{
  "id": 679,
  "title": "Implementation Strategies to Improve Blood Pressure Control in the United States: A Scientific Statement From the American Heart Association and American Medical Association",
  "abstract": "Hypertension is one of the most important risk factors that contribute to incident cardiovascular events. A multitude of US and international hypertension guidelines, scientific statements, and policy statements have recommended evidence-based approaches for hypertension management and improved blood pressure (BP) control. These recommendations are based largely on high-quality observational and randomized controlled trial data. However, recent published data demonstrate troubling temporal trends with declining BP control in the United States after decades of steady improvements. Therefore, there is a widening disconnect between what hypertension experts recommend and actual BP control in practice. This scientific statement provides information on the implementation strategies to optimize hypertension management and to improve BP control among adults in the United States. Key approaches include antiracism efforts, accurate BP measurement and increased use of self-measured BP monitoring, team-based care, implementation of policies and programs to facilitate lifestyle change, standardized treatment protocols using team-based care, improvement of medication acceptance and adherence, continuous quality improvement, financial strategies, and large-scale dissemination and implementation. Closing the gap between scientific evidence, expert recommendations, and achieving BP control, particularly among disproportionately affected populations, is urgently needed to improve cardiovascular health.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f5eba3428d026dee954d719a426a202a",
  "timestamp": "2025-05-15T01:41:29.793771"
}