{
  "id": 5196,
  "title": "Network structures and credit risk in cross-shareholdings among listed Japanese companies",
  "abstract": "This study assesses the network structures of cross-shareholdings among listed Japanese companies using a dataset of 2936 companies for the fiscal years 2008-2015. First, I analyze the network structure of cross-shareholdings on the Japanese stock market using centrality measures. Financial institutions and companies in the motor manufacturing industry are central in the network in terms of degree centrality. By contrast, companies in various industries play a central role in terms of betweenness centrality. Second, I use credit risk analysis to investigate the effects of cross-shareholdings using a panel regression. The results show that an increase in the share of foreign companies does not increase the counterparty credit risk in the network. In addition, an increase of a direct centrality measure (i.e., degree or eigenvector centrality) indicates that the connections among cross-shareholdings become denser in a neighboring area and increase credit contagion risk. By contrast, an increase of an indirect centrality measure (i.e., eccentricity or farness centrality) shows that the connections among cross-shareholdings become dispersed at the global level and decrease credit contagion risk. The results could provide senior managers with an important signal for credit risk management related to cross-shareholdings.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f60b4040d14e282ef0af728cf75c9b37",
  "timestamp": "2025-05-15T02:45:17.122698"
}