{
  "id": 574,
  "title": "Data mining-based stock price prediction using hybridization of technical and fundamental analysis",
  "abstract": "PurposeThe stock market generates massive databases of various financial companies that are highly volatile and complex. To forecast daily stock values of these companies, investors frequently use technical analysis or fundamental analysis. Data mining techniques coupled with fundamental and technical analysis types have the potential to give satisfactory results for stock market prediction. In the current paper, an effort is made to investigate the accuracy of stock market predictions by using the combined approach of variables from technical and fundamental analysis for the creation of a data mining predictive model.Design/methodology/approachWe chose 381 companies from the National Stock Exchange of India's CNX 500 index and conducted a two-stage data analysis. The first stage is identifying key fundamental variables and constructing a portfolio based on that study. Artificial neural network (ANN), support vector machines (SVM) and decision tree J48 were used to build the models. The second stage entails applying technical analysis to forecast price movements in the companies included in the portfolios. ANN and SVM techniques were used to create predictive models for all companies in the portfolios. We also estimated returns using trading decisions based on the model's output and then compared them to buy-and-hold returns and the return of the NIFTY 50 index, which served as a benchmark.FindingsThe results show that the returns of both the portfolios are higher than the benchmark buy-and-hold strategy return. It can be concluded that data mining techniques give better results, irrespective of the type of stock, and have the ability to make up for poor stocks. The comparison of returns of portfolios with the return of NIFTY as a benchmark also indicates that both the portfolios are generating higher returns as compared to the return generated by NIFTY.Originality/valueAs stock prices are influenced by both technical and fundamental indicators, the current paper explored the combined effect of technical analysis and fundamental analysis variables for Indian stock market prediction. Further, the results obtained by individual analysis have also been compared. The proposed method under study can also be utilized to determine whether to hold stocks for the long or short term using trend-based research.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f6251f65bb20f0fb0394c3cf43616c1c",
  "timestamp": "2025-05-15T00:45:01.335292"
}