{
  "id": 1837,
  "title": "A two-stage adaptive affinity propagation clustering using the wtDTW distance: Application in portfolio optimization",
  "abstract": "Affinity propagation (AP) clustering methods are pivotal for addressing financial datasets, a category of datasets where the number of clusters is inherently uncertain. The relevant research employs a grid-based search to optimize parameters of the model. Nevertheless, this renders the model-solving process exceedingly time-consuming. With regard to financial problems, few studies have discussed the appropriate distance measure. In order to address these identified research gaps, a two-stage adaptive affinity propagation (TAAP) clustering method with dynamic time warping improved by adaptive wavelet packet decomposition and time weighting (wtDTW) method has been developed. The objective of the method is twofold: firstly, to address the error warpings present in the sequence alignment process and to capture the temporal properties of asset prices through wtDTW; secondly, to reduce the computational effort of adaptive AP clustering through the introduction of a two-stage module. Furthermore, we constructed Independent Component Risk Parity (ICRP) portfolios based on this method to demonstrate its applicability to financial investment problems. The experimental results of our method on artificial datasets, public datasets (Iris, Wine, Glass, and Yeast), and financial datasets (A-share, U.S. stocks, bonds, funds, and commodities) validate the effectiveness of the proposed method in comparison to state-of-the-art methods.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f63d2e9a36ed6e48ae460743f81b5899",
  "timestamp": "2025-05-15T02:08:03.957053"
}