{
  "id": 1798,
  "title": "On the strategic management of an events portfolio to extend tourists' length of stay: a LASSO approach",
  "abstract": "Tourism destinations are increasingly recognizing the potential for additional benefits to be captured by managing their events as a strategic portfolio. By identifying and exploiting relatedness between key event variables, otherwise inaccessible benefits can be cross-leveraged from the portfolio as a whole. Developing a methodology for putting such a strategy into practice has, however, thus far eluded researchers. Indeed, the empirical research has thus far focused almost entirely on single events, considered in isolation. The purpose of this study is, therefore, to propose and test a parsimonious method for determining relatedness in the determinants of length of stay across a portfolio of events. This involves using sparse regression, based on the LASSO approach, using data from an event portfolio in Madeira. The LASSO method can be considered particularly advantageous because it produces results that are easily interpretable by event managers and are thus able to inform marketing strategies. The results from Madeira illustrate this by identifying four areas of close relatedness that could be cross-leveraged through the co-ordinated strategic marketing of the portfolio at the destination level. The approach uses readily obtainable data and, as such, represents a practical tool for event portfolio management that can readily be applied elsewhere.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f684001af110c263bc533c28923d48f9",
  "timestamp": "2025-05-15T00:59:53.137273"
}