{
  "id": 3347,
  "title": "Hybridisation of Feature Selection and Classification Techniques in Credit Risk Assessment Modelling",
  "abstract": "In recent years, the use of artificial intelligence techniques to manage credit risk has represented an improvement over conventional methods. Furthermore, small improvements to credit scoring systems and default forecasting can support huge profits. Accordingly, banks and financial institutions have a high interest in any changes. The literature shows that the use of feature selection techniques can reduce the dimensionality problems in most credit risk datasets, and, thus, improve the performance of the credit risk model. Many other works also indicated that various classification approaches would also affect the performance of the credit risk assessment modelling. In this research, based on the new proposed framework, we investigated the effect of various filter-based feature selection techniques with various classification approaches, namely, single and ensemble classifiers, on three credit datasets (German, Australian, and Japanese credit risk datasets) with the aim of improving the performance of the credit risk model. All single and ensemble classifier-based models were evaluated using four of the most used performance metrics for assessing financial stress models. From the comparison analysis between, with, and without applying the feature selection and across the three credit datasets, the Random-Forest + Information-Gain model achieved a better trade-off in improving the model's accuracy rate with the value of 96% for the Australian credit dataset. This model also obtained the lowest Type I error with the value of 4% for the German credit dataset, the lowest Type II error with the value of 2% for the German credit dataset and the highest value of G-mean of 95% for the Australian credit dataset. The results clearly indicate that the Random-Forest + Information-Gain model is an excellent predictor for the credit risk cases.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f68cbf36cd9f2a534b6783728e5bd11f",
  "timestamp": "2025-05-15T02:25:13.749362"
}