{
  "id": 3409,
  "title": "Unfavorable social determinants of health are associated with higher burden of financial toxicity among patients with atherosclerotic cardiovascular disease in the US: findings from the National Health Interview Survey",
  "abstract": "Background Atherosclerotic cardiovascular disease (ASCVD) is a major cause of financial toxicity, defined as excess financial strain from healthcare, in the US. Identifying factors that put patients at greatest risk can help inform more targeted and cost-effective interventions. Specific social determinants of health (SDOH) such as income are associated with a higher risk of experiencing financial toxicity from healthcare, however, the associations between more comprehensive measures of cumulative social disadvantage and financial toxicity from healthcare are poorly understood. Methods Using the National Health Interview Survey (2013-17), we assessed patients with self-reported ASCVD. We identified 34 discrete SDOH items, across 6 domains: economic stability, education, food poverty, neighborhood conditions, social context, and health systems. To capture the cumulative effect of SDOH, an aggregate score was computed as their sum, and divided into quartiles, the highest (quartile 4) containing the most unfavorable scores. Financial toxicity included presence of: difficulty paying medical bills, and/or delayed/foregone care due to cost, and/or cost-related medication non-adherence. Results Approximately 37% of study participants reported experiencing financial toxicity from healthcare, with a prevalence of 15% among those in SDOH Q1 vs 68% in SDOH Q4. In fully-adjusted regression analyses, individuals in the 2nd, 3rd and 4th quartiles of the aggregate SDOH score had 1.90 (95% CI 1.60, 2.26), 3.66 (95% CI 3.11, 4.35), and 8.18 (95% CI 6.83, 9.79) higher odds of reporting any financial toxicity from healthcare, when compared with participants in the 1st quartile. The associations were consistent in age-stratified analyses, and were also present in analyses restricted to non-economic SDOH domains and to 7 upstream SDOH features. Conclusions An unfavorable SDOH profile was strongly and independently associated with subjective financial toxicity from healthcare. This analysis provides further evidence to support policies and interventions aimed at screening for prevalent financial toxicity and for high financial toxicity risk among socially vulnerable groups.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f697642291a79509e83dd741f3357d86",
  "timestamp": "2025-05-15T02:25:40.244700"
}