{
  "id": 1474,
  "title": "An integrated model for crude oil forecasting: Causality assessment and technical efficiency",
  "abstract": "In light of the central role of crude oil in the economy and the complex mechanisms involved in forecasting crude oil prices, this study proposes a two-stage model that optimally selects driving predictors for crude oil price forecasting by integrating Granger causality test (GCT) and stochastic frontier analysis (SFA). In the first stage, GCT is used to perform causality assessments for 92 predictors across eight categories of factors (demand, supply, inventory, financial market, macroeconomy, economic policy uncertainty, geopolitical risk, and technical indi-cator). In the second stage, SFA is employed to assess the forecasting power of the preliminarily selected pre-dictors in terms of technical efficiency by using multiple evaluation measures. By collecting a data sample which spans a 21-year period from January 1, 2000 to December 31, 2020, we conduct a comprehensive empirical study by employing rolling time window technique. The empirical results demonstrate that the two-stage model significantly outperforms eight competing models in terms of four forecasting techniques (linear regression, artificial neural network, support vector regression, and random forest). The proposed model's outperformance is robust to different time windows, different forecast horizons, alternative proxies of crude oil prices, and different business conditions. We also explore the time-varying characteristics of predictors for crude oil price forecasting and confirm that financial factors remain vital determinants affecting oil prices.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f698b4a02a3c3e91e05fc9d2335a2925",
  "timestamp": "2025-05-15T02:03:39.726957"
}