{
  "id": 38,
  "title": "Optimized backpropagation neural network for risk prediction in corporate financial management",
  "abstract": "Corporate financial management is responsible for constructing, optimizing, and modifying finance-related structures for an unremitting function. The finance optimization model incorporates risk prediction and fund balancing for distinguishable corporate operations. This risk prediction is handled using sophisticated computing models with artificial intelligence and machine learning for self-training and external learning. Therefore, this article introduces a Backpropagation-aided Neural Network for designing an Optimal Risk Prediction (ORP-BNN) to pre-validate existing and new financial imbalances. The risk prediction model is designed to cope with corporate standards and minimum riskless financial management. This is designed as a linear snowfall model wherein the BNN decides the significance between fund allocation and restraining. The snowfall model significantly relies on allocation or restraining, which is achieved by assigning significant weights depending on the previous financial decision outcome. The weight factor is determined using gradient loss functions associated with the computing model. The training process is pursued using different structural modifications used for successful financial management in the past. In particular, the risk thwarted financial planning using a snowfall-like computing model, and its data inputs are used for training optimization. Therefore, the proposed model's successful risk mitigation stands high under prompt decisions.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f6a7bec3e2637fd719c74d25760c7365",
  "timestamp": "2025-05-15T01:46:03.859683"
}