{
  "id": 471,
  "title": "Competitive pricing within pharmaceutical classes: evidence on follow-on drugs in Germany 1993-2008",
  "abstract": "Competition from follow-on drugs has been a highly controversial issue. Manufacturers launching new molecules in existing drug classes have often been criticized for inflating health systems' expenses, but it has been argued that such drugs increase therapeutic options. Economic theory suggests that follow-on drugs induce price competition. We contribute to this discussion by addressing the topic of pricing at market entry and price development in the German market. We measure determinants of price strategies of follow-on drugs using regression analyses, considering all new molecules launched in the German market from 1993 to 2008. Prices of products are standardized on defined daily dosages controlling for sales volumes based on data from the IMS Health DPM database and for the therapeutic quality of a new product using ratings by Fricke/Klaus as a proxy for innovation. We identify prices correlating with therapeutic value at market entry. While the first two molecules engage in quality competition, price discounts below the market price can be observed from the third entrant on. Price discounts are even more distinct in development races with several drugs entering the market within 2 years and in classes with a low degree of therapeutic differentiation. Prices remain relatively constant over time. This study contributes to assessments of competition in pharmaceutical markets focusing on price strategies of new market entrants. After an initial phase of market building, further follow-on products induce price competition. Largely unchanged prices after 4 years may be interpreted as quality competition and can be attributed to prices in Germany being anchor points for international price referencing.",
  "year": 2015,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f6b294eb2ca5f119fbda5127f5243b47",
  "timestamp": "2025-05-15T01:32:30.169587"
}