{
  "id": 2867,
  "title": "Technology foresight for the South African road transport sector by 2035",
  "abstract": "Background: Foresight can be used to define futuristic orientated research and development (R&D) that is required to position the road transport sector for a challenging future. Objectives: To develop a set of futuristic R&D projects that could be added to a balanced SANRAL R&D portfolio to position SANRAL and the transport sector for the future on a 15-year horizon. Method: Inputs into and ranking of the drivers, trends and technologies that will impact the transport sector were obtained from interviews with eminent thinkers, participants in workshops and a survey leading to five potential future scenarios. Qualitative and quantitative data analysis yielded several key solutions (KSs) and key interventions (KIs) to position the sector. This was complemented with the novel use of technology trees to analyse the linkages between new and existing knowledge and to identify gaps in knowledge and subsequently the identification of key R&D opportunities. Results: Through backcasting from the desired future scenario as well as using 412 stakeholder inputs, 12 KSs and 61 KIs were defined and ranked. The top 30, most futuristic KIs were analysed using 18 hierarchical technology trees to define R&D opportunities. Conclusion: The analysis emphasised the importance of new technologies such as data science, machine learning, smart transport and advanced materials to position the sector. Contribution: The use of a novel, structured technology foresight approach that utilises scenario development combined with hierarchical technology trees was demonstrated. To position the road transport sector for a challenging future, 12 new thematic KSs and 61 KIs were developed.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f6bd1ca28e657efb76926adfc37a3c6b",
  "timestamp": "2025-05-15T01:11:17.432135"
}