{
  "id": 2498,
  "title": "The Sovereign-Bank Nexus in the Face of the COVID-19 Pandemic Outbreak-Evidence from EU Member States",
  "abstract": "The major focus of this paper is on the sovereign-banks relationship following the COVID-19 pandemic crisis outbreak, with a view to gaining an insight into banks' exposure to the sovereign. We rely on a series of complementary research approaches, such as desk research, comparative statistical analysis, exploratory learning algorithm, and a deterministic panel regression framework. The analysis reveals that most EU countries were not prepared for the pandemic crisis as they lacked a financial security buffer. The growing fiscal pressure and lockdown restrictions additionally resulted in an increase in banks' exposure to the government debt market and higher government debt securities exposure on their balance sheets. One of the novelties of the research is the adoption of the gap method in order to measure the changes between banking assets major items (government securities vs. loans) and uncovering the preference for holding a specific type of asset. Additional insight is brought by the clustering solution, which shows increased cross-country heterogeneity in terms of the sovereign-banks relationship. Empirical research shows that banks' involvement in the sovereign debt market is sensitive mainly to negative information related to pandemic occurrence and, to a lower extent, to positive information reflected by government's reactions and economic stimulus measures. In addition, our results reveal there is no crowding-out effect triggered by the pandemic, in terms of lending to the sovereign against lending to the real economy. In the pandemic onset banks did not proceed to a sharp portfolio rebalancing in favor of the sovereign.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f6be0ded586ac7b6c762f727896b75c5",
  "timestamp": "2025-05-15T01:07:35.678285"
}