{
  "id": 1667,
  "title": "Validation study of Yunnan ethnic culture industry stock model under epidemic situation based on chaotic particle swarm optimization neural networks",
  "abstract": "The new crown pneumonia epidemic is raging, in the context of global integration, the scope of the impact of this sudden event spread around the world, the stock market has not been spared, the financial risk has increased dramatically compared with the past, the emergence of the epidemic has led to the spread of investor panic, March 2020, the U.S. S&P 500 index appeared in the four plunge, and led to the market trading meltdown, the world's financial markets have had an extremely serious impact. The study of the impact of Xin Guan Pneumonia on the company's stock returns is not only conducive to enriching the theoretical study of public health emergencies, but also conducive to improving the coping strategy, stabilizing the general economic market, and enhancing the public's awareness of risk response. This paper compares the effect of the four intelligent algorithms of chaotic particle swarm algorithm, chaotic bee colony algorithm, chaotic fruit fly algorithm and chaotic ant colony algorithm combined with neural network on the prediction of the stock price trend of Yunnan national culture, and the study shows that the speed of convergence of the chaotic particle swarm optimization neural network and the speed of descent is better than that of the two models of chaotic fruit fly and chaotic bee colony, and the coefficients of decision of the chaotic particle swarm optimization neural network are higher than that of the other three models, and the errors are lower than the other three models. Indexes are lower than the other three models and have high accuracy in stock prediction of Yunnan ethnic culture, this finding emphasizes the potential of PSO-BP model to provide robust stock market prediction, which is important for both investors and policy makers in dealing with volatile market conditions.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f6ec133fea039653d69a98d1cddc21ae",
  "timestamp": "2025-05-15T02:06:22.385675"
}