{
  "id": 831,
  "title": "Leveraging Big Data for SME Credit Risk Assessment: A Novel BP-KMV and GARCH Integration",
  "abstract": "This study addresses the critical limitations in existing credit risk assessment models for unlisted technology small and medium enterprises (SMEs), which are crucial drivers of innovation and economic growth yet often hindered by traditional financing models' inadequacies. Recognizing the pivotal role of advanced analytical techniques in navigating these challenges, we propose an optimized early warning system, integrating the BP-KMV model with the GARCH (1,1) model and the Ordinary Least Squares (OLS) method. This innovative approach adapts to the volatility of technology ventures and incorporates alternative data sources, such as intellectual property and R&D expenditures, offering a holistic view of an SME's creditworthiness. Empirical validation on data from 525 listed and 150 unlisted technology SMEs demonstrates the model's superior predictive accuracy and early warning capabilities compared to traditional methodologies. Our findings reveal a nuanced understanding of credit risk in the technology sector, emphasizing the importance of dynamic, data-driven models in aligning financial support with innovative enterprises' growth trajectories. This research contributes to the knowledge economy by highlighting the synergies between technological advancements and financial innovation, paving the way for more informed decision-making by governments and banks to foster a thriving ecosystem for technology-driven SMEs.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f6f6604b1d777a19fbe79b5f2d3b3ec5",
  "timestamp": "2025-05-15T01:43:20.572558"
}