{
  "id": 4190,
  "title": "Financial hardship and health in a refugee population in Australia: A longitudinal study",
  "abstract": "Refugees and asylum seekers are at a higher risk than the host population to poor health and financial stress. This study uses a unique longitudinal panel from Australia, the Building a New life in Australia (BNLA cohort) to understand the relationship over time between the social determinants of health, health, and financial hardship in refugees and asylum seekers. We employ a longitudinal; dynamic multivariate logistic regression to firstly estimate the relationship between the social determinants of health and poor physical and mental health. Next, we include variables related to financial hardship in our model to determine if there is an association independent of the social determinants of health. Finally, we estimate if there is a relationship between the number of financial hardships and poor physical and mental health. The results show that migrants from North Africa, the Middle East, and Sub-Sahara Africa and women are more likely to suffer from poor health. Financial hardship has an independent association with poor health. We find that going without meals had the highest odds of suffering from poor health. There was evidence of a dose response of financial hardship for those suffering from a limiting long-term health condition and post-traumatic stress syndrome. These findings suggest that refugees in Australia may need additional support past their first year to help them assimilate and contribute to economic productivity.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f6f6558e9e2667f938e274235217ba07",
  "timestamp": "2025-05-15T02:34:13.436963"
}