{
  "id": 2840,
  "title": "Flood Damage Modeling on the Basis of Urban Structure Mapping Using High-Resolution Remote Sensing Data",
  "abstract": "The modeling of flood damage is an important component for risk analyses, which are the basis for risk-oriented flood management, risk mapping, and financial appraisals. An automatic urban structure type mapping approach was applied on a land use/land cover classification generated from multispectral Ikonos data and LiDAR (Light Detection And Ranging) data in order to provide spatially detailed information about the building stock of the case study area of Dresden, Germany. The multi-parameter damage models FLEMOps (Flood Loss Estimation Model for the private sector) and regression-tree models have been adapted to the information derived from remote sensing data and were applied on the basis of the urban structure map. To evaluate this approach, which is suitable for risk analyses, as well as for post-disaster event analyses, an estimation of the flood losses caused by the Elbe flood in 2002 was undertaken. The urban structure mapping approach delivered a map with a good accuracy of 74% and on this basis modeled flood losses for the Elbe flood in 2002 in Dresden were in the same order of magnitude as official damage data. It has been shown that single-family houses suffered significantly higher damages than other urban structure types. Consequently, information on their specific location might significantly improve damage modeling, which indicates a high potential of remote sensing methods to further improve risk assessments.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f705d873cb39d25971a884c58df8648f",
  "timestamp": "2025-05-15T02:19:46.663673"
}