{
  "id": 7835,
  "title": "Adolescent and young adult (AYA) lymphoma survivors report lower health-related quality of life compared to a normative population: results from the PROFILES registry",
  "abstract": "Background: Trying to simultaneously achieve developmental milestones and cope with a life-threatening disease may place adolescents and young adults (AYAs) at risk for impaired health-related quality of life (HRQoL) later in life. The aim of this study was to examine differences in HRQoL between AYA lymphoma survivors and a normative population and to determine sociodemographic, clinical and long-term symptom-related factors associated with HRQoL.Material and methods: This study was part of a longitudinal, population-based survey among lymphoma survivors diagnosed between 1999 and 2012. The AYA survivor sample (18-39 years at time diagnosis) was compared to a sex- and age-matched normative population on HRQoL (EORTC-QLQ-C30) and psychological distress (HADS). Multiple linear regression analyses were conducted to determine factors associated with HRQoL among survivors.Results: One hundred and ninety-eight AYA lymphoma survivors (58%) responded to the study invitation. Compared to an age- and sex-matched normative population (N=380), significantly and clinically relevant poorer HRQoL was observed for AYA lymphoma survivors in seven specific domains of HRQoL: physical, role, cognitive, emotional, social functioning, fatigue and financial difficulties (all p<0.05). In addition, AYA lymphoma survivors less often had a spouse/partner and more often had a lower educational level compared to the normative population. Linear regression analyses showed that being unemployed, female gender, having one or more comorbid conditions, high levels of fatigue and psychological distress were most strongly associated with HRQoL.Conclusions: These findings identify specific domains of life in which cancer has a significant and long-term impact for AYA lymphoma survivors. Future investigations are needed to identify and test administrations and timing of psychosocial support interventions having potential to reduce long-term late effects in specific HRQoL domains and promote function and adaptability after cancer treatment.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f73ac87eb1282cac2945a70e7bb45177",
  "timestamp": "2025-05-15T03:12:36.476094"
}