{
  "id": 1052,
  "title": "Simulated Annealing in Multifactor Equity Portfolio Management",
  "abstract": "Building a multifactor excess return model to select portfolio stocks has become a widely used tool for portfolio management. The decision to include return factors in such a model varies widely from practitioner to practitioner. Factor weightings in most models are commonly determined by linear regression. The linear regression approach ranks stocks by expected future returns and then selects a portfolio from among the highest ranked stocks. The regression model related to portfolio construction produces a model that is a best historic fit to the returns of every stock. No measure of portfolio return or risk can be considered in determining the regression coefficients. In addition to portfolio risk, restrictions on factor weights, portfolio structure, transaction costs, or turnover cannot be easily incorporated in determining the regression model. This thesis considers the portfolio construction model as a global optimization problem, rather than a curve fitting problem. No assumptions about convexity of optimization function F(theta) are made and, therefore, it may have several local maxima. To control risk throughout a portfolio construction process, this work considers the model's objective function to maximize return divided by risk - the Sharpe ratio. The model is constructed using a ten-year moving window of stock market information and then tested on the next year. We then examine the performance of a simulated annealing search and arbitrage pricing theorem to solve this global optimization problem.",
  "year": 2010,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f74aaca27fc7e32146c447d27b2200c0",
  "timestamp": "2025-05-15T00:51:25.866976"
}