{
  "id": 4217,
  "title": "The MANTRA study: a new umbrella concept prospectively applied to assess implantable medical devices for heart valve procedures",
  "abstract": "BackgroundClinical evidence is commonly obtained through individual trials that are time-, cost- and resource-consuming, and which often leave unanswered clinically relevant questions. Umbrella studies have been developed to address the need for more efficient and flexible trial structures, predominantly for cancer treatments. The umbrella concept foresees data collection within a unifying trial structure, to which one or more substudies may be added at any time to address product- or therapy-specific questions. To our knowledge, the umbrella concept has not yet been used in the medical device area, but it may offer similar advantages as in other settings, particularly in areas where multiple therapies are available within one large treatment area.MethodsThe MANTRA study (NCT05002543) is a prospective, global, post-marketing clinical follow-up study. The aim is to collect safety and device performance data covering the Corcym cardiac surgery portfolio for the treatment of aortic, mitral, and tricuspid valve diseases. The study uses a master protocol that outlines the main common parameters, and the specific questions are addressed in three substudies. The primary endpoints are device success at 30 days. Secondary endpoints include safety- and device performance-related data at 30 days, 1 year, and then annually through to 10 years. All endpoints are defined according to the more recent guidelines for heart valve procedures. Additionally, procedure and hospitalization information are collected, including Enhanced Recovery after Surgery in sites using such protocols, and patient outcome measures such as New York Heart Association classification and quality-of-life questionnaires.ResultsThe study started in June 2021. Enrollment in all three substudies is ongoing.ConclusionsThe MANTRA study will provide contemporary information on the long-term outcomes of medical devices for the treatment of aortic, mitral, and tricuspid heart valve diseases in routine clinical practice. The umbrella approach adopted in the study has the potential of longitudinally assessing long-term efficacy of the devices and the flexibility to investigate new research questions as they arise.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f74f0ce40c316af1bec007e74ae73a4e",
  "timestamp": "2025-05-15T01:24:51.486147"
}