{
  "id": 6552,
  "title": "Factors influencing farmers ' adaptation willingness under landslide risks: Using an extended sustainable livelihood framework",
  "abstract": "Landslides are one of the common natural disasters that seriously threaten smallholder farmers' livelihoods. Several adaptation measures for reducing the impact of disaster shocks are available; however, the effects of these measures highly rely on farmers' adoption and implementation. Therefore, this study explores the key factors influencing farmers' willingness to adopt agricultural (drip irrigation, drought-tolerant crops) and non-agricultural measures (income diversification, migration) under landslide risk, based on 350 random sample questionnaires in Heifangtai, Northwest China, where irrigation-induced landslides are frequent. This study incorporates disaster perception into the livelihood capital of the sustainable livelihood framework (SLF) and uses the boosted regression tree to reveal the relationships between extended livelihood capitals and farmers' willingness to take adaptation measures. The results show that social capital and disaster perception positively affect farmers' willingness to adopt adaptation measures. Disaster perception can rapidly increase farmers' willingness to adopt adaptation measures when they have adequate perception. The impact of natural capital shows a particular n  shaped trend of facilitation followed by inhibition, which ultimately had distinct impacts on farmers' willingness to adopt agricultural and non-agricultural adaptation measures. In addition, farmers' willingness to adopt migration is mainly dominated by disaster perception and limited by financial capital. Based on the results, this study provides policy recommendations from the perspectives of social organization management, disaster knowledge popularization, and financial support to increase the local farmers ' willingness to adapt.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f7549cacb185cbbea72bb383fe467575",
  "timestamp": "2025-05-15T02:59:07.591999"
}