{
  "id": 4451,
  "title": "Mapping inequality: Childhood asthma and environmental injustice, a case study of St. Louis, Missouri",
  "abstract": "As a geographic continuum of poverty and affluence has emerged, so too has a geographic continuum of good and poor health. Asthma is currently one of the most prevalent chronic childhood diseases. Over the past three decades, the greatest increases in asthma rates have been in urban areas and have disproportionately affected youth in poverty and those in racial and ethnic minority groups. Neighborhoods serve as a mechanism fostering environmental injustice and perpetuating these disparities in health outcomes and life opportunity for our most vulnerable populations. Using Geographic Information Systems (GIS) methods in a case study of St. Louis Missouri, this study examines local environmental risk by identifying 'hotspots,' or statistically significant spatial clustering of high or low levels of childhood asthma, and associations with neighborhood characteristics, socio-demographic characteristics, and access to healthcare resources within these hotspots. Results revealed statistically significant clustering of high asthma rates in areas with more non-White and poor residents, higher rates of public housing, deteriorating housing, and violent crime. High asthma hotspots were also located in areas with limited physical access to healthcare resources, such as physicians and medication, and lower school attendance rates. Residents of these high asthma hotspots experience greater environmental risk, and significant disparities in health and education outcomes, physical and financial healthcare resources, and overall well-being. This study demonstrates these place-based inequalities and presents clear evidence of environmental injustice, supporting the need for investments and interventions to improve the environments, health, and economic resources of our most vulnerable youth.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f757c73ed608c1154d713fc90d3b171d",
  "timestamp": "2025-05-15T02:37:16.947489"
}