{
  "id": 3710,
  "title": "A Method for Assessing Greener Alternatives between Chemical Products Following the 12 Principles of Green Chemistry",
  "abstract": "Companies are interested in improving chemicals to reduce environmental impacts, also known as green chemistry. The 12 principles of green chemistry outline a framework for identifying a greener chemical or process, spanning aspects in health hazard, ecological risk, and resource efficiency across a product lifecycle. However, that framework does not detail how to measure performance. Furthermore, collecting the data required, beyond simple health hazard ratings, is resource intensive. This paper describes an approach for establishing green chemistry metrics (GCM), to evaluate chemicals and chemical processes against the 12 principles, using readily available data, such as the data compiled in compliance with the Globally Harmonized System of Classification and Labeling of Chemicals (GHS). Using the GCM, chemicals or processes can be ranked by a hierarchy of metrics: (1) scores for each of the 12 principles, (2) three category rankings between new and improved chemicals/processes (improved resource use, increased energy efficiency, and reduced human and environmental hazards), and (3) a summary comparison ranking. The GCM approach is unique in that it is robust and flexible enough to encompass a diverse product portfolio, inexpensive to implement with on-hand data, based on generally accepted industry practices, and allows meaningful communications about chemical sustainability options.",
  "year": 2017,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f758d9d6a867f2df9d530aa91a35010f",
  "timestamp": "2025-05-15T01:20:03.440281"
}