{
  "id": 5417,
  "title": "The Impact of Monetary Policies on the Sustainable Economic and Financial Development in the Euro Area Countries",
  "abstract": "One of the responses of the monetary policies of central banks to the sustainable development on financial markets, which also affected other markets and economic growth, is the role of non-standard monetary policies, referred to as quantitative easing in the form of Asset Purchase Programme. In this paper, the following main research problem was addressed: How can the Asset Purchase Programme help the European Central Bank fulfill its mandate of supervising the financial stability and financial development? Based on this, we formulated the main objective: to identify the impact of monetary policies on the dynamics of financial markets development, labor markets, and the markets for goods and services. As part of the applied methodology, the impact of the quantitative easing on the government bond yields curve was based on an indirect assessment using the seemingly unrelated regression model, considering the use of parameters from the functional benchmark form. Through the vector error correction model, another additional impact of the application of the monetary policy mechanisms on selected indicators of the considered markets was identified. The relationship between financial markets and economic growth was determined on the basis of the two-stage least square model using endogeneity control instruments. Applying the changes identified by the above models allowed us to determine the expected change in the rate of growth of the aggregate output of the euro area countries. Based on our results, we found out that Asset Purchase Programme had an impact on the growth of government bond yields issued by euro area countries, on lowering the risk rate on corporate bond markets, and increasing the nominal value of shares. In addition, growth in inflation and a decline in interest rates were affected. Finally, the European Central Bank (ECB)'s non-standard monetary policies have positively affected and stimulated the labor market and development in goods and services markets, referred to the sustainable financial development.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f76266e9d97d0f405e55040e1fdb641e",
  "timestamp": "2025-05-15T02:47:42.878107"
}