{
  "id": 3784,
  "title": "Integration of CSR into the Marketing Mix for the Sustainable Development of Companies: A View from the Position of Financial Risk Management",
  "abstract": "This paper is devoted to establishing the consequences of integrating CSR into the marketing mix for financial risks in modern companies. Based on the international statistics for 2023, we compiled a regression model of the dependence of financial risks on the integration of CSR into their marketing mix. Based on that, we developed a new system approach to managing companies' sustainable development. Its features are marketing management of the sustainable development of companies, systemic management of social and financial risks to companies, and implementation of risk management through integrating CSR into the marketing mix. The main conclusion is that the sustainable development of companies in the Decade of Action requires a systemic integration of CSR into the marketing mix, for this will allow for the simultaneous reduction of social and financial risks. The theoretical significance of this conclusion consists in the disclosure of previously unknown cause-and-effect relationships between CSR and financial risks to companies, which are explained in this paper through the lens of the elements of the marketing mix in the 7P model. The originality of this research consists in developing novel marketing tools for the systemic management of social and financial risks for companies with the help of CSR. The practical significance relates to the fact that the offered recommendations on the more complete integration of CSR into their marketing mix will allow reducing financial risks and ensuring sustainable development of Russian companies in the Decade of Action (until 2030). The managerial significance is as follows: the developed system approach to managing companies' sustainable development will improve the practice of risk management in companies due to previously unavailable joint management and the general reduction of social and financial risks.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f768d1d9f7c0493ed823de89fc54a095",
  "timestamp": "2025-05-15T02:29:59.162392"
}