{
  "id": 7360,
  "title": "Association of Frailty with Perioperative Outcomes Following Hepatic Resection: A National Study",
  "abstract": "Objectives: Risk of mortality and major comorbidity remains high following hepatic resection. Given recent advancements in nonsurgical techniques to control hepatic malignancy, accurate assessment of surgical candidates, especially those considered frail, has become imperative. The present study aimed to characterize the impact of frailty on clinical and financial outcomes following hepatic resection in older individuals. Design: Retrospective cohort study. Setting and Participants: All older adults (>= 65 years) undergoing elective hepatic resection were identified from the 2012 to 2019 National Inpatient Sample. Methods: Frailty was defined by using the Johns Hopkins Adjusted Clinical Groups frailty-defining diagnosis indicator. Multivariable regression models were developed to assess the independent association of frailty with mortality, perioperative complications, and resource utilization. Marginal effects were tabulated to assess the impact of hospital volume on frailty-associated mortality. Results: Of an estimated 40,735 patients undergoing major hepatic resection, 9.0% were considered frail. After multivariable adjustment, frailty was associated with increased odds of mortality (adjusted odds ratio [AOR] 2.9; 95% confidence interval [CI] 2.0-4.3; P<.001) and perioperative complication (AOR 2.9; 95% CI 2.4-3.4; P<.001). Furthermore, frail patients incurred longer risk-adjusted length of stay (14.2 vs 6.7 days, P<.001) and greater hospitalization costs ($55,100 vs $29,300, P<.001). In assessing the impact of institutional expertise on perioperative outcomes, the marginal effect of frailty on mortality became less pronounced with increasing operative volume. Conclusions and Implications: As the population of the United States continues to age, surgeons are increasingly likely to encounter candidates for major hepatic resection who are frail. The present study associated frailty with inferior clinical and financial outcomes; however, frailty-associated mortality became less pronounced at centers with high hepatic resection operative volume. Coding-based instruments, such as the Johns Hopkins Adjusted Clinical Groups, may identify patients from electronic medical records who may benefit from further geriatric assessment and targeted treatments. (C) 2022 The Authors. Published by Elsevier Inc. on behalf of AMDA - The Society for Post-Acute and Long-Term Care Medicine.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f77abb6b148f4a1c49029212b1c6fc9f",
  "timestamp": "2025-05-15T03:07:32.012934"
}