{
  "id": 4995,
  "title": "Adaptation of hurricane risk perception scale to earthquake risk perception and determining the factors affecting women's earthquake risk perception",
  "abstract": "Worldwide studies show that gender is an important variable affecting disaster risk perception and that women have high levels of disaster risk perception. The objective of this study is to investigate women's earthquake risk perception as well as the factors that may help predict it. The data of the study were collected from 463 women living in Kocaeli (Turkey) by survey method. The study, which employed ordinary logistic regression analysis, analysed whether the same dependent variable was predicted by different independent variables in five models. Many of the women who participated in the research reported that they were more sensitive to earthquakes. The items with the highest mean among women's affective and cognitive risk perception factors are the items that measure fear and financial perception, respectively. Education and age significantly help predict women's earthquake risk perception. Living in dread of earthquakes and being depressed and worried for future generations make women feel more sensitive. This study has showed that all the underlying factors affecting women's disaster risk perception should be understood more deeply. It is thought that the results of the study will contribute to studies related to disaster management, risk perception, and women.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f77cdb18e04320fbd4fd5e40bcdda639",
  "timestamp": "2025-05-15T02:43:06.807369"
}