{
  "id": 3041,
  "title": "ESG and the performance of energy and utility portfolios: evidence from Australia",
  "abstract": "PurposeThis study aims to establish the effect of environmental, social and governance (ESG) practices on Australian energy and utility investment performance.Design/methodology/approachConventional and ESG-rated portfolios are constructed using monthly returns and ESG scores of S&P/ASX 300 listed energy and utility firms from 2014 to 2022. Portfolio performance is estimated using a four-factor regression model, controlling for any economic shocks associated with the COVID-19 pandemic.FindingsThe findings show that the lower the ESG score associated with the overall ESG and environmental portfolios, the greater the performance compared to the market (but not the conventional and other ESG portfolios). High ESG scores do not appear to influence the performance of the energy and utility portfolios, which contrasts expectations that the uptake of ESG should deliver superior risk-return outcomes for investors. The findings also indicate that a contrarian investment approach may be a reasonable performance indicator for high-rated ESG portfolios. ESG practices did not impact portfolio performance during the COVID-19 pandemic.Originality/valueThis research has contributed to the literature by offering ESG investment insights for policymakers, regulators, fund managers and investors. Consistent with the agency perspective on ESG practices and efficient market hypothesis, the evidence implies that, regardless of ESG scores (either high or low), investors should consider investing passively in diversified energy and utility portfolios or low-cost index fund equivalents.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f780b4c446435d61d0e22342492326ac",
  "timestamp": "2025-05-15T01:13:09.810062"
}