{
  "id": 2894,
  "title": "ESG Performance and Corporate Financial Risk of the Alternative Capital Market in Thailand",
  "abstract": "This study aims to investigate the pattern and level of environmental, social and governance (ESG) performance of listed companies in the alternative capital market of Thailand, and (2) to test for the relationship between ESG performance and corporate financial risk. The population and sample data are comprised of all the listed companies in the alternative capital market in Thailand, namely, the Market for Alternative Investment (MAI). Content analysis by scoring is used to quantify ESG performance in annual reports during the period 2017-2021, while corporate financial risk is measured by the ratio of debt on equity. Descriptive analysis, correlation matrix, and multiple regression are used to analyze the data of this study. The average scores of ESG performance are 6.182 out of 11 scores. In addition, there is an increase of ESG performance in annual reports of the listed companies from 5.540 to 7.180 scores during the period being studied. Finally, the result finds a negative relationship between ESG performance and corporate financial risk. The signaling theory demonstrates an explanation proposing that the increase of ESG performance can reduce corporate financial risk. Therefore, top-management and shareholders should pay attention to ESG responsibility because it can decrease risk as well as enhance sustainable development.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f7846a360e2369b7888f03a1f966995f",
  "timestamp": "2025-05-15T02:20:16.920706"
}