{
  "id": 9149,
  "title": "Community mask wearing as a COVID-19 preventive measure, its barriers, and motivators among rural households of Uganda: A mixed methods approach",
  "abstract": "Adherence to mask wearing has the potential to reduce coronavirus disease 2019 acquisition risk. However, there is limited information about community mask wearing and its predictors among rural populations. This study aimed to assess the level of adherence to community mask wearing as a COVID-19 prevention measure, its barriers, and motivators among the Ugandan rural population of Wakiso District. This cross-sectional study utilised both quantitative and qualitative data collection methods. The quantitative component employed a semi-structured interviewer-administered questionnaire among 400 participants, to assess the level of adherence and associated predictors towards mask wearing. Modified Poisson regression with robust standard error estimates was used to obtain crude and adjusted prevalence ratios associated with mask wearing. Quantitative data analysis was performed using Stata 15.0 Statistical software. The qualitative component was used to further explore the barriers and motivators of community mask wearing whereseven focus group discussions among 56 community health workers were conducted. Data was analysed using a thematic approach with the help of Nvivo Version 12 software. The quantitative results showed that 70.8% (283/400) of the participants were adherent to mask wearing. Furthermore, reusable (cloth masks) were the most common form of face masks worn by the participants; 71.9% (282/400). Adequate knowledge about mask wearing as a COVID19 prevention measure was positively associated with mask wearing (adjusted prevalence ratio (95% CI); 3.2 (1.19-8.56)). The qualitative results revealed; sensitization from health workers, provision of free masks, and fear of fines and arrests as motivators to mask wearing. Barriers to mask wearing included: inability to buy masks due to financial constraints, one-time provision of free masks, ill-fitting and worn-out masks, discomfort, and bribery. The practice of community mask wearing was sub-optimal among the study rural communities. Initiatives to scale up the practice need to be feasible for rural communities.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f7941037ccb398d8ddd6da9c937b8a55",
  "timestamp": "2025-05-15T03:25:54.661846"
}