{
  "id": 2369,
  "title": "Artificial Organic Networks Approach Applied to the Index Tracking Problem",
  "abstract": "The present work aims to adapt the Artificial Organic Networks (AON), a nature-inspired, supervised, metaheuristic, machine learning class, for computational finance purposes, applied as an efficient stock market index forecasting model. Thus, the proposed model aims to forecast a stock market index, with the aid of other economic indicators, employing a historic dataset of at least eleven years for all the variables. To accomplish this, a target function is proposed: a multiple non-linear regressive model. The relevance of computational finance is discussed, pointing out that is an area that has developed significantly in the last decades with different applications, some of these are: rich portfolio optimization, index-tracking, credit risk, stock investment, among others. Specifically, the Index Tracking Problem (ITP) concerns the prediction of stock market prices, being this a complex problem of the kind NP-hard. In this work, is discussed the undertaken innovative approach to implement the AON method, its main properties, as well as its implementation using the topology defined as Artificial Hydrocarbon Network (AHN), to tackle the ITP. Finally, we present the results of using a hybrid method based on K-means and the AHN configuration; within the result, the relative error obtained with this hybrid method was 0.0057.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f7a70b70c829fecfbeda8231ef27153c",
  "timestamp": "2025-05-15T01:06:10.754634"
}