{
  "id": 7836,
  "title": "Why acute ischemic stroke patients in the United States use or do not use emergency medical services transport? Findings of an inpatient survey",
  "abstract": "Background: Patients with acute ischemic stroke (AIS) who use emergency medical services (EMS) receive quicker reperfusion treatment which, in turn, mitigates post-stroke disability. However, nationally only 59% use EMS. We examined why AIS patients use or do not use EMS. Methods: During 2016-2018, a convenience sample of AIS patients admitted to a primary stroke center in South Carolina were surveyed during hospitalization if they were medically fit, available for survey when contacted, and consented to participate. The survey was programed into EpiInfo with skip patterns to minimize survey burden and self-administered on a touchscreen computer. Survey questions covered symptom characteristics, knowledge of stroke and EMS importance, subjective reactions, role of bystanders and financial factors. Descriptive and multiple regression analyses were performed. Results: Of 108 inpatients surveyed (out of 1179 AIS admissions), 49% were male, 44% African American, mean age 63.5 years, 59% mild strokes, 75 (69%) arrived by EMS, 33% were unaware of any stroke symptom prior to stroke, and 75% were unaware of the importance of EMS use for good outcome. Significant factors that influenced EMS use decisions (identified by regression analysis adjusting for stroke severity) were: prior familiarity with stroke (self or family/friend with stroke) adjusted odds ratio, 5.0 (95% confidence interval, 1.6, 15.1), perceiving symptoms as relevant for self and indicating possible stroke, 26.3 (7.6, 91.1), and bystander discouragement to call 911, 0.1 (0.01, 0.7). Further, all 27 patients who knew the importance of EMS had used EMS. All patients whose physician office advised actions other than calling EMS at symptom onset, did not use EMS. Conclusion: Systematic stroke education of patients with stroke-relevant comorbidities and life-style risk factors, and public health educational programs may increase EMS use and mitigate post-stroke disability.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f7aedc3c4684079eee2eb0f07f75250f",
  "timestamp": "2025-05-15T03:12:36.485180"
}