{
  "id": 3915,
  "title": "Using a panel data approach to determining the key factors of Islamic banks' profitability in Bahrain",
  "abstract": "This study examines the effect of bank-specific and macroeconomic key determinants of Islamic retail banks profitability in Bahrain. It used panel data of six Islamic retail banks from 2013 to 2019, and it employed an explanatory research with secondary financial data. Return on Assets (ROA) and Return on Equity (ROE) are two main profitability measures are used in this study. Random effect regression model and Fixed effect regression model are the two statistical models adopted in this study. Random effect regression model shows that Bank size is significantly positively related to banks' ROA, while operating efficiency and GDP growth have significant and negative relationship with banks' ROA. Fixed effect regression model shows that there are negative significant effects of credit risk, operating efficiency and GDP growth rate on banks' ROE. Finally, inflation rate has positive and statistically significant effect on both ROA and ROE. The study recommends that Islamic banks in Bahrain should achieve full benefits form economics of scale, should concentrate on credit risk management, especially on the control and monitoring of non-performing loans. In addition, managers should focus more on modern credit risk management techniques. Finally, Bahraini policy makers must boost the development of the equity market in order to improve bank's profitability.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f7c6b0f97ec2f4892188d8640283e2f2",
  "timestamp": "2025-05-15T02:31:28.333318"
}