{
  "id": 3956,
  "title": "Do Islamic Holy days affect stock returns? Empirical evidence from Asian and African markets",
  "abstract": "Purpose The Islamic Holy days are among the most celebrated spiritual traditions in the world and are observed by more than 1.5 billion Muslims. This study aims to investigate the effect of these events on the regular returns of stock exchanges in selected Muslim countries. Design/methodology/approach This study examines data from eight Asian and African stock exchanges from 2001 to 2019. Isolating the effect of Gregorian calendar anomalies, it aims to evaluate the effect of Islamic Holy days on stock returns by running a pooled random effect panel regression on all the stock exchanges examined. Findings The results reveal the positive impact of Eid-ul-Fitr on Asian markets, the negative impact of Eid Milad-un-Nabi on the African stock market's returns and the positive effect of the Holy month of Ramadan on both markets. Some Gregorian calendar anomalies also were found in these markets. Practical implications The research has significant implications for marketing professionals to recognize business opportunities and investors to efficiently manage their stock portfolio during Islamic events of Eid-ul-Fitr, Eid Milad-un-Nabi and Ramadan in relevant Muslim countries. Originality/value Given the research gap between Gregorian and Islamic calendar anomalies, this paper contributes by combining the effect of Islamic Holy days on the returns of selected Muslim-dominated financial markets.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f7df86223e466c8aa9237f6f4c83c4b7",
  "timestamp": "2025-05-15T01:22:39.322579"
}