{
  "id": 1685,
  "title": "An Application of the Smart Beta Portfolio Model: An Empirical Study in Indonesia Stock Exchange",
  "abstract": "Stock price fluctuations affect investor returns, particularly, in this pandemic situation that has triggered stock market shocks. As a result of this situation, investors prefer to move their money into a safer portfolio. Therefore, in this study, we approach an efficient portfolio model using smart beta and combining others to obtain a fast method to predict investment stock returns. Smart beta is a method to selects stocks that will enter a portfolio quickly and concisely by considering the level of return and risk that has been set according to the ability of investors. A smart beta portfolio is efficient because it tracks with an underlying index and is optimized using the same techniques that active portfolio managers utilize. Using the logistic regression method and the data of 100 low volatility stocks listed on the Indonesia stock exchange from 2009-2019, an efficient portfolio model was made. It can be concluded that an efficient portfolio is formed by a group of stocks that are aggressive and actively traded to produce optimal returns at a certain level of risk in the long-term period. And also, the portfolio selection model generated using the smart beta, beta, alpha, and stock variants is a simple and fast model in predicting the rate of return with an adjusted risk level so that investors can anticipate risks and minimize errors in stock selection.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f7e12858a8fae8d8fa8dbe737c5499b3",
  "timestamp": "2025-05-15T00:58:18.417826"
}