{
  "id": 791,
  "title": "Three and a half decades of artificial intelligence in banking, financial services, and insurance: A systematic evolutionary review",
  "abstract": "The banking, financial services, and insurance (BFSI) sector is one of the earliest and most prominent adopters of artificial intelligence (AI). However, academic research substantially lags behind the adoption of AI in practice. At the beginning of this century, AI research has been centered on the sector's credit risk. In the 2010s decade, expert systems were increasingly replaced by data-driven, algorithmic AI. Big data enjoyed much hype in that decade, which diminished later mostly due to unsuccessful implementations. Much published research on big data actually relates to machine and deep learning but not to big data per se. These terms are often found to be conflated in research and practice. The insurance sector is substantially underrepresented in published AI research, and current research is dominated by banking and investments. Governance frameworks for responsible AI (RAI) are yet to be incorporated into practice by fintech companies as well as incumbent organizations. RAI is a particular issue for decentralized finance (DeFi). The most successful implementations of AI in BFSI practice, as well as dominant academic research areas, are in investments, securities, market making, customer relationships, lending, risk management, and compliance.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f7e5c58b2c9873a0057f08039aa278f9",
  "timestamp": "2025-05-15T01:42:44.452671"
}