{
  "id": 7179,
  "title": "Everyday discrimination and subclinical indicators of stroke in midlife women",
  "abstract": "Disparities between Black and White women in stroke risk in the United States are present during midlife, a period during which subclinical indicators of stroke risk accelerate in women. Racism and forms of discrimination have long been associated with cardiovascular pathophysiology. However, few studies have examined midlife discrimination among women and subclinical carotid atherosclerosis, a strong predictor of stroke and myocardial infarction. The Everyday Discrimination Scale, which measures discriminatory experiences, was administered to 304 (including 120 White and 76 Black) midlife women (mean age = 54, SD = 3.9) free of clinical cardiovascular disease. At the same visit, using ultrasonography, we measured four markers of subclinical carotid atherosclerosis, including plaque count, grey scale median, and maximum plaque height. The majority (85%) of women experienced at least one form of discrimination in their daily life. Black women reported experiencing greater discrimination than White women with a mean (SD) Everyday Discrimination Score of 7.3 (5.2) versus 5.7 (4.3). These experiences were most attributed to race, age, income, and other. Black participants had a higher prevalence of carotid plaque compared to White participants (52% versus 46%). Using Poisson regression, higher discrimination was associated with higher plaque count among Black women only, adjusted for age, systolic blood pressure, low-density lipoprotein cholesterol, and education, such that one standard deviation increase in the Everyday Discrimination Scale was associated with a 25% higher plaque count. Further adjusting for financial strain did not reduce the effect size. We did not observe an association between discrimination and other carotid plaque measures in Black or White women. In Black women, higher levels of discrimination was associated with greater carotid atherosclerosis. Clarifying the relationship between discrimination and subclinical indicators of stroke risk could inform social and healthcare interventions to reduce discrimination and potential associated stroke risk.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f7e6093f91d32297a2e2c3d3cc83cd60",
  "timestamp": "2025-05-15T03:06:01.192001"
}