{
  "id": 2343,
  "title": "A machine learning approach to assess price sensitivity with application to automobile loan segmentation",
  "abstract": "Price sensitivity is an outstanding business issue in companies and organizations that aim to undertake optimal managerial decisions for increasing sales and / or revenue. Hence, price sensitivity assessment has become an in fashion problem that has attracted the attention of a wide variety of actors and business units within the organizations. In this paper we propose a machine learning approach to assess price sensitivity for an automobile loan portfolio in order to get a segmentation revealing the existence of groups with differential price sensitivity, defined by their differential purchase responses against changes in the loan interest rate. The proposed method combines the power of conditional inference trees, random forests and model based recursive partitioning algorithms to implement a process for price group finding, variable selection and price sensitivity segmentation in order uncover such differential groups and characterize them by asset and product characteristics and by customer attributes as well. The resulting segmentation will define high sensitivity groups, where interest rate reductions can be recommended in order to increase sales, as well as nearly insensitive groups for which a price strategy that increases the interest rate is expected to have slight impact on loan disbursements. (C) 2018 Elsevier B.V. All rights reserved.",
  "year": 2019,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f7fea8672d28a3b8a8799f1f7f21c074",
  "timestamp": "2025-05-15T01:06:10.643592"
}