{
  "id": 3358,
  "title": "SPECIFIC BANKING DETERMINANTS OF NON-PERFORMING LOANS: THE CASE OF BOSNIA AND HERZEGOVINA",
  "abstract": "The research was made in order to identify specific banking determinants of non-performing loans in banking sector of Bosnia and Herzegovina. This problem came to the fore during and after global financial crisis, when the quality of loan portfolio dramatically increased. Much research of the problem of non-performing loans has already been made but they dealt with developed worlds countries. In BiH there is no a lot of research dealing with this issue. In order to resolve this problem (to create adequate measures for managing loan risks in commercial banks) it is necessary to identify the factors that affect appearance and growth of nonperforming loans in BiH. The authors presumed that five specific banking factors statistically influence the non-performing loans. The research included six determinants, ie one dependent and five independent determents. Dependent determinant shows the share of non-performing in total loans of banking sector in BiH, and independent determinants are: active credit rate, credit growth rate, capital adequacy ratio, return on equity and ratio of loan and deposit. We used quarterly data about the period from the first quarter of 2004 to the end of fourth quarter of 2019. The data was downloaded from Central bank od BiH. The research includes correlation and regression analysis which established determinants which statistically influence the non-performing loans and it was determined which part of variable can be explained with independent variables. The results of regression analysis show that only one specific banking determinant can be used to explain and predict the value of non-performing loans in banking sector in BiH. In other words, only the rate of credit growth is statistically significant and negative relation to non-performing loan. That means that increase of credit growth rate could infect the decrease of non-performing loans, which could positively influence the quality of credit portfolio. On the other hand, decrease of the credit growth rate could affect increase of non-performing loans which could make worse the quality of credit portfolio. The results of analysis showed active credit rate, capital adequacy ratio, return on equity and ratio of loan and deposit doesn`t statistically influence non-performing loans in this banking sector. We analyzed the trend of movement of total loan placement by commercial banks in BiH, as well as the trend of movement of non-performing loans. The results show that non-performing loans were mostly growing from 2004 to 2016, and to the end of the analyzed period they started to decrease. Even though non-performing loans started to decrease their share in total loans is still very high. That is why we must resolve this problem as soon as possible. It cannot be resolved by commercial bank because the process would last much too long. It is necessary to involve the state in resolving this problem. Also the activities of state instruments must be complementary with bank activities.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f806d2e5bcc98861cc5a057c2e925d78",
  "timestamp": "2025-05-15T01:16:22.140773"
}