{
  "id": 8742,
  "title": "Husband's willingness-to-pay for HIV and syphilis screening at antenatal care clinic under the Thai universal coverage scheme",
  "abstract": "Background Screening for sexually transmitted infection (STI) especially HIV as early detection and treatment have been financially supported under the Thai Universal Coverage (UC) scheme since 2009 (THB140 for HIV). However, the implementation has not been evidence-based, strategic risk-based, nor economically evaluated whereas husbands who accompanied the pregnant women are likely to have a lower risk than those who did not come along. This study is aimed to determine the husband's willingness-to-pay (WTP) for his HIV and syphilis screening tests and potential factors affecting STI screenings at the antenatal care (ANC) clinic of a tertiary hospital in Thailand. Methods A pilot open-ended interview was conducted among 50 participants to estimate the mean and standard deviation of WTP prices for HIV and syphilis screening tests. A questionnaire was developed to obtain demographics, STI knowledge and screening history, as well as two contingent valuation methods (bidding and payment scale), using the mean WTP prices identified from the pilot study as a starting WTP with 1/4SD step-up/down. The survey of 200 randomly selected husbands of pregnant women was conducted at King Chulalongkorn Memorial Hospital from April to June 2018. Descriptive statistics and logistic regression were used for data analysis. Results During the study period, 597 pregnant women received their first ANC. Of 368 accompanying husbands, 200 were enrolled in the study. Their median age was 31 (IQR 27-36) years old and 67% had a first child. Eighty-eight percent of the participants were willing to test for the STIs. Based on the bidding method, WTP prices for HIV and syphilis screening tests were US$14.5 (IQR 12.4-14.5) and US$9.7 (IQR 10-12), respectively. The payment scale method suggested approximately three-quarters of the WTP prices from the bidding method. Conclusions The husbands who accompanied their pregnant wives to the ANC clinic showed positive behaviors according to the propitious selection theory. They tend to cooperate well with STI testing and are willing to pay at least two times the price of the STI screening tests. The financial support to promote STI screenings should be reconsidered to cover other groups with higher sexual behavior risks and less WTP.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f80ef80af8999a2d05ab0ebe79e54747",
  "timestamp": "2025-05-15T03:21:56.636771"
}