{
  "id": 7924,
  "title": "A mental model of factors associated with subjective life expectancy",
  "abstract": "The objective was to develop and test a framework based on a biopsychosocial model that can be used to identify factors associated with subjective (self-estimated) life expectancy (SLE). SLE predicts important work and retirement decisions so a better understanding of the factors that contribute to an individual's thoughts about their likely age at death is essential for late-career and financial planning and for developing interventions aimed at addressing inappropriate estimates. This is a sub-study of the Australian 45 and Up Study cohort. Survey data were collected at two time points (3 years apart) from 2579 participants aged over 55 years. Correlations and regression analyses tested the relationship of SLE with biomedical/genetic factors (age, health diagnoses, parental longevity), socioeconomic factors (income, education) health behaviors (exercise, smoking, alcohol use, diet), and psychosocial factors (optimism, distress, social connectedness). Variables within each set of factors except the socioeconomic set were significantly related to SLE. Healthy lifestyle behaviors significantly moderated the effect of parental longevity. The findings indicate that individuals construct an understanding of their personal life expectancy based on similar factors that predict actual life expectancy, but not all mortality risk factors appear to be weighted realistically. The findings imply that, at least to some extent, SLE is not a stable construct and might be amenable to intervention. (C) 2013 Elsevier Ltd. All rights reserved.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f82be93d64065ceccaa3746dcdf6e650",
  "timestamp": "2025-05-15T03:13:30.656302"
}