{
  "id": 952,
  "title": "Predicting soil ecological criteria of 17 metal(loid)s in China based on quantitative ion character-activity relationship - Species sensitivity distribution (QICAR-SSD) coupled model",
  "abstract": "Soil pollution caused by metal(loid)s is increasingly serious and poses unexpected risks to terrestrial organisms. Establishing soil quality standards is essential for assessing ecological risks of metal(loid)s and protecting soil ecosystems. However, the limited availability of metal(loid) ecotoxicological data has hampered the development of soil quality standards due to financial and practical constraints on toxicity testing. This study collected 77 normalization equations and 58 cross-species extrapolation equations to calculate the normalized EC10 (the added concentration causing a 10 % inhibition effect) of metal(loid)s under a representative scenario. A set of quantitative ion character-activity relationship (QICAR) models were then constructed using normalized EC10 and nine critical ionic characters (AR, AR/AW, BP, MP, Z/r(2), Z/r, Xm, sigma p, and |Log(K-OH)|). Subsequently, these QICAR models were employed to predict ecotoxicological EC10 of 17 metal(loid)s to 12 soil species and coupled with species sensitivity distribution (SSD) to determine Predicted No Effect Concentration (PNEC). The results demonstrated the coupled QICAR-SSD model could effectively derive terrestrial PNEC for data-poor metal(loid)s, with errors between the predicted PNEC and reported soil standards (excluding soil background levels) from different countries mostly <0.3 orders of magnitude. Finally, soil ecological criteria (SEC) for 17 metal(loid)s were calculated using an added risk approach based on PNEC and national soil background concentration. Overall, the coupled model proposed here can provide a valuable supplement to the development of soil quality standards for numerous metal(loid)s in soil components.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f834204e94d5afda162a03bf75844b87",
  "timestamp": "2025-05-15T01:44:35.521470"
}