{
  "id": 7111,
  "title": "Impacts of COVID-19 on caregivers of childhood cancer survivors",
  "abstract": "Purpose We sought to assess the impact of disruptions due to coronavirus disease 2019 (COVID-19) on caregivers of childhood cancer survivors. Methods A 13-question survey containing multiple-choice, Likert-type, and free-text questions on experiences, behaviors, and attitudes during the COVID-19 outbreak was sent to childhood cancer caregivers and completed between April 13 and May 17, 2020. Ordered logistic regression was used to investigate relationships between demographics, COVID-related experiences, and caregiver well-being. Results Caregivers from 321 unique families completed the survey, including 175 with children under active surveillance/follow-up care and 146 with children no longer receiving oncology care. Overall, caregivers expressed exceptional resiliency, highlighting commonalities between caring for a child with cancer and adopting COVID-19 prophylactic measures. However, respondents reported delayed/canceled appointments (50%) and delayed/canceled imaging (19%). Eleven percent of caregivers reported struggling to pay for basic needs, which was associated with greater disruption to daily life, greater feelings of anxiety, poorer sleep, and less access to social support (p < .05). Caregivers who were self-isolating reported greater feelings of anxiety and poorer sleep (p < .05). Respondents who expressed confidence in the government response to COVID-19 reported less disruption to their daily life, decreased feelings of depression and anxiety, better sleep, and greater hopefulness (p < .001) Conclusions Caregivers are experiencing changes to medical care, financial disruptions, and emotional distress due to COVID-19. To better serve caregivers and medically at-risk children, clinicians must evaluate financial toxicity and feelings of isolation in families affected by childhood cancer, and work to provide reliable information on how COVID-19 may differentially impact their children.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f83959cbe834ddea96f6261e1552f744",
  "timestamp": "2025-05-15T03:05:03.590980"
}