{
  "id": 6097,
  "title": "The nexus between investor sophistication and annuity insurance ownership: evidence from FINRA's National Financial Capability Study",
  "abstract": "Purpose Although annuitization provides insurance against longevity risk that can benefit households, researchers have uncovered an annuitization puzzle, which suggests households are reluctant to annuitize their wealth. This study contributes to the discussions on the annuitization puzzle by examining investor sophistication and owning annuities in non-retirement accounts. Design/methodology/approach The study utilizes data from the 2018 U S National Financial Capability Study (NFCS). The empirical analyses are based on logistic regression estimates of annuity ownership on investor sophistication. Interpretations are based on odds ratios. Findings The findings indicate that investor sophistication contributes to the annuity puzzle. Investors with low objective and high subjective investment knowledge (overconfident investors) are more likely to own annuities compared to those with low objective and low subjective investment knowledge. However, investors with high objective and low subjective investment knowledge (under-confident investors) are less likely to choose annuity ownership compared to those with low objective and low subjective investment knowledge. The findings and ensuing discussion highlight the importance of annuitization when planning for retirement, with implications for financial service professionals. Research limitations/implications The measure of investor sophistication does not assess the difficulty level of each financial knowledge question. The questions used to construct the investor sophistication variable are based on general investment knowledge. In addition, the annuity ownership variable used in this study pertains to investments outside retirement accounts. Despite these limitations, the findings highlight the importance of annuitization when planning for retirement. Originality/value Unlike prior studies, the authors consider four mutually exclusive measures of investor sophistication constructed from measures of objective and subjective investment knowledge to understand the effect of investor sophistication on annuity ownership in the United States.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f84eda9fc661d4182da75ce63447b7df",
  "timestamp": "2025-05-15T02:54:38.877627"
}