{
  "id": 4000,
  "title": "Influence of bull and bear market phase on financial risk tolerance of urban individual investors in an emerging economy",
  "abstract": "Purpose This study aims to analyze how risk tolerance is influenced by bull and bear market phases, age and professional work experience (PWE) of investors in emerging economies. The authors also analyze how different market phases (bull and bear) influence risk tolerance of investors in emerging economies for different age groups and with varying PWE. Design/methodology/approach The study uses two quantitative methods, one-way ANOVA and hierarchical regression model (HLM) to analyze individual investors' financial risk tolerance (FRT) in India. Findings The authors find that age and PWE have positive relationship with FRT behavior. However, interactions of these variables with market phase variable indicate that risk tolerance has nonlinear increasing relationship with investor's age and PWE. The risk tolerance of older investors is consistently high in both bull and bear market conditions, while young investors display a nonlinear risk behavior in different market conditions. Practical implications The study suggests that financial planners should include a longitudinal risk profiling of investors based on age groups, PWE and the current market phase to better understand investors' FRT and also to prefer more context-specific advice to investors in emerging economies, which, consequently, result in increasing the retail investors' interest in otherwise sparsely participated equity market. Originality/value Interaction effect of bull and bear market phases on relationship between age and PWE and FRT has been scantly studied.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f84f17fd91638b0a37b98ac6383ca26c",
  "timestamp": "2025-05-15T02:31:58.701033"
}