{
  "id": 6346,
  "title": "The influence mechanism of real estate enterprises' status on debt default risk",
  "abstract": "PurposeThe aim of this study is to analyze the influence mechanism of real estate enterprises' status on debt default risk and explore the heterogeneity effect of the characteristics of enterprises.Design/methodology/approachAgainst the background of the three red lines regulation of the financing of real estate enterprises and the COVID-19 pandemic, the authors select 123 real estate enterprises listed on China's Shanghai and Shenzhen A-shares markets from the first quarter of 2021 to the second quarter of 2022 as a research sample. The social network analysis method and Z-score financial risk early warning model are used to measure real estate enterprises' status and debt default risk. The authors construct a panel regression model to analyze how the status of real estate enterprises influences their debt default risk.FindingsThe results show that the status of real estate enterprises negatively and significantly affects their debt default risk. Economic policy uncertainty and financing constraints play negative moderating and mediating roles, respectively. Further research has found that the effect of real estate enterprises' status on debt default risk is characterized by heterogeneity in equity characteristics, i.e. it is significant in the sample of nonstate-owned enterprises but not in the sample of state-owned enterprises.Practical implicationsIt is helpful for real estate enterprises to attach importance to the value of social networks, and the authors provide policy suggestions for real estate enterprises to constantly improve their risk management systems.Originality/valueUsing economic policy uncertainty as the moderating variable and financing constraints as the mediating variable, the authors analyze how the status of real estate enterprises influences debt default risk, which contributes to a better understanding of the formation of the debt default risk of real estate enterprises.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f8685ed93dd9dc4934971f36df9b73b7",
  "timestamp": "2025-05-15T02:57:07.732974"
}