{
  "id": 7353,
  "title": "Economic Costs of Antidepressant Use: A Population-Based Study in Sweden",
  "abstract": "Background: Prescription of antidepressant drugs (ADs) has increased in recent decades, with rising costs for patients as well as for the health care system. There is sparse evidence of which factors explain the high economic costs and financial burden for the general population. Aims of the Study: The aim was to assess individual-level determinants of out-of-pocket and total health care costs of AD use in the Swedish general population. Methods: We randomly sampled 400,000 individuals aged 18+ from Statistics Sweden's population register from 2010 to 2013. Two-part regression models were used for our two primary outcome variables: (i) total health care costs for AD use per year and individual, and (ii) total out-of-pocket costs of AD use per year and individual. Results: Women, the unemployed, unmarried people and residents of big cities have both higher use of ADs and higher associated total health care and out-of-pocket costs. Today, ADs are relatively inexpensive and average cost differences among all groups are therefore minor. The elderly have higher use of ADs, but are more commonly low-volume users and do not have higher total health care or out-of-pocket costs. Discussion and Limitations: Groups with relatively low socioeconomic status are at risk of higher costs for antidepressant use. However, given the Swedish system of drug subsidies, differences in financial burden for individuals are minor. The limitations of this study included that we lacked data on diagnosis and could therefore not categorize the reasons for AD consumption. Furthermore, our results may not be generalized to other countries with a lower AD prevalence then Sweden's, since our estimates are dependent on the point prevalence of antidepressant use in the population. Implications for Health Care Provision and Use: Groups with higher AD consumption and economic costs may suffer from more severe depression owing to more risk factors and less social support in their surroundings, and may be in greater need of additional treatment and support than other groups. Implications for Health Policies and Further Research: Our results offer insight at an aggregate level, and more information on the underlying causes of higher costs is needed to discern the policy implications.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f86c932316902f2b980be15fabcd0783",
  "timestamp": "2025-05-15T03:07:31.996585"
}