{
  "id": 5312,
  "title": "Accessing healthcare in times of economic growth and economic downturn: Evidence from Ireland",
  "abstract": "This article examines the accessibility of healthcare in Ireland between 2003 and 2011 in the context of strong economic growth (2003-2007) and the subsequent financial crisis, which began in 2008. It investigates, in particular, changes in self-reported difficulties in accessing healthcare with regard to distance to health services, waiting times for appointments and the costs of seeing a doctor, and identifies particular risk factors that increase the likelihood of facing barriers in accessing health services. We conduct logistic regression analyses of cross-sectional data from the three rounds (2003, 2007, 2011) of the European Quality of Life Survey of 2682 individuals living in private households in Ireland. The study finds that the number of individuals reporting difficulties in accessing healthcare increased over time. Of particular concern are difficulties with the financial costs of covering doctor's appointments, which started to increase dramatically prior to the economic crisis and continued to rise during the crisis, in particular for higher income groups. Difficulties with distance and waiting time declined gradually over time and appear unaffected by the financial crisis, at least until 2011. Subgroups that face significantly more difficulties are women, younger individuals, the full-/part-time employed and individuals with poor health status. Our findings contribute to the recent discussion on the effects of institutional barriers on accessing health services in the context of significant economic change.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f899dcb8d0fc62041f9ea595f6bf2a3e",
  "timestamp": "2025-05-15T02:46:16.297696"
}