{
  "id": 3507,
  "title": "How does the financial performance of sugar-using firms compare to other agribusinesses? An accounting and economic profit rates analysis",
  "abstract": "PurposeThe United States (US) sugar program protects domestic sugar farmers from unrestricted imports of heavily-subsidized global sugar. Sugar-using firms (SUFs) criticize that program for causing US sugar prices to be higher than world sugar prices. This study examines the financial performance of publicly traded SUFs to determine if they are performing at an economic disadvantage in terms of accounting profitability, risk and economic profitability compared to other industries.Design/methodology/approachFirm-level financial accounting and market data from 2010 to 2019 were utilized to construct financial metrics for publicly traded SUFs, agribusinesses and general US firms. These financial metrics were analyzed to determine how SUFs compare to their agribusiness peer group and general US companies. The comprehensive financial analysis in this study covers: (1) accounting profit rates, (2) drivers of profitability, (3) economic profit rates, (4) trend analysis and (5) peer comparisons. Quantile regression analysis and Wilcoxon-Mann-Whitney statistics are employed for statistical comparisons.FindingsRegarding various profitability and risk measures, SUFs outperform their agribusiness peers and the general benchmark of all US firms in terms of accounting profit rates, risk levels and economic profit rates. Furthermore, compared to other US industries using the 17 French and Fama classifications, SUFs have the highest return on investment and economic profit rate?measured by the Economic Value Added (R) margin?and the second-lowest opportunity cost of capital, measured by the weighted average cost of capital.Originality/valueThis study finds nothing to suggest that the US sugar program hinders the financial success of SUFs, contrary to recent claims by sugar-using firms. Notably in this analysis is the evaluation of economic profit rates and a series of robustness techniques.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f8a303d9c2f47d58db0b1206452cfd00",
  "timestamp": "2025-05-15T02:26:48.593447"
}