{
  "id": 4095,
  "title": "Exploring motives for participation in a perpetual easement program: Going beyond financial incentives",
  "abstract": "Private land conservation has become an important element of the global conservation portfolio. Often, landowners are encouraged to participate in private land conservation with financial incentives. However, there is a concern that financial incentives may be limited given the ephemeral nature of funding. Financial incentives also have the potential to crowd-out participation from landowners motivated by altruistic factors rather than financial ones. These concerns underscore the importance of understanding drivers of participation in conservation programs. While there is a plethora of studies examining motivations for participation in term-limited conservation programs, there are far fewer that look at landowners' reasons for participating in perpetual programs. We examined landowners' non-financial motivations for participation in a United States Fish and Wildlife perpetual easement program using several analytical approaches. We first looked at correlations between the likelihood of participation in the easement program and survey respondent's beliefs, values, norms, and perceived behavioral control using a Bayesian regression analysis. Next, using a cluster analysis we segmented our landowner sample into two groups, tested for differences between the group theoretical constructs, and looked for patterns in geographic distributions of the clusters. Our results suggested that individuals who accepted responsibility for habitat protection and recognized habitat threats were more likely to have participated in the easement program. We did not find significant demographic patterns in our cluster analysis but did see differences across the tested theoretical constructs of theory of planned behavior and value-belief norm theory. Further exploration of variation revealed potential for conservation opportunities and allowed us to make recommendations for future policy actions.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f8a543134bb9eb391d6f1f8b760d4e36",
  "timestamp": "2025-05-15T01:23:58.021194"
}