{
  "id": 5418,
  "title": "Predictive association between immigration status and chronic pain in the general population: results from the SwePain cohort",
  "abstract": "BackgroundPrevious studies suggest that immigration may influence the experience of pain.ObjectiveThis population-based study examines whether immigration status is associated with chronic pain (CP), chronic widespread pain (CWSP), and severe CP at a two-year follow-up. We also tested mediation by mood status (i.e., anxiety and depression).Methods15, 563 participants from a representative stratified random sample of 34,000 individuals living in south-eastern Sweden completed a postal survey, during 2013-2015, that included the following data: immigration status; presence of CP (pain lasting at least 3 months) and CWSP (a modified classification of widespread pain for use in epidemiological studies); severity of CP based on a numeric rating scale; and depression, anxiety, economic situation, and sociodemographic information. We applied logistic regressions using the generalized estimating equations (GEE), with Swedish-born as the reference group and path analyses models.ResultsCompared to the Swedish-born participants (n =14,093;90%), the immigrants (n =1470;10%) had an elevated risk of all pain outcomes (CP: odds ratio [OR]=1.18; 95% confidence interval [CI=1.04-1.33, CWSP: OR=1.39; 95% CI: 1.15-1.69 and severe CP: 1.51; 95% CI: 1.23-1.87) after adjustments. Path analyses showed that baseline age, immigrant status, and financial hardship had a significant influence on chronic pain outcomes at follow-up with baseline mood status as the mediator. Immigration status was also associated with age and financial hardship.ConclusionImmigrants may have increased risk of chronic pain, widespread pain, and severe pain and this risk is mediated by mood status. Targeted interventions better tailored to the socio-economic and psychological status of immigrants with chronic pain are warranted.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f8a938ff03b28690d1d224e46ee39953",
  "timestamp": "2025-05-15T02:47:42.880122"
}