{
  "id": 3976,
  "title": "The local variations in regional technological evolution: Evidence from the rise of transmission and digital information technology in China's technology space, 1992-2016",
  "abstract": "While earlier studies have extensively evidenced the path-dependent character of technological evolution whereby the rise of new technologies is heavily constrained by the portfolio of preexisting technologies in a certain city, surprisingly little is known about the local variations in the degree of path-dependency and the factors underlying this spatial heterogeneity. Based on a case study of transmission and digital information technology (H04L patents) in China, we perform a geographically and temporally weighted regression to unveil the local variations in regional technological path-dependency. To explain these variations, we further dissect the extent to which local actors may dislodge regional economy from path-dependent technological regimes, and the extent to which their path-breaking capabilities may diverge geographically. The model reveals that while all cities in China are subject to path-dependency in the development of H04L technology, the effect of technological relatedness is especially pronounced in the southern coastline, where industrial innovation enables a much larger impact of technological relatedness on H04L technological progress. By contrast, the technological path-dependency withers in the vicinity of eastern coastline, particularly in the Jing-Jin-Ji area, Yangtze River Delta and their western hinterlands, where university innovation exerts a relatively higher degree of path-breaking effect on H04L technology. Additionally, local governmental support is also conducive to inducing H04L technological discontinuities for latecomers by dislodging them from path-dependent technological regimes.",
  "year": 2019,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f8b3c092318d26cc8928187d3eeaf194",
  "timestamp": "2025-05-15T01:22:39.416493"
}