{
  "id": 5858,
  "title": "Relationship Between Psychosocial Stress and Blood Pressure: The National Heart, Lung, and Blood Institute Family Heart Study",
  "abstract": "Introduction: Various domains of psychosocial stress have been significantly related to blood pressure. However, ambiguity is present in how these relationships are defined in the literature. Objective: To add to the existing literature and examine the relationship between psychosocial stress (financial strain and job strain) and other cofactors on blood pressure. Methods: This secondary analysis is designed to analyze the relationship between levels of job and financial stress and blood pressure outcomes among participants in the National Heart, Lung, and Blood Institute (NHLBI) Family Heart Study 2004-2008. The descriptive, cross-sectional design uses data from a subset of study participants, 350 White and 195 Black (n =545), 338 female (62%), and all aged 18-56 years. Psychosocial stress was measured using the Singh Stress Scale. Resting systolic (SBP) and diastolic (DBP) blood pressure values obtained on a stress reactivity protocol day in the primary study, as well as calculated mean arterial pressure (MAP) were used for this analysis. Multivariate linear regression analyses were used to explore the relationship between psychosocial stress and blood pressure. Results: In this young cohort, self-report of either financial strain or job strain was associated with lower blood pressure levels than those of participants who reported neither stressor. Differential sex and race effects appear to contribute to these results. Blood pressure levels were not significantly associated with self-report of both stressors. Conclusion: Understanding the effects of various forms of stress on blood pressure may inform more precise HTN risk-factor screening and interventions to improve BP management.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f8c4c1b4c6ba76e1855e4af69e3d3ac1",
  "timestamp": "2025-05-15T02:51:58.716278"
}