{
  "id": 8790,
  "title": "Home food availability is associated with multiple socio-economic indicators in 50 year olds from Canterbury, New Zealand",
  "abstract": "Financial restraints and poverty lead to poor diets and poor health outcomes. Limited research shows that socioeconomic status is related to home availability of certain foods. However, studies in this area have used different socio-economic indicators, which may not equally influence eating-related behaviors. Using multiple indicators of socio-economic status may provide a more accurate picture of these relationships. The aim of this study was to investigate whether several socio-economic indicators are independently associated with home availability of selected foods known to influence chronic disease risk in 50 year olds from Canterbury, New Zealand, participating in the CHALICE study. Participants were selected randomly from health research extracts from Canterbury. Data from 216 participants (110 females, 106 males) were included. The presence (but not quantity) of foods/beverages in the home was measured by a validated home food inventory. Linear regression analyses were performed for the following home food inventory scores: fruit, vegetables, lower fat dairy, obesogenic foods and sweetened beverages with household income, standard of living and education using multivariate models. Higher household income and standard of living were individually associated with a 2% to 3% higher fruit and vegetables (3 to 5 types/forms) and total food scores (6 to 9 types/forms) (p<0.03). Higher education level was associated with a 2.5% increase in fruit and vegetables score (4 types/forms) and an 8% decrease in sweetened beverages score (0.4 beverages) (p<0.02). These results suggest that using only one measure of socio-economic status cannot accurately capture the effects of social inequalities in food availability. Those experiencing the most social disadvantage had a lesser availability of fruit and vegetables which may be detrimental to good health.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f8c663b8a2730259eadf2075db4c7b73",
  "timestamp": "2025-05-15T03:22:26.063493"
}