{
  "id": 1465,
  "title": "E-Commerce Enterprise Supply Chain Financing Risk Assessment Based on Linked Data Mining and Edge Computing",
  "abstract": "In recent years, the rapid development of information technology has affected the way the world economy operates. The emergence of e-commerce has greatly shortened the time and space distance between economic participants and maximized the sharing of resources. However, the financial management and risk assessment capabilities of the existing supply are insufficient to adapt to the rapidly developing new environment. This article uses a combination of normative analysis and empirical analysis to analyze the status quo of the supply chain of small and medium e-commerce companies. First, this article establishes an evaluation framework for the supply chain of e-commerce companies based on edge computing. Second, according to the distribution of the supply chain, this article adds the member's predetermined quota, reputation, execution time, and other indicators as parameters to establish a fuzzy neural network model. On this basis, combined with the price regression model, the pricing plan is evaluated. The results show that the financing risk obtained by this model differs very little from the actual risk. The above-mentioned model constructs an e-commerce enterprise supply chain financing risk management model that adapts to the environment of the new era.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f8e83d23f8aadf5949d194e80ebc149e",
  "timestamp": "2025-05-15T02:03:39.673259"
}