{
  "id": 271,
  "title": "Adaptive Supervised Learning for Financial Markets Volatility Targeting Models",
  "abstract": "In the context of risk-based portfolio construction and pro-active risk management, finding robust predictors of future realised volatility is paramount to achieving optimal performance. Volatility has been documented in economics literature to exhibit pronounced persistence with clusters of high or low volatility regimes and to mean-revert to a normal level, underpinning Nobel prize-winning work on Generalized Autoregressive Heteroskedastic (GARCH) models. From a Reinforcement Learning (RL) point of view, this process can be interpreted as a model-based RL approach where the goal of the models is twofold: first, to represent the volatility dynamics and forecast its term structure and second, to compute a resulting allocation to match a given target volatility: hence the name volatility targeting method for risk-based portfolios. However, the resulting volatility model-based RL approaches are hard to distinguish as each model results in similar performance without a clear dominant one. We therefore present an innovative approach with an additional supervised learning step to predict the best model(s), based on historical performance ordering of RL models. Our contribution shows that adding a supervised learning overlay to decide which model(s) to use provides improvement over a naive benchmark consisting in averaging all RL models. A salient ingredient in this supervised learning task is to adaptively select features based on their significance, thanks to minimum importance filtering. This work extends our previous work on combining model-free and model-based RL. It mixes different types of learning procedures, namely model-based RL and supervised learning opening new doors to combine different machine learning approaches.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f8f06269a9480559a96238aeb35b52e3",
  "timestamp": "2025-05-15T00:41:04.792370"
}