{
  "id": 4148,
  "title": "Banking on foreign currency accounts: evidence from Malaysia",
  "abstract": "Purpose - The purpose of this paper is to study how the foreign currency account (FCA) is affected by the domestic fixed deposit (FD) rate, the FCA rate, the expected exchange rate and exchange rate risk. Design/methodology/approach - This paper analyses the causal relationship between the domestic FD rate, the FCA rate, the expected exchange rate on a set of foreign currency deposits and exchange rate volatility, based on the theory of portfolio choice. Based on the theory, the panel vector autoregressive regression of fully modified ordinary least squares and dynamic ordinary least squares are modelled. Findings - There is no cointegrating relationship for the three-month FCA deposits, the domestic FD rate, the FCA rate and the expected exchange rate. Only the six-month FCA business deposits are affected by the domestic FD rate, the FCA rate and the expected exchange rate. The FCA depositors are not affected by exchange rate volatility. Research limitations/implications - This study is conducted based on the FCA rate quoted by the leading commercial banks in Malaysia, Maybank. Thus, the FCA rate is used as a proxy for the FCA rate of commercial banks in Malaysia. Originality/value - Individual depositors have to save in more than the three-month FCA to realise their expected return. For individuals, the FCA deposit is not an alternative choice to domestic FD. Exporters may use the FCA deposit to finance their foreign purchases to save the cost of foreign exchange conversion but it is still not an appropriate hedging tool against foreign exchange fluctuations as compared to the existing forward foreign exchange facility.",
  "year": 2018,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f9043986eb3742b2e41eb772afb33e7c",
  "timestamp": "2025-05-15T01:24:25.327497"
}