{
  "id": 7705,
  "title": "A cross-sectional study of emergency care utilization and associated costs of violent-related (assault) injuries in the United States",
  "abstract": "BACKGROUND: Violent-related (assault) injuries are a leading cause of death and disability in the United States. Many violent injury victims seek treatment in the emergency department (ED). Our objectives were to (1) estimate rates of violent-related injuries evaluated in United States EDs, (2) estimate linear trends in ED visits for violent-related injuries from 2000 to 2010, and (3) to determine the associated health care and work-loss costs. METHODS: We examined adults 18 years and older from a nationally representative survey (the National Hospital Ambulatory Medical Care Survey) of ED visits, from 2000 to 2010. Violent injury was defined using International Classification of Diseases-9th Rev.-Clinical Modification, diagnosis and mechanism of injury codes. We calculated rates of ED visits for violent injuries. Medical and work-loss costs accrued by these injuries were calculated for 2005, inflation-adjusted to 2011 dollars using the WISQARS Cost of Injury Reports. RESULTS: An annual average of 1.4 million adults were treated for violent injuries in EDs from 2000 to 2010, comprising 1.6% (95% confidence interval, 1.5%-1.6%) of all US adult ED visits. Young adults (18-25 years), men, nonwhites, uninsured or publically insured patients, and those residing in high poverty urban areas were at increased risk for ED visits for violent injury. The 1-year, inflation-adjusted medical and work-loss cost of violent-inflicted injuries in adults in the United States was US $49.5 billion. CONCLUSION: Violent injuries account for over one million ED visits annually among adults, with no change in rates over the past decade. Young black men are at especially increased risk for ED visits for violent injuries. Overall, violent-related injuries resulted in substantial financial and societal costs. (Copyright (C) 2017 Wolters Kluwer Health, Inc. All rights reserved.)",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f91f3005e99d81ccd131ce64c7f88da8",
  "timestamp": "2025-05-15T03:11:04.638603"
}