{
  "id": 3126,
  "title": "Board Gender Diversity and Risk Management in Corporate Financing: A Study on Debt Structure and Financial Decision-Making",
  "abstract": "Purpose: This study examines the role of board gender diversity in shaping corporate financial decisions, particularly in terms of debt structure and risk management. Focusing on the Tehran Stock Exchange, it explores how female representation on boards influences long-term and short-term leverage decisions, focusing on the moderating effect of board compensation. Design/Methodology: Utilising a quantitative ex post facto design, the study analyses data from 114 companies listed on the Tehran Stock Exchange between 2017 and 2021. Multivariate regression techniques, including year- and industry-fixed effects, are employed to investigate the relationship between board gender diversity, debt structure, and risk-taking behaviour. Findings: The results reveal a significant negative relationship between female board representation and long-term debt, suggesting that companies with more female directors tend to adopt more conservative debt structures, thereby reducing risk. Additionally, the findings demonstrate that board compensation moderates this relationship by curbing managerial risk-taking, further improving financial decision-making. Originality/Value: This research provides novel insights into the intersection of board gender diversity and risk management in financial decision-making, particularly in the context of a developing economy like Iran. It also offers practical implications for firms seeking to optimise their debt structures while maintaining sound risk management practices.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f92ce65d851f4ec801722b9eeb243ca6",
  "timestamp": "2025-05-15T02:22:56.687015"
}