{
  "id": 4612,
  "title": "Financial loss in pyramid savings schemes, downward social mobility and acute coronary syndrome in transitional Albania",
  "abstract": "Objective: Extensive financial losses caused by the collapse of pyramid savings schemes led to the 1997 turmoil in Albania. The authors' aim was to assess the association of financial loss and social mobility with acute coronary syndrome (ACS) 6-9 years after the precipitous collapse. Methods: A population-based case-control study was conducted in Tirana, the Albanian capital, in 2003-6. 467 non-fatal consecutive ACS patients were recruited ( 370 men aged 59.1 (SD8.7) years and 97 women 63.3 (SD 7.1) years, 88% response). The control group comprised 469 men (53.1 ( SD 10.4) years) and 268 women (54.0 ( SD 10.9) years, 69% response). Information on the absolute financial loss ( in US$), relative loss and subjective social mobility was obtained by a structured interviewer-administered questionnaire. Associations of financial loss and social mobility with ACS were assessed by multivariable-adjusted logistic regression. Results: Financial loss in pyramid scams was frequent in both ACS patients (55%) and controls (41%). Downward subjective social mobility was noted in 31% of patients and 12% of controls. Upon adjustment for sociodemo-graphic and socioeconomic characteristics and conventional coronary risk factors, ACS was associated with both financial loss ( OR 1.9, 95% CI 1.4 to 2.6) and downward social mobility ( OR 2.2, 95% CI 1.4 to 3.3). Although the association with financial loss was partly mediated through subjective social mobility, both maintained independent associations with ACS. Conclusions: In the wake of a nationwide catastrophic collapse of savings that led to losses totalling about 40% of the Albanian gross domestic product, the authors detected apparent long-term deleterious health effects of financial loss and downward intragenerational subjective social mobility.",
  "year": 2008,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f93ed1a1f67295f246e031d406a8ac1c",
  "timestamp": "2025-05-15T02:38:56.469575"
}