{
  "id": 7700,
  "title": "Elder abuse through a life course lens",
  "abstract": "Background: This paper provides the findings from a large pilot study, Defining and Measuring Elder Abuse and Neglect, a precursor to a national prevalence study to be conducted in Canada beginning in September 2013. One purpose of this study and the focus of this paper was to determine whether a life course perspective would provide a useful framework for examining elder abuse. The two-year pilot study, 2009-2011, examined the prevalence of perceptions of abuse at each life stage by type of abuse, the importance of early life stage abuse in predicting types of elder abuse, and early life stage abuse as a risk factor for elder abuse. Methods: Older adults who were aged >= 55 years (N=267) completed a cross-sectional telephone survey, comprising measures of five types of elder abuse (neglect, physical, sexual, psychological, and financial) and their occurrence across the life course: childhood (<= 17 years), young adulthood (18 to 24 years), and older adulthood (5 to 12 months prior to the interview date). Data analyses included descriptive statistics, bivariate correlations for abuse at the various life stages, and the estimation of logistic regression models that examined predictors of late life abuse, and multinomial logistic regression models predicting the frequency of abuse. Results: Fifty-five percent of the sample reported abuse during childhood, and 34.1% reported abuse during young adulthood. Forty-three percent said they were abused during mature adulthood, and 24.4% said they were abused since age 55 but prior to the interview date of the study. Psychological (42.3%), physical (26.6%), and sexual abuses (32.2%) were the most common abuses in childhood while psychological abuse was the most common type of abuse at each life stage. When the risk factors for abuse were considered simultaneously including abuse during all three life stages, only a history of abuse during childhood retained its importance (OR=1.81, p=0.046, CI=1.01-3.26). Abuse in childhood increased the risk of experiencing one type of abuse relative to no abuse, but was also unrelated to experiencing two or more types of abuse compared to no abuse. Conclusions: Results suggest that a life course perspective provides a useful framework for understanding elder abuse and neglect. The findings indicate that a childhood history of abuse in this sample had a deciding influence on later mistreatment, over and above what happens later in life.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f94f511163c83a7c1fca81aa30062f71",
  "timestamp": "2025-05-15T03:11:04.620901"
}