{
  "id": 5179,
  "title": "Interest rate sensitivity of traditional, green, and stable cryptocurrencies: A comparative study across market conditions",
  "abstract": "Background: This study examines the impact of interest rate fluctuations on the returns of traditional, green, and stable cryptocurrencies from April 2019 to April 2023. Bitcoin, Cardano, and Tether represent these categories due to their market significance. Methods: Using quantile regression (QR), the study analyzes the impact of interest rate shocks on cryptocurrency returns during bullish and bearish market periods. It also decomposes nominal interest rates into real interest rates and inflation expectations. The sample period is divided into stable and rising interest rate sub-periods for robustness. Results: The results show that cryptocurrency returns are more sensitive to interest rate fluctuations in both bullish and bearish periods. The sensitivity varies across cryptocurrency types, with Cardano acting as a hedge against inflation risk during bearish periods. Conclusions: The results support the research hypotheses and provide insights into the behavior of cryptocurrencies under different market conditions. These findings help portfolio managers and policymakers to make informed decisions in a digital financial environment. Future research should explore the interactions between cryptocurrencies and other financial markets.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f950394090d8a619a2412cbbdd119c0c",
  "timestamp": "2025-05-15T02:45:17.026463"
}