{
  "id": 8259,
  "title": "The stress of musculoskeletal pain -: A comparison between primary care patients in various ages",
  "abstract": "Objectives: To analyse differences in demographic/financial/ pain/health variables, disability, General Health Questionnaire (GHQ; i.e., depression symptoms) and coping among 949 primary care pain patients in various ages (20-65+ years) and to identify predictors of disability and coping. Method: Patients completed scales about various areas (e.g., coping). The design was cross-sectional and data were collected during 15 consecutive days at 20 randomly selected primary care centres in Stockholm. Results: Univariate analyses showed that older patients (a) were more often divorced, blue-collar workers, less educated and had greater difficulties with living expenses, (b) had pain of longer duration, more frequently and of more complexity, and felt more disabled, (c) consumed more painkillers, analgesics, sedatives and other medications, had received more pain treatments and had more health problems and (d) more often used passive coping for pain. Younger patients (a) had more severe pain, were financially strained and were more often unemployed and (b) more often used active coping for pain. There were no significant differences concerning GHQ scores. Multivariate regression analyses showed that active coping was associated with younger age. High disability and passive coping were associated with older age. Conclusion: We corroborated previous findings and may provide new insights into the experiences of older and younger pain patients. Further research concerning, for example, the elderly at risk of developing pain problems is needed. (C) 2004 Elsevier Inc. All rights reserved.",
  "year": 2004,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f95ae13d8e55044ea866545e269d9299",
  "timestamp": "2025-05-15T03:16:49.074075"
}