{
  "id": 821,
  "title": "Evaluating Employee Health Risks Due to Hypertension and Obesity: Self-Testing Workplace Health Stations",
  "abstract": "Background: We evaluated employee health risks due to hypertension, pre-hypertension, overweight, and obesity through the use of self-testing workplace health stations that measure blood pressure (BP) and weight. Methods: We analyzed BP and weight data from the first IS months after the installation of health stations in the offices of a financial services company with approximately 20000 employees in 13 US workplace locations. Results: Data showed that 21.7% of the employees voluntarily used a health station at least once to measure BP or weight during the first 18 months. Health station usage ranged from a high of 51.8% to a low of 5.3% at the 13 workplace locations. Among health station users, 52.5% used a health station more than once. Health station users used the health stations an average of 4.2 times (median, 2 times). Among health station users, 95.6% measured BP, 92.2% measured weight, and 87.8% measured both BP and weight. Initial BP results were: hypertension 26.7%, prehypertension 40.3%, and normal BP 32.9%. The initial body mass index (BMI) results were: obese 38%, overweight 34.7%, normal weight 25.3%, and underweight 2%. Employees with hypertension on the initial reading used the health stations more frequently than employees with pre-hypertension or normal BP. Employees with an obese BMI result on the initial reading used the health stations more frequently than employees with an overweight or normal BM I result. Many employees reduced their health risks due to hypertension, pre-hypertension, overweight, or obesity, although the health risks of many other employees were unchanged or increased. Conclusions: Self-testing workplace health stations that measure BP and weight provide employees with information about their health risks due to hypertension, pre-hypertension, overweight, and obesity. Self-testing workplace health stations can also be used to identify at-risk employees who may benefit from health and wellness programs.",
  "year": 2009,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f95d7e61d3a1b6ffd86c14088a47c56a",
  "timestamp": "2025-05-15T01:43:20.478604"
}