{
  "id": 7897,
  "title": "Determinants of polydoctoring among multimorbid older adults; a cross-sectional study in an urban area of Japan",
  "abstract": "BackgroundMultimorbidity increases with age, leading to various adverse outcomes, including higher mortality, care dependency, hospitalizations, and healthcare costs. Polydoctoring, managing a patient with multimorbidity by multiple healthcare providers, can be a risk of fragmented care and increased healthcare expenditures. This study aims to identify patient-related factors contributing to polydoctoring in older adults with multimorbidity.MethodsThis study is a cross-sectional study using baseline data from the Kawasaki Aging and Wellbeing Project. Participants were residents of Kawasaki City aged 85-89 years, without disability in basic activities of daily living, and being able to visit study site. The regularly visited facilities (RVF) index was employed to quantify polydoctoring. Polydoctoring was defined as having two or more RVFs. Poisson regression analysis was conducted to assess the association between polydoctoring and patient demographics, including types of chronic conditions and socioeconomic factors.ResultsA total of, 968 participants with multimorbidity were analyzed. Increased RVF was significantly associated with eye diseases (rate ratio [RR] 1.27, 95% confidence interval [CI] 1.12-1.44), osteoporosis (RR 1.22, 95% CI 1.08-1.38), prostate diseases (RR 1.22, 95% CI 1.07-1.40), and osteoarthritis (RR 1.16, 95% CI 1.05-1.27). No significant correlation was found with educational status or financial hardship.ConclusionThe study indicated that certain chronic conditions are linked to increased polydoctoring among multimorbid older adults in Japan. However, most of those conditions are considered to be within a scope of family medicine/general practice. Training general practitioners to manage these conditions could reduce healthcare costs and the treatment burden, indicating a direction for future healthcare policy and medical education. This study aims to identify patient-related factors contributing to polydoctoring in older adults in Japan. Polydoctoring was significantly associated with eye diseases, osteoporosis, prostate diseases, and osteoarthritis. No significant correlation was found with educational status or financial hardship.image",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f96a63038c8d0302c78f53b2d014fdd6",
  "timestamp": "2025-05-15T03:13:04.955900"
}