{
  "id": 6341,
  "title": "Risk stratification for early and late falls in acute care settings",
  "abstract": "Background and Aims Falling generally injures patients, lengthens hospital stays and leads to the wastage of financial and medical resources. Although falls can occur at any stage after hospital admission, there are no studies that characterise falls with length of hospital stay in acute care settings. This study aims to clarify risk stratification of early and late falls in acute care settings. Methods A retrospective cohort study was conducted for participants who were admitted to a teaching hospital in Japan. Patients' falls were divided into two groups based on the median of the fall date (day 10). Considering a 70/30 split, the logistic regression model was used to extract independent predictors for early and late falls for nine risk variables based on exploratory analysis among 26 items selected from the modified Japanese Nursing Association Fall Risk Assessment Tool, and risk models were validated. This study was conducted according to the STROBE guideline. Results Of the 10,975 patients admitted, 87 and 90 with early and late falls, respectively, were identified. The five significant risk factors extracted for early falls were fall history, muscle weakness, impaired understanding, use of psychotropics and the personality trait of 'doing everything on one's own'; risk factors identified for late falls were being older than 65 years, impaired extremities and unstable gait, in addition to muscle weakness. Using these variables for early and late falls in the validation cohort, the concordance indices of the risk models were both over 0.80. Conclusions By separately extracting risk factors for early and late falls in an acute care hospital setting, this study shed light on the characteristics of the respective types of falls. Relevant to clinical practice As the risk factors of falls vary according to the length of hospitalisation, specific preventive care can be implemented to avoid fall incidents.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f976be3d8ce515a04c98400eaad758fa",
  "timestamp": "2025-05-15T02:57:07.707321"
}