{
  "id": 5746,
  "title": "Sentiments-Risk Relationship across the Corporate Life Cycle: Evidence from an Emerging Market",
  "abstract": "The influence of market sentiments on the bankruptcy risk propensity of firms has been extensively explored in the literature. However, less attention has been paid to whether the corporate life cycle plays any role in this nexus. The purpose of this research is to unveil how the corporate bankruptcy risk propensity responds to market sentiments, and whether this sentiments-risk relationship varies over different stages of the corporate life cycle. Using a sample of 301 Pakistani non-financial listed firms for 2005-2014, we employ two-step generalized method of moments (GMM) regression estimation to address the issue of endogeneity. Empirical evidence reveals that managers tend to escalate a firm's bankruptcy risk during high market sentiments. Further analysis indicates that during the period of positive market sentiments, introduction stage firms prefer to assume the highest bankruptcy risk followed by decline and growth firms, while mature firms continue to be risk-averse. This research contributes to the corporate finance literature by suggesting that managerial risk-taking is influenced by market sentiments and corporate managers show a different attitude towards risk at different stages of the corporate life cycle. Therefore, to ensure enterprise sustainability, capital market regulators should have a robust risk management framework in place to discipline the excessive risk-taking by firm managers over different stages of the corporate life cycle. Moreover, investors and creditors shall take into consideration the respective life cycle stage of the firm to minimize the risk exposure of their investment portfolios. Our results are robust to alternate econometric specifications and alternate variable specifications.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f991bf5a49052dbe1c59731bd7d59c60",
  "timestamp": "2025-05-15T02:50:53.955940"
}