{
  "id": 4623,
  "title": "Impact of financial burden, resulting from prescription co-payments, on antihypertensive medication adherence in an older publically insured population",
  "abstract": "IntroductionMedication co-payments represent a financial barrier to antihypertensive medication adherence. The introduction of co-payments for Irish publically insured patients was associated with a 5% reduction in adherence. However there is socioeconomic variability within this population, and the impact may be greater for those on lower income. We evaluated medication-related financial burden of the co-payment in a cohort of Irish publically insured antihypertensive users and tested its association with adherence at 12months.MethodsThis was a prospective cohort study of community dwelling older (>65yrs) adults (n=1152) from 106 Irish community pharmacies. Participants completed a structured telephone interview at baseline, and a follow-up interview at 12-months, which we linked to pharmacy records. We assessed medication-related financial burden at baseline using a single questionnaire item, and adherence at 12months via questionnaire and refill-adherence as Proportion of Days Covered (PDC).ResultsA third of participants (30.1%) reported financial burden due to medication costs. In adjusted linear regression models financially burdened participants had significantly lower self-reported adherence (=-0.29, 95% CI -0.48 to -0.11), although this was not evident with PDC (=-2.76, 95% CI -5.65 to 0.14).ConclusionThis co-payment represents a financial barrier to antihypertensive adherence for many older Irish publically insured patients. The negative impact to adherence will potentially increase the risk of adverse outcomes, such as stroke, and increase long-term healthcare costs.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f99227a50120b82ae082094676df5e76",
  "timestamp": "2025-05-15T02:39:26.937673"
}