{
  "id": 5424,
  "title": "Effects of a free health insurance programme for the poor on health service utilisation and financial protection in Senegal",
  "abstract": "IntroductionImplemented in 2013 in Senegal, the Programme National de Bourses de Securite Familiale (PNBSF) is a national cash transfer programme for poor households. Besides reducing household poverty and encouraging children's school attendance, an objective of the PNBSF is to expand health coverage by guaranteeing free enrolment in community-based health insurance (CBHI) schemes. In this paper, we provide the first assessment of the PNBSF free health insurance programme on health service utilisation and health-related financial protection.MethodsWe collected household-level and individual-level cross-sectional data on health insurance in 2019-2020 within the Niakhar Population Observatory in rural Senegal. We conducted a series of descriptive analyses to fully describe the application of the PNBSF programme in terms of health coverage. We then used multivariate logistic and Poisson regression models within an inverse probability weighting framework to estimate the effect of being registered in a CBHI through the PNBSF-as compared with having no health insurance or having voluntarily enrolled in a CBHI scheme-on a series of outcomes.ResultsWith the exception of health facility deliveries, which were favoured by free health insurance, the PNBSF did not reduce the unmet need for healthcare or the health-related financial risk. It did not increase individuals' health service utilisation in case of health problems, did not increase the number of antenatal care visits and did not protect households against the risk of forgoing medical care and of catastrophic health expenditure.ConclusionWe found limited effects of the PNBSF free health insurance on health service utilisation and health-related financial protection, although these failures were not necessarily due to the provision of free health insurance per se. Our results point to both implementation failures and limited programme outcomes. Greater commitment from the state is needed, particularly through strategies to reduce barriers to accessing covered healthcare.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f995c361ff82cc5f44c6d374ee116775",
  "timestamp": "2025-05-15T02:47:42.898983"
}