{
  "id": 6710,
  "title": "Cropping systems are homogenized by off-farm income - Empirical evidence from small-scale farming systems in dry forests of southern Ecuador",
  "abstract": "Diversified agricultural landscapes have been shown to provide a wide range of ecosystem services. It is often stated that the main motivation behind growing multiple crops within a farm is to buffer farm income against market and climate risks. However, household characteristics, particularly the amount of off-farm income may also influence farm diversity. While the drivers of diversifying farm income have been investigated extensively, the ecologically important level of land-use diversity on a farm has seldom been used as a dependent variable. Based on data from 163 households, this paper analyzes the impact of social, economic and demographic household characteristics on crop diversification for farms located around the Laipuna Reserve in the dry forests of southern Ecuador. Using a Heckman two-step regression model, we identified factors that influence a) the probability that a farm will be diversified (PD) and b) the degree of diversification at the farm level (LUD), quantified by the Shannon index. We found that PD is positively related to the percentage of household members who depend on family income but do not work (economic dependence ratio), as well as river access and available family labor force. PD is inversely related to access to financial support (i.e. social payments and credits) and off-farm income. LUD is positively related to the number of household members and the age of the head of the household, and correlates negatively with labor force, financial support and off-farm income. Our results demonstrate that land-use diversification is not only a strategy to reduce risk, but it is also driven by farmers' efforts to meet household, mainly subsistence, needs. Moreover, we also demonstrate that when households have access to financial support and off-farm income, the pressure to diversify their crops diminishes. Finally, we argue that forest and agricultural policies should impose instruments to support land-use diversification financially, while acknowledging the importance of financial support and off-farm income for household economies. Strategies to reduce poverty should be accompanied by direct support of land-use diversification, infrastructure development and agricultural training.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f99b1d7b7e3ac55540aa32b9bc34b968",
  "timestamp": "2025-05-15T03:00:35.570166"
}