{
  "id": 8501,
  "title": "Out-of-pocket medical expenses for inpatient care among beneficiaries of the National Health Insurance Program in the Philippines",
  "abstract": "Objective The National Health Insurance Program (NHIP) in the Philippines is a social health insurance system partially subsidized by tax-based financing which offers benefits on a fee-for-service basis up to a fixed ceiling. This paper quantifies the extent to which beneficiaries of the NHIP incur out-of-pocket expenses for inpatient care, and examines the characteristics of beneficiaries making these payments and the hospitals in which these payments are typically made. Methods Probit and ordinary least squares regression analyses were carried out on 94 531 insurance claims from Benguet province and Baguio city during the period 2007 to 2009. Results Eighty-six per cent of claims involved an out-of-pocket payment. The median figure for out-of-pocket payments was Philippine Pesos (PHP) 3016 (US$ 67), with this figure varying widely [inter-quartile range (IQR): PHP 9393 (US$ 209)]. Thirteen per cent of claims involved very large out-of-pocket payments exceeding PHP 19 213 (US$ 428)-the equivalent of 10% of the average annual household income in the region. Membership type, disease severity, age and residential location of the patient, length of hospitalization, and ownership and level of the hospital were all significantly associated with making out-of-pocket payments and/or the size of these payments. Conclusion Although the current NHIP reduces the size of out-of-pocket payments, NHIP beneficiaries are not completely free from the risk of large out-of-pocket payments (as the size of these payments varies widely and can be extremely large), despite NHIP's attempts to mitigate this by setting different benefit ceilings based on the level of the hospital and the severity of the disease. To reduce these large out-of-pocket payments and to increase financial risk protection further, it is essential to ensure more investment for health from social health insurance and/or tax-based government funding as well as shifting the provider payment mechanism from a fee-for-service to a case-based payment method (which up until now has only been partially implemented).",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f9a75175a93fd0cc742ffa18dbd0410e",
  "timestamp": "2025-05-15T03:19:21.363472"
}