{
  "id": 3973,
  "title": "Herding in the Australian stock market during the era of COVID-19: the roles of liquidity, government interventions and mood contagion",
  "abstract": "PurposeThis study explores the economic impact of the COVID-19 crisis on herding behaviour in the Australian equity market by considering liquidity, government interventions and sentiment contagion.Design/methodology/approachThis study utilizes a daily dataset of the top 500 stocks in the Australian market from January 2009 to December 2021. Both predictive regression and portfolio approaches are employed to consider the impact of COVID-19 on herding intention.FindingsThis study confirms that herding propensity is more pronounced at the beginning of the crisis and becomes less significant towards later phases when reverse herding is more visible. Investors herd more toward sectors with less available information on financial support from the government during the financial meltdown. Conditioning the stock liquidity, herding is only detectable during highly liquid periods and high-liquid stocks, which is more observable during the initial phases of the crisis. Further, the mood contagion from the United States (US) market to Australian market and asymmetric herding intention are evident during the pandemic.Originality/valueThis is the first study to shed further light on the impact of a health crisis on the trading behaviour of Australian investors, which is driven by liquidity, public information and sentiment. Notwithstanding the theoretical contributions to the prior literature, several practical implications are proposed for businesses, policymakers and investors during uncertainty periods.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f9ce1b68fddd1804b0fc7c4ddc44d8da",
  "timestamp": "2025-05-15T01:22:39.412448"
}