{
  "id": 247,
  "title": "A NOVEL NONLINEAR NEURAL NETWORK BASED ON COEFFICIENT OF VARIATION FOR SOLVING CARDINALITY CONSTRAINT PORTFOLIO OPTIMIZATION PROBLEM",
  "abstract": "Today, determining stocks in the portfolio is the major problems in the finance world. In 1952, Harry Markowitz had proposed standard portfolio optimization which is cornerstone of portfolio optimization. Mainly, in the Portfolio optimization problem main goal is minimizing the risk, while maximizing the expected return of portfolio. Since portfolio optimization problem is an NP-hard problem, hard computing techniques does not meet today's conditions. Due to time constraints and the necessity of economic situations, many heuristic methods were used to solve portfolio optimization method such as particle swarm optimization, ant colony optimization etc. In this study, Markowitz's mean-variance portfolio optimization with cardinality constraint is tried to solve which is not only quadratic optimization problem but also it is a binary integer programming problem. In order to solve mixed-integer quadratic optimization problem, we suggested nonlinear neural network based on coefficient of variation for solving cardinality constraint portfolio optimization (CCPO) problem. While analyzing the proposed algorithm efficiency, ISE-30 data (Istanbul Stock Exchange 30) was used between 10.06.2015-14.05.2017. Finally, the obtained results from the proposed algorithm are compared with the results obtained from the classic portfolio selection models in the literature.",
  "year": 2019,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f9d5c49f2c9e00ad2d34843a32b2f486",
  "timestamp": "2025-05-15T00:41:04.730472"
}