{
  "id": 5624,
  "title": "Multicenter investigation of bowel evacuation function after transanal total mesorectal excision for mid-low rectal cancer",
  "abstract": "Purpose To determine the effect of transanal total mesorectal excision (taTME) procedure on the postoperative bowel evacuation function of patients with low rectal cancer. Methods Bowel evacuation function was investigated in 316 patients with rectal cancer after taTME in 18 hospitals in China. Low anterior resection syndrome (LARS) score, Wexner score, and EORTC QLQ-C30 were used for functional evaluation. The association between perioperative risk factors and LARS score was determined by univariate and multivariate analyses. Results The prevalence rate of no LARS, minor LARS, and major LARS in patients after taTME was 39.9%, 28.2%, and 31.9%, respectively. The two most frequently reported symptoms of LARS after taTME were bowel clustering (72.8%) and fecal urgency (63.3%). Patients with major LARS had significantly higher Wexner score and worse global health status and financial difficulties according to the EORTC QLQ-C30 questionnaire than those without major LARS. Preoperative chemoradiotherapy was an independent risk factor of major LARS occurrence after taTME (OR: 3.503, P = 0.044); existing preoperative constipation (OR: 0.082, P = 0.040) and manual anastomosis (OR: 4.536, P = 0.021) were favorable factors affecting bowel evacuatory function within 12 months after taTME, but for patients whose follow-up time was longer than 12 months, postoperative chemoradiotherapy (OR: 8.790, P = 0.001) and defunctioning stoma (OR: 3.962, P = 0.010) were independent risk factors. Conclusions The bowel evacuation function after taTME is acceptable. Perioperative chemoradiotherapy, anastomotic method, and preoperative constipation are factors associated with bowel dysfunction after taTME.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f9dc315ad7c2169e172f5312ee4aed7c",
  "timestamp": "2025-05-15T02:49:50.225272"
}