{
  "id": 6934,
  "title": "One Virus, Four Continents, Eight Countries: An Interdisciplinary and International Study on the Psychosocial Impacts of the COVID-19 Pandemic among Adults",
  "abstract": "The novel coronavirus disease 2019 (COVID-19) pandemic brought about several features that increased the sense of fear and confusion, such as quarantine and financial losses among other stressors, which may have led to adverse psychosocial outcomes. The influence of such stressors took place within a broader sociocultural context that needs to be considered. The objective was to examine how the psychological response to the pandemic varied across countries and identify which risk/protective factors contributed to this response. An online survey was conducted from 29 May 2020-12 June 2020, among a multinational sample of 8806 adults from eight countries/regions (Canada, United States, England, Switzerland, Belgium, Hong Kong, Philippines, New Zealand). Probable generalized anxiety disorder (GAD) and major depression episode (MDE) were assessed. The independent role of a wide range of potential factors was examined using multilevel logistic regression. Probable GAD and MDE were indicated by 21.0% and 25.5% of the respondents, respectively, with an important variation according to countries/regions (GAD: 12.2-31.0%; MDE: 16.7-32.9%). When considered together, 30.2% of the participants indicated probable GAD or MDE. Several factors were positively associated with a probable GAD or MDE, including (in descending order of importance) weak sense of coherence (SOC), lower age, false beliefs, isolation, threat perceived for oneself/family, mistrust in authorities, stigma, threat perceived for country/world, financial losses, being a female, and having a high level of information about COVID-19. Having a weak SOC yielded the highest adjusted odds ratio for probable GAD or MDE (3.21; 95% confidence interval (CI): 2.73-3.77). This pandemic is having an impact on psychological health. In some places and under certain circumstances, however, people seem to be better protected psychologically. This is a unique opportunity to evaluate the psychosocial impacts across various sociocultural backgrounds, providing important lessons that could inform all phases of disaster risk management.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fa0092f068ce2ebce4d0dd6aed6fe67c",
  "timestamp": "2025-05-15T03:03:13.464028"
}