{
  "id": 8340,
  "title": "Long-Term Trajectories of Cognitive Disability Among Older Adults Following a Major Disaster",
  "abstract": "Importance Older adults are at high risk for cognitive impairments following natural disasters, but the persistence of such effects is not well understood. Objective To track older adults' postdisaster cognitive disability trajectories over a decade and examine associations of cognitive disability with disaster damage exposure. Design, Setting, and Participants This prospective cohort study used predisaster baseline surveys conducted in August 2010 and 4 follow-ups approximately every 3 years until November 10, 2022. Invitations were mailed at baseline to all citizens 65 years or older in Iwanuma City, Japan, a coastal municipality significantly impacted by the 2011 Great East Japan Earthquake and Tsunami. A total of 1988 respondents who were cognitively independent (ie, without cognitive disability) before the disaster completed the 4 postdisaster cognitive assessments. Exposures Experiences of residential damage, worsening financial conditions, loss of loved ones, and disruption in health care services. A composite score quantified these experiences, with higher scores indicating greater overall damage. Main Outcomes and Measures Cognitive disability level was assessed using a standardized in-home evaluation under a national long-term care insurance scheme. Trained investigators evaluated participants' activities of daily living, cognitive function, and presence of mental and/or behavioral disorders. Latent class growth analyses (LCGA) identified distinct cognitive disability trajectories. Primary outcomes consisted of inclusion in these trajectories. Results The analytic sample consisted of 1988 participants who were cognitively independent at baseline, with a mean (SD) age of 72.4 (5.4) years, of whom 1159 (58.3%) were female. LCGA identified 3 cognitive disability trajectories: high and gradual deterioration (277 [13.9%]; high levels of cognitive disability with increasing impairment over time), low and progressive deterioration (541 [27.2%]; low levels of cognitive disability with accelerated decline in cognitive function over time), and low and stable (1170 [58.9%]; low levels of cognitive disability that remained stable). In multinomial regression analyses with the low and stable trajectory serving as the reference, housing damage (adjusted odds ratio [AOR], 2.52; 95% CI, 1.26-5.04), worsening financial conditions (AOR, 1.83; 95% CI, 1.15-2.90), and disruption in health care services (AOR, 1.76; 95% CI, 1.03-2.99) were associated with high and gradual deterioration. Worsening financial conditions (AOR, 1.38; 95% CI, 1.01-1.90) and higher composite damage scores (AOR, 1.16; 95% CI, 1.01-1.34) were associated with low and progressive deterioration. These associations no longer remained after adjusting for postdisaster depressive symptoms. Conclusions and Relevance In this cohort study of older adults who survived the 2011 Great East Japan Earthquake and Tsunami, disaster-related exposures were associated with worse long-term cognitive disability trajectories. These findings could inform tailored interventions to preserve cognitive function in older disaster survivors.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fa21bae70042124cb7c380f6381bb501",
  "timestamp": "2025-05-15T03:17:49.151386"
}