{
  "id": 9050,
  "title": "Catastrophic household costs due to injury in Vietnam",
  "abstract": "Objective: Little is known about the costs of injury and their impact on injured persons and their families in Vietnam. This study aimed to examine the cost of injury in hospitalised patients and to identify the most costly injuries and those more likely to result in catastrophic household expenditure. Method: A prospective cohort study was conducted, recruiting individuals admitted to Thai Binh General Hospital due to injury in Vietnam from January to August 2010. During the hospitalisation period, data on expenditure including direct medical, direct non-medical and indirect costs were collected. Demographic and injury characteristics were also obtained. The associations between the risk of catastrophic expenditure and injury cause, severity and principal injured region were examined by modified Poisson regression approach. Payment of more than 40% of the household non-subsistence spending was considered a catastrophic expenditure. Results: Of 918 patients approached, 892 (97%) were recruited. Total costs for all participants during the hospitalisation period were US$ 325,812. Patients admitted for road injury accounted for the largest number of injuries (n = 477, 53%), and the largest percentage of the total costs (US$ 175,044, 57%). This was followed by individuals hospitalised due to falls, representing 29% of the sample (n = 261) and 31% of the total costs (US$ 103,128). In terms of cost per hospital stay, burn injuries were the most costly (US$ 427), followed by falls (US$ 395) and road crashes (US$ 367). Of all sample, 26% experienced catastrophic expenditure due to their injuries. Factors significantly associated with increased risk of catastrophic expenditure were having more severe or higher MAIS injuries (RR = 2.02, 95% CI: 1.14-3.57), principal injured region to lower extremities (RR = 3.34, 95% CI: 1.41-7.91) or head (RR = 3.21, 95% CI: 1.37-7.52), longer hospital stay (RR = 1.09, 95% CI: 1.07-1.10), older age, lower income and not having insurance (RR = 1.63, 95% CI: 1.21-2.21). Conclusion: A high proportion of households experienced catastrophic expenditure following injury, highlighting the important need for programmes to prevent injuries, road traffic and fall-related injuries in particular. Furthermore, expansion of health insurance coverage may help individuals cope with the financial consequences of injury. (C) 2012 Elsevier Ltd. All rights reserved.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fa2eea0fc4e0f852871667c7ac53e583",
  "timestamp": "2025-05-15T03:24:54.958579"
}