{
  "id": 2541,
  "title": "A Self-adaptive Indicator Selection Approach for Solving Credit Risk Assessment",
  "abstract": "Credit risk assessment, which aims at identifying high-risk users, plays a critical role in financial institutions. A common method is to use the greedy strategy to generate an interpretable rule set to classify all the users into high-risk or non-risk users. During each iteration, the greedy strategy utilizes a pre-defined indicator function to evaluate which rule is the best and then adds it to the rule set. However, in reality, the indicator function is designed manually and requires much domain knowledge and expert experience. Worse still, we need to design a suitable indicator for every situation, which is tedious and time-consuming work. This motivates us to propose a self-adaptive indicator that can be adapted to different situations without too much human intervention. In this paper, we see the indicator as a weighted sum of several sub-indicators. By tuning the weights, the indicator can be adapted to different situations automatically. That is, we transform this indicator selection problem into a weights tuning problem. To find the best weight of self-adaptive indicators, machine learning methods and black-box optimization are utilized. The experimental results demonstrated that our self-adaptive indicator can select a better rule set to identify more high-risk users compared to the human-defined indicator.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fa337af03673193122154122ea222958",
  "timestamp": "2025-05-15T02:16:32.682553"
}