{
  "id": 5014,
  "title": "Risk of Adverse Financial Events in Patients With Cancer: Evidence From a Novel Linkage Between Cancer Registry and Credit Records",
  "abstract": "PURPOSE Although financial toxicity is a growing cancer survivorship issue, no studies have used credit data to estimate the relative risk of financial hardship in patients with cancer versus individuals without cancer. We conducted a population-based retrospective matched cohort study using credit reports to investigate the impact of a cancer diagnosis on the risk of adverse financial events (AFEs). METHODS Western Washington SEER cancer registry (cases) and voter registry (controls) records from 2013 to 2018 were linked to quarterly credit records from TransUnion. Controls were age-, sex-, and zip code-matched to cancer cases and assigned an index date corresponding to the case's diagnosis date. Cases and controls experiencing past-due credit card payments and any of the following AFEs at 24 months from diagnosis or index were compared, using two-sample z tests: third-party collections, charge-offs, tax liens, delinquent mortgage payments, foreclosures, and repossessions. Multivariate logistic regression models were used to evaluate the association of cancer diagnosis with AFEs and past-due credit payments. RESULTS A total of 190,722 individuals (63,574 cases and 127,148 controls, mean age 66 years) were included. AFEs (4.3% v 2.4%, P < .0001) and past-due credit payments (2.6% v 1.9%, P < .0001) were more common in cases than in controls. After adjusting for age, sex, average baseline credit line, area deprivation index, and index/diagnosis year, patients with cancer had a higher risk of AFEs (odds ratio 1.71; 95% CI, 1.61 to 1.81; P < .0001) and past-due credit payments (odds ratio 1.28; 95% CI, 1.19 to 1.37; P < .0001) than controls. CONCLUSION Patients with cancer were at significantly increased risk of experiencing AFEs and past-due credit card payments relative to controls. Studies are needed to investigate the impact of these events on treatment decisions, quality of life, and clinical outcomes.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fa45751408cf03e25f928c87f27ca81b",
  "timestamp": "2025-05-15T02:43:40.085721"
}