{
  "id": 2814,
  "title": "Forecasting nonlinear dependency between cryptocurrencies and foreign exchange markets using dynamic copula: evidence from GAS models",
  "abstract": "PurposeThis paper examines and forecasts correlations between cryptocurrencies and major fiat currencies using Generalized Autoregressive Score (GAS) time-varying copulas. The authors examine to which extent the multivariate GAS method captures the volatility persistence and the nonlinear interaction effects between cryptocurrencies and major fiat currencies.Design/methodology/approachThe authors model tail dependence between conventional currencies and Bitcoin utilizing a Glosten-Jagannathan-Runkle Generalized Autoregressive Conditional Heteroscedastic model (GJR-GARCH)-GAS copula specification, which allows detecting the leptokurtic feature and clustering effects of currency returns distribution.FindingsThe authors' results show evidence of multiple tail dependence regimes, implying the unsuitability of applying static models to entirely describe the extreme dependence between Bitcoin and fiat currencies. Compared to the most common constant copulas, the authors find that the multivariate GAS copulas better forecast the volatility and dependency between cryptocurrencies and foreign exchange markets. Furthermore, based on the value-at-risk (VaR) and expected shortfall (ES) analyses, the authors show that the multivariate GAS models produce accurate risk measures by adding cryptocurrencies to a portfolio of fiat currencies.Originality/valueThis paper has two main contributions to the existing literature on cryptocurrencies. First, the authors empirically examine the tail dependence structure between common conventional currencies and bitcoin using GJR-GARCH GAS copulas which consider the leptokurtic feature and clustering effects of currency returns distribution. Second, by modeling VaR and ES, the authors test the implication of using time-varying models on the performance of currency portfolios, including cryptocurrencies.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fa4eb8984fba86ef9410a25bd274f634",
  "timestamp": "2025-05-15T01:10:49.499467"
}