{
  "id": 7946,
  "title": "The Effect of Ownership Structure on Earnings Smoothing: A Study on Borsa İstanbul",
  "abstract": "Earnings smoothing practices aim to create a low risk and high yield business perception by providing a stable profit distribution over the years and to decrease the profit in the periods when the profit is high and to increase it in the periods when it is low. The aim of this study is to examine the relationship between ownership structure and earnings smoothing practices. In the study, 199 firms which operate between 2012 and 2020 on Borsa & Idot;stanbul were analyzed by binary logistic regression method with financial data. Earnings smoothing practices is dependent variable and it was measured with the Eckel (1981) coefficient of variation model in the study. Ownership structure indicators which are institutional ownership rate, managerial ownership rate and foreign ownership rate was used as independent variables. In addition, profitability, leverage, size, dividend payout and cash flow rate were used as control variables. As a result of the analysis, while the relationship of between earnings smoothing and foreign ownership rate has a negative and statistically significant effect, institutional ownership rate and managerial ownership rate have not a statistically significant effect on earnings smoothing. Also, according to this study, profitability, leverage and size which were used control variables increase the probability of applying earnings smoothing on the other hand cash flow rate decreases the probability of applying earnings smoothing.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fa70001643290b09e5c40c6153f7d7af",
  "timestamp": "2025-05-15T03:13:30.701660"
}