{
  "id": 6800,
  "title": "Accrual management as an indication of money laundering through legally registered Mafia firms in Italy",
  "abstract": "Purpose The purpose of this paper is to investigate how accounting is used to disguise and carry out money laundering activities in specific socio-economic and political contexts and whether discretionary accruals can provide evidence of such illicit practices performed through legally registered Mafia firms (LMFs). Design/methodology/approach The study is based on a sample of 224 Italian firms identified as LMFs, due to having been confiscated by judicial authorities because of their owners being accused of Mafia-type association. Using a multivariate regression model, specifically developed discretionary accrual proxies for LMFs are compared with those of a population of lawful firms (LWFs). Findings The results reveal that in the pre-confiscation years, LMFs manage aggregate, revenue and expense accruals more than LWFs do, in order to smooth earnings and disguise/carry out money laundering. In contrast, in the post-confiscation years, there is no significant difference in the level of accrual management between LMFs and LWFs, as a consequence of the effective intervention of legal administrators. Originality/value This study adopts discretionary revenue and expense accrual proxies that provide additional insight into the simultaneous manipulation of revenues and expenses, linked to money laundering, which may not be fully detected by traditional aggregate accrual models. Furthermore, it suggests that the incentive for LMFs to manage accruals may be fostered by the irrelevance of their financial statements to trades with stakeholders. Finally, this paper may provide regulators with financial accounting signals which could be included in risk assessment models aiming to detect money laundering activities within firms.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fa7cc38a1893022157a692c605050120",
  "timestamp": "2025-05-15T03:01:31.471726"
}