{
  "id": 5241,
  "title": "Risk governance: exploring the role of organisational culture",
  "abstract": "Purpose This study aims to investigate the association between organisational culture (OC) and the extent to which risk governance (RG) practices are implemented in Qatar. Design/methodology/approach It relies on the institutional theory and OC perspectives to generate testable hypotheses and explain the empirical findings, using data from 85 Qatari firms collected based on questionnaires. It also applies ordinary least squares regression to examine the associations between five OCs (innovation, outcome orientation, attention to detail, team orientation and tight versus loose control) and the level of implementing RG practices, whilst controlling for the presence of internal audit (IA), firm size, listing status, type (private/government) and sector (financial/non-financial). Findings An OC of tight control, the presence of an IA and being a private firm are significantly associated with implementing RG practices. An OC of teamwork is negatively associated with RG practices. Practical implications Policymakers and corporate managers are encouraged to set guidelines governing the formation of cohesive cooperative teams within organisations. They must develop strategies that promote the risk culture as a major component of OC. Policymakers should also monitor the culture and institutional forces behind the successful implementation of RG that involves the collaboration of employees at different organisational levels. Originality/value To the best of the authors' knowledge, this study is novel because it empirically examines the OC-RG relationship in an emerging market economy (Qatar).",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fa7fde0f162483428f4b5c562f78ed85",
  "timestamp": "2025-05-15T02:45:47.420563"
}