{
  "id": 7912,
  "title": "Sovereign Credit Ratings Analysis Using the Logistic Regression Model",
  "abstract": "This study is an empirical analysis of sovereign credit ratings (SCR) in South Africa (SA) using Logistic Regression (LR) to identify their determinants and forecast SCRs. Data of macroeconomic indicators including SCRs from 1999 to 2020 in quarterly format were classified and analyzed to identify indicators utilized by Credit Rating Agencies (CRAs) and then predict future ratings CRAs take various information from political, infrastructure, financial, economic, regional, local, and other factors pertaining to a country and assess the ability of that country to pay its debt. This information is then presented through a grading scale termed rating, with the highest rating country being highly creditworthy and lowest rating likely to default. There are three major CRAs, namely, Fitch, Moodys and Standard and Poors. The study identified the use of different macroeconomic indicators by CRAs as well as different techniques in assessing and assigning sovereign credit ratings. The study points out that Household Debt to Disposable Income Ratio (HDDIR) was the most influential variable on SCRs. HDDIR, exchange rates and the inflation rate were the most crucial variables for guessing credit ratings. Policymakers should aim to reduce household debt in relation to disposable income, implement policies that strengthen the local currency and stabilize as well as lower inflation. Investors should watch out on nations that have high household debt levels as this may spill over into credit risk.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fa854733f58c4cd4258c6d881f4754f3",
  "timestamp": "2025-05-15T03:13:05.028033"
}