{
  "id": 3312,
  "title": "Impacts of credit constraints on adoption of risk management strategies and income of maize farmers in Northern Nigeria",
  "abstract": "PurposeA correlation has been shown in the literature between credit constraints and the adoption of agricultural technologies, technical efficiencies and measures for adapting to climate change. The relationship between credit constraints, risk management strategy adoption and income, however, is not well understood. Consequently, the purpose of this study was to investigate how credit constraints affect the income and risk management practices adopted by Northern Nigerian maize farmers.Design/methodology/approachCross-sectional data were collected from 300 maize farmers in Northern Nigeria using a multi-stage sampling technique. Descriptive statistics, seemingly unrelated regression and double hurdle regression models were the analysis methods.FindingsThe results showed that friends and relatives, banks, Adashe, cooperatives and farmer groups were the main sources of credit in the study area. The findings also revealed that the sources of risk in the study area included production risk, economic risk, financial risk, institutional risk, technological risk and human risk. In addition, the risk management strategies used to mitigate observed risks were fertilizer application, insecticides, planting of disease-resistant varieties, use of herbicides, practising mixed cropping, modern planning, use of management tools as well as making bunds and channels. Furthermore, we found that interest rate, farm size, level of education, gender and marital status were significant determinants of statuses of credit constraints while the age of the farmer, gender, household size, primary occupation, access to extension services and income from maize production affected the choice and intensity of adoption of risk management strategies among the farmers.Research limitations/implicationsThe study concluded that credit constrained status condition of farmers negatively affected the adoption of some risk management strategies and maize farmers' income.Practical implicationsThe study concluded that credit constrained status condition of farmers negatively affected the adoption of some risk management strategies and maize farmers' income. It therefore recommends that financial service providers should be engaged to design financial products that are tailored to the needs of smallholder farmers in the study area.Originality/valueThis paper incorporates the role of constraints in influencing farmers' decisions to uptake credits and subsequently their adoption behaviours on risk management strategies. The researcher approached the topic with a state-of-the-art method which allows for obtaining more reliable results and hence more specific contributions to research and practice.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fa8620fbba654920a669f59cd145cfc3",
  "timestamp": "2025-05-15T02:24:39.786458"
}