{
  "id": 7283,
  "title": "Adverse Childhood Experiences Among 28,047 Norwegian Adults From a General Population",
  "abstract": "Aim: The purpose of this study was to estimate the prevalence of adverse childhood experiences (ACEs) among Norwegian adults from a general population and to identify potential associations with demographic and socioeconomic characteristics. Methods: A randomly drawn sample (N = 61,611) from the public registry of inhabitants was invited to participate in the Norwegian Counties Public Health Survey. The present study was based on online responses from 28,047 adults >= 18 years (mean age: 46.9 years, SD = 16.03). Log-link binomial regression analyses were performed to examine associations between four measures of ACEs (family conflict, lack of adult support, bad memories, and difficult childhood) and demographic (age, gender, civil status, parental divorce) and socioeconomic characteristics (education level, perceived financial situation, and welfare benefits). Results: Single individuals and those with parents that divorced during childhood were at elevated risk of all four ACEs. The risk varied to some degree between the sexes. The prevalence of ACEs declined with increasing age. We found a consistent social gradient that corresponded to the frequency of ACEs for all three socioeconomic characteristics investigated. The risks were highest for those in the lowest socioeconomic levels (RR: 1.53, 95% CI: 1.32-1.78 to RR: 4.95, CI: 4.27-5.74). Conclusions: Public health strategies should direct more attention to the interplay between ACEs and socioeconomic factors. Welfare services should be sensitive to ACEs among their service recipients.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fa8ca2276fd11949e9787c122f59be77",
  "timestamp": "2025-05-15T03:07:02.609683"
}