{
  "id": 5844,
  "title": "Capital flows to transition economies: Implications for investment",
  "abstract": "At the beginning of the 1990's, transition countries started with trade liberalization, which, coupled with capital and financial integration paved the way for foreign capital inflows and outflows. The magnitude and sequence of this capital account liberalization was not the same throughout the transition countries. Two thirds of total capital inflows to transition countries (excluding the ex Soviet countries) concentrated in only three of them, the Czech Republic, Poland and Hungary. Capital inflows can have positive impacts on the developing (transition) countries. Most importantly, capital inflows can directly enhance economic growth by increasing level and efficiency of investments and through the development of the domestic financial sector. Access to foreign capital can also smooth consumption, improve risk management between domestic and foreign investors and deepen integration with international financial markets. This paper focuses on some of these positive effects. We analyze the implications of capital inflows into transition countries on domestic investment. For that purpose, we conducted regression analysis on panel data on a sample of 11 transition countries (Bulgaria, Croatia, the Czech Republic, Estonia, Hungary, Latvia, Lithuania, Poland, Romania, the Slovak Republic and Slovenia). We used the instrumental variables method, due to the endogenous nature of capital inflows. Our findings indicate a positive relation between capital inflows and the level of domestic investment. Other foreign investments (mainly foreign loans) have the highest impact on domestic investment. Foreign direct investments (FDI) have a positive and significant influence on domestic investment, while foreign portfolio investments have no significant impact on domestic investment activity.",
  "year": 2005,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fa920b3e1715deba92c9bf5fca1054c3",
  "timestamp": "2025-05-15T02:51:58.619423"
}