{
  "id": 7687,
  "title": "Estimation of flood losses to agricultural crops using remote sensing",
  "abstract": "The estimation of flood damage is an important component of risk-oriented flood design, risk mapping, financial appraisals and comparative risk analyses. However, research on flood loss modelling, especially in the agricultural sector, has not yet gained much attention. Agricultural losses strongly depend on the crops affected, which need to be predicted accurately. Therefore, three different methods to predict flood-affected crops using remote sensing and ancillary data were developed, applied and validated. These methods are: (a) a hierarchical classification based on standard curves of spectral response using satellite images, (b) disaggregation of crop statistics using a Monte Carlo simulation and probabilities of crops to be cultivated on specific soils and (c) analysis of crop rotation with data mining Net Bayesian Classifiers (NBC) using soil data and crop data derived from a multi-year satellite image analysis. A flood loss estimation model for crops was applied and validated in flood detention areas (polders) at the Havel River (Untere Havelniederung) in Germany. The polders were used for temporary storage of flood water during the extreme flood event in August 2002. The flood loss to crops during the extreme flood event in August 2002 was estimated based on the results of the three crop prediction methods. The loss estimates were then compared with official loss data for validation purposes. The analysis of crop rotation with NBC obtained the best result, with 66% of crops correctly classified. The accuracy of the other methods reached 34% with identification using Normalized Difference Vegetation Index (NDVI) standard curves and 19% using disaggregation of crop statistics. The results were confirmed by evaluating the loss estimation procedure, in which the damage model using affected crops estimated by NBC showed the smallest overall deviation (1%) when compared to the official losses. Remote sensing offers various possibilities for the improvement of agricultural flood loss estimation. However, crop prediction and loss modelling are still quite uncertain and further research is needed. (C) 2011 Elsevier Ltd. All rights reserved.",
  "year": 2011,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fa95c47109acb297da9a422dd172dafb",
  "timestamp": "2025-05-15T03:11:04.559194"
}