{
  "id": 4959,
  "title": "Empirical research on the relation between listed companies' corporate governance of real estate and its performance",
  "abstract": "The paper made an empirical research on the relation between listed companies' corporate governance of real estate and its performance with 40 samples in China stock market. The descriptive results of corporate governance index of real estate listed companies show that governance index mean of real estate is lower than the other 12 industries; this means that the governance situation of real estate is significantly different the other industries. The six sub-indexes of real estate is lower than the other industries, especially the director board governance index and supervisor board governance index of real estate are very lower. Among earning per share, Tobin Q and Z value three financial indexes, Z value of glassing corporate finance risk of real estate is significantly lower than the other industries; this tell us that the finance risk of real estate is comparatively higher. The results of spearman correlation analysis between governance index and financial indexes reveal that governance index is strongly and positively correlative to Tobin Q and earning per share. The multivariate linear regression analysis shows that there is endogenous relation between corporate governance of real estate and earning per share and Z value. However, the relation does not exit between governance index and Tobin Q value.",
  "year": 2006,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "faace7aeab2db0fb85d2dad15c289406",
  "timestamp": "2025-05-15T02:42:36.318188"
}