{
  "id": 2663,
  "title": "A hybrid data-driven model for project portfolio selection problem based on sustainability and strategic dimensions: a case study of the telecommunication industry",
  "abstract": "Project portfolio selection is a multi-criteria decision-making process that is always accompanied by important decisions with uncertainty. Considering the existence of different data in the field of various projects, the use of data-driven approaches to evaluate and select projects in previous studies has been neglected. To cover this gap, the purpose of this study is to provide a hybrid data-driven framework for selecting investment projects in the telecommunication industry. To do this, first by reviewing the theoretical literature and surveys of experts, project evaluation criteria through sustainability paradigm as well as strategic issues are identified, and then with the best-worst fuzzy approach (FBWM), the weight of each criterion is determined. According to the FBWM findings, the most important criteria identified include initial capital requirements, initial revenue, number of specialists employed, energy consumption reduction, and market share increase. After identifying the important criteria, using data envelopment analysis (DEA), the performance of each project was determined separately for each year. Then, based on project labels specified by DEA, the efficiency of projects is measured and evaluated with a forward-looking view through machine learning algorithms such as random forest and support vector regressors. Results show that both models can predict the project performance appropriately, while the random forest regressor has the highest evaluation metrics in both train and test sets. So, the managers could use these results for more efficient project selection.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fab7cbc1a39e636ecb055bafdafaf0b5",
  "timestamp": "2025-05-15T01:09:14.926918"
}