{
  "id": 6138,
  "title": "A critical review of acid rock drainage prediction methods and practices",
  "abstract": "Failure to accurately predict acid rock drainage CARD) leads to long-term impacts on ecosystems and human health, in addition to substantial financial consequences and reputational damage to operators. Currently, a range of chemical static and kinetic tests are used to evaluate the acid producing nature of materials, from which risk assessments are prepared and waste classification schemes designed. However, these well-established tests and practices have inherent limitations, for example: (i) best-practice sampling is not pursued; (ii) risk assessments rely on limited static and kinetic test data, thus compromising the accuracy of resulting ARD block models; (iii) static tests are completed off-site and do not reflect actual field measurements; (iv) kinetic test data do not become available until later stages of mine development; (v) waste classification schemes generally categorise materials as only three types (i.e., PAF, NAF and UC) with other drainage forms (e.g., neutral metalliferous or saline) not considered; and (vi) conventional testing fails to consider that reactivity of waste is controlled by parameters other than chemistry (e.g., microbiology, type and occurrence of minerals, texture and hardness). Thus, accurate prediction is challenging because of the multifaceted processes leading to ARD. Hence, risk assessments need to consider mineralogical, textural and geometallurgical rock properties in addition to predictive geochemical test data. Instead, a new architecture of integrative, staged ARD testing should be pursued. Better ARD prediction must start with improving the definition of geoenvironmental models and waste units. Then, a range of low-cost and rapid tests for the screening of samples should be conducted on site prior to the performance of established tests and advanced analyses using state-of-the-art laboratories. Such an approach to ARD prediction would support more accurate and cost-effective waste management during operation, and ultimately less costly mine closure outcomes. Crown Copyright (C) 2015 Published by Elsevier Ltd. All rights reserved.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fac545311f790d85d7a48be2cdd82696",
  "timestamp": "2025-05-15T02:55:12.901140"
}