{
  "id": 793,
  "title": "Using feature construction to improve the performance of neural networks",
  "abstract": "Recent years have seen the growth in popularity of neural networks for business decision support because of their capabilities' for modeling, estimating, and classifying. Compared to other AI methods for problem solving such as expert systems, neural network approaches are especially useful far their ability to learn adaptively from observations. However, neural network learning performed by algorithms such as back-propagation (BP) are known to be slow due to the size of the search space involved and also the iterative manner in which the algorithm works. In this paper, we show that the degree of difficulty in neural network learning is inherent in the given set of training examples. We propose a technique for measuring such learning difficulty, and then develop a feature construction methodology that helps transform the training data so that both. the learning speed and classification accuracy of neural network algorithms are improved, We show the efficacy of the proposed method for financial risk classification, a domain characterized by frequent data noise, lack of functional structure, and high attribute interactions. Moreover, the empirical studies also provide insights into the structural characteristics of neural networks with respect to the input data used as well as possible mechanisms to improve the learning performance.",
  "year": 1998,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fad224cf45dbc0df9b7e734d3f1e60ab",
  "timestamp": "2025-05-15T01:55:08.063488"
}