{
  "id": 3704,
  "title": "The deliberate search for stratigraphic and subtle combination traps: where are we now?",
  "abstract": "Stratigraphic and subtle combination traps have a well-documented track record as significant producing hydrocarbon resources. The majority of these success cases come from onshore USA where unprecedented drilling densities combined with a long history of hydrocarbon exploration provide a large portfolio of stratigraphic and subtle combination traps. By comparing USA-based examples with other global cases it is evident that numerous basins still have the potential for exploration success associated with these traps. This paper attempts to raise the awareness of the exploration potential of stratigraphic and subtle combination traps through four approaches. Firstly, a summary of key global statistics related to stratigraphic and subtle combination traps is provided with the intention of demonstrating that they have historically represented a key hydrocarbon resource. Secondly, a classification scheme is introduced and acts as a reference for the observations and case studies presented. The third component of this paper is to present a range of case studies, which serve to demonstrate the exploration history behind successful discoveries associated with stratigraphic and subtle combination traps. The final component is to consider the general exploration history and from this long experience highlight the key techniques necessary for the development of a successful exploration strategy.",
  "year": 2006,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fae08195d9dd7a15a230089414026c00",
  "timestamp": "2025-05-15T01:20:03.405796"
}