{
  "id": 4654,
  "title": "Midlife vulnerability and food insecurity: Findings from low-income adults in the US National Health Interview Survey",
  "abstract": "Background Food insecurity, limited access to adequate food, in adulthood is associated with poor health outcomes that suggest a pattern of accelerated aging. However, little is known about factors that impact food insecurity in midlife which in turn could help to identify potential pathways of accelerated aging. Methods Low-income adults (n = 17,866; 2014 National Health Interview Survey), ages 18 to 84, completed a 10-item food security module and answered questions regarding health challenges (chronic conditions and functional limitations) and financial worry. We used multinomial logistic regression for complex samples to assess the association of health challenges and financial worry with food insecurity status and determine whether these associations differed by age group, while adjusting for poverty, sex, race/ethnicity, education, family structure, social security, and food assistance. Results Food insecurity rates were highest in late- (37.5%) and early- (36.0%) midlife, relative to younger (33.7%) and older (20.2%) age groups and, furthermore, age moderated the relationship between food insecurity and both risk factors (interaction p-values < .05, for both). The effects of poor health were stronger in midlife relative to younger and older ages. Unlike younger and older adults, however, adults in midlife showed high levels of food insecurity regardless of financial worry. Conclusions Findings suggest that food insecurity in midlife may be more severe than previously thought. Greater efforts are needed to identify those at greatest risk and intervene early to slow premature aging.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fae33168259d4bed09c535d57e8d6df8",
  "timestamp": "2025-05-15T02:39:27.027852"
}