{
  "id": 4653,
  "title": "Bridging the adoption gap for cryptocurrencies: understanding the affordances that impact approach-avoidance behavior for potential users and continuation usage for actual users",
  "abstract": "PurposeWith the rise of cryptocurrency and its influence on the financial industry, this paper aims to explore cryptocurrency affordances that lead to approach-avoidance behavioral intentions for non-users (potential) and the intention to continue use for users (actual), drawing upon affordance theory and chasm theory.Design/methodology/approachThe authors collected data from 480 potential and actual users in Germany and used maximum likelihood structural equation modeling (ML-SEM) to analyze it. In particular, the data consisted of 301 cryptocurrency users in Germany\\ the authors used ML-SEM to test the post-adoption model. Additionally, logistic regression was utilized to determine the dominant actual usage method (store of value or medium of exchange) for various cryptocurrency coins.FindingsAccording to the study's results, the perceived value benefits have a positive impact on the behavioral intention of potential users to adopt cryptocurrency, and they influence the intention of actual users to continue using it. However, both perceived volatility and financial risk tolerance are the most crucial factors hindering cryptocurrency adoption, whether in the pre-adoption or the post-adoption stage.Originality/valueThis is the first study to reveal cryptocurrency affordances and examine their effect on behavioral intentions toward cryptocurrency adoption based on the differences between non-users (potential) and users (actual). Furthermore, the authors explore how cryptocurrency holders perceive and invest in different coins (e.g. NFTs), which sheds light on factors such as financial risk tolerance that affect their decision making.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fae6fcae120a85ee8b7f0c2507cd7487",
  "timestamp": "2025-05-15T02:39:27.022351"
}