{
  "id": 5185,
  "title": "Financial hardship among siblings of long-term survivors of childhood cancer: A Childhood Cancer Survivor Study report",
  "abstract": "BackgroundSiblings of children with cancer may experience adverse household economic consequences, but their financial outcomes in adulthood are unknown.MethodsA total of 880 siblings (aged 18-64 years) of adult-aged childhood cancer survivors were surveyed to estimate the prevalence of financial hardship by three established domains (behavioral, material, and psychological). For individual financial hardship items matching the contemporaneous National Health Interview Survey or Behavioral Risk Factor Surveillance System, siblings were compared with the general population by calculating adjusted prevalence odds ratios (ORs) to sample-weighted responses. Multivariable logistic regression models examined associations between sibling characteristics and each hardship domain and between sibling hardship and survivors' cancer/treatment characteristics.ResultsBehavioral, material, and psychological hardship was reported by 24%, 35%, and 28%, respectively. Compared with national survey respondents, siblings were more likely to report worries about medical bills (OR, 1.14; 95% confidence interval [CI], 1.06-1.22), difficulty affording nutritious foods (OR, 1.79; 95% CI, 1.54-2.07), and forgoing needed medical care (OR, 1.38; 95% CI, 1.10-1.73), prescription medications (OR, 2.52; 95% CI, 1.99-3.20), and dental care (OR, 1.34; 95% CI, 1.15-1.57) because of cost. Sibling characteristics associated with reporting financial hardship in one or more domains included female sex, older age, chronic health conditions, lower income, not having health insurance, high out-of-pocket medical expenditures, and nonmedical/nonhome debt. No survivor cancer/treatment characteristics were associated with sibling financial hardship.ConclusionsAdult siblings of childhood cancer survivors were more likely to experience financial hardship compared with the general population. Childhood cancer may adversely affect entire households, with potentially lasting implications. Adult siblings of long-term childhood cancer survivors may experience greater aspects of financial hardship compared with the general population. A childhood cancer diagnosis and treatment may adversely affect entire households, with potentially lasting implications.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fae70807d1161d1a806b5da6055c210d",
  "timestamp": "2025-05-15T02:45:17.073397"
}