{
  "id": 7565,
  "title": "Serious Mortgage Arrears among Immigrant Descendant and Native Participants in a Low-Income Public Starter Mortgage Program: Evidence from Norway",
  "abstract": "Although low-income homeownership programs serving vulnerable families at the lower end of the income distribution have been the focus of housing policy in many countries over the past 50 years, little is known about the post-origination experiences of immigrant families participating in these programs. Notably absent from the extant literature are studies examining the sustainability of homeownership among immigrant homebuyers and their susceptibility to falling behind on payments and experiencing mortgage defaults, evictions, or short sales. Utilizing data from 8263 families participating in Norway's Starter Mortgage Program (Startlan) during the first three calendar years after mortgage origination, we examine the extent to which serious mortgage arrears varies by immigrant background. Two primary questions shape our research: (1) What is the incidence of serious mortgage arrears among Western, Eastern European, and non-Western immigrant homeowners relative to ethnic Norwegians participating in a public low-income homeownership program? and (2) What pre- and post-origination characteristics of applicants and households, mortgage terms at the time of origination, and experiences of household financial vulnerability or economic shocks predict heterogeneity in serious mortgage arrears by immigrant backgrounds? We found that 6.1% of ethnic Norwegian, 6.2% of Western, 4.9% of non-Western, and 3.2% of Eastern European immigrant homeowners participating in the Starter Mortgage Program were in serious mortgage arrears at least once during the first three calendar years after mortgage origination. Results from our negative binomial regression analyses suggest that program participants who were sole owners, with larger families, and higher debt were more likely to experience serious mortgage arrears; these effects were accentuated for ethnic Norwegians. Additionally, mortgage terms at the time of origination produced differential effects by immigrant background. Compared to Western and Eastern European immigrant homeowners, ethnic Norwegians were more likely to have experienced serious mortgage arrears if they purchased a single-family home, had larger LTV and DTI ratios, or if the Startlan share of their mortgages was higher. Non-Western immigrant mortgagors were more likely to make late mortgage payments if they had larger LTV ratios, interest-only mortgage servicing, or if they were more reliant on Startlan funds to finance their mortgages; however, this risk was reduced if they had fixed-rate mortgages. Financial vulnerability in terms of higher debt or fewer assets also increased the risk of serious mortgage arrears for ethnic Norwegians and non-Western immigrant homeowners, while increases in real wealth reduced that risk for all immigrant mortgagor groups.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "faedd3ab5e9d0c84a1700d45d3779918",
  "timestamp": "2025-05-15T03:10:05.513462"
}