{
  "id": 4996,
  "title": "Conceptual and Analytical Framework as Flood Risk Mapping Subsidy",
  "abstract": "There are still gaps in defining values and category classifications of exposed items in quantitative damage analysis. This paper proposes a framework that refines the development of flood risk analysis at a local scale. This study first performs a quantitative risk analysis, based mainly on secondary data; it then attempts to communicate the results graphically, aiming to reduce the financial and human resources required. We propose an easily standardized database in a GIS environment, analyzing the influence of a reservoir for flood control and the construction of replicable local-scale risk curves. Hydrological (HEC-HMS) and 2D hydrodynamic (HEC-RAS) models were used to simulate hydrographs considering different return periods. For damage estimation, the processing included vectorization of lots, building use definition with Google Street View, classification of standard designs, and a field survey to validate those classes. In monetary value, this study calculated the effect of the construction of a reservoir for damage reduction, showing the potential to determine the effectiveness of measures adopted to mitigate flood impacts. In addition, for each simulated return period, exposure, hazard, and damage maps can be established, making it possible to perform a complete risk analysis.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fb1b8f81b932460ba9cd9766fddd97a5",
  "timestamp": "2025-05-15T02:43:06.810254"
}