{
  "id": 2949,
  "title": "GEOTECHNICAL RISK CLASSIFICATION FOR UNDERGROUND MINES",
  "abstract": "Underground mining activities are prone to major hazards largely owing to geotechnical reasons. Mining combined with the confined working space and uncertain geotechnical data leads to hazards having the potential of catastrophic consequences. These incidents have the potential of causing multiple fatalities and large financial damages. Use of formal risk assessment in the past has demonstrated an important role in the prediction and prevention of accidents in risk prone industries such as petroleum, nuclear and aviation. This paper proposes a classification system for underground mining operations based on their geotechnical risk levels. The classification is done based on the type of mining method employed and the rock mass in which it is carried out. Mining methods have been classified in groups which offer similar geotechnical risk. The rock mass classification has been proposed based on bulk rock mass properties which are collected as part of the routine mine planning. This classification has been subdivided for various stages of mine planning to suit the extent of available data. Alpha-numeric coding has been proposed to identify a mining operation based on the competency of rock and risk of geotechnical failures. This alpha numeric coding has been further extended to identify mining activity under 'Geotechnical Hazard Potential (GHP)'. GHP has been proposed to be used as a preliminary tool of risk assessment and risk ranking for a mining activity. The aim of such classification is to be used as a guideline for the justification of a formal geotechnical risk assessment.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fb35c573ccf7a15b5ce05d9dd4fbe656",
  "timestamp": "2025-05-15T02:20:48.259958"
}