{
  "id": 4259,
  "title": "The impact of African swine fever virus on smallholder village pig production: An outbreak investigation in Lao PDR",
  "abstract": "African swine fever virus (ASFV) causes a deadly disease of pigs which spread through southeast Asia in 2019. We investigated one of the first outbreaks of ASFV in Lao People's Democratic Republic amongst smallholder villages of Thapangtong District, Savannakhet Province. In this study, two ASFV affected villages were compared to two unaffected villages. Evidence of ASFV-like clinical signs appeared in pig herds as early as May 2019, with median epidemic days on 1 and 18 June in the two villages, respectively. Using participatory epidemiology mapping techniques, we found statistically significant spatial clustering in both outbreaks (p < 0.001). Villagers reported known risk factors for ASFV transmission - such as free-ranging management systems and wild boar access - in all four villages. The villagers reported increased pig trader activity from Vietnam before the outbreaks; however, the survey did not determine a single outbreak source. The outbreak caused substantial household financial losses with an average of nine pigs lost to the disease, and Monte Carlo analysis estimated this to be USD 215 per household. ASFV poses a significant threat to food and financial security in smallholder communities such as Thapangtong, where 40.6% of the district's population are affected by poverty. This study shows ASFV management in the region will require increased local government resources, knowledge of informal trader activity and wild boar monitoring alongside education and support to address intra-village risk factors such as free-ranging, incorrect waste disposal and swill feeding.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fb42f6cb7fe38d1009d85c68b5acfde4",
  "timestamp": "2025-05-15T02:34:48.966622"
}