{
  "id": 1070,
  "title": "A Multimodal Deep Neural Network-based Financial Fraud Detection Model Via Collaborative Awareness of Semantic Analysis and Behavioral Modeling",
  "abstract": "The monitoring and early warning of financial risks have become a crucial link in maintaining market stability and safeguarding the rights and interests of investors. Traditional financial risk monitoring methods often rely on a single data source or analysis model, making it challenging to comprehensively and accurately capture risk signals. Therefore, this paper proposes a novel financial risk monitoring model based on multimodal neural networks, which innovatively integrates multiple data sources, such as vision, language and audio, and utilizes their inherent correlations to enhance the accuracy of risk identification. First, by employing the Bidirectional Long Short-Term Memory Network (BiLSTM) structure and incorporating the self-attention mechanism, the semantic information of financial texts is deeply analyzed through the calculation of dynamic weight coefficients. Additionally, Option-based Hierarchical Reinforcement Learning (OHRL) is utilized to accurately model the behavior of market participants, capturing nuanced changes in their decision-making process. By integrating these two types of information, a comprehensive BiLSTM-OHRL model is formulated to evaluate the risk status of financial markets in a more comprehensive and accurate manner. The results demonstrate that the model performs impressively in financial risk monitoring, accurately capturing the emotional and behavioral characteristics of market participants, thereby enhancing the comprehensiveness and predictive capability of the monitoring model. It provides robust technical support for the stable operation of the financial market.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fb4a5012e9d97dac2c54e71472b419b1",
  "timestamp": "2025-05-15T01:58:43.349847"
}