{
  "id": 4425,
  "title": "Role of corporate innovation and uncertainty in determining corporate investment of the firm: does financial constraint, executive risk preference and firm risk-taking ability play any role",
  "abstract": "PurposeThis paper aims to investigate the relationship between corporate innovation and the firm's corporate investment. Further, the authors begin with the assertion that the relationship between corporate innovation and corporate investment is impacted by significantly a) uncertain periods, b) financial constraint, c) executives' risk preference and d) firm risk-taking ability.Design/methodology/approachThis study has considered non-financial listed companies (774 firms) for the period spanning from 2010-2022. The authors use a fixed effect regression model within a panel data framework to examine the relationship between corporate innovation and investment. For robustness, the authors use system generalised methods of moments to investigate the relationship between corporate investment and corporate innovation across all the samples.FindingsThis study finds a positive relationship between corporate innovation and corporate investment, which means when the firm tries to make some innovation, it will increase its expenditure on fixed assets. However, the positive relationship between corporate innovation and corporate investment reduces with uncertainty. Additionally, financial constraint plays a significant role in determining this relationship. Executives and firms with high risk-taking ability tend to be more inclined to make investments.Originality/valueThe study is unique because it determines the impact of corporate innovation on corporate investment. The current literature is focused on corporate innovation and uncertainties. However, no light has been shed on the relationship between corporate innovation and investment. At the same time, the authors have introduced three more variables which play a significant role in determining the corporate innovation-investment relationship.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fb5aefde9feb504183458ea7e50c1553",
  "timestamp": "2025-05-15T02:37:16.782765"
}