{
  "id": 2738,
  "title": "Estimating the slip resistant quality of winter footwear using Artificial Intelligence",
  "abstract": "Slips and falls on ice are among the common causes of emergency department visits and hospitalizations during the winter season. These injuries are costly and can place a financial burden on healthcare systems and municipalities. Using slip resistant winter footwear is a key factor in reducing the risk of slips and eventually falls. In this study, we developed an Artificial Intelligence model that classifies high and low slip resistant footwear based on images of their outsoles. Our model was trained on a unique dataset which consisted of images of 266 winter footwear outsoles. This dataset included footwear outsoles made from rubber (n = 89), Arctic Grip (n = 101), and Green Diamond material (n = 76). The slip resistance of all footwear samples was tested and rated with a human-centered protocol called the Maximum Achievable Angle test. We applied a transfer learning technique to develop a 2D convolutional neural network to classify the outsoles as having high and low slip resistance. The best classification model used the Xception pre-trained model and obtained an accuracy and F1-score of 0.85 and 0.89, respectively. The AUC-ROC (Area Under the Curve for Receiver Operating Characteristic) was also 0.91. Our results suggest that the proposed model properly identified high and low slip resistant winter footwear outsoles. Our findings also confirmed that the footwear's outsole tread pattern and material directly impact the footwear's slip resistance quality. The proposed model will help footwear manufacturers to improve their workflow and increase product quality which can ultimately decrease the events of slips and falls.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fb70bc85e5d35079920e019ee005a291",
  "timestamp": "2025-05-15T02:18:37.166249"
}