{
  "id": 7359,
  "title": "Prevalence and Characteristics of Bed-Sharing Among Black and White Infants in Georgia",
  "abstract": "Objectives To examine: (1) the prevalence and characteristics of bed-sharing among non-Hispanic Black and White infants in Georgia, and (2) differences in bed-sharing and sleep position behaviors prior to and after the American Academy of Pediatrics' 2005 recommendations against bed-sharing. Methods Georgia Pregnancy Risk Assessment Monitoring System (PRAMS) data were obtained from the Georgia Department of Public Health. Analysis was guided by the socioecological model levels of: Infant, Maternal, Family, and Community/Society within the context of race. Data from 2004 to 2011 were analyzed to address the first objective and from 2000 to 2004 and 2006 to 2011 to address the second objective. Rao-Scott Chi square tests and backward selection unconditional logistic regression models for weighted data were built separately by race; odds ratios (OR) and 95 % Confidence Intervals (CIs) were calculated. Results A total of 6595 (3528 Black and 3067 White) cases were analyzed between 2004 and 2011. Significantly more Black mothers (81.9 %) reported ever bed-sharing compared to White mothers (56 %), p < 0.001. Logistic regression results indicated that the most parsimonious model included variables from all socioecological levels. For Blacks, the final model included infant age, pregnancy intention, number of dependents, and use of Women, Infant and Children (WIC) Services. For Whites, the final model included infant age, maternal age, financial stress, partner-related stress, and WIC. When comparing the period 2000-2004 to 2006-2011, a total of 10,015 (5373 Black and 4642 White cases) were analyzed. A significant decrease in bedsharing was found for both Blacks and Whites; rates of non-supine sleep position decreased significantly for Blacks but not Whites. Conclusions for Practice Continued high rates of bed-sharing and non-supine sleep position for both Blacks and Whites demonstrate an ongoing need for safe infant sleep messaging. Risk profiles for Black and White mothers differed, suggesting the importance of tailored messaging. Specific research and practice implications are identified and described.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fb711b4a4c0b5ad957c7ccd48b76fc70",
  "timestamp": "2025-05-15T03:07:32.011006"
}