{
  "id": 5078,
  "title": "A novel multifactor clustering integration paradigm based on two-stage feature engineering and improved bidirectional deep neural networks for exchange rate forecasting",
  "abstract": "Accurate exchange rate forecasting is of great importance for foreign exchange investment, hedging foreign exchange risk and international economic transactions. However, it is extremely challenging to make accurate forecasts for exchange rates because of their high volatility, nonlinearity, and non-stationarity. Based on this, this paper proposes a multifactor clustering integration paradigm for exchange rate prediction. From the classical theory of exchange rate determination, a comprehensive library of factors affecting the exchange rate is constructed. A two-stage feature engineering is constructed to capture the stable structure of features. In order to enable features to be learned adequately and to improve algorithmic efficiency and predictive performance, a novel clustering integration paradigm is constructed to improve the stability of the model. The framework builds different predictive sub-models for different data, and then embeds Bayesian optimization algorithms into the bidirectional deep neural networks. Finally, the output results of different sub-models are integrated using nonlinear integration techniques. In addition, the superiority of the proposed model is verified using eight comparative models. The results of the empirical analysis show that the average percentage error of our proposed model is the lowest among all the comparative models (0.412648 %, 0.515348 %, and 0.329892 % on the three datasets, respectively). Compared to the standard LSTM, the average percentage error is at least 88 % lower, proving the effectiveness of the proposed model. It can help investors to make better decisions in the international financial markets.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fbb0c9b11ecf587221f12decc4f2ecae",
  "timestamp": "2025-05-15T02:44:10.995272"
}