{
  "id": 5404,
  "title": "Comparative Assessment of Insurance and Banking Regulation: Solvency II Versus Basel III",
  "abstract": "The paper provides a cross-sectorial quantitative assessment of the insurance and banking regulatory frameworks: Solvency II and Basel III based on the seven criteria: characteristics of the banking and insurance industries, importance of systemic risk, types of risks taken into account, formula complexity of capital requirements calculation, time perspective and solvency assessment typology, quality and quantity of the regulatory capital and level approach of capital requirements. The results of the quantitative assessment reveal several similarities between the two frameworks such as: the three pillars structure, the complex methodology applied to determine the capital requirements, the various alternatives for capital requirements calculation as standard approach or own internal model and capital classification into tiers. The evaluation shown significant differences: business models in banking and insurance industries differ substantially, systemic risk is more pronounced in banking sector, banks and insurers are exposed to different categories of risks and Basel III is heavily focused on liquidity risk. Even if the two frameworks used a complex methodology to calculate the capital requirements, the Solvency II formula can be considered more complex due to the holistic approach and the diversification effects reflected at all three levels. Considerable differences between the two regulatory regimes appear in terms of own internal models. Solvency II internal models are purely principle-based models without any restrictions, compared to the Basel III internal models which have heavy restrictions. Also, the items eligibility of the different capital tiers and the proportion of the capital tiers have indicated lower capital quality standards for insurance companies compared to banks, both in the advantage for insurance companies. These differences can be mainly attributed to the different particularities of the two industries and to the different supervisory purposes: Basel III is focused on the financial sector stability, while Solvency II is focused first on the policyholders' protection and then on the financial sector stability.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fbbdbadcbbb988fa05ef2396a689ef1f",
  "timestamp": "2025-05-15T02:47:14.086384"
}