{
  "id": 1378,
  "title": "RETRACTED: Risk factor analysis combined with deep learning in the risk assessment of overseas investment of enterprises (Retracted article. See vol. 20, 2025)",
  "abstract": "To evaluate the overseas investment risks of enterprises and expand the application and development of deep learning methods in risk assessment, 15 national clusters are utilized as samples to analyze and discuss the overseas investment risk indicators of enterprises. First, based on the indicator system of overseas investment risks, five major types of investment risks are identified. Second, the Deep Neural Network (DNN) is introduced; a risk evaluation model is constructed for enterprise overseas investment. Finally, the investment attractiveness index in the Fraser risk assessment learning label is adopted as the evaluation results of the model. According to the classification of risks, the model is trained and its performance is tested. The results show that the major source of overseas investment risks includes basic resources, political systems, economic and financial development, and environmental protection. The corresponding risk score is high. North American country clusters and Oceanian country clusters have lower investment risks, while the investment risks in Africa, Latin America, and Asia are affected by multiple factors of the specific cities. This is closely related to the resources and legal systems possessed by the country clusters. This is of great significance for enterprises to conduct risk assessment in overseas investment.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fbe15bf44841eca637541d3b15b472c2",
  "timestamp": "2025-05-15T02:02:22.712701"
}