{
  "id": 3673,
  "title": "Credit Rating Prediction Through Supply Chains: A Machine Learning Approach",
  "abstract": "As supply chain channels physical, financial, and information flows as well as associated risks, a firm's supply chain information should be helpful in understanding and predicting its credit risks. Credit ratings, as an approximate but important measure of corporate credit risks, have been widely used by investors, creditors, and supply chain partners in their decision-making. This study studies the role of supply chain information in predicting companies' credit ratings. Using firm-level supplier-customer linkages and corporate credit rating data, we develop a machine learning framework with gradient boosted decision trees to examine whether and what supply chain features can significantly improve the prediction accuracy of credit ratings, and what types of supply chain links have higher information content that positively affects the predictability of the supply chain features. We construct a firm's supply chain variables from its supplier and customer portfolios. We show that incorporating supply chain features can improve prediction accuracy over the benchmark credit rating model using only the focal firm's features. Moreover, the informativeness of supply chain links in focal credit risk prediction depends on the focal firm's industry sector, the relationship strength of such links, and the switching costs. Finally, we develop a focal credit rating prediction model with a high accuracy level using supply chain factors solely, which can potentially be applied to predict credit risks of small- and medium-sized enterprises (SMEs) and private firms with no public financial information, as long as their supply chain information is available.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fbf66fa89c473f908b373c86c93832a4",
  "timestamp": "2025-05-15T02:29:00.047900"
}