{
  "id": 7044,
  "title": "Rent Seeking, Earning Management and Agency Cost: How Do They Impact Equity Value? Indian Evidence",
  "abstract": "The article examines the earning management and its nature of the non-rent seeking (NRS) and rent seeking prone (RSP) firms of India followed by their respective valuation implication in the light of agency cost. The various earning management components are estimated from the residuals of a series of regression models, and then compared based on categorization of NRS and rent seeking nature of firms. The robustness of the estimates is validated using various financial characteristics and a separate cross-sectional estimation model. Finally, the article uses ordinary least square (OLS) and 2 stage least square (2 SLS) regression models to find the impact of different earning management components on valuation of NRS and rent seeking firms in the backdrop of their differential agency cost. The results of the study suggest that the cash flow management by the NRS firms with lesser agency cost, is beneficial for equity valuation as the same might convey private information as to future operating cash flow, but accrual management by them impacts valuation negatively-due to information risk. For RSP firms with higher agency cost-cash flow management and cost of production management being opportunistic, inversely impact the equity value. The study provides insight as to how valuation gets impacted by different forms of earning management in presence of differential agency cost of non-rent and rent seekers in an economy where 'cronyism' plays a dominant role.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fc28a8a039df4d2c2860c52f916b5fdf",
  "timestamp": "2025-05-15T03:04:23.029873"
}