{
  "id": 6196,
  "title": "Exploring farmers' coping strategies and adaptive measures against the extended drought in Balochistan, Province of Pakistan",
  "abstract": "Small-scale farmers are at risk and have been negatively affected by the extended drought since the late 1990s in Balochistan, Pakistan. Using questionnaire surveys, key informant interviews and focus group discussions conducted in 2018, this study explores the coping and adaptation strategies used by farmers in the region over the last few decades to mitigate the adverse impacts of extended drought. The study employs binary logistic regression models on survey data of 265 selected farm households regarding their coping strategies. Multiple factors determined farmers' adaptation strategies, which include reducing the number of domestic animals, selling household assets, borrowing money from relatives, off-farm labor work and seasonal migration. We found that most of the farmers were reluctant to plant new crop varieties and were not ready to take any undue risks. However, farmers did adjust their inputs (i.e., fertilizers, manure and pesticides) in anticipation of drought years, and opted for mixed-cropping and off-farm livelihood activities to minimize the impact of production losses. Barriers impeding small-scale farmers from taking other appropriate adaptation measures (e.g., expanding irrigation capacity) were financial constraints, lack of water resources, non-availability of efficient technologies, insufficient provision of electricity, limited empirical knowledge, poor extension services and the heavy financial constraints faced by the farmers during the extended drought period.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fc2a4d3ee2c095f4826b75566ac9e1bf",
  "timestamp": "2025-05-15T02:55:44.594159"
}