{
  "id": 6253,
  "title": "Impact of higher capital buffers on banks' lending and risk-taking in the short- and medium-term: Evidence from the euro area experiments",
  "abstract": "We study the impact of higher capital buffers on bank lending and risk -taking behaviour, at different time horizons following the initial policy decision. Employing a regression discontinuity design and confidential centralised supervisory data for euro area banks from 2014 to 2017, our research uniquely explores the effects of the EU policy on other systemically important institutions (O-SIIs) through a quasi -randomised experiment, exploiting the induced policy change and discontinuity of the O-SII identification process. Our findings show that the introduction of the O-SII buffers resulted in a short-term reduction in credit supply to households and financial sector, followed by a medium -term shift towards less risky borrowers, particularly in the household sector. We find a temporary cut in loan growth post -capital hikes, succeeded by a rebound in the medium -term. Our results substantiate the hypothesis that higher capital buffers can positively discipline banks by reducing risk -taking in the medium -term. At the same time, evidence suggests a limited adverse impact on the real economy, characterised by a temporary reduction in credit supply restricted to instances of macroprudential policy tightening.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fc6cbb0ce65d4b7adf500954ffa4979c",
  "timestamp": "2025-05-15T02:56:11.054973"
}