{
  "id": 3880,
  "title": "Decision support system to evaluate a vandalized and deteriorated oil pipeline transportation system using artificial intelligence techniques. Part 1: modeling",
  "abstract": "The oil and gas industry worldwide is experiencing problems of vandalism and mechanical deterioration due to corrosion in its various pipeline transport systems, a drop in the price of hydrocarbons due to the COVID-19, limitation of maintenance processes. This article provides a contribution original to the knowledge and management of a pipeline transportation system (PTS), without an immediate high impact that would help reduce property loss due to corrosion, through the development of intelligent evaluation models that combine field data, laboratory, and cognitive knowledge in a case study in Mexico. The research is divided into Part 1: modeling, a Fuzzy expert system (FES) unified the knowledge of corrosion specialists and mechanical integrity studies (MIS) and identified evolutionary corrosion patterns with reliability of 0.9029. An artificial neural network (ANN) supported by statistics and metallography establishes test reliability of 0.9556 and determines the corrosion inhibition capacity (C) of Mexican hydrocarbon mixtures based on their properties compared to carbon steel. Part 2: analysis of the operational and economic risk of the PTS under corrosive effects, using Monte Carlo simulation (MCS) estimates various financial scenarios considering corrosive profiles of soils, supply, demand, and inflation.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fc6ff6de4f1b7397030fc73270c0375f",
  "timestamp": "2025-05-15T02:30:58.258559"
}