{
  "id": 6127,
  "title": "Dynamic leverage policy in Islamic and conventional banks during crises in the OIC countries: a procyclicality and prospect-theory analysis",
  "abstract": "PurposeThe purpose of this study is to investigate and compare the dynamic leverage policies of Islamic and conventional banks within selected Organization of Islamic Cooperation (OIC) countries. The study specifically focuses on the concepts of leverage procyclicality and prospect theory. Design/methodology/approachTo achieve the research objectives, the study uses data from three distinct periods: Crisis I (2007-2009), Crisis II (2011-2012) and Crisis III (2020). The analysis uses dynamic panel-data regression, using the generalized method of moments (GMM) technique. FindingsThe research findings indicate that both Islamic and conventional banks demonstrate leverage procyclicality. Interestingly, Islamic banks exhibit weaker leverage procyclicality during normal conditions but display stronger procyclicality during crises compared to their conventional counterparts. The application of prospect theory reveals that both bank types exhibit risk-taking or risk-averse behavior through leverage under certain financial and market performance measures as the first-level domain of the gain-vs-loss condition. Furthermore, during crises (as the second-level domain of the normal-vs-crisis condition), both Islamic and conventional banks experience heightened leverage. Notably, Islamic banks, owing to their lower risk exposure and greater shock resilience, demonstrate lesser risk-taking behavior through leverage than conventional banks, both during periods of underperformance and worsening conditions amid crises. These findings validate the extension of prospect theory's applicability in a two-level domain perspective. The dynamic nature of leverage policy, being procyclical and adhering to prospect theory, also varies following different crises specifically. Research limitations/implicationsThe study's limitations include the unequal crisis periods (Crises I, II and III), leading to an imbalanced examination of their effects, certain financial and market performance metrics that fail to corroborate the expected hypotheses and the limited generalizability of findings beyond the selected OIC countries. Practical implicationsUnderstanding the intricate dynamics and behavioral aspects of leverage policy for both Islamic and conventional banks, particularly during crisis scenarios, proves crucial for reviewing banking regulations, making informed financial decisions and managing risks effectively. Originality/valueThis study enriches the current knowledge by presenting two key points. First, it highlights the dynamic nature of leverage procyclicality in Islamic banks, showing a change from weaker procyclicality in normal conditions to stronger procyclicality during crises compared to conventional banks. Second, it expands the application of prospect theory by introducing a dual-level domain context. Examining the comparative leverage policies of Islamic and conventional banks during different crises within OIC countries provides novel insights into leverage procyclicality and behavioral responses.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fc7c987c0ce104bf16d6552caec5bb34",
  "timestamp": "2025-05-15T02:55:12.855935"
}