{
  "id": 6969,
  "title": "Relationships Among Veteran Status, Gender, and Key Health Indicators in a National Young Adult Sample",
  "abstract": "Objective: Although many risk behaviors peak during young adulthood, little is known about health risk factors and access to care. This study assessed health indicators and health care access in a national sample of young adult veterans and civilians. Methods: Data were from the 2010 Behavioral Risk Factor Surveillance System, a national telephone survey. Of 27,471 participants, ages 19-30 years, 2.2% were veterans (74.6% were male) and 97.7% were civilians (37.6% were male). Gender-stratified comparisons assessed health indicators and health care access by veteran status. Multivariate logistic regression was used to examine health indicators and health care access as a function of gender and veteran status. Results: In the overall sample, women were more likely than men to have insurance, to have a regular physician, and to have had a routine checkup and yet were more likely to report financial barriers to care. Women also were more likely than men to report general medical and mental distress and higher lifetime anxiety and depressive disorders, whereas men were more likely to be overweight or obese and to report tobacco use and high-risk drinking. Adjusted analyses revealed a higher likelihood of general medical distress and higher rates of lifetime anxiety disorders among veterans compared with civilians, although there were no differences between veterans and civilians regarding health care utilization and hazardous drinking. Conclusions: Findings extend the literature on health care status and modifiable risk factors for young adults by identifying differences between men and women and between veterans and civilians. Interventions may need to be tailored on the bases of gender and veteran status because of several differences in mental health and general health needs.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fc7ecce72a03fb006a7a5493c4fb6279",
  "timestamp": "2025-05-15T03:03:55.676905"
}