{
  "id": 5833,
  "title": "Key participant characteristics influencing completion of a phase II cardiac rehabilitation program: A cross-sectional analysis",
  "abstract": "Study objective: Cardiac rehabilitation (CR) programs are effective at reducing cardiovascular disease risk factors, yet programs in the United States (US) have poor participation and completion. The current study evaluates characteristics related to completion and drop-out for CR participants.Design: A cross-sectional study design compared participants who completed the program (finishers) and those did not finish (non-finishers). Variables were compared to determine differences between the dichotomous groups included demographic data, initial six-minute walk test, Zung Depression Index, and Quality of Life Measure (QLM). Logistical regression using variables with differences between groups determined impact on program completion.Setting: Phase two outpatient hospital based cardiac rehabilitation program. Participants: Ninety-seven participants were part of the sample; 61 completed the program, and 36 dropped out. Main outcome measure: Completion of CR.Results: Ninety-seven participants are included; 61 (63 %) were finishers and 36 (37 %) were non-finishers. Finishers were older, had a higher proportion of females and Medicare insurance recipients, had lower depression scores, and reported higher quality of life. Results of the final logistic regression revealed finishers were more likely to have Medicare (odds ratio (OR) = 5.215, confidence interval (CI) 1.897-14.338), be female (OR = 4.597, 95 % CI 1.532-13.795) and have higher QLM Family Sub scores (OR = 1.129, 95 % CI 1.023-1.246). The model correctly classified 71.9 % of cases.Conclusion: The analysis highlights Medicare insurance and family support are associated with program completion. Interventions to increase family and social support, and to provide financial assistance for those with financial burden through lack of insurance or high co-pays may increase cardiac rehabilitation completion rates.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fc900c1acbc41a8a64dde0d1587f30d2",
  "timestamp": "2025-05-15T02:51:58.580220"
}