{
  "id": 1375,
  "title": "RETRACTED: Application of Business Intelligence Based on the Deep Neural Network in Credit Scoring (Retracted Article)",
  "abstract": "In order to solve the economic globalization and the intensification of financial market volatility, this study puts forward the judgment of credit risk of loan enterprises, so as to effectively improve the ability of commercial banks to control credit risk. At the same time, neural network technology is applied to solve nonlinear data modeling. Experiments and evaluation are carried out by using the artificial neural network (ANN) evaluation model. The experimental evaluation model data obtained from the experimental evaluation model show that the prediction effect is good, which proves the effectiveness of this method. According to the data of China Banking Regulatory Commission, at the end of the third quarter of 2016, the balance of nonperforming loans of Chinese commercial banks was 1493.9 billion yuan. By the end of the third quarter of 2021, the balance of nonperforming loans of Chinese commercial banks had reached 28153.5 trillion yuan, a month on month increase of about 42.7 billion yuan. At the end of the third quarter of 2021, the domestic and foreign currency assets of Chinese banking financial institutions were 339.4 trillion yuan, a year-on-year increase of 7.7%. This shows that the credit risk remains high, but it is still at a controllable level. Commercial banks are the center of the modern economic system. Their credit risk is very important to the stability and safe development of national economy. It is also the key factor for its own business sustainability and the protection of the interests of depositors. Therefore, effectively preventing and reducing credit risk is a key field in the financial risk management of commercial banks.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fc94e1de07dec2522eae9d8e4003836e",
  "timestamp": "2025-05-15T02:02:22.692694"
}