{
  "id": 1704,
  "title": "The Impact of Environmental Risk on Business Failure: A Fuzzy-Set Qualitative Comparative Analysis Approach with Extreme Gradient Boosting Feature Selection",
  "abstract": "Corporate performance is increasingly impacted by environmental issues, but their specific role in business failure remains underexplored, which leads to a gap in research that is often focused exclusively on financial metrics. By investigating the relationship between environmental financial exposure and business failure, this study addresses this gap, integrating financial ratios and environmental variables to understand how environmental performance affects financial viability. A novel dual-stage methodology was employed, first using Extreme Gradient Boosting (XGBoost) for feature selection to identify the most significant predictors of failure from a dataset of Spanish companies (N = 38,456) using 2022 ORBIS data. Next, a fuzzy-set qualitative comparative analysis (fsQCA) was applied to analyze the sufficient causal configurations leading to a high propensity for business failure. The analysis identified three distinct causal configurations associated with failure. All highlighted poor financial performance indicators, such as low results per employee and low profit per employee. Notably, one configuration identified high environmental risk (measured by TRUCAM) as a core condition contributing significantly to financial distress. These findings highlight the critical link between environmental responsibility and financial health, demonstrating the benefits of combining fsQCA with machine learning to identify intricate causal configurations and providing information to companies and governments who want to support long-term financial stability and corporate sustainability.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fc9556a43d91e180037182f1a8bb9201",
  "timestamp": "2025-05-15T02:06:22.514383"
}