{
  "id": 3814,
  "title": "Epidemiology of Uveitis among the Chinese Population in Taiwan A Population-Based Study",
  "abstract": "Purpose: This study aimed to investigate the incidence and prevalence of uveitis in Taiwan, and then analyzed the risk factors related to uveitis using multivariate regression. Design: Population-based cohort study using medical claims data. Participants: We randomly selected 1 000 000 residents from the Taiwan National Health Insurance Research Database. All participants with correct registry data (96%) were included in the study. The study period was from 2000 to 2008. Methods: All types of uveitis were identified using the International Classification of Diseases, 9th revision, Clinical Modification diagnostic codes. The annual incidence and cumulative prevalence of uveitis were calculated. A univariate and a multivariate Poisson regression were used to determine the risk factors associated with uveitis. Main Outcome Measures: The first diagnosis of uveitis noted during the study period. Results: The annual cumulative incidence rate of uveitis ranged from 102.2 to 122.0 cases per 100 000 persons over the study period, and the average incidence density was 111.3 cases per 100 000 person-years (95% confidence interval, 108.4-114.1). The cumulative prevalence was found to have increased from 318.8 cases per 100 000 persons in 2003 to 622.7 cases per 100 000 persons in 2008. Anterior uveitis was the most common location and accounted for 77.7% of all incident cases, which was followed by panuveitis, posterior uveitis, and intermediate uveitis. Multivariate regression analysis showed that males, the elderly, and individuals who lived in an urban area had higher incidence rates for uveitis. Conclusions: The epidemiology of uveitis in Taiwan differs from most previous studies in other countries. The incidence of uveitis in Taiwan has increased significantly recently. The elderly and individuals living in urban areas are the populations that are most commonly affected by uveitis. These findings are consistent with suggestions found in several recent studies. Financial Disclosure(s): The authors have no proprietary or commercial interest in any of the materials discussed in this article. Ophthalmology 2012; 119: 2371-2376 (C) 2012 by the American Academy of Ophthalmology.",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fc9a1cf8b986aaca9293acb2230ac991",
  "timestamp": "2025-05-15T02:30:28.616914"
}