{
  "id": 600,
  "title": "Using a genetic backpropagation neural network model for credit risk assessment in the micro, small and medium-sized enterprises",
  "abstract": "In China, with the Double Carbon goal within reach, Micro, Small and Medium-sized Enterprises (MSMEs) emerge as pivotal contributors to economic advancement. However, they are now confronted with the imperative of transitioning towards green and low-carbon practices. To facilitate the attainment of peak carbon dioxide emissions and carbon neutrality, a refined approach is imperative. This entails precise capital allocation, enhanced financial services, streamlined management, and robust risk mitigation strategies. Consequently, conducting thorough credit risk assessments for MSMEs becomes a crucial endeavor. However, obtaining substantial loans for them proves challenging due to their elusive credit ratings and potential defaults. To address this issue, this study leverages machine learning and intelligent optimization algorithms to construct a classification model for default and credit ratings of MSMEs, utilizing their daily invoice data. Specifically, twelve indicators pertaining to default and credit ratings are extracted. Subsequently, Principal Component Analysis is employed to reduce dimensionality and synthesize all pertinent information. Following this, the Genetic Algorithm-based Back Propagation Neural Network (GA-BPNN) is utilized to delineate the relationship between indicators and default, as well as credit rating, respectively. The results indicate a prediction accuracy of 0.92 for default risk and 0.86 for credit rating. This underscores the efficacy of GA-BPNN in effectively classifying the underlying default risk and credit ratings of MSMEs, offering a promising approach for decision-making.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fca969221c9be3eea01524bdba804961",
  "timestamp": "2025-05-15T01:52:49.533099"
}