{
  "id": 9093,
  "title": "Sex Trafficking in New York City and Vulnerabilities to Re-Trafficking",
  "abstract": "Human trafficking occurs in a cycle of coercion and exploitation of vulnerable people; yet, little is known about those who are trafficked more than one time (re-trafficked). Our study sought to describe the trafficking experiences and explore vulnerabilities to re-trafficking in an urban, majority immigrant, population. This study is part of a parent cohort study that enrolls patients at the EMPOWER Center in New York City, which provides trauma-informed obstetric and gynecologic services to victims of sexual- and gender-based violence. Retrospective chart review was conducted on patients with a history of sex trafficking who were evaluated at the EMPOWER Center from February 2013 to January 2021. A total of 87 patients were enrolled in this study, 23 (26.4%) of whom had been re-trafficked. All were women. Most (88.5%) were victims of international trafficking, most often from Mexico or the Caribbean/Central America. Nine (10.3%) reported contraceptive use and six (6.9%) experienced forced substance use while trafficked. The most reported barriers that women faced in escaping trafficking were threat of violence (28.7%) and financial dependence (19.5%). Re-trafficked patients were more likely to have a history of being undocumented (odds ratio [OR] = 5.29; 95% confidence intervals [CI] [1.34, 20.94]) and experienced childhood sexual abuse (OR = 2.99; 95% CI [1.10, 8.16]), experienced childhood physical abuse (OR = 3.33; 95% CI [1.18, 9.39]), and lived with a non-parent family member (OR = 6.56; 95% CI [1.71, 25.23]). Although these vulnerabilities were no longer significant when analyzed in a parsimonious multivariate logistic regression model adjusting for the other significant variables, likely due to the limited sample size. Almost half (46.0%) reported ongoing emotional effects from being trafficked, which did not vary by re-trafficking status. Our study highlights potential pre-trafficking vulnerabilities, illustrates the complexity of the trafficking experience, and presents potential risk factors for being re-trafficked.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fcacd9ed1ed8aeeaf8b6d9c088a0d464",
  "timestamp": "2025-05-15T03:25:27.755054"
}