{
  "id": 3821,
  "title": "Social Determinants of Mental, Physical, and Oral Health of Middle-Aged and Older African Americans in South Los Angeles",
  "abstract": "Background. A growing body of research suggests that financial difficulties could weaken the protective effects of socioeconomic status (SES) indicators, including education and income, on the health status of marginalized communities, such as African Americans. Aim. We investigated the separate and joint effects of education, income, and financial difficulties on mental, physical, and oral self-rated health (SRH) outcomes in African American middle-aged and older adults. Methods. This cross-sectional study enrolled 150 middle-aged and older African Americans residing in South Los Angeles. Data on demographic factors (age and gender), socioeconomic characteristics (education, income, and financial difficulties), and self-rated health (mental, physical, and oral health) were collected. Three linear regression models were used to analyze the data. Results. Higher education and income were associated with a lower level of financial strain in a bivariate analysis. However, according to multivariable models, only financial difficulties were associated with poor mental, physical, and oral health. As similar patterns emerged for all three health outcomes, the risk associated with financial difficulties seems robust. Conclusions. According to our multivariable models, financial strain is a more salient social determinant of health within African American communities than education and income in economically constrained urban environments such as South Los Angeles. While education and income lose some protective effects, financial strain continues to deteriorate the health of African American communities across domains.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fcb3c1ce5a221ef56eb442cec8559e5a",
  "timestamp": "2025-05-15T02:30:28.629302"
}