{
  "id": 8097,
  "title": "Women's postoperative experiences before and after the introduction of spinal opioids in anaesthesia for caesarean section",
  "abstract": "Aim. The aim was to evaluate a new anaesthetic routine and to study the effect of spinal opioids for caesarean section on postoperative pain, expectations of pain, satisfaction with pain treatment, breastfeeding, infant care and length of hospital stay. Background. Inadequate postoperative pain relief is a problem among hospitalised patients. Women undergoing caesarean section have been shown to experience high levels of pain during the first days after operation. Women are expected to breastfeed and care for their newborn while recovering from major abdominal surgery and sufficient pain relief are of importance. Design. Comparative patient survey. Methods. Data were collected through a questionnaire distributed to two independent samples of women undergoing elective and emergency caesarean section before and after the introduction of an additive of opioids in obstetric spinal anaesthesia. Chi-square tests were performed, and risk ratios were used for bivariate analysis. Logistic regression modelling was used for multivariate analysis. Results. The group of women undergoing caesarean section with opioids added to the spinal anaesthesia reported significantly lower levels of experienced pain. High pain levels irrespective of mode of caesarean section affected breastfeeding and infant care. Length of hospital stay for caesarean women was shortened and the consumption of analgesics was reduced. Conclusions. Women receiving an additive of opioids in spinal anaesthesia experienced lower levels of pain. Low pain levels facilitate breastfeeding and infant care and are of relevance for financial considerations. Relevance to clinical practice. The results of this study indicate that spinal opioids for women undergoing caesarean section have a positive effect on the postoperative pain experience. Women undergoing caesarean section and have high pain levels are in special need of attention and care because of a higher risk of a decreased ability to breastfeed and to take care of their newborn.",
  "year": 2010,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fcbfcc8e599ff7551923a894a7a1d7ed",
  "timestamp": "2025-05-15T03:15:09.407297"
}