{
  "id": 2429,
  "title": "Digital Health Technology Research Funded by the National Institutes of Health",
  "abstract": "Importance Digital health in biomedical research and its expanding list of potential clinical applications are rapidly evolving. A combination of new digital health technologies (DHTs), novel uses of existing DHTs through artificial intelligence- and machine learning-based algorithms, and improved integration and analysis of data from multiple sources has enabled broader use and delivery of these tools for research and health care purposes. The aim of this study was to assess the growth and overall trajectory of DHT funding through a National Institutes of Health (NIH)-wide grant portfolio analysis. Observations This study used 21 preselected DHT search terms to identify the funding allocations in DHT research across a 9-year period between fiscal year 2015 and fiscal year 2023. A subset of grants were manually curated to confirm the search terms' accuracy and ascertain the stage of development, focus, and types of tools or approaches. To understand the translation of DHTs from biomedical research to clinical application, common measures, such as digital health publications and clinical trials were included. The DHT portfolio represented 3.2% (US $7 628 967 500) of the overall NIH grants funded from 2015 to 2023. DHT research funding increased during this period from $348 725 600 to $1 533 281 000. DHT research publications and clinical trials using the same search terms increased from 3714 to 14 786 and from 89 to 240, respectively. More DHT research funding was used for research and development purposes (59.3%) than for clinical or regulatory purposes (41.0%) based on manual, second-level data curation. Conclusions and Relevance This study found that investments in DHT research at the NIH has increased over the past 9 years and that this increase has been steady since 2015, including during and even after the COVID-19 pandemic. Increased use of DHTs is expected to continue as these technologies become a more integral part of the biomedical research ecosystem.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fcc8c9fa8f94b99b39f31696a24af3ec",
  "timestamp": "2025-05-15T01:06:38.138304"
}