{
  "id": 6133,
  "title": "A twin-family study of the association between employment, burnout and anxious depression",
  "abstract": "Background: Earlier studies have shown that employment and burnout are related to anxiety and depression. This twin-family study investigates to what extent these associations are caused by shared etiological factors. Methods: In a sample of 4309 Dutch twins and 1008 siblings, bivariate genetic analyses of employment and anxious depression and of burnout and anxious depression were carried out using structural equation modelling. Results: Employment and anxious depression were both influenced by genetic and individual-specific environmental factors. The association between employment and anxious depression was small, but significant, estimated at -0.08. Power was too low to decide whether the covariance was explained by genetic or environmental factors. In burnout, familial clustering was due to genetic factors in men, but to genetic and common environmental factors in women. In both sexes, there was a strong correlation of around 0.40 with anxious depression, which was explained by shared genetic and shared individual-specific environmental factors. Limitations: The group of unemployed subjects in our sample not only contained subjects who were searching for a job, but also subjects who were out of the labour force. Conclusions: Associations between employment and anxious depression as well as between burnout and anxious depression are due to overlapping genetic and individual-specific environmental factors. Work related circumstances, e.g. financial strain or work-family conflict, might be of importance in burnout and anxious depression. These results support the notion that a genetic vulnerability for depression also increases the risk for exposure to high-risk environments, such as unemployment. (c) 2005 Elsevier B.V. All rights reserved.",
  "year": 2006,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fccd95375fc3011090b14099f5c41c51",
  "timestamp": "2025-05-15T02:55:12.885655"
}