{
  "id": 2675,
  "title": "Towards a managerially useful approach to classifying services",
  "abstract": "The topic of service classification has received extensive scholarly attention. The efforts put in have resulted in a wide array of service classifications. At the same time, there has been little discussion of similarities and differences between classifications. Furthermore, use of individual classifications in practice, like for example in service procurement training programs, usually demonstrates that single classifications do not sufficiently capture all relevant aspects of service procurement. We conducted a systematic review of 88 articles on service classification published between 1964 and 2013, with the objective of developing a comprehensive, managerially useful service classification. Careful analysis of 50 identified classifications suggest that in particular the following four service classification attributes provide meaningful insights: (1) the way the service is used; (2) the extent of customer contact; (3) the degree of participation/interaction; and (4) the degree of customization. As a first attempt at validating the resulting classification scheme, we compared it with classification schemes emerging from training sessions with over 300 purchasing managers. These purchasing managers indicate that starting from how the service is being used already provides them with useful insights over their current classifications, based on for example the portfolio of Kraljic. According to them, adding the other segmentation attributes provides an even deeper understanding of the type of activity patterns involved, boundary-spanning roles, et cetera. We conclude that purchasing managers that collectively use the four service segmentation attributes mentioned here may obtain a more complete overview of key managerial issues in the procurement and subsequent management of business services. (C) 2015 Elsevier Ltd. All rights reserved.",
  "year": 2015,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fcdcb904c03774664450bd138d994829",
  "timestamp": "2025-05-15T01:09:14.948904"
}