{
  "id": 3535,
  "title": "Levels of Urbanization and Parental Education in Relation to the Mortality Risk of Young Children",
  "abstract": "Background: The establishment of the National Health Insurance program in Taiwan in 1995 effectively removed the financial barrier to access health care services of Taiwanese people. This population-based cohort study aimed to determine the independent and joint effects of parental education and area urbanization on the mortality risk among children under the universal health insurance coverage in Taiwan since 1995. Methods: We linked 1,501,620 births from 1996 to 2000 to the Taiwan Death Registry to estimate the neonatal, infant, and under-five mortality rates, according to the levels of parental education and urbanization of residential areas. We used a logistic regression model that considers data clustering to estimate the independent and joint effects. Results: Lower levels of parental education and area urbanization exerted an independent effect of mortality on young children, with a stronger magnitude noted for areas with lower levels of urbanization. Children whose parents had lower levels of education and who were born in areas with lower levels of urbanization experienced the highest risk for neonatal (odds ratio (OR) = 1.60, 95% CI = 1.46-1.76), infant (OR = 1.58, 95% CI = 1.48-1.70), and under-five (OR = 1.71, 95% CI = 1.61-1.82) mortality. Conclusions: Even with universal health insurance coverage, lower levels of area urbanization and parental education still exerted independent and joint effects on mortality in young children. This finding implies the inadequate accessibility to health care resources for children from socially disadvantaged families and less urbanized areas.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fce1d530e7ff3986385cdbd68c8189b9",
  "timestamp": "2025-05-15T02:27:19.102490"
}