{
  "id": 1199,
  "title": "Neural Network Model for the Multiple Factor Analysis of Economic Efficiency of an Enterprise",
  "abstract": "The paper proposes a neural network model for assessing the impact of financial instruments and organizational forms on the growth of efficiency within the industry based on the case study of such a high-technology company as the Rosatom State Atomic Energy Corporation. A large holding that is a monopoly state corporation (Rosatom SC) manages more than 300 large enterprises which it owns (either fully or partially, through joint ventures, such as JSCs), or controls directly, such as FSUEs (Federal state unitary enterprises) and FSBIs (Federal state budgetary institutions). Objective: To explain the degree of impact of financial instruments and their groups on the overall economic efficiency using a non-recurrent neural network-based analysis, and to build a neural network-based profit generation model. The main criterion for the economic efficiency of the head enterprise of Rosatom group is its combined profit for the year. Since 2007, Rosatom group has used EBITDA as the main indicator of the company's performance. The Rosatom's order portfolio exceeds $133 billion, which is 67% of the global nuclear power plant construction market. The present paper suggests a methodology for evaluating the economic efficiency of existing organizational forms, financial instruments and support institutions for Rosatom. The paper proposes an algorithm for building a neural network model for evaluating an enterprise's efficiency.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fceea63d133eb66dfb115457653c860c",
  "timestamp": "2025-05-15T00:53:09.862082"
}