{
  "id": 86,
  "title": "On solving the suburban commuting problem in megacities: Integrating ridesharing with urban rail transit",
  "abstract": "The increasing spatial separation between workplaces and residences, coupled with the continued rise in motor vehicle ownership, has significantly strained urban traffic during rush hours. Suburban commuters, in particular, experience prolonged travel times. To enhance suburban commuting efficiency and alleviate congestion, this paper introduces a novel approach to address the Suburban Commuting Problem (SCP) in megacities. The proposed solution integrates ride-sharing with urban rail transit (URT) systems. By promoting ridesharing in suburban areas, commuters can broaden their options for URT stations, no longer restricted to the nearest but often overcrowded end stations. This approach enhances the accessibility of URT and helps alleviate queuing congestion at end stations. Consequently, this approach shortens travel times for suburban commuters. We formulate the SCP as an arc-flow mixed-integer linear programming model, as well as a set-partitioning formulation. We introduce a tailored branch-and-price (BP) algorithm based on the set-partitioning approach to accurately solve the SCP. To expedite the solution process for the pricing sub-problem, we devise a tailored label-setting algorithm incorporating a bi-directional search strategy. Finally, we evaluate our model and algorithm's performance through extensive computational experiments and provide valuable managerial insights. The case results based on part of road network in Beijing indicate that the proposed optimized solution for the integrated commuting mode can reduce vehicle commuting distance by 34.65%, thereby mitigating traffic congestion and reducing pollutant emissions.",
  "year": 2025,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fcfccb9ec8c06612642d5498f4f6a96b",
  "timestamp": "2025-05-15T01:27:29.371012"
}