{
  "id": 2209,
  "title": "Current advances in the use of bioluminescence assays for drug discovery: an update of the last ten years",
  "abstract": "IntroductionBioluminescence is a well-established optical detection technique widely used in several bioanalytical applications, including high-throughput and high-content screenings. Thanks to advances in synthetic biology techniques and deep learning, a wide portfolio of luciferases is now available with tuned emission wavelengths, kinetics, and high stability. These luciferases can be implemented in the drug discovery and development pipeline, allowing high sensitivity and multiplexing capability.Areas coveredThis review summarizes the latest advancements of bioluminescent systems as toolsets in drug discovery programs for in vitro applications. Particular attention is paid to the most advanced bioluminescence-based technologies for drug screening over the past 10 years (from 2013 to 2023) such as cell-free assays, cell-based assays based on genetically modified cells, bioluminescence resonance energy transfer, and protein complementation assays in 2D and 3D cell models.Expert opinionThe availability of tuned bioluminescent proteins with improved emission and stability properties is vital for the development of bioluminescence assays for drug discovery, spanning from reporter gene technology to protein-protein techniques. Further studies, combining machine learning with synthetic biology, will be necessary to obtain new tools for sustainable and highly predictive bioluminescent drug discovery platforms.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fd05693a05100efff7675062c4ba7a2d",
  "timestamp": "2025-05-15T01:04:27.432000"
}