{
  "id": 1627,
  "title": "Risk attribution and interconnectedness in the EU via CDS data",
  "abstract": "The global financial crisis in 2008, and the European sovereign debt crisis in 2010, highlighted how credit risk in banking sectors cannot be analysed from a uniquely micro-prudential perspective, focused on individual institutions, but it has instead to be studied and regulated from a macro-prudential perspective, considering the banking sector as a complex system. Traditional risk management tools often fail to account for the complexity of the interactions in a financial system, and rely on simplistic distributional assumptions. In recent years machine learning techniques have been increasingly used, incorporating tools such as text mining, sentiment analysis, and network models in the risk management processes of financial institutions and supervisors. Network theory applications in particular are increasingly popular, as they allow to better model the intertwined nature of financial systems. In this work we set up an analytical framework that allows to decompose the credit risk of banks and sovereign countries in the European Union according to systematic (system-wide and regional) components. Then, the non-systematic components of risk are studied using a network approach, and a simple stress-test framework is set up to identify the potential transmission channels of distress and risk spillovers. Results highlight a relevant component of credit risk that is not explained by common factors, but can still be a potential vehicle for the transmission of shocks. We also show that due to the properties of the network structure, the transmission of shocks applied to different institutions is quite diversified, both in terms of breadth and speed. Our work is useful to both regulators and financial institutions, thanks to its flexibility and its requirement of data that can be easily available.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fd183fe1a5cb9e84c9ccb8f65022b886",
  "timestamp": "2025-05-15T02:05:42.493025"
}