{
  "id": 2261,
  "title": "Research on Identification and Correction of Fund Investment Style Drift Based on FSD Model",
  "abstract": "In order to solve the problem of investment style drift of open industry theme fund, this paper divides 110 industry theme stocks into ten types based on ITC classification by establishing hierarchical model, constructing judgment matrix, calculating portfolio weight vector and portfolio consistency test. On this basis, combined with the risk weight coefficient of stocks, this paper divides ten types of stocks into three risk levels, and completes the classification of open-end funds based on industry themes and risk levels. Second, this paper defines the fund risk volatility index and the fund steady return index under the new combination, establishes the style drift index using the daily cumulative return rate, and carries on the symbolic processing. The fund style drift control rate is introduced as the judgment basis, and the secondary drift index with only positive and negative properties is taken as the final judgment index. Finally, based on the theory that the total risk value of funds before and after the drift remains stable, combined with the style weight value under nine investment styles, this paper establishes a fund style drift correction model by solving the weight interval of each style after the drift and comparing it with the specific weight before the drift, to realize the correction of the drifting result of funds.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fd1ee6f081eecbf74a952160e9b8e476",
  "timestamp": "2025-05-15T01:05:04.466300"
}