{
  "id": 1847,
  "title": "Nonprofit organizations and social-alliance portfolio size: Evidence from website content analysis",
  "abstract": "Business-Nonprofit Partnership (BNP) has been widely regarded as a vital approach for public value creation and social innovation. At the same time, many studies show a positive association between the size of an organization?s portfolio of partners and its overall performance and innovation. Building on these insights, we contribute to the BNP literature by drawing on the relational view to theorize and empirically examine the conditions that underpin the effectiveness of nonprofit organizations (NPOs) in establishing collaborative linkages with the private sector (i.e. to determine the size of their portfolio of business partners). Data were compiled from the websites of NPOs (n = 102) that were collaborating with FTSE 100 companies. The results of regression analysis show that the ability of NPOs to deliver economic rent (to business partners) and to establish calculative trust (pre-collaboration trust) is positively associated with their portfolio size. Furthermore, the results indicate that the ability to create social value is also positively associated with portfolio size but only for larger NPOs, and that the delivery of collaboration options is negatively associated with portfolio size. We discuss these findings in relation to their implications for research and practice.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fd26645955f736a66ac3c042e4fe79db",
  "timestamp": "2025-05-15T01:00:27.282672"
}