{
  "id": 8870,
  "title": "Real-world clinical predictors of manic/hypomanic episodes among outpatients with bipolar disorder",
  "abstract": "Background Bipolar disorder is a mental illness in which manic and depressive states are repeated, causing psychosocial dysfunction. Manic/hypomanic episodes cause problems with interpersonal, social and financial activities, but there is limited evidence regarding the predictors of manic/hypomanic episodes in real-world clinical practice. Methods The multicenter treatment survey on bipolar disorder (MUSUBI) in Japanese psychiatric clinics was administered in an observational study that was conducted to accumulate evidence regarding bipolar disorder in real-world clinical practice. Psychiatrists were asked to complete a questionnaire about patients with bipolar disorder who visited 176 member clinics of the Japanese Association of Neuro-Psychiatric Clinics by conducting a retrospective medical record survey. Our study extracted baseline patient characteristics from September to October 2016, including comorbidities, mental status, duration of treatment, Global Assessment of Functioning (GAF) score, and pharmacological treatment details. We investigated the presence or absence of manic/hypomanic episodes over the course of one year from baseline to September-October 2017. Results In total, 2231 participants were included in our study, 29.1% of whom had manic/hypomanic episodes over the course of one year from baseline. Binomial logistic regression analysis revealed that the presence of manic/hypomanic episodes was correlated with lower baseline GAF scores, rapid cycling, personality disorder, bipolar I disorder, and a mood state with manic or mixed features. Substance abuse was also a risk factor for manic episodes. There was no significant association between a baseline antidepressant prescription and manic/hypomanic episodes. Conclusions In Japan, 29.1% of outpatients with bipolar disorder had manic/hypomanic episodes over the course of one year. Our study suggested that a low GAF score, rapid cycling, personality disorder, bipolar I disorder, substance abuse, and baseline mood state could be predictors of manic/hypomanic episodes. Based on our findings, an antidepressant prescription is not a predictor of manic/hypomanic episodes.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fd28a7d5e486f9822249329c516d96bb",
  "timestamp": "2025-05-15T03:23:27.758594"
}