{
  "id": 1564,
  "title": "RETRACTED: Development and Supervision of Robo-Advisors under Digital Financial Inclusion in Complex Systems (Retracted Article)",
  "abstract": "With the rapid development of the market economy, there are more and more projects in the financial industry, and their complexity and technical requirements are getting higher and higher. The development of computer technology has promoted the birth of robot consultants, and it is of great significance to use robot consultants to manage and supervise financial industry projects. In order to further analyze the development and supervision of robo-advisors under the digital inclusive financial system, this paper uses complex systems and clustering algorithms as technical support to carry out research. First, the traditional K-means algorithm is used to select the initial clustering center, to improve the noise and outlier processing capabilities, and to build a data mining system based on the improved algorithm. Then, a product design model for robo-advisors is built and the risks of robo-advisors are analyzed from three aspects: technology, market, and law. Analyzing the performance of the improved K-means algorithm, in the operation of the experimental dataset B, the accuracy of the clustering result after 6 iterations reached 97.08%, which shows that the algorithm has good performance. During the trial operation of the data mining system, the four types of customers of financial institutions were accurately clustered, and it was concluded that the main type of customers who brought benefits to financial institutions was high-income customers accounting for 10.75%. Robo-advisory product models are used to build five risk-level investment portfolios and conduct risk backtests. Except for the growth and income portfolio, other portfolios have consistently outperformed the performance benchmark during the analyzed time period. Running the research system of this paper in a financial institution, comparing the capital budget before and after the operation, found that the system can improve the accuracy of the budget and reduce the risk of the robo-advisor for the financial institution.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fd28df30bb5b1a48be5cac6c5818836a",
  "timestamp": "2025-05-15T02:05:08.075612"
}