{
  "id": 3382,
  "title": "Corporate social responsibility and idiosyncratic risk in the restaurant industry: does brand diversification matter?",
  "abstract": "Purpose This study aims to examine the link between corporate social responsibility (CSR) and idiosyncratic risk in the restaurant industry. The study also explores whether brand diversification magnifies the risk reduction effect of CSR in the restaurant industry. Design/methodology/approach The study uses an unbalanced panel of 274 firm-year observations for 43 restaurant firms over the period 1995-2015. Models are estimated via fixed effect regression with robust standard errors. Findings The study finds that CSR involvement reduces idiosyncratic risk and this risk reduction is intensified when restaurant firms operate a portfolio of brands. Research limitations/implications The study's findings are limited to restaurant industry, therefore, generalization of the findings to other industries requires delicate care. Brand diversification is a simple brand count due to a lack of brand sales data. Practical implications CSR activities are not cost burden for restaurant firms. Indeed, CSR could be a viable strategy to reduce the volatility in future expected cash flows, hence the idiosyncratic risk. This risk reduction could help owners/managers access to capital with lower cost. Moreover, the study suggests that CSR practices should not be implemented in isolation from firm marketing strategy such as portfolio of brands. Originality/value Although prior hospitality research puts forth some evidence using systematic risk as the measure of firm risk, this measure may not best suit the purpose in CSR context given that CSR is a direct, firm-specific strategy. Hence, the current study provides both new evidence with firm-specific, idiosyncratic risk and introduces an important contingency situation when the risk reduction effect of CSR would become more profound for restaurant firms.",
  "year": 2020,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fd51a76ac38c16dacc2a49f54e61779f",
  "timestamp": "2025-05-15T01:16:22.221227"
}