{
  "id": 1381,
  "title": "Scenario-based multi-period program optimization for capability-based planning using evolutionary algorithms",
  "abstract": "Capability based planning (CBP) is a strategy focused planning framework that facilitates organizations to systematically develop capacity to achieve their business objectives in highly uncertain, dynamic and competitive environments. Capability programming is an integral part of CBP which requires selecting a portfolio of capability projects for execution, referred as a capability program, such that the overall strategic risk facing the planning organization across a number of projected future operating scenarios is minimized while maintaining the most economical choice. It is a challenging optimization problem that requires handling a number of dynamic constraints and objectives that vary throughout the entire planning horizon. An optimizing simulation approach is presented in this paper that combines an evolutionary multi-objective optimization algorithm with a reinforcement learning technique to generate capability programs which optimize strategic risks and program costs across multiple planning scenarios as well as over a rolling planning horizon. The role of the optimization algorithm in this approach is to search for the non-dominated capability programs at each decision point by minimizing the strategic risks associated with individual capability projects across a number of planning scenarios as well as the total cost of the program. The reinforcement learning algorithm, on the other hand, searches horizontally within the set of non-dominated programs to minimize capability risks and costs over the entire planning horizon. The methodology is evaluated on a test problem generated based on the data distributions in an Australian Defence Capability Plan and the performance is compared with two myopic heuristic methods. (c) 2016 Elsevier B.V. All rights reserved.",
  "year": 2017,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fd5d938e5ac3c13893900bb59c9402ca",
  "timestamp": "2025-05-15T00:54:56.548596"
}