{
  "id": 2692,
  "title": "Risk-Return Trade-off: Amanah Saham Bumiputera Versus Tabung Haji",
  "abstract": "This research explores the risk-return trade-off and the income return on investment in Amanah Saham Bumiputera (ASB) with Tabung Haji (TH) over an observed period from 1994 through 2020. Specifically, the study examines any potential theoretical connections between the performance of these two-unit trusts. Within the frameworks of the Capital Asset Pricing Model (CAPM) and the Modern Portfolio Theory (MPT), this research uses long run OLS regression and the Engle-Granger cointegration test (1987) to estimate the annual announced nominal dividends of both funds over a 27-year period. The empirical evidence supports the existence of a unidirectional equilibrium relationship between the stated dividends of the two funds, from TH to ASB. However, there is an absence of a dynamic relationship between them. The study also observed a statistically significant positive correlation between ASB's dividends and TH's throughout the entire sample period. This evidence strongly suggests that the two funds are competing with one another and technically related in terms of dividend distributions. In terms of systematic risk, both funds have a significantly low negative beta, which suggests an inverse relationship with the stock market performance. Concerning coefficient of variation analysis, ASB seems to be the preferred portfolio with the given rate of return. Therefore, it is clear that both ASB and TH are credible unit trusts coupled with a diversification effect. Consequently, it is essential for the top management of ASB and TH to step up operational and allocative efficiencies in their portfolio management to provide steadily increasing dividend payments to their unitholders in the long run.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fd6866627dee2ff595fbcafdb902b17b",
  "timestamp": "2025-05-15T01:09:43.292288"
}