{
  "id": 1386,
  "title": "EWSE and Uncertainty and Disturbance Estimator Based Pitch Angle Control for Wind Turbine Systems Operating in Above-Rated Wind Speed Region",
  "abstract": "As wind energy becomes a larger part of the world's energy portfolio, the control of wind turbines is still confronted with challenges including wind speed randomness and high system uncertainties. In this study, a novel pitch angle controller based on effective wind speed estimation (EWSE) and uncertainty and disturbance estimator (UDE) is proposed for wind turbine systems (WTS) operating in above-rated wind speed region. The controller task is to maintain the WTS's generator power and rotor speed at their prescribed references, without measuring the wind speed information and accurate system model. This attempt also aims to bring a systematic solution to deal with different system characteristics over wide working range, including extreme and dynamic environmental conditions. First, support vector machine (SVR) based EWSE model is developed to estimate the effective wind speed in an online manner. Second, by integrating an UDE and EWSE model into the controller, highly turbulent and unpredictable dynamics introduced by wind speed and internal uncertainties is compensated. Rigid theoretical analysis guarantees the stability of the overall system. Finally, the performance of the novel pitch control scheme is testified via the professional Garrad Hassan (GH) bladed simulation platform with various working scenarios. The results reveal that the proposed approach achieves better performance in contrast to traditional L1 adaptive and proportional-integral (PI) pitch angle controllers.",
  "year": 2020,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fda10f321689c0f4554115ddead58d22",
  "timestamp": "2025-05-15T00:54:56.556740"
}