{
  "id": 5771,
  "title": "The Effect of Stressful Life Events on Postpartum Depression: Findings from the 2009-2011 Mississippi Pregnancy Risk Assessment Monitoring System",
  "abstract": "Objectives To determine the prevalence of postpartum depression (PPD) among new mothers in Mississippi during 2009-2011 and evaluate the effects of different stressful life events in the year before delivery on the likelihood of PPD. Methods We used Mississippi Pregnancy Risk Assessment Monitoring System (PRAMS) 2009-2011 data (n = 3695) to evaluate the effects of different stressful life events on PPD. We categorized 13 stressors into 4 groups: financial, relational, trauma-related, and emotional. A composite score of the mothers' responses (C10) to the three items: I felt down, depressed, or sad, I felt hopeless, and I felt slowed down was used to measure PPD. The items were rated on a Likert scale from (1) never to 5 (always). Descriptive statistics, Chi square tests, t tests, and logistic regression analyses were conducted using SAS 9.3 Proc Survey procedure (SAS Institute, Cary, NC, USA). Results The overall prevalence of self-reported PPD was 14.8 %. Mothers who experienced high relational with low financial and high trauma related stresses had the highest likelihood of PPD diagnosis after adjusting for confounders (OR = 8.6; 95 % CI, 3.5-21.3), followed by those who reported high relational stress with low financial and low trauma stresses (OR = 5.9; 95 % CI, 3.5-10.2). Those with high financial, low relational, and low trauma had the least likelihood of PPD (OR = 2.2; 95 % CI, 1.6-3.0) compared to women with low stress in all three categories. Conclusion Our findings showed that the likelihood of PPD was higher among women who had high relational stress, indicating that efforts to effectively prevent PPD need to focus on healthy relationships between partners during pregnancy.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fda4ef3e154079bc6871cac188425193",
  "timestamp": "2025-05-15T02:51:29.974402"
}