{
  "id": 1172,
  "title": "Analysis of Internet Financial Risk Control Model Based on Machine Learning Algorithms",
  "abstract": "On the basis of traditional credit risk control, this paper proposes the demand and direction of a new credit risk control strategy based on machine learning and relying on big data. First, on the basis of introducing the basic algorithmic principles of machine learning, we give reasons for choosing machine learning models and build a machine learning-based Internet consumer finance credit risk control strategy model to provide theoretical support for the empirical analysis later. Second, we take the test data of Internet consumer finance S company as the research sample and carry out empirical analysis according to the machine learning-based Internet consumer finance credit risk control strategy model. The comparison of the training results is based on the comprehensive consideration of training time, validation set accuracy, TPR evaluation indicators, and interpretability of the results; it verifies the advantages of the machine learning model in screening the key influencing factors that cause the overdue performance of credit customers. According to the optimized credit risk control strategy, corresponding strategy suggestions are provided for the credit risk control of S company. The research results show that the prediction effect of the classification model based on traditional linear regression is generally lower than that of the model based on the classification algorithm based on machine learning, and there is a complex nonlinear relationship between platform default and its related influencing factors. The accuracy of classification and early warning results of the random forest algorithm is relatively high, and the detection rate of the decision tree model is relatively high, but the cost is also the highest. In addition, the accuracy of the four types of early warning models is relatively stable, reaching an average of 80%. This paper proposes a machine learning-based Internet consumer finance credit risk control strategy model. Its system, timeliness, and risk prediction capabilities provide new ideas and suggestions for Internet consumer finance companies to design risk control strategies.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fdc2e332a998752693977715f32990f5",
  "timestamp": "2025-05-15T01:59:56.254535"
}