{
  "id": 5317,
  "title": "Oral Health-Related Quality of Life Among Publicly Insured Mental Health Service Outpatients With Serious Mental Illness",
  "abstract": "Objective: The study investigated factors associated with unmet need for dental care and oral health-related quality of life (OHQoL) among individuals with serious mental illness receiving outpatient care in a public mental health program serving a largely low-income population, mostly from racialethnic minority groups. Methods: Cross-sectional interview data were collected from a convenience sample (N=150) of outpatients. Adjusted risk ratios (ARRs) and adjusted risk differences (ARDs) were estimated by logistic regression models to examine the independent contribution of sociodemographic and clinical factors to low OHQoL and past-year unmet dental need, defined as inability to obtain all needed dental care. Results: More than half of participants reported low OHQoL (54%) and a past-year dental visit (61%). Over one-third (39%) had past-year unmet dental need. Financial barriers (ARR=3.16) and nonfinancial barriers (ARR=2.18) were associated with greater risk for past-year unmet dental need after control for age, gender, high dental anxiety, and limited English proficiency. ARDs for financial and nonfinancial barriers indicated absolute differences of 40 and 27 percentage points, respectively. Unmet dental need (ARR=1.31), xerostomia severity (ARR=1.20), and a schizophrenia spectrum diagnosis (ARR=1.33) were associated with low OHQoL, after control for age and current smoking, with ARDs ranging from 11 to 15 percentage points. Conclusions: Improving oral health promotion, oral health service access, and the integration of the mental and oral health systems may help reduce the high prevalence of low OHQoL in this population, given that low OHQoL is partly driven by unmet dental need.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fdec447b26f0d412840e6e7c1f0a803a",
  "timestamp": "2025-05-15T02:46:44.850098"
}