{
  "id": 2190,
  "title": "Patient-Reported Financial Distress in Cancer: A Systematic Review of Risk Factors in Universal Healthcare Systems",
  "abstract": "Simple Summary A comprehensive understanding of risk factors associated with experiencing subjective financial distress is needed to inform the development of valid instruments and effective interventions to tackle financial toxicity. Several studies from the US indicate a strong correlation of the US-healthcare system's systematic organisation and its particular socioeconomic risk factors for cancer patients experiencing financial toxicity. It is assumed that risk factors differ in other high-income countries due to the different structure of universal healthcare coverage. As an exhaustive analysis for other countries is lacking, this review aims to identify risk factors for subjective financial distress in universal healthcare systems. Financial toxicity is a side effect of cancer that results from the perceived financial distress an individual may experience in the course of the disease. The purpose of this paper is to analyse underlying factors related to subjective financial distress in high-income countries with universal healthcare coverage. A systematic literature review was conducted to identify qualitative and quantitative studies of cancer patient-reported subjective financial distress by performing a search in the databases of PubMed, PsycINFO and CINAHL up to December 2020. A qualitative synthesis was performed linking the time-dependent occurrence of risk factors to derived categories of risk factors. Out of 4321 identified records, 30 quantitative and 16 qualitative studies were eligible. Classification of risk factors resulted in eight categories with a total of 34 subcategories. Subjective financial distress is primarily determined by pre-diagnosis sociodemographic- factors as well as financial and work factors that might change during the course of the disease. The design of healthcare and social security systems shapes the country-specific degree of subjective financial distress. Further research should focus on evolving multidisciplinary intervention schemes and multidimensional instruments for subjective financial distress to account for identified risk factors in universal healthcare systems more precisely.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fdf22eae83610b4e16213d5b99e2a0c1",
  "timestamp": "2025-05-15T02:12:17.443759"
}