{
  "id": 3184,
  "title": "Development of a Large Database of Italian Bridge Bearings: Preliminary Analysis of Collected Data and Typical Defects",
  "abstract": "This paper presents the development and analysis of a bridge bearing database consistent with the 2020 Italian Guidelines (LG2020), currently enforced by the Italian law for risk classification and management of existing bridges. The database was developed by putting together the contribution of 24 research teams from 18 Italian universities in the framework of a research project foreseen by the agreement between the High Council of Public Works (CSLP, part of the Italian Ministry of Transportation) and the research consortium ReLUIS (Network of Italian Earthquake and Structural Engineering University Laboratories). This research project aimed to apply LG2020 to a set of about 600 bridges distributed across the Italian country, in order to find possible issues and propose modifications and integrations. The database includes almost 12,000 bearing defect forms related to a portfolio of 255 existing bridges located across the entire country. This paper reports a preliminary analysis of the dataset to provide an overview of the bearings installed in a significant bridge portfolio, referring to major highways and state roads. After a brief state of the art about the main bearing types installed on the bridges, along with inspection procedures, the paper describes the database structure, showing preliminary analyses related to bearing types and defects. The results show the prevalence of elastomeric pads, representing more than 55% of the inspected bearings. The remaining bearings are pot, low-friction with steel-Teflon surfaces and older-type steel devices. Lastly, the study provides information about typical defects for each type of bearing, while also underscoring some issues related to the current version of the LG2020 bearing inspection form.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fe05da65a2e373fb9baa74a8afbcdc3e",
  "timestamp": "2025-05-15T01:14:16.299382"
}