{
  "id": 4881,
  "title": "Does green process innovation affect a firm's financial risk? The moderating role of slack resources and competitive intensity",
  "abstract": "Purpose Over the last two decades, corporations have increasingly adopted green innovation to lessen the unsuitable impact on the environment and gain competitive advantage at the same time. However, researchers have paid more attention to green product innovation and the firm's financial risk (FFR) relationship than green process innovation. Such neglect of green process innovation has failed to produce an elusive understanding of green process innovation and FFR relationship, and this relationship is necessary to understand for the ongoing debate on does it pay to be green? Thus, the purpose of this research is to investigate the relationship between green process innovation performance (GPRIP) and FFR, and it also examines the moderating role of slack resources and competitive intensity in facilitating this relationship. Design/methodology/approach The authors collected 202 publicly listed Thai manufacturing firms' data using questionnaire survey and firms' financial statements, and this research employed hierarchical moderating regression analyses to test hypotheses. Findings Results demonstrate that GPRIP negatively influences the FFR. Competitive intensity reinforces the negative relationship between GPRIP and FFR, whereas organizational slack has an unfavorable moderating effect, i.e. firms with ample organizational slack are less likely to reduce their financial risk from higher GPRIP. Originality/value The research model contributes to an ongoing debate on does it pay to be green? by providing a thorough understanding of GPRIP and FFR relationship, as to the authors' best knowledge, no work to date has examined this relationship. This research also sets out the boundary conditions of the GRPIP and FFR relationship and highlights the critical role of firm-specific condition, i.e. slack resource and market condition, i.e. competitive intensity to reap higher financial benefits from GPRIP.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fe0857b9182905dbad4f627453c24edf",
  "timestamp": "2025-05-15T02:42:04.858405"
}