{
  "id": 7911,
  "title": "Going with the flow: How does global energy value chain adapt to geopolitical risks?",
  "abstract": "Geopolitics is a significant risk that affects the global energy system and impacts countries' participation in the global energy value chain (EGVC). Based on this, this paper provides a thorough analysis and empirical examination of the impact of geopolitics risks (GPR) on the EGVC with 41 countries around the world from 2010 to 2019. The results of the study found that: (1) Compared to energy importing countries, energy exporting countries have lower participation and are in the upstream of EGVC, obtaining less value added. (2) The GPR can reduce EGVC participation and push countries to move upstream of EGVC, thus crowding out activities with higher value-added such as new energy technology innovation while guaranteeing energy security. (3) Influenced by trade barriers and other factors, GPR affects countries' participation in EGVC mainly by reducing the scale of international trade, and the increase in the level of financial development can mitigate the impact of the GPR on EGVC. (4) The quantile regression results show that GPR affects countries' participation in EGVC mainly by increasing the level of forward participation as well as decreasing the level of backward participation, and GPR has a greater impact on countries located upstream and with higher participation in the EGVC. This study contributes to the research on EGVC and guides for countries to participate in EGVC under uncertain external conditions.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fe3395b58c0d817c39d1195108fc5d9b",
  "timestamp": "2025-05-15T03:13:05.018928"
}