{
  "id": 4049,
  "title": "Entrepreneurial marketing strategies, resources and social disadvantage: exploring the role of resources and minority status among US agrofood enterprises",
  "abstract": "PurposeThis paper aims to investigate associations between firm resources and reliance on entrepreneurial marketing (EM) channels among agrofood ventures. It accounts for agropreneur gender and racial/ethnic status in the context of marketing channel portfolio composition. The authors examine the established assumption that resource limitations drive EM and whether socially disadvantaged status of agropreneurs is associated with marketing strategy beyond standard resourcing measures.Design/methodology/approachUsing 2015 Local Foods Marketing Practices Survey data, the authors apply linear regression to investigate differences in the use of EM channels, accounting for resources, social status and other factors.FindingsLimited-resource ventures rely more on consumer-oriented channels that require EM practices. Socially disadvantaged entrepreneurs favor these channels, even when accounting for resources. Notably, ventures headed by men of color rely more on the most customer-centric local foods marketing channel.Research limitations/implicationsFuture research should investigate how social and human capital influences the use of EM.Practical implicationsEntrepreneurial support policy and practice for agropreneurs should be cautious about the double-burden folk theorem of intersectional disadvantage and review how to best direct resources on EM to groups most likely to benefit.Originality/valueThis paper uses a unique, restricted, nation-wide, federal data set to examine relationships between resource endowments, social status and the composition of agrofood enterprises' marketing channel portfolios. To the best of the authors' knowledge, it is the first to include racial- and ethnic-minority status of agropreneurs and to account for intersectionality with gender.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fe3626110e8458d2300fea3bc9903e04",
  "timestamp": "2025-05-15T01:23:27.285791"
}