{
  "id": 6260,
  "title": "A dominance-based rough set approach applied to evaluate the credit risk of sovereign bonds",
  "abstract": "Even though sovereign bonds represent low-risk alternatives that give investors a healthy income, the risk assessment process for these bonds is still considered subjective because of the lack of criteria-related information and transparency of the methodologies used by international credit rating agencies. The 2007 economic crisis reflected the lack of clarity in procedures adopted by these agencies, although the financial sector was rigorously regulated. Intending to bring more transparency to the classification process, this paper presents the use of a methodology grounded in Rough Set Theory based on dominance, the Dominance-Based Rough Sets Approach (DRSA). This study takes related studies in the literature into consideration and seeks to show how the World Bank and credit rating agencies such as Standard & Poor's and Moody's can improve on how they tackle certain issues. Using the perspective obtained with DRSA, it was possible to verify the consistency of agencies' ratings and to induce rules for pattern recognition that can explain, using a set of non-redundant attributes, how the credit risk of sovereign bonds is classified. A significant rate of accuracy was obtained in the extrapolation using real data and the number of sovereign bonds analyzed was increased. Since this analysis only uses objective attributes, it was inferred that the absence of subjective attributes, i.e. political stability, provoke divergences in the results when compared to those provided by the credit rating agencies.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fe59bad6df0d3f25bdad91053691a689",
  "timestamp": "2025-05-15T02:56:11.063783"
}