{
  "id": 3935,
  "title": "Can Finland serve as a model for other developed countries? Assessing the significance of energy efficiency, renewable energy, and country risk",
  "abstract": "The Sustainable Development Goal (SDG) that emphasizes sustainable and affordable energy presents a practical pathway to achieve sustainable growth. Moreover, this goal aligns with SDG 13, which focuses on climate action. Nonetheless, it is important to consider factors such as political and financial risk, as they can influence climate action efforts and the renewable energy sources adoption. Hence, this study broadens the conversation surrounding CO2 emission reduction and the achievement of Sustainable Development Goals (SDGs). It accomplishes this by investigating the interplay between renewable energy, political risk, financial risk, and CO2 emissions in Finland spanning from 1990/Q1 to 2021/Q4. Notably, this research distinguishes itself through its exploration of these complex connections, employing a wavelet-based quantile methodology. Unlike traditional quantile regression, which can only reveal connections between variables within each quantile, the waveletbased quantile approach enables the simultaneous capture of correlations across quantiles and periods. The results show that in the long-term and across all quantiles (0.01-0.99), energy efficiency, specifically gas and oil efficiency, lessens CO2. In addition, low financial and political risks improve ecological quality by lessening CO2 across all periods and quantiles (0.01-0.99). The paper outcomes serve as a basis for formulating a policy framework aimed at achieving SDG 7 and SDG 13 in Finland.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fe6563d114cdb8ac846d3e2dec84a8f8",
  "timestamp": "2025-05-15T02:31:28.407325"
}