{
  "id": 3707,
  "title": "An E-valuation framework for developing net-enabled business metrics through functionality interaction",
  "abstract": "Managers engaged in net-enabled business planning seek metrics to help them analyze the success of their e-business investments. Likewise, researchers require metrics to build analytical models and conduct empirical research on the impact of e-business strategies on firm performance. In this article, the authors develop a comprehensive E-Valuation Framework for identifying net-enabled applications and their resulting user-based functionalities for activities across the value chain. The authors propose that the real value from net-enabled applications can be found in functionality interactions, where one application enables or enhances functionality in another application. The comprehensive framework can be used to generate three types of metrics managers can use to evaluate their net-enabled strategic initiatives. Further. a classification of net-enabled organizations provides the basis for selecting applications critical to a firm's strategic thrusts. We make use of the resource-based view of the firm and real-options analysis to discuss how successful application deployment is based on the resources and assets the firm possesses as well as managing the rollout of an applications portfolio over time. The framework allows managers to map their organization's net-enabled initiatives into a coherent, easily understood visual representation and provides direction for researchers evaluating the efficacy of net-enabled business strategies.",
  "year": 2007,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fe6783abacd60337d4a0473525453be9",
  "timestamp": "2025-05-15T01:20:03.429280"
}