{
  "id": 8102,
  "title": "An epidemiological study of health and morbidity profile among geriatric population in field practice area of a Medical College in Navi Mumbai",
  "abstract": "Background: Geriatric population is a very vulnerable group, potentially can suffer many kinds of illnesses ALL AT ONCE. There is a need for proper planning to tackle the social, financial, psychological and physical problems encountered during old age. In India, proportion of old age population is estimated to rise up to 19% by 2050.[1] Objectives: To study the socio demographic and health profile, morbidity prevalence and patterns of various diseases seen in the geriatric age group. To assess the health seeking behavior and the demand for healthcare services in geriatric population. Methodology: This is an epidemiological community based cross-sectional descriptive study on 240 participants aged 60 years and above. Study subjects were interviewed using a questionnaire followed by taking thorough health and morbidity history. General physical examination and Systemic examination was done. Morbidity pattern was analyzed and associations with various determinants were derived. Results: Out of the total 240 subjects, 208 (86.67%) had at least one morbidity and 32 (13.33%) of them dint have any. Association of different parameters with presence or absence of presenting symptoms, morbidity and multi system morbidity was analyzed. Variables significantly positive (P <0.25) in univariate analysis were included in multivariate analysis and binary logistic regression model was applied. Lack of sleep, reduced appetite, nutritional deficiency, low literacy, reduced physical activity and history of addictions all have significant association (P <0.05) with either physical symptoms or systemic morbidity. Conclusion: These risk factors worsen the natural aging process and hamper the process of healthy ageing. Measures must be taken to reduce these modifiable risk factors at younger age in order to prevent multi factorial causation of chronic diseases in old age as we're heading towards a demographic shift soon.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fe72cd0dca111cb842249c3b193a3007",
  "timestamp": "2025-05-15T03:15:09.430836"
}