{
  "id": 1567,
  "title": "Deterministic modelling of implied volatility in cryptocurrency options with underlying multiple resolution momentum indicator and non-linear machine learning regression algorithm",
  "abstract": "Modeling implied volatility (IV) is important for option pricing, hedging, and risk management. Previous studies of deterministic implied volatility functions (DIVFs) propose two parameters, moneyness and time to maturity, to estimate implied volatility. Recent DIVF models have included factors such as a moving average ratio and relative bid-ask spread but fail to enhance modeling accuracy. The current study offers a generalized DIVF model by including a momentum indicator for the underlying asset using a relative strength index (RSI) covering multiple time resolutions as a factor, as momentum is often used by investors and speculators in their trading decisions, and in contrast to volatility, RSI can distinguish between bull and bear markets. To the best of our knowledge, prior studies have not included RSI as a predictive factor in modeling IV. Instead of using a simple linear regression as in previous studies, we use a machine learning regression algorithm, namely random forest, to model a nonlinear IV. Previous studies apply DVIF modeling to options on traditional financial assets, such as stock and foreign exchange markets. Here, we study options on the largest cryptocurrency, Bitcoin, which poses greater modeling challenges due to its extreme volatility and the fact that it is not as well studied as traditional financial assets. Recent Bitcoin option chain data were collected from a leading cryptocurrency option exchange over a four-month period for model development and validation. Our dataset includes short-maturity options with expiry in less than six days, as well as a full range of moneyness, both of which are often excluded in existing studies as prices for options with these characteristics are often highly volatile and pose challenges to model building. Our in-sample and out-sample results indicate that including our proposed momentum indicator significantly enhances the model's accuracy in pricing options. The nonlinear machine learning random forest algorithm also performed better than a simple linear regression. Compared to prevailing option pricing models that employ stochastic variables, our DIVF model does not include stochastic factors but exhibits reasonably good performance. It is also easy to compute due to the availability of real-time RSIs. Our findings indicate our enhanced DIVF model offers significant improvements and may be an excellent alternative to existing option pricing models that are primarily stochastic in nature.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fe747abb2807e18f7ac0d292aafd893d",
  "timestamp": "2025-05-15T02:05:08.082097"
}