{
  "id": 4797,
  "title": "Impact of climate risk on financial performance - evidence from select energy companies from select G-20 countries",
  "abstract": "PurposeThe recent meeting of G-20 world leaders, held in New Delhi, in 2023, highlighted that the physical effect of climate change has considerable macro-economic costs at the national and global levels and they have also pledged to accelerate the clean, sustainable and inclusive energy transition along a variety of pathways. Climate change could pose various emerging risks to the firm's operational and financial activities, specifically for those which are belonging to the energy sector. Thus, this study aims to investigate the impact of climate risks on the financial performance of select energy companies from G-20 countries.Design/methodology/approachThe study considered 48 energy companies from G-20 countries as the sample for the period of 2017 to 2021. To measure the climate change-related physical risks, the study has considered the ND-GAIN climate vulnerability score and the firm's financial performance has been measured by return on assets, return on equity, return on capital used and price-to-book ratio. To examine the impact of climate risks on the financial performance of the sample companies, the authors have used pooled ordinary least squares (OLS) and fixed/random effect regression analysis and required data diagnosis tests are also performed.FindingsThe empirical results suggested that climate risks negatively impacted the financial performance of the sample companies. The market performances of the firms are also being impacted by the physical climate change. The results of panel data regression analysis also confirmed the robustness of the empirical results derived from the pooled OLS analysis suggesting that firms that operated in a less climate-risky country, financially performed better than the firms that operated in a more climate-risky country.Practical implicationsThe paper has significant practical implications like it could be helpful for the policymakers, investors, suppliers, researchers and other stakeholders in developing deeper insights about the impact of climate risks on the energy sectors from an international perspective. This study may also help the policymakers in developing policies for the management of climate risk for the energy sector.Originality/valueThis study adds insights to the existing literature in the area of climate risks and firm's financial performance. Moreover, this may be the first study that attempts to evaluate the impact of climate risks on the financial performance of select energy companies from the G-20's perspective.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fe86449ac04e86ec5cf57d80c7858374",
  "timestamp": "2025-05-15T02:41:00.897986"
}