{
  "id": 7529,
  "title": "Effects of Maternal Stress on Low Birth Weight and Preterm Birth Outcomes Across Neighborhoods of South Carolina, 2000-2003",
  "abstract": "Objective Studies evaluating the effect of maternal stress on preterm birth (PTB) or low birth weight (LBW) and variations across neighborhood contexts have been inconclusive. The purpose of the study was to examine the relationships among neighborhood contexts, prenatal stress, and birth outcomes, and to further explore the modifying effects of neighborhood contexts. Methods We evaluated this objective by using South Carolina Pregnancy Risk Assessment and Monitoring System (PRAMS), 2000-2003 data linked to the 2000 U.S. census data for 8064 women (N = 8064). Principal component analysis with varimax rotation was used to group stress constructs into four main domains (Financial, Emotional, Traumatic, and Spousal-related). We used multilevel logistic regression analysis to estimate the adjusted odds ratio for different models. Results Maternal stress was significantly associated with increased risks of low birth weight and preterm deliveries. Neighborhood high poverty and low education (upper quartiles) were independently associated with low birth weight but not preterm deliveries and stress appeared as a partial mediator of contextual effects on birth outcomes. The interaction models showed that the relationship between stress and LBW or PTB was modified by neighborhood contexts with risks being greater for infants born in disadvantaged neighborhoods. Conclusions Effects of maternal stress on LBW and PTB outcomes may be different for mothers living in different neighborhood contexts. Therefore, investigations that fail to examine places of residence would most likely not identify mothers at risk of LBW or PTB. Policies to improve birth outcomes need to target both places of residence and specific mediating or moderating factors associated with deprived neighborhoods of residence.",
  "year": 2010,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fe988eae021a88b405d4c74eac46174a",
  "timestamp": "2025-05-15T03:09:36.879110"
}