{
  "id": 4673,
  "title": "A preliminary investigation of farm-level risk factors for cattle condemnation at the slaughterhouse: A case-control study on French farms",
  "abstract": "The financial impact of condemnation for farmers and the importance of efficiency in the meat inspection process to guarantee food safety are well known. Identifying farm-level risk factors for condemnation are useful in order to find a way for farmers to potentially reduce their condemnation rates and to build a risk-based farm classification for veterinary services to target both meat inspection and farms inspections. To our knowledge, this has not yet been done, probably due to a lack of available meat inspection data. A preliminary investigation was performed through a case-control study on 36 French farms, from a dairy production region to identify farm-level risk factors for high condemnation rates (i.e. more than 45% of cattle with at least one portion of the carcass condemned). Multivariable exact logistic regression was performed to take into account the small sample size. The final model identified two significant risk factors. The odds of having a high condemnation rate was at least twice as greater for farmers who did not adhere to the quality charter of an international retailer and was significantly higher when the most qualified worker on the farm had a degree in agriculture. This latter effect was unexpected and is reviewed in the discussion section. The protective effect of the quality charter could be explained by the annual control of farms performed to guarantee compliance with good farming practices in the adhering farms. It led us to believe that compliance with well known good farming practices could be a way for farmers to reduce their condemnation rates. This study is a preliminary investigation performed on a small sample size of farms that were mainly dairy farms. It is a first step for further investigations that need to be done on this topic at a larger scale to fill the current lack of knowledge. (C) 2013 Elsevier B.V. All rights reserved.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fea856223854ad8b510c89a864b80d73",
  "timestamp": "2025-05-15T02:39:57.425606"
}