{
  "id": 6409,
  "title": "Prospective cohort studies of coronary heart disease in the UK: a systematic review of past, present and planned studies",
  "abstract": "Background Prospective cohort studies have made enormous contributions to our understanding of coronary heart disease (CHD) epidemiology in the UK. However, identification of cohorts and dissemination of key characteristics and results can be haphazard, and it is difficult to identify studies which are at the planning stage. Methods We carried out a systematic review of cohort studies by searching MEDLINE and relevant websites and consulting key individuals. We included all large prospective UK cohort studies that focused on the development of CHD in predominantly healthy subjects. Results The MEDLINE search retrieved 1558 hits and we identified 39 cohorts that met inclusion criteria. 'Early' cohorts were important in defining the major risk factors for CHD, particularly smoking, cholesterol, blood pressure, physical activity and body mass index. Prospective cohort studies have subsequently appraised potentially important novel risk factors including nutritional status, genetic determinants, haemostatic factors, lipid sub-fractions, psychosocial factors and the 'life course' perspective. Psychosocial factors have been relatively neglected, as have women, ethnic minorities and the elderly. Key methodological issues include minimizing losses to follow up, standardized measurements, quality assurance systems, change in risk factors over time, residual confounding, regression dilution bias, detection of non-fatal events, measurement of quality of life, and generalizability. Conclusions The current and proposed prospective UK cohorts have sufficient power potentially to determine the importance of many traditional and newer CHD risk factors on cardiovascular risk in men, women and even ethnic minorities. However, secure financial support and hence sustainability will remain essential to maximize long-term benefits. (C) 2003 Lippincott Williams Wilkins.",
  "year": 2003,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fea9198a84a2f5d846f6c75c2c88d12e",
  "timestamp": "2025-05-15T02:57:38.864139"
}