{
  "id": 2693,
  "title": "Simulation of sovereign CDS market based on interaction between market participant",
  "abstract": "A research for distributional property of financial asset is the subject of intense interest not only for financial theory but also for practitioner. Such respect is no exception to CDS market. The CDS market, which began to receive attention since the global financial debacle, is not well researched despite of the importance of research necessity. This research introduces creation of CDS market and use Ising system utilizing occurrence characteristics (to shift risk) as an important factor. Therefore the results of this paper would be of great assistance to both financial theory and practice. From this study, not only distributional property of the CDS market but also various statistics like multifractal characteristics could promote understanding about the market. A salient point in this study is that countries are mainly clustering into 2 groups and it might be because of market situation and geographical characteristics of each country. This paper suggested 2 simulation parameters representing this market based on understanding such CDS market situation. The estimated parameters are suitable for high and low risk event of CDS market respectively and these two parameters are complementary and can cover not only basic statistics but also multifractal properties of most countries. Therefore these estimated parameters can be used in researches preparing for a certain event (high or low risk). Finally this research will serve as a momentum double-checking indirectly the performance of Ising system based on these results. (C) 2017 Elsevier B.V. All rights reserved.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fea92a0a19d06bc724efcef8cb956555",
  "timestamp": "2025-05-15T02:18:06.217996"
}