{
  "id": 9344,
  "title": "Evaluating Primary Treatment for People with Advanced Glaucoma Five-Year Results of the Treatment of Advanced Glaucoma Study",
  "abstract": "Purpose: To determine whether primary trabeculectomy or medical treatment produces better outcomes in terms of quality of life (QoL), clinical effectiveness, and safety in patients with advanced glaucoma. Design: Multicenter randomized controlled trial. Participants: Between June 3, 2014, and May 31, 2017, 453 adults with newly diagnosed advanced open- angle glaucoma in at least 1 eye (Hodapp classification) were recruited from 27 secondary care glaucoma departments in the United Kingdom. Two hundred twenty-seven were allocated to trabeculectomy, and 226 were allocated medical management. Methods: Participants were randomized on a 1:1 basis to have either mitomycin C-augmented trabeculectomy or escalating medical management with intraocular pressure (IOP)-reducing drops as the primary intervention and were followed up for 5 years. Main Outcome Measures: The primary outcome was vision-specific QoL measured with the 25-item Visual Function Questionnaire (VFQ-25) at 5 years. Secondary outcomes were general health status, glaucoma-related QoL, clinical effectiveness (IOP, visual field, and visual acuity), and safety. Results: At 5 years, the mean +/- standard deviation VFQ-25 scores in the trabeculectomy and medication arms were 83.3 +/- 15.5 and 81.3 +/- 17.5, respectively, and the mean difference was 1.01(95% confidence interval [CI],-1.99 to 4.00; P = 0.51). The mean IOPs were 12.07 +/- 5.18 mmHg and 14.76 +/- 4.14 mmHg, respectively, and the mean difference was-2.56 (95% CI,-3.80 to-1.32; P < 0.001). Glaucoma severity measured with visual field mean deviation were-14.30 +/- 7.14 dB and-16.74 +/- 6.78 dB, respectively, with a mean difference of 1.87 (95% CI, 0.87-2.87 dB; P < 0.001). Safety events occurred in 115 (52.2%) of patients in the trabeculectomy arm and 124 (57.9%) of patients in the medication arm (relative risk, 0.92; 95% CI, 0.72-1.19; P = 0.54). Serious adverse events were rare. Conclusions: At 5 years, the Treatment of Advanced Glaucoma Study demonstrated that primary trabeculectomy surgery is more effective in lowering IOP and preventing disease progression than primary medical treatment in patients with advanced disease and has a similar safety profile. Financial Disclosure(s): Proprietary or commercial disclosure may be found in the Footnotes and Disclosures at the end of this article. Ophthalmology 2024;131:759-770 (c) 2024 by the American Academy of Ophthalmology. This is an open access article under the CC BY license (http://creativecommons.org/licenses/by/4.0/).",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fea90f4d709c4a6dbdcedc39cf03b7de",
  "timestamp": "2025-05-15T03:27:53.379497"
}