{
  "id": 9425,
  "title": "Estimation of the susceptibility of a road network to shallow landslides with the integration of the sediment connectivity",
  "abstract": "Landslides cause severe damage to the road network of the hit zone, in terms of both direct (partial or complete destruction of a road or blockages) and indirect (traffic restriction or the cut-off of a certain area) costs. Thus, the identification of the parts of the road network that are more susceptible to landslides is fundamental to reduce the risk to the population potentially exposed and the financial expense caused by the damage. For these reasons, this paper aimed to develop and test a data-driven model for the identification of road sectors that are susceptible to being hit by shallow landslides triggered in slopes upstream from the infrastructure. This model was based on the Generalized Additive Method, where the function relating predictors and response variable is an empirically fitted smooth function that allows fitting the data in the more likely functional form, considering also non-linear relations. This work also analyzed the importance, on the estimation of the susceptibility, of considering or not the sediment connectivity, which influences the path and the travel distance of the materials mobilized by a slope failure until hitting a potential barrier such as a road. The study was carried out in a catchment of northeastern Oltrepo Pavese (northern Italy), where several shallow landslides affected roads in the last 8 years. The most significant explanatory variables were selected by a random partition of the available dataset in two parts (training and test subsets), 100 times according to a bootstrap procedure. These variables (selected 80 times by the bootstrap procedure) were used to build the final susceptibility model, the accuracy of which was estimated through a 100-fold repetition of the holdout method for regression, based on the training and test sets created through the 100 bootstrap model selection. The presented methodology allows the identification, in a robust and reliable way, of the most susceptible road sectors that could be hit by sediments delivered by landslides. The best predictive capability was obtained using a model in which the index of connectivity was also calculated according to a linear relationship, was considered. Most susceptible road traits resulted to be located below steep slopes with a limited height (lower than 50 m), where sediment connectivity is high. Different land use scenarios were considered in order to estimate possible changes in road susceptibility. Land use classes of the study area were characterized by similar connectivity features. As a consequence, variations on the susceptibility of the road network according to different scenarios of distribution of land cover were limited. The results of this research demonstrate the ability of the developed methodology in the assessment of susceptible roads. This could give the managers of infrastructure information about the criticality of the different road traits, thereby allowing attention and economic budgets to be shifted towards the most critical assets, where structural and non-structural mitigation measures could be implemented.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "feaa9d2ddbeb26cf1e6ecac283561fcc",
  "timestamp": "2025-05-15T03:28:46.273351"
}