{
  "id": 8289,
  "title": "Factors associated with health insurance ownership among women of reproductive age: A multicountry study in sub-Saharan Africa",
  "abstract": "BackgroundPromoting the coverage and ownership of health insurance constitutes a key strategy to achieving universal healthcare, thereby meeting the Sustainable Development Goal (SDG 3.8) of safeguarding the vulnerable population from financial risk resulting from catastrophic health expenditures. In sub-Saharan Africa, accessing medical services is particularly challenging among women due to inadequate opportunities for socio-economic empowerment and meeting their unique healthcare needs. The present study aimed to explore the sociodemographic factors associated with health insurance ownership among women in selected countries in sub-Saharan Africa. MethodsWe extracted cross-sectional data on health insurance ownership and conceptually relevant sociodemographic variables on women aged 15-49 years from Demographic and Health Surveys on five selected countries in sub-Saharan Africa (n = 55,438), including Burkina Faso, DR Congo, Cameroon, Gabon and Kenya. Data were analyzed using descriptive and multivariate regression analysis, and the associations were reported in terms of average marginal effects. ResultsData revealed considerable cross-country variation in health insurance ownership: Gabon (57.9%), Kenya (6.1%), DR Congo (2.8%), Cameroon (1.1%), Burkina Faso (0.4%). In the multivariate regression analysis, women's age, marital status, place of residency, educational level, household wealth status, employment, and media access were significant predictors of insurance ownership. The associations were generally similar across the five countries, with higher age, better educational level and wealth status showing a consistently positive relationship with insurance ownership. ConclusionOur findings revealed striking inequality in health insurance ownership among the studied countries, which should be given due attention to achieving universal healthcare-related goals. There also exist considerable sociodemographic disparities in health insurance ownership among women that should be addressed using context-specific programmatic interventions. Our findings revealed striking inequality in health insurance ownership among the studied countries, which should be given due attention to achieving universal healthcare-related goals. There also exist considerable sociodemographic disparities in health insurance ownership among women that should be addressed using context-specific programmatic interventions.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fec5051aa20a233252a35d794f4ebe63",
  "timestamp": "2025-05-15T03:17:21.543827"
}