{
  "id": 3684,
  "title": "A Study of Multifactor Quantitative Stock-Selection Strategies Incorporating Knockoff and Elastic Net-Logistic Regression",
  "abstract": "In the data-driven era, the mining of financial asset information and the selection of ap-propriate assets are crucial for stable returns and risk control. Multifactor quantitative models are a common method for stock selection in financial assets, so it is important to select the optimal set of factors. Elastic Net, which combines the benefits of the L1 and L2 penalty terms, performs better at filtering features due to the complexity of the features in high-dimensional datasets than Lasso and Ridge regression. At the same time, the false discovery rate (FDR), which is important for making reliable investment decisions, is not taken into account by the current factor-selection methodologies. Therefore, this paper constructs the Knockoff Logistic regression Elastic Net (KF-LR-Elastic Net): com-bining Logistic regression with Elastic Net and using Knockoff to control the FDR of variable selection to achieve factor selection. Based on the selected factors, stock returns are predicted under Logistic re-gression. The overall model is denoted as Knockoff Logistic regression Elastic Net-Logistic regression (KL-LREN-LR). The empirical study is conducted with data on the CSI 300 index constituents in the Chinese market from 2016-2022. KF-LREN-LR is used for factor selection and stock-return forecasting to select the top 10 stocks and establish an investment strategy for daily position changing. According to empirical evidence, KF-LR-Elastic Net can select useful factors and control the FDR, which is helpful for increasing the accuracy of factor selection. The KF-LREN-LR forecast portfolio has the advantages of high return and controlled risk, so it is informative for optimizing asset allocation.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fec853a6f32d5d7a421f561019bf8d69",
  "timestamp": "2025-05-15T02:29:00.126752"
}