{
  "id": 8539,
  "title": "Prevalence and factors associated with the development of antenatal and postnatal depression among Jordanian women",
  "abstract": "Objectives: to investigate the prevalence of depression during pregnancy and postpartum period for Jordanian women and identify associated risk factors and maternity service delivery issues. Design: a prospective cross-sectional study. Participants were recruited during the last trimester of pregnancy, provided personal, social and obstetric information, and completed the Edinburgh Postnatal Depression Scale (EPDS), Depression Anxiety and Stress Scale (DASS-21), the Maternity Social Support Scale (MSSS), the Cambridge Worry Scale (CWS), Perceived Self-Efficacy Scale (PSES) and Perceived Knowledge Scale (PKS). All participants were contacted again at six-eight weeks and six months post partum to complete a telephone or face-to-face interview. The postnatal questionnaire included the EPDS, MSSS, and DASS-21. Setting: a teaching hospital and five health centres in Irbid city in northern Jordan. Participants: Arabic speaking women (n=353) between the ages of 18 and 45 years, in their last trimester of pregnancy, at low risk for obstetric complications and receiving antenatal care between November 2005 and August 2006. Findings: high rates of antenatal (19%) and postnatal depression (22%) were reported. A regression analysis revealed that stress, anxiety, financial problems, perceived lack of parenting knowledge, difficult relationship with the mother-in-law, unplanned pregnancy, and low self-efficacy were associated with antenatal depression. These seven factors accounted for 83% (r(2) = 0.834) of variance in the development of probable antenatal depression. At six-eight weeks post partum, a regression analysis revealed that antenatal depression, unplanned pregnancy, difficult relationship with mother-in-law, dissatisfaction with overall care, stress, lack of social support, giving birth to a female baby, feeling pressured to birth the baby quickly, and perceived low parenting knowledge were associated with postnatal depression. These nine variables accounted for 82% (r(2) = 0.819) of variance in the development of probable PND. Three intrapartum and postpartum variables associated with PND at six-eight weeks (postpartum haemorrhage, unhelpful doctors during labour and birth, and anxiety) were no longer associated with PND at six months. Conclusions and implications for practice: Jordanian women need support to prepare for labour and birth. Postpartum emotional support and assessment of symptoms of depression needs to be incorporated into routine practice. The opportunity for open discussion along with increased awareness and clarification of common misconceptions about antenatal and postnatal depression are necessary. Quality assurance systems would help reduce the rate of invasive obstetric procedures, and give greater emphasis to emotional care provided to women during the perinatal period. (c) 2010 Elsevier Ltd. All rights reserved.",
  "year": 2011,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "feca9005464d2c360e8a10cd51f4fde0",
  "timestamp": "2025-05-15T03:19:52.129533"
}