{
  "id": 3965,
  "title": "Improving the potential of fifth-generation district heating and cooling networks through robust design and operational optimization under future energy market and demand uncertainties",
  "abstract": "Network investments and projected energy prices greatly impact the financial viability and environmental impact of fifth-generation district heating and cooling (5GDHC) networks. Compared to the previous generation, the upfront investment costs in 5GDHC networks are relatively high due to the decentralized energy demand and supply of the participating prosumers. The transition to 5GDHC is also hindered by uncertain energy markets and the fluctuating energy demands of the prosumers. It makes investors hesitant to commit, even for promising business cases. In this work, a framework is presented to assess the economic and environmental performance of a 5GDHC business case, based on a multi-objective robust optimization algorithm (MO-RDO), to identify the optimal trade-offs between environmental and economic designs. The proposed methodology consists of four steps. In the first two steps, a specific business case is modeled, and techno-economic and environmental performances are analyzed against uncertain energy markets. In the third step, the technoeconomic and environmental indicator responses are used to develop a data-driven machine-learning model. This model offers better computational efficiency than a high-fidelity nonlinear model and assesses the most influential parameters driving economic and environmental performance via a global sensitivity analysis. This aids in refining the multi-objective robust design optimization (MO-RDO) framework by pinpointing key design variables and objectives amid data uncertainties. Additionally, the formulated MO-RDO provides a mix of environmentally and economically optimal network designs and operational parameters and highlights the trade-offs between them. The designs and trade-offs are evaluated using financial metrics like net present value (NPV), return on investment, and discounted payback period. These metrics are calculated over the project life, considering the initial investment and net savings. For the considered case, the environmental design has a 10% higher investment cost compared to the economically optimal solution but reduces total emissions (TE) by 13% and improves operational cost savings, which is crucial for better financial indicators. The proposed framework aligns with the EU transition plan to incorporate waste energy sources and decarbonization paths, estimating only a 3% increase in NPV as a risk for the environmentally optimal solution on a financial scale.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fecf0494c5775e05e7b0c92eb0b8b3c4",
  "timestamp": "2025-05-15T02:31:58.578188"
}