{
  "id": 415,
  "title": "A Deep Learning-Based Approach to Constructing a Domain Sentiment Lexicon: a Case Study in Financial Distress Prediction",
  "abstract": "Financial text mining has been widely viewed as a promising approach to analyzing questions related to financial issues. However, only a few studies have ever emphasized constructing financial domain sentiment lexicons, especially in a Chinese financial context. In light of this gap in research, the purpose of this study is to generate a Chinese financial domain sentiment lexicon (CFDSL). Then, that lexicon is applied to financial distress prediction (FDP). This study proposes a deep learning-based framework to construct a domain sentiment lexicon, employing words vector models and deep learning-based classifiers in the process. To evaluate the effectiveness of the CFDSL, this study applies the lexicon to analyzing annual reports; sentiment features are also regarded as predictive factors in FDP. The experiment results indicate that deep learning-based models can achieve satisfactory results in generating a CFDSL that mainly covers four aspects of sentiment words, including capital markets, stock markets, companies' internal business conditions and politics. This study also discovers that sentiment features that are calculated four years prior to the predicted benchmark year enable the optimum performance. In addition, CFDSL-based sentiment features show advantages in FDP, compared with other lexicons. This study makes a novel contribution to existing research, as it expands the method of constructing financial domain sentiment lexicons. This paper also provides new findings that can have significant implications for the provision of early warning signals of Chinese listed companies' financial risk.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fed685a70b386c78d959474c85520bd2",
  "timestamp": "2025-05-15T01:37:32.590428"
}