{
  "id": 2101,
  "title": "Risk assessment in granting credit by non-financial legal entities",
  "abstract": "Purpose: This study aimed to verify risk assessment procedures when granting credit by a legal entity via financing in negotiations with its customers. Methodology: A documentary approach was used, emphasizing qualitative analysis, during the experimental study conducted at an XYZ organization linked to information technology. Results: They point out that the credit score and rating score, established through the evaluation stages, taking into account the company's history, documentation, guarantees, financial health, cash flow, indebtedness, corporate governance, and market prospects, enable the risk classification of their analyzed clients, ranging from AAA for the alpha client to D for the beta client. This result made it possible to deduce that credit assessment is appropriate automation in financing decisions for commercial activities, capable of promoting financial flexibility and commercial agility. Customer risk classification is therefore seen as a fundamental tool for improving XYZ's financial decisions, minimizing default risks, and guaranteeing the financial security of its commercial operations, resulting from establishing risk scores for both defaulting and non-defaulting companies. Contributions of the Study: This study makes a relevant theoretical contribution to the field of research by highlighting the importance of validating the criteria used in granting financing, as well as the contextual factors that can affect decisions. The practical contribution of analyzing a non-financial institution under the pandemic context and how they minimize their default by establishing credit analysis mechanisms provides improvements and consequently greater security as lenders.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fee50b401c631236932435dc32436ed5",
  "timestamp": "2025-05-15T02:10:59.103846"
}