{
  "id": 5505,
  "title": "Research on the Factors Affecting the Risk Premium of China's Green Bond Issuance",
  "abstract": "Green bonds have both bond and green attributes and are one of the important financing tools for green financial markets. The green bond risk premium directly reflects the financing cost of bond issuers and the capital gains of investors. A reasonable risk premium is the key to the successful issuance and trading of green bonds. Therefore, this paper studies the factors affecting the risk premium of China's green bond issuance, aiming to provide a basis for determining a more reasonable risk premium. Based on the primary issuance market of green bonds, this paper takes into account the macro- and microscopic cross-sectional data of green bond issuance and comprehensively considers the main factors affecting the green bond risk premium from macro-influence factors, micro-influence factors, and green attribute factors. An empirical study of the factors affecting the risk premium of China's green bond issuance was conducted using multivariate statistical regression analysis. The study found that the green attribute factor affecting the risk premium of green bonds is third-party green assessment certification. The bond factors affecting the risk premium of green bond issuance mainly include debt credit rating, issue period, and issue size, all of which affect the risk of green bond issuance. The issuer factors affecting the risk premium of green bonds include debt principal, nature of property rights, and return on net assets. The macro factor affecting the risk premium of green bonds is the current market interest rate.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "feeb52a35bde3f58023e36d0e0a8b42b",
  "timestamp": "2025-05-15T02:48:23.809155"
}