{
  "id": 134,
  "title": "A Fast-Warning Method of Financial Risk Behavior Based on BP Neural Network",
  "abstract": "With the speedy development of economy, there are many issues in business enterprise finance, and organization finance is going through large risks. With more and more complicated market environment, the uncertainty danger of business enterprise operation intensifies, and economic crises happen frequently. The monetary disaster of a company regularly shows that there can also be a complete crisis. Once the organization is deeply in economic crisis, it can also now not be capable to make certain the ordinary capital chain of the enterprise, and in serious cases, it may also have an effect on the sustainable operation of the agency or even make the employer bankrupt and liquidate. Therefore, we have to set up a best financial catastrophe early warning model to prevent and control the occurrence of economic disaster risk. BP neural network can, quite in shape nonlinear feature relationship, have true gaining knowledge of adaptability, excessive parallel computing and statistics processing ability. In view of the actual state of affairs of commercial enterprise, business enterprise and economic risk, the BP neural community algorithm is used to predict agency financial risk and a hazard prediction model in particular primarily based on BP neural community is established. The simulation consequences exhibit that the accuracy and correctness of economic hazard conduct early warning primarily based on BP neural network are 91.51% and 95.28%, respectively. It is proved that the fast-warning approach of economic threat that is conducted primarily based on BP neural network has excessively taken a look at the accuracy and robust cognizance ability.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "feef5763b5a3290a08351b4aad821dc5",
  "timestamp": "2025-05-15T01:47:14.085925"
}