{
  "id": 43,
  "title": "A New Perspective on Financial Risk Prediction in a Carbon-Neutral Environment: A Comprehensive Comparative Study Based on the SSA-LSTM Model",
  "abstract": "Climate change is widely acknowledged as the paramount global challenge of the 21st century, bringing economic, social, and environmental impacts due to rising global temperatures, more frequent extreme weather events, and ecosystem disturbances. To combat this, many countries target net-zero carbon emissions by 2050, reshaping both the financial system and consumption patterns. This transition has sharpened the financial sector's focus on climate-related risks, making the carbon footprint, environmental benefits of investments, and sustainability of financial products critical to investors' decisions. However, conventional risk prediction methods may not fully capture these climate-associated risks in a carbon-neutral setting. Emerging from this context is the need for innovative predictive tools. Recently, Long Short-Term Memory networks (LSTM) have gained prominence for their efficacy in time-series forecasting. Singular Spectrum Analysis (SSA), effective for extracting time series patterns, combined with LSTM as SSA-LSTM, offers a potentially superior approach to financial risk prediction. Our study, focusing on a case study of the wind energy sector in China, situates itself within the growing body of research focusing on the integration of environmental sustainability and financial risk management. Leveraging the capabilities of SSA-LSTM, we aim to bridge the gap in the current literature by offering a nuanced approach to financial risk prediction in the carbon-neutral landscape. This research not only reveals the superiority of the SSA-LSTM model over traditional methods but also contributes a robust framework to the existing discourse, facilitating a more comprehensive understanding and management of financial risks in the evolving carbon-neutral global trend.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ff001293a6556102b1e17a0769541610",
  "timestamp": "2025-05-15T01:33:11.339286"
}