{
  "id": 6605,
  "title": "CONCEPTUAL FUNDAMENTALS OF ORGANIZATIONAL AND ECONOMIC MECHANISM FORMATION OF ECONOMIC SUSTAINABILITY MANAGEMENT OF A TELECOMMUNICATION ENTERPRISE",
  "abstract": "Modern telecommunications companies operate in conditions of risk and uncertainty due to both external and internal factors. Due to the influence of various factors, companies may find themselves in a state of crisis due to the lack of a management mechanism, the main purpose of which is to ensure economic stability and efficiency based on sustainable capacity building. The purpose of this article is to identify the factors that affect the economic stability of telecommunications enterprises in Ukraine, and study their impact on the integrated indicator in order to form an organizational and economic mechanism for managing economic stability. The study was carried out using the following methods: analysis, synthesis, generalization, systematization, correlation and regression analysis. The main tendencies of Ukrainian telecommunication networks development are defined in this research. It is established that the crisis conditions in the world and national economy have led to the development of organizational and economic mechanism for managing the economic stability of telecommunications enterprises. The key structural element of this mechanism is proposed to determine the assessment of economic stability based on the use of a set of balanced indicators. Based on correlation and regression analysis, a significant dependence of the overall integrated indicator of economic stability on the subscriber component, moderate - on the component of internal business processes and staff training and development and a weak inverse dependence on the financial component. It was proved an expediency of using multicollinearity to check the tightness of the relationship between the analyzed variables in the regression model.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ff05c8bdd033c1e62699188e4b7efe83",
  "timestamp": "2025-05-15T02:59:37.091766"
}