{
  "id": 791,
  "title": "Cross-border trade risk prediction model based on support vector machine",
  "abstract": "Exchange rate fluctuations in cross-border trade often increase the difficulty of risk management for enterprises, and traditional forecasting methods are difficult to accurately assess risk levels, thereby affecting the optimization of financial decisions. Therefore, this article designed a cross-border trade risk prediction model based on Support Vector Machines (SVM), mainly to solve the problem of financial uncertainty caused by exchange rate fluctuations. The study used SVM model to extract and analyze features from exchange rate data, economic indicators, and other related data, mapped the data to high-dimensional space using kernel function, and optimized hyperparameters using Bayesian optimization to achieve accurate prediction of cross-border trade risks. The experimental results showed that the accuracy of the designed model in high, medium, and low-risk classification was 92%, 81%, and 89%, respectively, with an average absolute error between 0.09 and 0.13, demonstrating high prediction accuracy and model stability. This model can effectively distinguish different risk categories and performs very well in handling high-risk and low-risk samples. The model also performs well in predicting stability and adaptability to exchange rate fluctuations, providing a reasonable reference range for risk management of cross-border trade enterprises.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ff1aa7af2b4617df34fdb8855ee9e0df",
  "timestamp": "2025-05-15T01:55:08.060194"
}