{
  "id": 6229,
  "title": "The Role of Social Support in Elder Financial Exploitation Using a Community Sample",
  "abstract": "Background and Objective: Social support is known to be an important protective factor against elder financial exploitation (FE), yet few empirical studies have examined the relationship between FE and distinct components of social support. Perceived social support, social network size, and interactions with close network members (positive and negative) were measured separately and tested as potential predictors of FE. Research Design and Methods: Three hundred and ninety-five community-dwelling adults aged 60 and older were recruited to complete a 90-minute survey and interview. We used OLS regression to examine the role of social support in FE. Other risk factors associated with FE including dependency, poor physical health, depression, cognition, and demographic characteristics were included as potential predictors. Results: Negative interactions with close network members predicted FE, and remained predictive when all other variables and social support factors were included in the model. Other social support factors were not unique predictors of FE. Discussion and Implications: Negative social interactions with close network members are important to assess and consider in FE prevention and intervention programs; relationships between social interactions and other risk factors warrant further attention.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ff2f74b9bbfbf3bf46011b2066bc6897",
  "timestamp": "2025-05-15T02:56:10.870783"
}