{
  "id": 3917,
  "title": "Temporal changes in global stock markets during COVID-19: an analysis of dynamic networks",
  "abstract": "Purpose COVID-19 evolved from a local health crisis to a pandemic and affected countries worldwide accordingly. Similarly, the impacts of the pandemic on the performance of global stock markets could be time-varying. This study applies a dynamic network analysis approaches to evaluate the evolution over time of the impact of COVID-19 on the stock markets' network. Design/methodology/approach Daily closing prices of 55 global stock markets from August 1, 2019 to September 10, 2020 were retrieved. This sample period was further divided into nine subsample periods for dynamic analysis purpose. Distance matrix based on long-range correlations was calculated, using rolling window's length of 100 trading days, rolled forward at an interval of one month's working days. These distance matrices than used to construct nine minimum spanning trees (MSTs). Network characteristics were figured out, community detection and network rewiring techniques were also used for extracting meaningful from these MSTs. Findings The findings are, with the evolution of COVID-19, a change in co-movements amongst stock markets' indices occurred. On the 100th day from the date of reporting of the first cluster of cases, the co-movement amongst the stock markets become 100% positively correlated. However, the international investor can still get better portfolio performance with such temporal correlation structure either avoiding risk or pursuing profits. A little change is observed in the importance of authoritative node; however, this central node changed multiple times with change of epicenters. During COVID-19 substantial clustering and less stable network structure is observed. Originality/value It is confirmed that this work is original and has been neither published elsewhere, nor it is currently under consideration for publication elsewhere.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ff33d5bac94dc5ecadd2a7a5df44b97e",
  "timestamp": "2025-05-15T01:22:11.865647"
}