{
  "id": 7550,
  "title": "Postnatal depression and socio-demographic risk: factors associated with Edinburgh Depression Scale scores in a metropolitan area of New South Wales, Australia",
  "abstract": "Objective: The aim of this study was to determine the prevalence and risk factors for postnatal depressive symptoms in women living in metropolitan Sydney, Australia. Method: A population-based cross-sectional study of mothers of newborn infants was undertaken during home and community clinic visits in South West Sydney from 2000 to 2004. A comprehensive 45 item survey questionnaire was completed by 29 405 mothers. A self-report Edinburgh Postnatal Depression Scale (EPDS) of depressive symptoms was completed by 25 455 mothers at the first child and family nurse visit. The primary study outcome measures were EPDS scores greater than 9 and greater than 12. Results: At a mean infant age of 2.16 weeks the prevalence of EPDS >9 was 12% and EPDS >12 was 6.2%. Results from multiple logistic regression revealed that EPDS >9 and EPDS >2 were associated with a maternal country of birth other than Australia, difficult financial situation, living in the suburb one year or less, 'no regret leaving the suburb', unplanned pregnancy, not breastfeeding, and poor rating of mother's own health. Other social demographic factors such as marital status, maternal age, education of mother, or being Aboriginal or a Torres Strait Islander show no significant association with postnatal depressive symptoms. Conclusions: The results confirm prevalence rates and maternal individual-level risk factors from previous studies. The study contributes to the limited number of studies of postnatal depression and socio-demographic factors. Neighbourhood and community group-level factors may be important and should be studied further.",
  "year": 2011,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ff3a3b9737891059aee390e52d882701",
  "timestamp": "2025-05-15T03:09:36.954868"
}