{
  "id": 5086,
  "title": "Did Board Configuration Matter? The Case of US Subprime Lenders",
  "abstract": "Manuscript Type: Empirical Research Question/Issue: The origins of the global financial crisis have been attributed to the combination of a housing price bubble and innovative financial instruments, as well as the lack of restraint by corporate executives and boards to engage in excessive risk-taking. The rise in subprime lending between 1997 and 2005 played a crucial role in inflating the housing price bubble. We take a unique dataset of US financial institutions heavily engaged in subprime lending and ask the following research question: Did board configuration play a role in determining whether a financial institution specialized in subprime lending? Research Findings/Insights: We use a matched-pair sample of firms in the financial industry from 1997-2005 with half of the sample specializing in subprime lending and conduct panel data logistic regression analysis. We find that the board configurations of those financial institutions that engaged in subprime lending were significantly different from those that did not. Specifically, subprime lenders had boards that were busier, had less tenure, and were less diverse with respect to gender. Theoretical/Academic Implications: This study uses the group decision making perspective in the context of subprime lending to examine board of director configuration and its influence on decision making processes around the issue of risky subprime lending. Findings show that how boards were configured did influence the decision to specialize in subprime lending. We find robust support for predictions based on the group decision making perspective. Practitioner/Policy Implications: The deterioration of mortgage lending requirements that gave rise to the defaults of so many subprime loans, in retrospect, appears to be something that should have been entirely preventable. By demonstrating that subprime specialists had significant differences in board configuration that impacted group decision making, this study offers guidance to policymakers considering additional regulation and for corporate officers examining corporate governance issues.",
  "year": 2011,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ff49cb86acb51b2ae76342f3cc043d54",
  "timestamp": "2025-05-15T02:44:11.014894"
}