{
  "id": 5671,
  "title": "Assessing the Uncertainties of Simulation Approaches for Solar Thermal Systems Coupled to Industrial Processes",
  "abstract": "Industrial energy accounts for a large percentage of global consumption and, thus, it is a target for decarbonization by renewable and in particular solar energy adoption. Low uncertainty simulation tools can reduce the financial risk of solar projects, fostering the transition to a sustainable energy system. Several simulation tools are readily available to developers; differences exist in the format of input data and complexity of physical and numerical models. These tools can provide a variety of results from technical to financial and sensitivity analysis, often producing significant differences in yield assessment and uncertainty levels. IEA SHC Task 64/SolarPACES Task IV-Subtask C aims to address the lack of standard simulation tools for Solar Heating of Industrial Processes (SHIP) plants. This article describes the collaborative work developed by the researchers participating in the task. The identification and classification of several currently available simulation tools are performed on the basis of their capabilities and simulation approaches. A case study of solar heat supply to a copper mining operation is defined, allowing a comparison of the results produced by equivalent simulation tools. The proposed methodology identifies the main sources of differences among the simulation tools, the assessment of the deviation considering a series of statistical metrics for different time scales, and identifies their limitations and bias. The effects of physical characteristics of SHIP plants and different simulation approaches are discussed and quantified. The obtained results allow us to develop a basic guideline for a standardized yield assessment procedure with known uncertainties. Creating this common framework could partially reduce the risk perceived by the finance industry regarding SHIP systems.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ff6816a2f0d1f50e737dea6170526a55",
  "timestamp": "2025-05-15T02:50:21.166212"
}