{
  "id": 2703,
  "title": "NODE: a large-scale seismic risk prioritization tool for Italy based on nominal structural performance",
  "abstract": "Prioritization of seismic risk mitigation at a large scale requires rough-input methodologies able to provide an expedited, yet conventional, assessment of the seismic risk corresponding to the portfolio of interest. In fact, an evaluation of seismic vulnerability at regional level by means of mechanics-based methods is generally only feasible for a fraction of the portfolio, selected according to prioritization criteria, due to the sheer volume of information and computational effort required. Therefore, conventional assessment of seismic risk via simple indices has been proposed in literature and in some guidelines, mainly based on the comparison of code requirements at the time of design and current seismic demand. These indices represent an attempt to define a relative seismic risk measure for a rapid ranking to identify the part of the portfolio that deserves further investigation. Although these risk metrics are based on strong assumptions, they have the advantage of only requiring easy-to-retrieve data, such as design year and location as the bare minimum, making them suitable for applications within the risk analysis industry. Moreover, they can take both hazard and vulnerability into account, albeit conventionally, and can be manipulated in order to account for exposure in terms of individual or societal risks. In the present study, the main assumptions, limitations, and possible evolutions of existing prioritization approaches to nominal risk are reviewed, with specific reference to the Italian case. Furthermore, this article presents the software NODE (available to interested readers), which enables the computation of location-specific code-based seismic performance demands, according to the Italian code and the evolution of seismic classification since 1909. Finally, this study intends to contribute to the ongoing debate on strategies for large-scale seismic assessment for building stock management purposes.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ff69d3da3b3801fd01b02232930ca0bb",
  "timestamp": "2025-05-15T01:09:43.325036"
}