{
  "id": 9062,
  "title": "Reticular Pseudodrusen Status, ARMS2/ HTRA1 Genotype, and Geographic Atrophy Enlargement",
  "abstract": "Purpose: To determine whether reticular pseudodrusen (RPD) status, ARMS2/HTRA1 genotype, or both are associated with altered geographic atrophy (GA) enlargement rate and to analyze potential mediation of genetic effects by RPD status.Design: Post hoc analysis of an Age-Related Eye Disease Study 2 cohort.Participants: Eyes with GA: n = 771 from 563 participants.Methods: Geographic atrophy area was measured from fundus photographs at annual visits. Reticular pseudodrusen presence was graded from fundus autofluorescence images. Mixed-model regression of square root of GA area was performed by RPD status, ARMS2 genotype, or both.Main Outcome Measures: Change in square root of GA area.Results: Geographic atrophy enlargement was significantly faster in eyes with RPD (P < 0.0001): 0.379 mm/ year (95% confidence interval [CI], 0.329-0.430 mm/year) versus 0.273 mm/year (95% CI, 0.256-0.289 mm/ year). Enlargement was also significantly faster in individuals carrying ARMS2 risk alleles (P < 0.0001): 0.224 mm/ year (95% CI, 0.198-0.250 mm/year), 0.287 mm/year (95% CI, 0.263-0.310 mm/year), and 0.307 mm/year (95% CI, 0.273-0.341 mm/year) for 0, 1, and 2, respectively. In mediation analysis, the direct effect of ARMS2 genotype was 0.074 mm/year (95% CI, 0.009-0.139 mm/year), whereas the indirect effect of ARMS2 genotype via RPD status was 0.002 mm/year (95% CI,-0.006 to 0.009 mm/year). In eyes with incident GA, RPD presence was not associated with an altered likelihood of central involvement (P = 0.29) or multifocality (P = 0.16) at incidence. In eyes with incident noncentral GA, RPD presence was associated with faster GA progression to the central macula (P = 0.009): 157 gm/year (95% CI, 126-188 gm/year) versus 111 gm/year (95% CI, 97-125 gm/year). Similar findings were observed in the Age-Related Eye Disease Study.Conclusions: Geographic atrophy enlargement is faster in eyes with RPD and in individuals carrying ARMS2/ HTRA1 risk alleles. However, RPD status does not mediate the association between ARMS2/HTRA1 genotype and faster enlargement. Reticular pseudodrusen presence and ARMS2/HTRA1 genotype are relatively inde-pendent risk factors, operating by distinct mechanisms. Reticular pseudodrusen presence does not predict central involvement or multifocality at GA incidence but is associated with faster progression toward the central macula. Reticular pseudodrusen status should be considered for improved predictions of enlargement rate.Financial Disclosure(s): Proprietary or commercial disclosure may be found after the references. Ophthalmology 2023;130:488-500 Published by Elsevier on behalf of the American Academy of Ophthalmology",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ff6dcc3ffcb0447d13ca7634096907d4",
  "timestamp": "2025-05-15T03:24:55.054515"
}