{
  "id": 3108,
  "title": "Effects of financial incentives on volunteering for clinical trials: A randomized vignette experiment",
  "abstract": "Background: Financial incentives may aid recruitment to clinical trials, but evidence regarding risk/burdendriven variability in participant preferences for incentives is limited. We developed and tested a framework to support real-world decisions on recruitment budget. Methods: We included two phases: an Anchoring Survey, to ensure we could capture perceived unpleasantness on a range of life events, and a Vignette Experiment, to explore relationships between financial incentives and participants' perceived risk/burden and willingness to participate in high-and low-risk/burden versions of five vignettes drawn from common research activities. We compared vignette ratings to identify similarly rated life events from the Anchoring Survey to contextualize ratings of study risk. Results: In our Anchoring Survey (n = 643), mean ratings (scale 1 = lowest risk/burden to 5 = highest risk/ burden) indicated that the questions made sense to participants, with highest risk assigned to losing house in a fire (4.72), and lowest risk assigned to having blood pressure taken (1.13). In the Vignette Experiment (n = 534), logistic regression indicated that amount of offered financial incentive and perceived risk/burden level were the top two drivers of willingness to participate in four of the five vignettes. Comparison of event ratings in the Anchoring Survey with the Vignette Experiment ratings suggested reasonable concordance on severity of risk/ burden. Conclusions: We demonstrated feasibility of a framework for assessing participant perceptions of risk for study activities and discerned directionality of relationship between financial incentives and willingness to participate. Future work will explore use of this framework as an evidence-gathering approach for gauging appropriate incentives in real-world study contexts.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ff9103563cb38be34d9de197ca8fac45",
  "timestamp": "2025-05-15T02:22:25.197081"
}