{
  "id": 6629,
  "title": "Factors associated with the size of internal audit functions: evidence from Kuwait",
  "abstract": "Purpose - This study aims to examine whether the size of internal audit functions (IAFs) is significantly related to factors documented by related prior auditing research, namely, diffusion of ownership, firm size, affiliation to the financial services industry, proportion of assets in the form of receivables and inventory, audit committee's size and the presence of risk management committee. Design/methodology/approach - Using data related to companies listed on the Kuwait Stock Exchange, this study uses a regression model to examine research hypothesis related to factors predicted to have an association with the size of the firm's IAF. Findings - The results of the current study provide evidence of a significantly positive relation between the size of the IAF and firm's affiliation to the finance sector, audit committee's size and the presence of a separate risk management committee. Such empirical evidence, which stems from the Kuwaiti market, is expected to be valuable for regulators and policy makers as well as audit researchers interested in linking it to the international empirical findings about this issue documented in other audit markets. Originality/value - This study is original because it is the first to empirically examine factors associated with the size of IAFs in the GCC region, including Kuwait.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ff9419eea45e88b20a1fa9bd39ba44a2",
  "timestamp": "2025-05-15T03:00:04.983050"
}