{
  "id": 2412,
  "title": "Predictors of needs for families of children with cerebral palsy",
  "abstract": "Background: This study examined child, family and service characteristics that are predictors of family needs for community, financial, family support and services needs for families of children with cerebral palsy (CP). CP is a non-progressive neurological condition caused by lesions in the central nervous system resulting in limitations in motor function and associated co-morbid conditions. Children with CP often require multiple health, rehabilitation, and community services. Purpose: To identify risk and protective factors among predictors of needed resources and services (i. e. community, financial, family support) and to discuss implications for coordination of medical, rehabilitation, and community services for children with CP and their families. Methods: Secondary data analysis was conducted with a national dataset (n = 441) of mothers of children with CP. The average age of children was 10.7 years (SD = 4.5) and was distributed across the various Gross Motor Function Classification System levels. Four logistic regression models were conducted to examine predictive power of child, family and current service characteristics on needed resources and services. Results: Limited child gross motor function was a risk factor (odds ratio (OR): 1.30-1.70) while perception of family-centered services (FCS) was a protective factor (OR: 0.57-0.63) in having the needs met. Conclusion: Mothers of children with CP who are able to walk, reported strong family relationships, and perceived need-oriented and FCS expressed less needs for community, financial, family support and services' resources needs. Implications for service providers are provided.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ffa6e2c7487589996987886f8dc8e60d",
  "timestamp": "2025-05-15T02:14:50.388662"
}