{
  "id": 8247,
  "title": "Catastrophic long-term care expenditure: associated socio-demographic and economic factors",
  "abstract": "Objective An increasing number of persons across the world require long-term care (LTC). In Spain, access to LTC involves individuals incurring out-of-pocket (OOP) expenditure. There is a large body of literature on the incidence of catastrophic OOP payments in access and participation in health systems, but not in the field of LTC nor the determinants of these expenses. Our aim was to analyse the socio-demographic and economic factors associated with different levels of catastrophic LTC expenditure in the form of private out-of-pocket payments among dependent persons in Spain. Materials and methods The study used the Spanish Disability and Dependency Survey (SDDS) conducted by the Spanish National Statistics Institute to obtain the socioeconomic, demographic and health profiles. The households were classified into those below the poverty threshold and those above the threshold of catastrophe, using measures of impoverishment and catastrophe. We estimated two logistic regression models, one binary (impoverishment) and one ordinal (catastrophe). Results The results show that OOP expenditure on LTC increases the probability of impoverishment by 18.90%. The factors associated with higher probability of experiencing catastrophe were age, being single, widowed or separated, lower levels of household income and education, higher level of dependence and living in an autonomous community with lower per capita income. Conclusions These findings highlight the need to include exemptions or insurance in the design of LTC policies to protect dependent persons from the risk of financial burden.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ffad97966edb1365e09dbc1daf1dad8f",
  "timestamp": "2025-05-15T03:16:49.003327"
}