{
  "id": 8012,
  "title": "Burnout in podiatrists associated with individual characteristics, workplace and job satisfaction: A national survey",
  "abstract": "BackgroundBurnout is highly prevalent among health practitioners. It negatively impacts job performance, patient care, career retention and psychological well-being. This study aimed to identify factors associated with burnout among Australian podiatrists.MethodsData were collected from registered podiatrists via four online surveys administered annually from 2017 to 2020 as part of the Podiatrists in Australia: Investigating Graduate Employment (PAIGE) study. Information was collected about work history, job preferences, personal characteristics, health, personality, life experiences and risk-taking behaviours. Multiple logistic regression analyses were used to determine if (i) individual characteristics, (ii) workplace factors and (iii) job satisfaction measures were associated with burnout (based on the abbreviated Maslach Burnout Inventory).ResultsA total of 848 responses were included, with 268 podiatrists (31.6%) experiencing burnout. Participants experiencing burnout were slightly younger, more recent to practice, had poorer health, greater mental distress, lower scores for resilience, extraversion, agreeableness, conscientiousness, emotional stability and openness to experiences. They were less likely to have financial and clinical risk-taking behaviour and more likely to have career risk-taking behaviour. Prediction accuracy of these individual characteristic variables for burnout was 72.4%. Participants experiencing burnout were also more likely to work in private practice, have more work locations, work more hours, more direct patient hours, see more patients, have shorter consultation times, more likely to bulk bill chronic disease management plans, have less access to sick leave and professional development and be more likely to intend to leave patient care and the profession within 5 years than participants not experiencing burnout. Prediction accuracy of these workplace-related variables for burnout was 67.1%. Participants experiencing burnout were less satisfied with their job. Prediction accuracy of these variables for burnout was 78.8%.ConclusionsMany of the factors associated with burnout in Australian podiatrists are modifiable, providing opportunities to implement targeted prevention strategies. The strength of association of these factors indicates high potential for strategies to be successful.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ffaec0eafbcc9c74c26839cf72b5aade",
  "timestamp": "2025-05-15T03:14:07.350155"
}