{
  "id": 8753,
  "title": "Social determinants of health and COVID-19 recovery after inpatient rehabilitation",
  "abstract": "Background: Neighborhoods with more social determinants of health (SDOH) risk factors have higher rates of infectivity, morbidity, and mortality from COVID-19. Patients with severe COVID-19 infection can have long-term functional deficits leading to lower quality of life (QoL) and independence measures. Research shows that these patients benefit greatly from inpatient rehabilitation facilities (IRF) admission, but there remains a lack of studies investigating long-term benefits of rehabilitation once patients are returned to their home environment. Objective: To determine SDOH factors related to long-term independence and QoL of COVID-19 patients after IRF stay. Design: Multisite cross-sectional survey. Setting: Two urban IRFs. Main Outcome Measures: Primary outcome measures were Post-COVID Functional Status Scale (PCFS) and Short Form-36 (SF-36) scores. Secondary outcomes were quality indicator (QI) scores while at IRF and a health care access questionnaire. Results were analyzed using analysis of variance and multivariate logistic regression analyses. Results: Participants (n = 48) who were greater than 1 year post-IRF stay for severe COVID-19 were enrolled in the study. Higher SF-36 scores were associated with male gender (p = .002), higher income (>=$70,000, p = .004), and living in the city (p = .046). Similarly, patients who were of the male gender (p = .004) and had higher income (>=$70,000, p = .04) had a greater odds of a 0 or 1 on the PCFS. Age was not associated with differences. Women were more likely to seek follow-up care (p = .014). Those who sought follow-up care reported lower SF-36 overall and emotional wellness scores, p = .041 and p = .007, respectively. Commonly reported barriers to health care access were financial and time constraints. Conclusions: Patients with SDOH risk factors need to be supported in the outpatient setting to maintain functional gains made during IRF stays. Female gender, income, and urban setting are potential predictors for long-term QoL and independence deficits after rehabilitation for COVID-19 infection. Low emotional wellness is an indicator for patients to seek out care as far out as 1 year from their rehabilitation stay.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ffb60597d5bcbeea29b0865622f19ae7",
  "timestamp": "2025-05-15T03:21:56.696577"
}