{
  "id": 702,
  "title": "Unsupervised neural networks approach for understanding fraudulent financial reporting",
  "abstract": "Purpose - Creditor reliance on accounting-based numbers as a persistent and traditional standard to assess a firm's financial soundness and viability suggests that the integrity of financial statements is essential to credit decisions. The purpose of this paper is to provide an approach to explore fraudulent financial reporting (FFR) via growing hierarchical self-organizing map (GHSOM), an unsupervised neural network tail, to help capital providers evaluate the integrity of financial statements, and to facilitate analysis further to reach prudent credit decisions. Design/methodology/approach - This paper develops a two-stage approach: a classification stage that well trains the GHSOM to cluster the sample into subgroups with hierarchical relationship, and a pattern-disclosure stage that uncovers patterns of the common FFR techniques and relevant risk indicators of each subgroup. Findings - An application is conducted and its results show that the proposed two-stage approach can help capital providers evaluate the reliability of financial statements and accounting numbers-based decisions. Practical implications - Following the SOM theories, it seems that common FFR techniques and relevant risk indicators extracted from the GHSOM clustering result are applicable to all samples clustered in the same leaf node (subgroup). This principle and any pre-warning signal derived from the identified indicators can be applied to assessing the reliability of financial statements and forming a basis for further analysis in order to reach prudent decisions. The limitation of this paper is the subjective parameter setting of GHSOM. Originality/value - This is the first application of GHSOM to financial data and demonstrates an alternative way to help capital providers such as lenders to evaluate the integrity of financial statements, a basis for further analysis to reach prudent decisions. The proposed approach could be applied to other scenarios that rely on accounting numbers as a basis for decisions.",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ffb9421a06a8fa8cdd5126d0998b7993",
  "timestamp": "2025-05-15T01:53:59.451832"
}