{
  "id": 7907,
  "title": "Illnesses and hardship financing in India: an evaluation of inpatient and outpatient cases, 2014-18",
  "abstract": "BackgroundProgress towards universal health coverage requires strengthening the country's health system. In developing countries, the increasing disease burden puts a lot of stress on scarce household finances. However, this burden is not the same for everyone. The economic burden varies across the disease groups and care levels. Government intervention is vital in formulating policies in addressing financial distress at the household level. In India, even when outpatient care forms a significant proportion of out-of-pocket expenditure, government schemes focus on reducing household expenditure on inpatient care alone. Thus, people resort to hardship financing practices like informal borrowing or selling of assets in the event of health shocks. In this context, the present study aims to identify the disease(s) that correlates with maximum hardship financing for outpatients and inpatients and to understand the change in hardship financing over time.MethodsWe used two waves of National Sample Survey Organisation's data on social consumption on health- the 71(st) and the 75(th) rounds. Descriptive statistics are reported, and logistic regression is carried out to explain the adjusted impact of illness on hardship financing. Pooled logistic regression of the two rounds is estimated for inpatients and outpatients. Marginal effects are reported to study the changes in hardship financing over time.ResultsThe results suggest that cancer had the maximum likelihood of causing hardship financing in India for both inpatients (Odds ratio 2.41; 95% Confidence Interval (CI): 2.03 - 2.86 (71(st) round), 2.54; 95% CI: 2.21 - 2.93 (75(th) round)) and outpatients (Odds ratio 6.11; 95% CI: 2.95 - 12.64 (71(st) round), 3.07; 95% CI: 2.14 - 4.40 (75(th) round)). In 2018, for outpatients, the hardship financing for health care needs was higher at public health facilities, compared to private health facilities (Odds ratio 0.72; 95% CI: 0.62 - 0.83 (75(th) round). The marginal effects model of pooled cross-section analysis reveals that from 2014 to 2018, the hardship financing had decreased for inpatients (Odds ratio 0.747; 95% CI:0.80 - -0.70), whereas it had increased for outpatients (Odds ratio 0.0126; 95% CI: 0.01 - 0.02). Our results also show that the likelihood of resorting to hardship financing for illness among women was lesser than that of men.ConclusionGovernment intervention is quintessential to decrease the hardship financing caused by cancer. The intra-household inequalities play an important role in explaining their hardship financing strategies. We suggest the need for more financial risk protection for outpatient care to address hardship financing.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ffc4e8b74fdf27c6d8c91fbbe9d23189",
  "timestamp": "2025-05-15T03:13:04.992019"
}