{
  "id": 2021,
  "title": "Integrating Data Modality and Statistical Learning Methods for Earthquake-Induced Landslide Susceptibility Mapping",
  "abstract": "Earthquakes induce landslides worldwide every year that may cause massive fatalities and financial losses. Precise and timely landslide susceptibility mapping (LSM) is significant for landslide hazard assessment and mitigation in earthquake-affected areas. State-of-the-art LSM approaches connect causative factors from various sources without considering the fusion of different information at the data modal level. To exploit the complementary information of different modalities and boost LSM accuracy, this study presents a new LSM model that integrates data modality and machine learning methods. The presented method first groups causative factors into different modal types based on their intrinsic characteristics, followed by the calculation of the pairwise similarity of modal data. The similarities of different modalities are fused using nonlinear graph fusion to generate a unified graph, which is subsequently classified using different machine learning methods to produce final LSM. Experimental results suggest that the presented method achieves higher performance than existing LSM methods. This study provides a new solution for producing precise LSM from a fusion perspective that can be applied to minimize the potential landslide risk and for sustainable use of erosion-prone slopes.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ffcba1f5da2b2cfd8034926d2422afd1",
  "timestamp": "2025-05-15T02:10:25.662946"
}