{
  "id": 9413,
  "title": "Impact of office-based laboratories on physician practice patterns and outcomes after percutaneous vascular interventions for peripheral artery disease",
  "abstract": "Background: Percutaneous vascular interventions (PVIs) for peripheral artery disease have shifted from hospital-based facilities to office-based laboratories (OBLs). The transition to OBLs is due to a variety of factors such as technology advancement, increased efficiency, and financial incentives. We evaluated the impact of physicians switching to OBLs use from hospital-based facilities on procedure volume, procedure type, and patient outcomes. Methods: We identified patients with PVI for lower extremity peripheral artery disease from 2006 to 2013 in a 20% Medicare sample and identified physicians who transitioned from predominantly hospital-based facilities to OBLs (switch physicians) and compared them with those who did not use OBLs (control physicians). The main outcomes investigated were average number of PVIs at 30 days and 1 year and atherectomy usage. Patient outcomes included above-ankle amputation, major adverse limb events, and death. We used a difference-in-difference model to control for time effects in a multivariate regression model, reported as an odds ratio (OR) and 95% confidence interval (CI). Results: The cohort comprised 292 switch physicians, who treated 7134 patients (3888 before OBL use and 3246 after transitioning to OBLs), and 3715 control physicians treating 54,213 patients (36,327 in the preperiod and 17,886 in the postperiod). Switch and control physicians both treated more patients with lower extremity wounds during the study period; however, this increase was greater for control physician (0.7% vs 5.5%, P < .001). On average, patients treated by switch physicians had 0.05 (95% CI, 0.03-0.07; P < .001) underwent more PVIs within 30 days and 0.12 more PVIs (95% CI, 0.08-0.16; P < .001) within 1 year of the initial revascularization procedure after the physician transitioned to an OBL. Similarly, patients treated by switch physicians underwent 0.02 (95% CI, 0.01-0.03; P = .002) more atherectomy procedures at 30 days and 0.03 (95% CI, 0.01-0.05; P = .008) more atherectomy procedures at 1 year. Transitioning to OBLs was also associated with a decreased risk in above-ankle amputation at 30 days (OR, 0.58; 95% CI, 0.38-0.97; P = .009) and 1 year (OR, 0.75; 95% CI, 0.60-0.95; P = .01). However, no statistical difference was observed for major adverse limb events and mortality rates at 30 days and 1 year because patients treated by switch and control physicians experienced similar decreases. Conclusions: Transitioning to OBLs was associated higher 30-day and 1-year PVI rates and atherectomy rates. Although transitioning to OBLs was associated with lower rates of above-ankle amputations, switch physicians treated a lower number of patients with lower extremity wounds.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ffcd3d4419e939e97bcf9167d2429c41",
  "timestamp": "2025-05-15T03:28:46.185412"
}