{
  "id": 2541,
  "title": "Surrogate-Assisted Scenario-Generation Method for Simulation-Based Stochastic Programming Problems",
  "abstract": "Simulation is required in real-world industrial decision-making to model the complexity, such as supply chain management with uncertain future demand. Scenario generation is critical for handling inherent uncertainties as deterministic scenarios to solve stochastic programming problems (SPPs). Generating a minimal yet representative scenario set is important to solve simulation-based SPPs (SBSPPs) since SBSPPs require thousands of simulation iterations proportional to the number of scenarios, leading to significant computational time. However, conventional methods, such as Monte Carlo method and recent problem-driven approaches, are ineffective in solving SBSPPs due to time-consuming simulation evaluation. This paper proposes a surrogate-assisted scenario-generation method called Inferred Cost-Space Scenario Clustering (ICSSC) that is applicable to various SPPs including SBSPPs. ICSSC employs a scenario clustering based on a new cost-space scenario distance evaluated by the surrogate model trained with offline simulation data to quickly approximate simulation evaluations. We conducted three types of numerical experiments to validate the effectiveness: Markowitz portfolio optimization, stochastic server location, and inventory placement optimization. Empirical results revealed that ICSSC could generate an effective scenario set based on the impact of uncertainties on decision outcomes for broader SPPs, and yields better solutions with 7.2 times shorter runtime than Monte Carlo methods.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ffd316e7a1804346c396657fd166286f",
  "timestamp": "2025-05-15T01:08:10.681626"
}