{
  "id": 7608,
  "title": "Understanding Associations between Disasters and Sustainability, Resilience, and Poverty: An Empirical Study of the Last Two Decades",
  "abstract": "This study investigates the impact of disasters on sustainability, resilience, and poverty, using data from the Sustainable Development Report and the Emergency Events Database (EM-DAT) from 2000 to 2023. Regression models assessed the effects of disasters, deaths, injuries, affected individuals, and economic damage on normalized values of the dependent variables with lag periods of one, two, and three years of independent variables. The results reveal that disasters consistently negatively impact sustainability and resilience, highlighting the need for robust disaster risk reduction strategies and resilient infrastructure. Higher mortality rates significantly hindered development, emphasizing the importance of improving early warning systems, emergency preparedness, and healthcare infrastructure. While injuries and the number of affected individuals did not show significant associations, economic damage was positively associated with resilience, suggesting that financial losses might drive recovery investments. Additionally, disasters were found to exacerbate poverty levels over time with significant associations in the two and three-year lag models. This study also uncovered significant regional disparities with lower resilience, sustainability, and higher poverty levels in certain regions compared to others. Higher-income groups demonstrated better resilience and lower poverty levels. These findings underscore the necessity for targeted, region-specific strategies to enhance resilience, reduce poverty, and support sustainable development, leveraging post-disaster recovery phases for long-term improvement.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ffd5579c0195fef6a98636ebcecec0c8",
  "timestamp": "2025-05-15T03:10:05.678517"
}