{
  "id": 9090,
  "title": "Spatial and sociodemographic correlates of gambling participation and disorder among female Filipino migrant workers in Macao, People's Republic of China",
  "abstract": "Background and aims: Correlates and risk factors for gambling disorder among vulnerable or transient populations such as transnational migrant workers are unknown. The current study examined sociodemographic and spatial correlates of gambling disorder among female Filipino domestic workers in Macao (SAR), China. Design: Survey-based, respondent-driven sampling study administered from November 2016 to August 2017. Setting: Macao (SAR), which encompassed 38 casinos within its 30.4 km(2) area at the time of this study. Participants: Representative sample of N = 1194 female Filipino domestic workers in Macao. Measurements: Symptoms of gambling disorder based on Diagnostic and Statistical Manual of Mental Disorders, Fifth Edition (DSM-5). Correlates evaluated included sociodemographic information, proximity to venues, perceived social support, and symptoms of depression and anxiety. Findings: Prevalence of gambling disorder was 5.1%. Multivariable regression analyses indicated that likelihood of gambling participation (i.e., ever gambling) was associated with current indebtedness (RR = 1.56, 95%CI = 1.08-2.25, p =.017) and worse self-reported health (RR = 1.31, 95%CI = 1.04-1.65, p =.02). Increased symptoms of gambling disorder were independently associated with lower perceived social support (RR = 0.92, 95%CI = 0.87-0.98, p =.006), increased dependents relying upon monthly remittances (RR = 1.10, 95%CI = 1.06-1.16, p <.001), increased depression severity (RR = 1.16, 95%CI = 1.07-1.25, p <.001), decreased salary quintile (RR = 0.97, 95%CI = 0.94-1.00, p =.04), and proximity to the nearest Mocha Club gaming venues (RR = 1.04, 95%CI = 1.02-1.07, p =.005). The association between proximity to casinos and increased symptoms of gambling disorder was significant only for domestic workers living apart from employers (RR = 1.07, 95%CI = 1.00-1.14, p =.04). Conclusions: Increased spatial proximity to gambling venues and greater financial and psychosocial burdens are associated with gambling disorder among domestic workers in Macao.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ffd7cafe78e79601c337438bff1df699",
  "timestamp": "2025-05-15T03:25:27.746038"
}