{
  "id": 4154,
  "title": "The impact of financial fragility on firm performance: an analysis of BIST companies",
  "abstract": "This study analyzes the impact of financial fragility on firm performance through panel data regression models. In this context, financial fragility is represented by a selected set of nine different macroeconomic indicators as independent variables which are the real exchange rate of Turkish Lira, BIST 100 index, the ratios of short-term foreign debt to long-term foreign debt, exports to imports, short-term foreign debt to international reserves as well as the ratios of current account deficit, budget deficit, net public debt and private sector foreign debt to gross domestic product, respectively. In addition, firm performance is represented by the Altman Z-Score, EBT and share price of BIST companies as dependent variables. Integrating data from 4,193 observations of 492 diverse listed companies on Borsa Istanbul with coverage from 2005 to 2017, separate regression models were constituted for each firm performance construct with selected nine indicators of the given years. Empirical findings primarily suggested that a significant relationship existed between financial fragility and firm performance based on selected representative parameters. The main findings suggest that the change in the BIST 100 index can be concluded as the most influential indicator for firm performance in terms of profitability, bankruptcy risk and share price development. Moreover, fluctuations in the real exchange rate in one period may signal for changes in share prices in the coming period.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fff0c2e41071ed209cceffecc6bf6d2d",
  "timestamp": "2025-05-15T02:33:42.117324"
}