{
  "id": 8704,
  "title": "Impact of Economic Policy Uncertainty on Bank Loan Restructuring: Empirical Evidence from Industry-Level Loan Distribution in China",
  "abstract": "In recent years, there has been significant interest in economic policy uncertainty and its economic consequences. Fluctuations in economic policies can introduce instability into business operations, resulting in elevated credit default risks. It is important to investigate whether Chinese commercial banks take economic policy uncertainty into account and adopt a more diversified loan structure to mitigate the risks associated with policy changes. In this study, we investigate the impact of economic policy uncertainty on loan concentration within a sample of Chinese commercial banks from 2007 to 2020. Using a panel dataset of 311 banks, we employ fixed-effects regression models and conduct robustness checks with instrumental variables and dynamic panel regressions to address endogeneity concerns. Our findings reveal a significant negative correlation between economic policy uncertainty and the loan concentration of banks. These results hold strong even when subjected to rigorous testing for endogeneity using instrumental variables and dynamic panel regressions. Furthermore, we also find that the negative impact of economic policy uncertainty on loan concentration is more pronounced in regional banks, small-sized banks, and banks with lower market shares. Moreover, the mechanism analysis demonstrates that operational risk serves as a vital channel through which economic policy uncertainty affects loan concentration. By shedding light on how macroeconomic policies impact the financial behavior of commercial banks, we provide new empirical evidence and valuable insights into the dynamics of bank loan structures. In light of our findings, we propose policy recommendations to ensure economic policy stability, encourage the diversification of loan portfolios, expand the regulatory scope on loan concentration, and foster improvements in the regulatory system.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "fffa27d525c0a5bfc8d78e24ce55be23",
  "timestamp": "2025-05-15T03:21:24.728591"
}