{
  "paper": {
    "id": 459,
    "title": "Stock market extreme risk prediction based on machine learning: Evidence from the American market",
    "abstract": "Extreme risk in stock markets poses significant challenges, necessitating greater attention in related research. This study presents an effective machine-learning model for forecasting extreme risks in the American stock market. Specifically, to address the issues of imbalanced data distribution and concept drift, we introduced class weight and time weight parameters to enhance the AdaBoost algorithm. Moreover, we improved the active learning framework by transitioning from manual to algorithmic annotation. Experiments on the S&P 500 index from 2005 to 2022 revealed that our optimal model significantly enhanced the classification performance, particularly for risk instances. Additionally, we validated the efficacy of customized sample weight values, the significance of the density-weight strategy, and the robustness of the overall framework under different risk definition criteria and feature lag periods. Our research is significant for the adoption of appropriate macroeconomic policies to mitigate downside risks and provides a valuable tool for achieving financial stability.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "7418e263eb0315e65345c607417f5e18",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "active learning",
      "classification"
    ],
    "stage1_timestamp": "2025-05-15T01:50:52.713725"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用改进的机器学习模型来预测股票市场的极端风险，这直接属于金融风险管理的范畴。论文的研究目标和实验设计都集中在风险预测和分类上，旨在帮助制定宏观经济政策和实现金融稳定。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"该论文的核心技术是使用改进的机器学习模型来预测股票市场的极端风险，这直接属于金融风险管理的范畴。论文的研究目标和实验设计都集中在风险预测和分类上，旨在帮助制定宏观经济政策和实现金融稳定。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:57:41.349836"
}