{
  "paper": {
    "id": 3187,
    "title": "Bibliometric Analysis of Intelligent Systems for Early Anomaly Detection in Oil and Gas Contracts: Exploring Recent Progress and Challenges",
    "abstract": "The oil and gas industries are crucial to global economies, influencing geopolitics, driving technological advancements, employing millions, and impacting financial markets. The complexity and the volume of data generated by these industries demonstrate the need for efficient information management, where effective contract audits play a key role in ensuring market stability, transparency, fair revenue distribution, corruption mitigation, and enhancing industry integrity to attract investors. This study employs bibliometric analysis to explore the application of machine learning (ML) in detecting anomalous contracts within the oil and gas industry. This analysis identifies key research and challenges, laying the groundwork for further computational ML advancements. The PRISMA guidelines identify ML's role from 2018 to 2023, including post-COVID-19. Principal component analysis (PCA) evaluates the bibliometric contributions of different countries and institutions. China, Indonesia, Egypt, Saudi Arabia, the University of Antwerp Operations Research Group, and the University of Pittsburgh emerge as significant contributors. These findings underscore ML's pivotal role in fraud detection, risk mitigation, and cost savings, concluding that anomalous contract detection remains open to newer ML techniques and ongoing research.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "9f0476293b219b13b87a56429e8bc065",
    "relevant_keywords": [
      "machine learning",
      "principal components analysis"
    ],
    "stage1_timestamp": "2025-05-15T02:23:33.536057"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要探讨机器学习在石油和天然气行业异常合同检测中的应用，虽然涉及风险缓解和成本节约，但并未明确指出其应用于衍生品定价、金融风险管理或投资组合管理等特定金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要探讨机器学习在石油和天然气行业异常合同检测中的应用，虽然涉及风险缓解和成本节约，但并未明确指出其应用于衍生品定价、金融风险管理或投资组合管理等特定金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:38:04.420020"
}