{
  "paper": {
    "id": 3161,
    "title": "A Digital Transformation (DT) Model for Intelligent Organizational Systems: Key Constructs for Successful DT",
    "abstract": "Intelligent organizational systems or intelligent organizations are being created through processes of digital transformation (DT) that typically involves intelligent technologies such as robotic process automation (RPA), the Internet of Things (IoT), artificial intelligence (AI), machine learning (ML), blockchain, drones, virtual reality (VR), 3Dprinting, big data and big data analytics (BDA). However, there is the significant problem of high DT failure rateswith severe financial losses. Thus, understanding the key constructs for DT success in terms of organizational performance is an essential knowledge requirement and was the research problem and knowledge gap addressed by the study. The study followed an integrative literature review method since the purposewas analysis and synthesis for research model development. The study exposed the key constructs for successful DT in terms of organizational performance, namely organizational performance, sustainability, information technology (IT)/digital capability, change management, dynamic capabilities and risk management. This knowledge enables DT management to effectively manage DT toward success. For DT and related scientists, the study establishes the foundations for measuring DT and the associated organizational performance and facilitates DT theory progression and new knowledge generation.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "12fc9f999bc75c7cf69114645243d463",
    "relevant_keywords": [
      "machine learning"
    ],
    "stage1_timestamp": "2025-05-15T02:22:56.870570"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究数字转型（DT）在智能组织系统中的关键成功因素，如组织绩效、可持续性、IT/数字能力等，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域的具体应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究数字转型（DT）在智能组织系统中的关键成功因素，如组织绩效、可持续性、IT/数字能力等，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域的具体应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:38:05.400679"
}