{
  "paper": {
    "id": 76,
    "title": "Fuzzy portfolio selection with different risk attitudes based on machine learning",
    "abstract": "This paper studies a fuzzy portfolio selection program with different risk attitudes based on Machine Learning to help investors make reasonable investment decisions. Firstly, the asset's return is assumed as a fuzzy variable, which is estimated by the Long-Short Term Memory, Convolutional Neural Networks, Support Vector Regression and Random Forest, respectively. Secondly, the possibilistic mean and possibilistic variance with different risk attitudes are calculated within the framework of possibilistic theory. Thirdly, considering the borrowing constraints, transaction costs, and threshold constraints, a fuzzy portfolio selection model with different risk attitudes based on Machine Learning is proposed. According to the possibilistic measure, the proposed model is transformed into a quadratic programming problem, and the pivoting algorithm is designed to obtain the optimal solution. Finally, the possibility equal-weight portfolio model and possibility mean-variance portfolio model based on history quartile are selected as benchmarks, and a comparing numerical example is provided to demonstrate the effectiveness of the proposed model.",
    "year": 2025,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "051de919c015d9bf67974eabaf75a2c2",
    "relevant_keywords": [
      "machine learning",
      "support vector machine",
      "SVM",
      "decision tree",
      "neural network",
      "deep learning",
      "convolutional neural network",
      "CNN",
      "long short-term memory",
      "LSTM"
    ],
    "stage1_timestamp": "2025-05-15T00:38:57.040191"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心内容是研究基于机器学习的模糊投资组合选择模型，旨在帮助投资者做出合理的投资决策。论文详细讨论了资产回报的模糊变量估计、不同风险态度下的可能性均值和方差计算，以及考虑多种约束条件的投资组合选择模型。这些内容明确指向投资组合管理领域，而非衍生品定价或金融风险管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心内容是研究基于机器学习的模糊投资组合选择模型，旨在帮助投资者做出合理的投资决策。论文详细讨论了资产回报的模糊变量估计、不同风险态度下的可能性均值和方差计算，以及考虑多种约束条件的投资组合选择模型。这些内容明确指向投资组合管理领域，而非衍生品定价或金融风险管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:33:53.286509"
}