{
  "paper": {
    "id": 5434,
    "title": "Artifficial neural networks estimating survival probability after treatment of choroidal melanoma",
    "abstract": "Purpose: To describe neural networks predicting survival from choroidal melanoma (i.e., any uveal melanoma involving choroid) and to demonstrate the value of entering age, sex, clinical stage, cytogenetic type, and histologic grade into the predictive model. Design: Nonrandomized case series. Participants: Patients resident in mainland Britain treated by the first author for choroidal melanoma between 1984 and 2006. Methods: A conditional hazard estimating neural network (CHENN) was trained according to the Bayesian formalism with a training set of 1780 patients and evaluated with a test set of another 874 patients. Conditional hazard estimating neural network-generated survival curves were compared with those obtained with Kaplan-Meier analyses. A second model was created with information on chromosome 3 loss, using training and test sets of 211 and 140 patients, respectively. Main Outcome Measures: Comparison of CHENN survival curves with Kaplan-Meier analyses. Representative results showing all-cause survival and inferred melanoma-specific mortality, according to age, sex, clinical stage, cytogenetic type, and histologic grade. Results: The predictive model plotted a survival curve with 95% credibility intervals for patients with melanoma according to relevant risk factors: age, sex, largest basal tumor diameter, ciliary body involvement, extraocular extension, tumor cell type, closed loops, mitotic rate, and chromosome 3 loss (i.e., monosomy 3). A survival curve for the age-matched general population of the same sex allowed estimation of the melanoma-related mortality. All-cause survival curves generated by the CHENN matched those produced with Kaplan-Meier analysis (Kolmogorov-Smirnov, P<0.05). In older patients, however, the estimated melanoma-related mortality was lower with the CHENN, which accounted for competing risks, unlike Kaplan-Meier analysis. Largest basal tumor diameter was most predictive of mortality in tumors showing histologic and cytogenetic features of high-grade malignancy. Ciliary body involvement and extraocular extension lost significance when cytogenetic and histologic data were included in the model. Patients with a monosomy 3 melanoma of a particular size were predicted to have shorter survival if their tumor showed epithelioid cells and closed loops. Conclusions: Estimation of survival prognosis in patients with choroidal melanoma requires multivariate assessment of age, sex, clinical tumor stage, cytogenetic melanoma type, and histologic grade of malignancy. Financial Disciosure(s): The authors have no proprietary or commercial interest in any materials discussed in this article.",
    "year": 2008,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "a83204b166433b3018ee864fd4b11206",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "neural network",
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T02:47:43.003380"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究使用神经网络预测脉络膜黑色素瘤患者的生存概率，属于医学领域的应用，与金融研究领域无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究使用神经网络预测脉络膜黑色素瘤患者的生存概率，属于医学领域的应用，与金融研究领域无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:30:31.578582"
}