{
  "paper": {
    "id": 2024,
    "title": "An estimation of distribution algorithm with clustering for scenario-based robust financial optimization",
    "abstract": "One important problem in financial optimization is to search for robust investment plans that can maximize return while minimizing risk. The market environment, namely the scenario of the problem in optimization, always affects the return and risk of an investment plan. Those financial optimization problems that the performance of the investment plans largely depends on the scenarios are defined as scenario-based optimization problems. This kind of uncertainty is called scenario-based uncertainty. The consideration of scenario-based uncertainty in multi-objective optimization problem is a largely under explored domain. In this paper, a nondominated sorting estimation of distribution algorithm with clustering (NSEDA-C) is proposed to deal with scenario-based robust financial problems. A robust group insurance portfolio problem is taken as an instance to study the features of scenario-based robust financial problems. A simplified simulation method is applied to measure the return while an estimation model is devised to measure the risk. Applications of the NSEDA-C on the group insurance portfolio problem for real-world insurance products have validated the effectiveness of the proposed algorithm.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "7267278f47a9a1e0a262164b38ad05d7",
    "relevant_keywords": [
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T02:10:25.670941"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文主要研究的是在不确定市场环境下寻找稳健的投资计划，以最大化回报并最小化风险，这直接涉及投资组合管理的核心问题。论文还以团体保险投资组合问题为例，进一步验证了其算法在投资组合管理中的应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文主要研究的是在不确定市场环境下寻找稳健的投资计划，以最大化回报并最小化风险，这直接涉及投资组合管理的核心问题。论文还以团体保险投资组合问题为例，进一步验证了其算法在投资组合管理中的应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:44:48.211254"
}