{
  "paper": {
    "id": 872,
    "title": "Least squares support vector machines ensemble models for credit scoring",
    "abstract": "Due to recent financial crisis and regulatory concerns of Basel 11, credit risk assessment is becoming one of the most important topics in the field of financial risk management. Quantitative credit scoring models are widely used tools for credit risk assessment in financial institutions. Although single support vector machines (SVM) have been demonstrated with good performance in classification, a single classifier with a fixed group of training samples and parameters setting may have some kind of inductive bias. One effective way to reduce the bias is ensemble model. In this study, several ensemble models based on least squares support vector machines (LSSVM) are brought forward for credit scoring. The models are tested on two real world datasets and the results show that ensemble strategies can help to improve the performance in some degree and are effective for building credit scoring models. (C) 2009 Elsevier Ltd. All rights reserved.",
    "year": 2010,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "8ebeec9c0e64da97132fa221427e6923",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM"
    ],
    "stage1_timestamp": "2025-05-15T01:56:17.476553"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on developing ensemble models based on least squares support vector machines for credit scoring, which is a critical component of credit risk assessment in financial institutions. This directly relates to the field of Financial Risk Management, as it aims to improve the accuracy of credit risk evaluation.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on developing ensemble models based on least squares support vector machines for credit scoring, which is a critical component of credit risk assessment in financial institutions. This directly relates to the field of Financial Risk Management, as it aims to improve the accuracy of credit risk evaluation.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:54:13.505673"
}