{
  "paper": {
    "id": 15,
    "title": "Security-Aware Information Classifications Using Supervised Learning for Cloud-Based Cyber Risk Management in Financial Big Data",
    "abstract": "With the fast development of Web-based solutions, a variety of paradigms and platforms are emerging as value creators or improvers in multiple industries. This trend has also enable financial firms to improve their business processes and create new services. Sharing data between financial service institutions has become an option of achieving value enhancements. However, the concern of the privacy information leakage has also arisen, which impacts on both financial organizations and customers. It is important for stakeholders in financial services to be aware of the proper information classifications, by which determining which information can be shared between the financial service institutions. This paper focuses on this issue and proposes a new approach that use combined supervised learning techniques to classify the information in order to avoid releasing those information that can be harmful for either financial service providers or customers. The proposed model is entitled as Supervised lEarning-Based Secure Information Classification (SEB-SIC) model, which is mainly supported by the proposed Decision Tree-based Risk Prediction (DTRP) algorithm. The proposed scheme is a predictive mechanism that uses the historical data as the training dataset. The performance of our proposed mechanism has been assessed by the experimental evaluations.",
    "year": 2016,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "d0d5d823c40546e4f30661636e30207b",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "decision tree",
      "feature representation"
    ],
    "stage1_timestamp": "2025-05-15T01:46:03.757318"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文提出了一种基于监督学习的信息分类方法，旨在防止金融数据共享中的隐私信息泄露，这属于金融风险管理中的信息安全风险控制范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文提出了一种基于监督学习的信息分类方法，旨在防止金融数据共享中的隐私信息泄露，这属于金融风险管理中的信息安全风险控制范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:01:35.089763"
}