{
  "paper": {
    "id": 3090,
    "title": "Hybrid quantile regression estimation for time series models with conditional heteroscedasticity",
    "abstract": "Estimating conditional quantiles of financial time series is essential for risk management and many other financial applications. For time series models with conditional heteroscedasticity, although it is the generalized auto-regressive conditional heteroscedastic (GARCH) model that has the greatest popularity, quantile regression for this model usually gives rise to non-smooth non-convex optimization which may hinder its practical feasibility. The paper proposes an easy-to-implement hybrid quantile regression estimation procedure for the GARCH model, where we overcome the intractability due to the square-root form of the conditional quantile function by a simple transformation. The method takes advantage of the efficiency of the GARCH model in modelling the volatility globally as well as the flexibility of quantile regression in fitting quantiles at a specific level. The asymptotic distribution of the estimator is derived and is approximated by a novel mixed bootstrapping procedure. A portmanteau test is further constructed to check the adequacy of fitted conditional quantiles. The finite sample performance of the method is examined by simulation studies, and its advantages over existing methods are illustrated by an empirical application to value-at-risk forecasting.",
    "year": 2018,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "aaba52ddd43d234578f6916334315e37",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:22:25.139668"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on estimating conditional quantiles of financial time series, specifically for the GARCH model, which is crucial for risk management applications such as value-at-risk forecasting. The proposed hybrid quantile regression estimation procedure directly addresses challenges in financial risk assessment and management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on estimating conditional quantiles of financial time series, specifically for the GARCH model, which is crucial for risk management applications such as value-at-risk forecasting. The proposed hybrid quantile regression estimation procedure directly addresses challenges in financial risk assessment and management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:38:30.446534"
}