{
  "paper": {
    "id": 1048,
    "title": "STOCK MARKET PREDICTION IN BRICS COUNTRIES USING LINEAR REGRESSION AND ARTIFICIAL NEURAL NETWORK HYBRID MODELS",
    "abstract": "The BRICS (Brazil, Russia, India, China and South Africa) acronym was created by the International Monetary Foundation (IMF)-Group of Seven (G7) to represent the bloc of developing economies which crucially impact on the global economy by their potential economic growth. Most of the foreign direct investment are considering the stock markets of BRICS as the most attractive destination for foreign portfolio investment. This study aims to identify the relationship between macroeconomic variables and the stock market index values of BRICS and generate accurate predictions for index values by performing linear regression and artificial neural network hybrid models. Monthly data from January 2003 to December 2019 are used for the empirical study. The results indicate that a strong correlation exists between the stock market and macroeconomic variables in BRICS over time. The hybrid model is observed very accurate for index value prediction where the mean absolute percentage error (MAPE) value is 0.714% for the whole data set covering all BRICS countries data during the study period. Additionally, MAPE values for each of the BRICS countries are, respectively, obtained as 0.083%, 2.316%, 0.116%, 0.962% and 0.092%. Thus, the main findings of this study show that while neural network-integrated models have high performances for volatile stock market prediction, macroeconomic stabilization should be the priority of monetary policy to prevent the high volatility of stock markets.",
    "year": 2022,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "862703729148ec807b47c8fb87689712",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "regression",
      "neural network",
      "deep learning",
      "backpropagation",
      "BP",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T00:51:25.839255"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究使用线性回归和人工神经网络混合模型预测BRICS国家股票市场指数与宏观经济变量之间的关系，并未涉及衍生品定价、金融风险管理或投资组合管理等特定金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究使用线性回归和人工神经网络混合模型预测BRICS国家股票市场指数与宏观经济变量之间的关系，并未涉及衍生品定价、金融风险管理或投资组合管理等特定金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:25:13.325248"
}