{
  "paper": {
    "id": 231,
    "title": "Predicting Extreme Financial Risks on Imbalanced Dataset: A Combined Kernel FCM and Kernel SMOTE Based SVM Classifier",
    "abstract": "Extreme financial risk prediction is an important component of risk management in financial markets. In this study, taking the China Securities Index 300 (CSI300) as an example, we set out to introduce the kernel method into fuzzy c-mean algorithm (FCM) and synthetic minority over-sampling technique (SMOTE) and combine them with support vector machine (SVM) to propose a hybrid model of KFCM-KSMOTE-SVM for predicting extreme financial risks, which is compared with other various prediction models. In addition, we investigate the influence on the prediction performance of KFCM-KSMOTE-SVM exerted by its parameters. The empirical results present that KFCM-KSMOTE-SVM outperforms other various prediction models significantly, which verifies that KFCM-KSMOTE-SVM can solve the class imbalance problem in financial markets and is more appropriate for predicting extreme financial risks. Meanwhile, parameter set plays an important role in constructing KFCM-KSMOTE-SVM prediction model. Besides, the experiment on Shanghai Stock Exchange Composite Index also proves that KFCM-KSMOTE-SVM has strong robustness on predicting extreme financial risks.",
    "year": 2020,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "cfc3c688bd9ce1fe919e12986ece2d02",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM",
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T01:48:30.710907"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on predicting extreme financial risks using a hybrid machine learning model, which is a core aspect of financial risk management. The study specifically addresses risk prediction in financial markets, as evidenced by its use of the China Securities Index 300 and the Shanghai Stock Exchange Composite Index for empirical validation.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on predicting extreme financial risks using a hybrid machine learning model, which is a core aspect of financial risk management. The study specifically addresses risk prediction in financial markets, as evidenced by its use of the China Securities Index 300 and the Shanghai Stock Exchange Composite Index for empirical validation.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:59:53.975100"
}