{
  "paper": {
    "id": 8895,
    "title": "MODELLING SMALL BUSINESS FAILURES IN MALAYSIA",
    "abstract": "Small and medium-sized enterprises (SMEs) are significant contributors to development and growth in an economy. Since SME failure is common, this study develops a failure prediction model for the small and medium-sized enterprises. By using 132 distressed and non-distressed SMEs in Malaysia during the period of 2000 through 2010 based on the logistic regression, the results for Model 1 illustrate that higher gearing and lower profitability are associated with a higher failure risk. In addition, the incorporation of the firm's age as an additional factor in Model 2 significantly improves the model's predictive accuracy. A high area under the receiver operating curve indicates that Model 2 is excellent in discriminating between the distressed and non-distressed SMEs. The Hanley and McNeil test statistic shows that both models could predict failure better than a random model. The overall prediction accuracy rate ranges from 50% to 83% and 75% to 89% for the respective Model 1 and 2 when applied to the 1-year, 2-year, 3-year and 4-year prior to distress holdout samples. Our result indicates that young SMEs rely heavily on debt and they are less efficient which led them into distressed situation. The model can detect failure as early as four years prior to the event. The developed model could be used as a refined tool to avoid possible adverse situations among the small medium-sized enterprises, creditors and investors. To the SMEs, the model could assist in early detection of distress situation; whereas to credit providers the predictors could be included in the score card for better credit decision making. Investors could potentially use the model to assess the financial well-being of companies to safeguard their interests.",
    "year": 2015,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "6fc86202ad2d546f47617f4ec6cf281a",
    "relevant_keywords": [
      "classification",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T03:23:27.857225"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要研究中小企业失败预测模型，通过逻辑回归分析财务指标以预测企业财务困境，这属于信用风险管理的范畴，是金融风险管理的一个重要子领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文主要研究中小企业失败预测模型，通过逻辑回归分析财务指标以预测企业财务困境，这属于信用风险管理的范畴，是金融风险管理的一个重要子领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:25:13.492659"
}