{
  "paper": {
    "id": 572,
    "title": "DEEPCLAIR: Utilizing Market Forecasts for Effective Portfolio Selection",
    "abstract": "Utilizing market forecasts is pivotal in optimizing portfolio selection strategies. We introduce DEEPCLAIR, a novel framework for portfolio selection. DEEPCLAIR leverages a transformer-based time-series forecasting model to predict market trends, facilitating more informed and adaptable portfolio decisions. To integrate the forecasting model into a deep reinforcement learning-driven portfolio selection framework, we introduced a two-step strategy: first, pre-training the time-series model on market data, followed by fine-tuning the portfolio selection architecture using this model. Additionally, we investigated the optimization technique, Low-Rank Adaptation (LoRA), to enhance the pre-trained forecasting model for fine-tuning in investment scenarios. This work bridges market forecasting and portfolio selection, facilitating the advancement of investment strategies.",
    "year": 2024,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "dab0b0791567e0010934238154a62bef",
    "relevant_keywords": [
      "machine learning",
      "reinforcement learning",
      "deep learning",
      "neural network",
      "representation learning",
      "transformer",
      "attention mechanism",
      "unsupervised pre-train"
    ],
    "stage1_timestamp": "2025-05-15T00:45:01.332293"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "The paper introduces DEEPCLAIR, a framework specifically designed for portfolio selection, leveraging market forecasts and deep reinforcement learning to optimize investment strategies. The core focus is on improving portfolio decisions, which directly falls under the domain of Portfolio Management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Portfolio Management\"],\n  \"justification\": \"The paper introduces DEEPCLAIR, a framework specifically designed for portfolio selection, leveraging market forecasts and deep reinforcement learning to optimize investment strategies. The core focus is on improving portfolio decisions, which directly falls under the domain of Portfolio Management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:29:34.366502"
}