{
  "paper": {
    "id": 1582,
    "title": "A comprehensive cluster and classification mining procedure for daily stock market return forecasting",
    "abstract": "Data mining and big data analytic techniques are playing an important role in many application fields, including the financial markets. However, only few studies have focused on predicting daily stock market returns, and among these studies, the data mining procedures utilized are either incomplete or inefficient. This paper presents a comprehensive data mining process to forecast the daily direction of the S&P 500 Index ETF (SPY) return based on 60 financial and economical features. The fuzzy c-means method (FCM) is initially used to cluster the preprocessed data. A principal component analysis (PCA) is applied next to the entire data set and each of seven clusters. The dimension of the entire cleaned data set is then reduced according to the combining results from the entire data set and each cluster. Corresponding to different levels of the dimensionality reduction, twelve new data sets are generated from the entire cleaned data. Artificial neural networks (ANNs) and logistic regression models are then used with the twelve transformed data sets for classification in order to forecast the daily direction of future market returns and indicate the efficiency of dimensionality reduction with PCA. A group of hypothesis tests are performed over the classification and simulation results to show that the ANNs give significantly higher classification accuracy than logistic regression, and that the trading strategies guided by the comprehensive cluster and classification mining procedure based on PCA and ANNs gain higher risk-adjusted profits than the comparison benchmarks, as well as those strategies guided by the forecasts based on PCA and logistic regression models. (C) 2017 Elsevier B.V. All rights reserved.",
    "year": 2017,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "1ac84c0c558fadf51d8dc111e78591a6",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "unsupervised learning",
      "classification",
      "regression",
      "clustering",
      "principal components analysis",
      "neural network",
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T02:05:08.144719"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是使用数据挖掘和机器学习方法预测股票市场每日回报的方向，并基于这些预测构建交易策略以获得更高的风险调整后收益。这直接关联到投资组合管理中的资产选择和交易策略优化。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是使用数据挖掘和机器学习方法预测股票市场每日回报的方向，并基于这些预测构建交易策略以获得更高的风险调整后收益。这直接关联到投资组合管理中的资产选择和交易策略优化。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:47:57.538728"
}