{
  "paper": {
    "id": 8579,
    "title": "Spatial Analysis on the Variances of Landslide Factors Using Geographically Weighted Logistic Regression in Penang Island, Malaysia",
    "abstract": "Landslides are one of the common natural disasters involving mostly movement of soil surfaces associated with gravitational attraction. Their adverse losses and significant damage, which always result in at least 17% of casualties and billions of dollars of financial losses worldwide, have made landslides the third most notorious phenomenon devastating many parts of the world. Malaysia has had multiple landslide occurrences, particularly in highly urbanized areas, such as Penang Island, owing to the declining vegetation cover in hilly terrains. Thus, this study aims to delineate the spatial relationship variances between landslide occurrences and the influencing factors in the area of interest. Ten influencing factors considered, including distance to roads, distance to rivers, distance to faults, slope angle, slope aspect, curvature, rainfall annual average, lithology, soil series, and land use. In this study, we use a software (GWR 4.0) as a medium for the analysis processing, coupled with GIS. A local statistical technique, Geographically Weighted Logistic Regression (GWLR), is primacy in capturing the geographical variation of the model coefficients that considers non-stationary variables and models their relationships, as well as processes regression coefficients over space. Goodness-of-fit criteria were used to evaluate the GWLR model, namely AICc that decrease from 872.202167 to 800.856998. Bayesian Information Criterion (BIC) shows a decrease in value from 925.784185 to 945.196942. Likewise, deviance decreased from 849.931675 to 739.175630, while pdev increased from 0.379457 to 0.460321. These goodness-of-fit criteria values express GWLR as the best model for local measure. The variances in both local parameter estimates and the t-values (negative and positive values) show the level of significance for each landslide factor in influencing landslide occurrences across the study area. The results of the local parameter estimates and the t-values also show that the slope angle and the slope aspect spatially affect landslide occurrences across the study area. Therefore, a proper perspective and a thorough understanding of the certain slope condition must be established for future mitigation actions to support the agenda of SDG 15, which promotes resilience and disaster risk reduction.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "e7bf860b5bfb4f2e8c964813a68e7c80",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T03:20:22.204942"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究地理加权逻辑回归（GWLR）在滑坡影响因素空间分析中的应用，属于自然灾害风险评估领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究地理加权逻辑回归（GWLR）在滑坡影响因素空间分析中的应用，属于自然灾害风险评估领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:25:36.187052"
}