{
  "paper": {
    "id": 728,
    "title": "Possibilistic clustering for crisis prediction: Systemic risk states and membership degrees",
    "abstract": "Research on understanding and predicting systemic financial risk has been of increasing importance in the recent years. A common approach is to build predictive models based on macro-financial vulnerability indicators to identify systemic risk at an early stage. In this article, we outline an approach for identifying different systemic risk states through possibilistic fuzzy clustering. Instead of directly using a supervised classification method, we aim at identifying coherent groups of vulnerability with macro-financial indicators for pre-crisis data, and determine the level of risk for a new observation based on its similarity to the identified groups. The approach allows for differentiating among different possible pre-crisis states, and using this information for estimating the possibility of systemic risk. In this work, we compare different fuzzy clustering methods, as well as conduct an empirical exercise for European systemic banking crises.",
    "year": 2017,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "44689c45d6124cc3d7453c414361bd5f",
    "relevant_keywords": [
      "unsupervised learning",
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T01:54:34.008668"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on identifying systemic financial risk states using possibilistic fuzzy clustering, which is directly related to financial risk management, specifically in the context of predicting systemic banking crises.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on identifying systemic financial risk states using possibilistic fuzzy clustering, which is directly related to financial risk management, specifically in the context of predicting systemic banking crises.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:55:26.795128"
}