{
  "paper": {
    "id": 4853,
    "title": "Application of selected scoring models on corporate credit rating",
    "abstract": "The topic of the paper concerns with the area of credit risk measurement possibilities and quantification. Under the credit risk it is possible to consider any risk resulting from the inability or unwillingness of the counterparty to carry out the obligations. Credit rating then reflects the creditworthiness of a particular company, security or obligation. The objective of the paper is to demonstrate an illustrative application of two selected scoring models with respect to the credit rating assessment. By means of multivariate models, we can prove that some financial variables are statistically relevant for rating. Two approaches, linear discriminant analysis and multinomial logistic regression will be used on selected European data. The dataset comprises only nonfinancial corporations from recently acceded EU countries for which is typical the absence of publicly available information concerning external rating. A special attention will be paid to the comparison of models and the interpretation of results.",
    "year": 2011,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "a370244fcaa7892edb50cb08484252c3",
    "relevant_keywords": [
      "classification",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:41:32.838479"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on credit risk measurement and quantification, specifically using scoring models to assess corporate credit ratings, which is a key aspect of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on credit risk measurement and quantification, specifically using scoring models to assess corporate credit ratings, which is a key aspect of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:31:55.583123"
}