{
  "paper": {
    "id": 1624,
    "title": "Machine Learning-based Fundamental Stock Prediction Using Companies' Financial Reports",
    "abstract": "Portfolio management is a key goal of investment. Therefore, a key factor in extremely successful revenues is the ability to predict shares and securities with efficiency. The use of fundamental stock analysis to forecast the long-term performance of shares is effective and potent. However, further investigation in this field suffers from the lack of online fundamental features. This paper proposes two approaches of time-dependent and independent stock prediction utilizing fundamental analysis. To accomplish this, we first present a brand-new fundamental feature dataset from TSE. Its features are extracted from corporate financial records, and each share's return and risk values serve as its prediction targets. Additionally, the impact of using temporal dependency-which is lacking from the great majority of machine learning techniques-on prediction performance is examined in this paper. Finally, we suggest using machine learning techniques and assess their effectiveness of fundamental stock prediction.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "a02cc1c91133ed9703567346221bd60e",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "regression",
      "feature representation",
      "neural network",
      "deep learning",
      "representation learning",
      "backpropagation",
      "BP",
      "hidden layer",
      "recurrent neural network",
      "long short-term memory",
      "LSTM"
    ],
    "stage1_timestamp": "2025-05-15T02:05:42.488057"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心研究目标是利用机器学习技术进行基本面股票预测，以支持投资组合管理。论文明确提到投资组合管理是其关键目标，并且研究重点在于预测股票的长期表现，这是投资组合管理的重要组成部分。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心研究目标是利用机器学习技术进行基本面股票预测，以支持投资组合管理。论文明确提到投资组合管理是其关键目标，并且研究重点在于预测股票的长期表现，这是投资组合管理的重要组成部分。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:47:20.647663"
}