{
  "paper": {
    "id": 307,
    "title": "Systemic risk prediction using machine learning: Does network connectedness help prediction?",
    "abstract": "The global financial crisis not only highlights the important role of financial network connectedness, but also urges regulators pay more attention to systemic risk. We study whether network connectedness helps systemic risk prediction by using machine learning techniques, including k -nearest neighbor (KNN), support vector regression (SVR), extreme gradient boosting (XGB), and feedforward neural network (FNN). Based on prediction results, we use the fingerprint model to deliver interpretability evaluations of financial variables and network connectedness. We find that (1) the linear and nonlinear effects of stock market volatility and network connectedness effectively interpret systemic risk; (2) the interaction effects between stock market volatility and other drivers have a stronger ability to predict system risk in SVR, KNN, and XGB approaches, while network connectedness performs more profoundly in FNN approach; and (3) the interaction effect between stock market volatility and network connectedness is evident in all approaches.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "d113b55e040dcc25888eac1919563c15",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "regression",
      "support vector machine",
      "SVM",
      "neural network",
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T01:49:04.692201"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on predicting systemic risk using machine learning techniques, which is a key aspect of financial risk management. The study evaluates the role of network connectedness and stock market volatility in systemic risk prediction, directly addressing risk assessment and mitigation in financial systems.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on predicting systemic risk using machine learning techniques, which is a key aspect of financial risk management. The study evaluates the role of network connectedness and stock market volatility in systemic risk prediction, directly addressing risk assessment and mitigation in financial systems.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:59:06.843889"
}