{
  "paper": {
    "id": 3207,
    "title": "A comprehensive review of artificial intelligence and network based approaches to drug repurposing in Covid-19",
    "abstract": "Conventional drug discovery and development is tedious and time-taking process; because of which it has failed to keep the required pace to mitigate threats and cater demands of viral and re-occurring diseases, such as Covid19. The main reasons of this delay in traditional drug development are: high attrition rates, extensive time requirements, and huge financial investment with significant risk. The effective solution to de novo drug discovery is drug repurposing. Previous studies have shown that the network-based approaches and analysis are versatile platform for repurposing as the network biology is used to model the interactions between variety of biological concepts. Herein, we provide a comprehensive background of machine learning and deep learning in drug repurposing while specifically focusing on the applications of network-based approach to drug repurposing in Covid-19, data sources, and tools used. Furthermore, use of network proximity, network diffusion, and AI on network-based drug repurposing for Covid-19 is well-explained. Finally, limitations of network-based approaches in general and specific to network are stated along with future recommendations for better network-based models.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "69b8e8a0858fbebd2e3bc4fc3ca29f32",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T02:23:33.617830"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要讨论的是人工智能和网络方法在药物再利用中的应用，特别是在应对Covid-19的背景下。虽然提到了机器学习和深度学习技术，但这些技术的应用场景是医药领域，而非金融领域。论文内容并未涉及衍生品定价、金融风险管理或投资组合管理等金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要讨论的是人工智能和网络方法在药物再利用中的应用，特别是在应对Covid-19的背景下。虽然提到了机器学习和深度学习技术，但这些技术的应用场景是医药领域，而非金融领域。论文内容并未涉及衍生品定价、金融风险管理或投资组合管理等金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:38:03.295550"
}