{
  "paper": {
    "id": 1194,
    "title": "GROUP TUTORING AND THE PORTFOLIO, TWO TOOLS FOR AUTONOMOUS LEARNING. AN APPLICATION TO SUBJECTS OF MANAGEMENT FOR STUDENTS OF ARCHITECTURE",
    "abstract": "The new methodological approach prioritizes learning over teaching, underlining the need for a change from professor who teaches, to student who learns. Thus, for active learning by students, the professor assumes functions of guide, adviser, and facilitator of resources. In this context, we incorporate two methodological tools, the portfolio for developing autonomous work and group tutoring for guiding and advising in student learning processes. Teaching innovation has been applied in the field of marketing, feasibility and financing of Real Estate projects, in the fifth year of the Architecture Degree. This communication firstly shows the methodologies that have been applied, secondly discusses the results observed and concludes with the perception of students about learning. The evaluation of the innovation applied has been based on the content of students' portfolio and an anonymous questionnaire about their perception of the usefulness of the portfolio and group tutoring in the learning process. We have obtained interesting evidence to consider implementation of these tools in the future.",
    "year": 2014,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "94611f735f3cd248f3b013b8190d6853",
    "relevant_keywords": [
      "active learning"
    ],
    "stage1_timestamp": "2025-05-15T00:53:09.846985"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要讨论的是教育方法和教学工具（如组合学习和小组辅导）在建筑学学生管理课程中的应用，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要讨论的是教育方法和教学工具（如组合学习和小组辅导）在建筑学学生管理课程中的应用，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:23:25.957207"
}