{
  "paper": {
    "id": 4080,
    "title": "A Score approach to identify the risk of students dropout: an experiment with Information Systems Course",
    "abstract": "Context: The student dropout in Higher Education contributes to much social, economic, and academic loss. Students have different reasons for dropping out but the main ones are related to difficulty in learning the content, the structure proposed by the course, and the lack of financial resources. Problem: Besides understanding the motive for students completely abandoned their studies, the most important problem is identifying which groups of students are at risk of dropping out. However, studies focus essentially on categorical indicators, i.e., binary results that denote whether a student is or is not in the risk group. This type of analysis is important, but, it does not present the variation in the student's performance during their academic life. Solution: Creating a score using machine learning techniques (KNN) can provide an instrument to measure how close the student is or not to the dropout group. Theory: We used Organizational knowledge creation to make available and expand knowledge about dropping and to provide inputs for the creation of a knowledge system. Method: The experimental study is quantitative and it was performed from the execution of KNN and its validation from statistical analyses. Results: With equation developed and accuracy of 87% with KNN, was possible to develop a drop out risk score with values between 0 and 1,000, where the closer to 0, the greater the probability of the student to drop out. Contributions and Impact in the IS area: The main contribution of the paper is to provide a new method to assist in the analysis of higher education dropout in Information System and other courses.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "647a04257971571cf388d18d64a9fcc8",
    "relevant_keywords": [
      "machine learning",
      "classification",
      "KNN"
    ],
    "stage1_timestamp": "2025-05-15T02:33:03.392383"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究使用机器学习技术（KNN）来预测高等教育中学生辍学的风险，其应用场景是教育领域而非金融领域。虽然涉及风险评估，但并非金融风险管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究使用机器学习技术（KNN）来预测高等教育中学生辍学的风险，其应用场景是教育领域而非金融领域。虽然涉及风险评估，但并非金融风险管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:34:18.301011"
}