{
  "paper": {
    "id": 2904,
    "title": "Credit risk assessment on fuzzy proximal SVM for multi-class classification",
    "abstract": "Due to recent financial crises and regulatory concerns, financial intermediaries' credit risk assessment is an area of renewed interest in both the academic world and the business community. In this paper, we propose a multi-category extension of fuzzy proximal support vector machines, where a fuzzy membership is assigned to each data point. Patterns are classified by assigning them to the nearest of M parallel planes, which are proximal to one of the M-categories and separate a category from the rest. The algorithm is simple and fast as no quadratic or linear programming problem is solved. The credit risk assessment also can be seen as an M-categories classification problem. And we hope to find a more effectively method to solve it through this algorithm.",
    "year": 2008,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "991e566c5c9b3ddc6bef5e4a4f5b512a",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM"
    ],
    "stage1_timestamp": "2025-05-15T02:20:16.971576"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on credit risk assessment, which is a key component of financial risk management. The proposed method aims to improve the classification of credit risk, directly addressing risk evaluation and mitigation in financial contexts.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on credit risk assessment, which is a key component of financial risk management. The proposed method aims to improve the classification of credit risk, directly addressing risk evaluation and mitigation in financial contexts.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:39:20.727087"
}