{
  "paper": {
    "id": 3663,
    "title": "IDENTIFICATION OF FACTORS FOR ASSESSING CREDIT RATING OF NON-FINANCIAL COMPANIES",
    "abstract": "Goal: an improvement of the quality and accuracy of credit rating estimation, to add non-financial companies' characteristics to the assessment, and to compare the importance of factors for different industries and countries. Methodology: the use of exploratory factor analysis and ordered logistic regression models. The study is based on publicly available data on non-financial companies from different industries and countries for the period from 2007 to 2021. Findings: a group of financial variables is the most significant in credit risk assessment for companies from developed countries, for emerging markets, macroeconomic variables mostly determine credit ratings instead. The nonfinancial variables have diverse effects, but as a group increase the accuracy of the credit rating assessment. Originality and contribution of the authors: there is limited research on the topic of credit rating assessment of non-financial companies with the inclusion of non-financial factors. In addition, the presented research contributes to the search for new relevant indicators that can be introduced instead of the qualitative variables used by international rating agencies and requiring expert assessment.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "17a200fadfd975755a85da3ec23773db",
    "relevant_keywords": [
      "regression",
      "principal components analysis"
    ],
    "stage1_timestamp": "2025-05-15T02:29:00.006243"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on improving the quality and accuracy of credit rating estimation for non-financial companies, which is a key aspect of credit risk assessment in financial risk management. The use of exploratory factor analysis and ordered logistic regression models to identify significant factors for credit rating directly addresses risk evaluation and mitigation strategies.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on improving the quality and accuracy of credit rating estimation for non-financial companies, which is a key aspect of credit risk assessment in financial risk management. The use of exploratory factor analysis and ordered logistic regression models to identify significant factors for credit rating directly addresses risk evaluation and mitigation strategies.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:35:33.825673"
}