{
  "paper": {
    "id": 2194,
    "title": "Digital Bank Runs: A Deep Neural Network Approach",
    "abstract": "The introduction of Central Bank Digital Currency (CBDC) could represent a deep structural change to the financial sector, and in particular to the banking sector. This paper proposes a Deep Neural Network (DNN) design to model the introduction of CBDC and its potential impact on commercial banks' deposits. The model proposed forecasts the likelihood of the occurrence of bank runs as a function of the system characteristics and of the intrinsic features of CBDC. The success rate of CBDC and the impact on the banking sector is highly dependent on its design. Whether CBDC should carry any form of interest, if the amount of CBDC should be capped by account or if convertibility from banks' deposits should be guaranteed by commercial banks are important features to consider. Further, the design of CBDC needs to contribute to enhancing the sustainability of the financial system, hence a CBDC design that promotes financial inclusion is paramount. The model is initially calibrated with Euro area system data. Results show that an increase in the financial system risk perception would trigger a significant transfer of wealth from bank deposits to CBDC, while the wealth transfer to CBDC is to a lesser extent also sensitive to its interest rate.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "84583b1d937447599ecbae3fcf16a910",
    "relevant_keywords": [
      "neural network",
      "deep learning",
      "deep neural network",
      "DNN"
    ],
    "stage1_timestamp": "2025-05-15T02:12:17.451747"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用深度神经网络模型来预测银行挤兑的可能性，并分析中央银行数字货币（CBDC）对商业银行存款的潜在影响。这属于金融风险管理的范畴，因为它涉及评估和管理金融系统中的风险。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是使用深度神经网络模型来预测银行挤兑的可能性，并分析中央银行数字货币（CBDC）对商业银行存款的潜在影响。这属于金融风险管理的范畴，因为它涉及评估和管理金融系统中的风险。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:43:42.829010"
}