{
  "paper": {
    "id": 186,
    "title": "Identification of Enterprise Financial Risk Based on Clustering Algorithm",
    "abstract": "In order to solve the problem that corporate financial risks seriously affect the healthy development of enterprises, credit institutions, securities investors, and even the whole of China, the K-means clustering algorithm, the risk screening process, and the Gaussian mixture clustering algorithm, the risk screening process, are proposed; experiments have shown that although the number of high-risk companies selected by the K-means algorithm is small, only 9% of the full sample, the high-risk cluster can contain nearly 30% of the new special treatment companies. If the time period is extended to the next 5 years, this proportion will be higher. Finally we found that if the prediction of special handling events is used as the criterion for evaluating high-risk clusters, then K-means clustering can effectively screen out those risky companies that need to be treated with caution by investors. The validity of the experiment is verified.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "22af65fe512db7cc5bceea8b3dfc7a12",
    "relevant_keywords": [
      "unsupervised learning",
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T01:47:53.002889"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on identifying corporate financial risks using clustering algorithms, specifically targeting high-risk companies for investors and credit institutions, which falls under the domain of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on identifying corporate financial risks using clustering algorithms, specifically targeting high-risk companies for investors and credit institutions, which falls under the domain of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:00:21.314334"
}