{
  "paper": {
    "id": 3537,
    "title": "EXPLORING THE ASYMMETRIC EFFECTS OF ECONOMIC POLICY UNCERTAINTY AND IMPLIED VOLATILITIES ON ENERGY FUTURES RETURNS: NOVEL INSIGHTS FROM QUANTILE-ON-QUANTILE REGRESSION",
    "abstract": "This study examined the asymmetric effects of major uncertainty and volatility indices (economic policy uncertainty, Chicago Board Options Exchange crude oil volatility, CBOE volatility index, CBOE VIX volatility, and NASDAQ 100 volatility target) on the returns of global energy and its constituents (global energy index, Brent, heating oil, natural gas, and petroleum). The causality-in-quantiles test and the quantile-on-quantile regression technique were employed on daily data covering the period between April 2012 and March 2022. The findings evidenced asymmetries and heterogeneity in the causal effects of global uncertainty and market volatilities on energy markets. For all uncertainty and volatility measures, we found strong negative relationships with energy commodities at stressed conditions, signalling some hedging benefits for market participants. The current research is among the first investigations to explore the asymmetric relationships between major uncertainty and volatility indices, as well as global energy and its constituents. Essential portfolio implications of our findings are discussed.",
    "year": 2022,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "1f34e636327e66c521cf9f0755b445da",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:17:54.234523"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk",
      "Portfolio Management"
    ],
    "justification": "该论文研究了经济政策不确定性和隐含波动率对能源期货回报的不对称影响，并讨论了这些发现对投资组合管理的重要启示。此外，研究还涉及市场压力条件下的对冲策略，这属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\", \"投资组合管理\"],\n  \"justification\": \"该论文研究了经济政策不确定性和隐含波动率对能源期货回报的不对称影响，并讨论了这些发现对投资组合管理的重要启示。此外，研究还涉及市场压力条件下的对冲策略，这属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:09:39.616894"
}