{
  "paper": {
    "id": 2676,
    "title": "A hybrid framework using explainable AI (XAI) in cyber-risk management for defence and recovery against phishing attacks",
    "abstract": "Phishing and social engineering contribute to various cyber incidents such as data breaches and ransomware attacks, financial frauds, and denial of service attacks. Often, phishers discuss these attack vectors in dark forums. Further, the probability of phishing attacks and the subsequent loss suffered by the firm are highly correlated. In this context, we propose a hybrid framework using explainable AI techniques to assess cyber-risks generated from correlated phishing attacks. The first phase computes the probability of expert phishers within a community of similar attackers with varying expertise. The second phase calculates the probability of phishing attacks upon a firm even after it has invested in IT security and adopted regulatory steps. The third phase categorises phishing and genuine URLs using various machine-learning-based classifiers. Next, it estimates the joint distribution of phishing attacks using an exponential-beta distribution and quantifies the expected loss using Archimedean Copula. Finally, we offer recommendations for firms through the computation of optimal investments in cyberinsurance versus IT security. First, based on the risk attitude of a firm, it can use this explainable-AI (XAI) framework to optimally invest in building security into its enterprise architecture and plan for cyber-risk mitigation strategies. Second, we identify a long-tail phenomenon demonstrated by the losses suffered during most cyber-attacks, which are not one-off incidents and are correlated. Third, contrary to the belief that cyberinsurance markets are ineffective, it can guide financial firms to design realistic cyber-insurance products.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "d45e62bc1a0eaaa22eee14911241842c",
    "relevant_keywords": [
      "machine learning",
      "classification",
      "explainable AI (XAI)"
    ],
    "stage1_timestamp": "2025-05-15T02:18:06.148198"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要关注的是使用可解释AI（XAI）技术来评估和管理网络钓鱼攻击带来的网络风险，并提出了一种混合框架来优化企业在网络安全和网络保险方面的投资。虽然涉及风险评估和保险产品设计，但其核心应用领域是网络安全而非金融风险管理、衍生品定价或投资组合管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要关注的是使用可解释AI（XAI）技术来评估和管理网络钓鱼攻击带来的网络风险，并提出了一种混合框架来优化企业在网络安全和网络保险方面的投资。虽然涉及风险评估和保险产品设计，但其核心应用领域是网络安全而非金融风险管理、衍生品定价或投资组合管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:40:39.799104"
}