{
  "paper": {
    "id": 49,
    "title": "Application of classification and regression tree (CRT) analysis to identify the agricultural households at risk of financial exclusion",
    "abstract": "The article deals with the problem of using the classification and regression trees (CRT) method to identify socio-economic features of agricultural households at risk of financial exclusion. Financial exclusion applies to people/households who do not use or use financial services and products to a small extent, both of their own choice and due to barriers in accessing financial products and services. The research used empirical data on agricultural households in Central Pomerania (Poland). Based on the use of the decision tree method, it was shown that nearly half of the surveyed farms do not use financial products and services or use them to a small extent, therefore they are financially excluded. Higher acreage indicates a lower risk of financial exclusion. The age of the household head influences the risk of financial exclusion. The fact of saving confirms the desire to multiply capital, hence in the group of farms where this occurs, the risk of financial exclusion is lower than in the remaining ones. (C) 2021 The Authors. Published by Elsevier B.V. This is an open access article under the CC BY-NC-ND license (https://crativecommons.org/licenses/by-nc-nd/4.0) Peer-review under responsibility of the scientific committee of KES International.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "4ad16c13d8b7bf1b3287b025914e83ed",
    "relevant_keywords": [
      "classification",
      "regression",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T01:46:03.893323"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究使用分类和回归树（CRT）方法识别农业家庭面临金融排斥的风险，并未涉及衍生品定价、金融风险管理或投资组合管理等特定金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究使用分类和回归树（CRT）方法识别农业家庭面临金融排斥的风险，并未涉及衍生品定价、金融风险管理或投资组合管理等特定金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:01:14.073301"
}