{
  "paper": {
    "id": 2801,
    "title": "Revisiting SME default predictors: The Omega Score",
    "abstract": "SME default prediction is a long-standing issue in the finance and management literature. Proper estimates of the SME risk of failure can support policymakers in implementing restructuring policies, rating agencies and credit analytics firms in assessing creditworthiness, public and private investors in allocating funds, entrepreneurs in accessing funds, and managers in developing effective strategies. Drawing on the extant management literature, we argue that introducing management- and employee-related variables into SME prediction models can improve their predictive power. To test our hypotheses, we use a unique sample of SMEs and propose a novel and more accurate predictor of SME default, the Omega Score, developed by the Least Absolute Shortage and Shrinkage Operator (LASSO). Results were further confirmed through other machine-learning techniques. Beyond traditional financial ratios and payment behavior variables, our findings show that the incorporation of change in management, employee turnover, and mean employee tenure significantly improve the model's predictive accuracy.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "0afe4f7dc0e754a2a7e12def07d54b7f",
    "relevant_keywords": [
      "machine learning",
      "classification",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:19:08.483211"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on developing a novel predictor (Omega Score) for SME default prediction using machine learning techniques, which is directly related to assessing and managing credit risk, a key aspect of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on developing a novel predictor (Omega Score) for SME default prediction using machine learning techniques, which is directly related to assessing and managing credit risk, a key aspect of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:40:08.414772"
}