{
  "paper": {
    "id": 4310,
    "title": "ANN prediction model of final construction cost at an early stage",
    "abstract": "Previous studies developed models to predict final construction cost (FCC) values based on many inputs, which makes them difficult to use. However, relying on models with relatively few inputs will reduce the accuracy of the prediction results. This paper aims to develop an artificial neural network (ANN) model to predict the FCC based on contract cost (CC), contract duration, and project sector at an early stage of a project. The data collected and used for the ANN model was 135 Saudi Arabian construction projects. The Zavadskas and Turskis logarithmic approaches, and the Pasini method were utilized to overcome the limited data. Then, the ANN model was developed through two stages. The purpose of the first stage was to enhance the data by identifying the abnormal data using absolute percentage errors (APE). The enhanced data was used to develop the ANN in the second stage. The finding showed that the ANN model provided an average MAPE (mean absolute percentage error) of 18.7%. The MAPE of the ANN model is decreased to 8.7% on average by deleting data with an APE higher than 35%. The model allows stakeholders to evaluate the financial importance of potential risks and develop appropriate risk management strategies.",
    "year": 2025,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "c84c69c14baf3d3c44e2601043add5da",
    "relevant_keywords": [
      "machine learning",
      "neural network",
      "backpropagation",
      "BP",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T02:35:26.368572"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究使用人工神经网络（ANN）模型预测建筑项目的最终成本，虽然提到了风险评估，但其核心应用领域是建筑项目管理而非金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究使用人工神经网络（ANN）模型预测建筑项目的最终成本，虽然提到了风险评估，但其核心应用领域是建筑项目管理而非金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:33:21.937785"
}