{
  "paper": {
    "id": 2317,
    "title": "Machine Learning in Transaction Monitoring: The Prospect of xAI",
    "abstract": "Banks hold a societal responsibility and regulatory requirements to mitigate the risk of financial crimes. Risk mitigation primarily happens through monitoring customer activity through Transaction Monitoring (TM). Recently, Machine Learning (ML) has been proposed to identify suspicious customer behavior, which raises complex socio-technical implications around trust and explainability of ML models and their outputs. However, little research is available due to its sensitivity. We aim to fill this gap by presenting empirical research exploring how ML supported automation and augmentation affects the TM process and stakeholders' requirements for building eXplainable Artificial Intelligence (xAI). Our study finds that xAI requirements depend on the liable party in the TM process which changes depending on augmentation or automation of TM. Context-relatable explanations can provide much-needed support for auditing and may diminish bias in the investigator's judgement. These results suggest a use case-specific approach for xAI to adequately foster the adoption of ML in TM.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "dd3528d0bec42f36d48da42d9764f1fb",
    "relevant_keywords": [
      "machine learning",
      "explainable artificial intelligence (xAI)"
    ],
    "stage1_timestamp": "2025-05-15T02:14:19.537107"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要研究机器学习在交易监控（Transaction Monitoring）中的应用，旨在通过可解释的人工智能（xAI）来识别可疑的客户行为，从而减轻金融犯罪的风险。这直接关联到金融机构的风险管理活动，特别是反洗钱（AML）和欺诈检测等金融风险管理领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文主要研究机器学习在交易监控（Transaction Monitoring）中的应用，旨在通过可解释的人工智能（xAI）来识别可疑的客户行为，从而减轻金融犯罪的风险。这直接关联到金融机构的风险管理活动，特别是反洗钱（AML）和欺诈检测等金融风险管理领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:43:18.549863"
}