{
  "paper": {
    "id": 3989,
    "title": "Predicting Stock Price Falls Using News Data: Evidence from the Brazilian Market",
    "abstract": "Market participants use a wide set of information before they decide to invest in risk assets, such as stocks. Investors often follow the news to collect the information that will help them decide which strategy to follow. In this study, we analyze how public news and historical prices can be used together to anticipate and prevent financial losses on the Brazilian stock market. We include an extensive set of 64 securities in our analysis, which represent various sectors of the Brazilian economy. Our analysis compares the traditional Buy & Hold and the moving average strategies to several experiments designed with 11 machine learning algorithms. We explore daily, weekly and monthly time horizons for both publication and return windows. With this approach we were able to assess the most relevant set of news for investor's decision, and to determine for how long the information remains relevant to the market. We found a strong relationship between news publications and stock price changes in Brazil, suggesting even short-term arbitrage opportunities. The study shows that it is possible to predict stock price falls using a set of news in Portuguese, and that text mining-based approaches can overcome traditional strategies when forecasting losses.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "af59f31efb35a319fe755a423a0dc327",
    "relevant_keywords": [
      "machine learning",
      "classification",
      "regression",
      "support vector machine",
      "SVM",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T02:31:58.645827"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是利用机器学习和新闻数据分析来预测股票价格下跌，从而帮助投资者做出更好的投资决策。这属于投资组合管理的范畴，因为它涉及资产选择和策略优化，以最大化回报或最小化风险。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是利用机器学习和新闻数据分析来预测股票价格下跌，从而帮助投资者做出更好的投资决策。这属于投资组合管理的范畴，因为它涉及资产选择和策略优化，以最大化回报或最小化风险。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:34:42.765488"
}