{
  "paper": {
    "id": 1059,
    "title": "Building up Explainability in Multi-layer Perceptrons for Credit Risk Modeling",
    "abstract": "Granting loans is one of the major concerns of financial institutions due to the risks of default borrowers. Default prediction by the neural networks is a popular technique for credit risk modeling. Neural networks generally offer the accurate predictions that help banks to prevent financial losses and grow their business by approving more creditworthy borrowers. Although neural networks are capable of capturing the complex, non-linear relationships between a large number of features and output, these models act as black boxes. This is a graduation project paper that is focused on loan default risk prediction by multi-layer perceptron neural network and building up explainability to some degree in the trained neural networks through sensitivity analysis. The architecture of a multi-layer perceptron neural network with the best result is used to help the credit-risk manager in explaining why an applicant is a defaulter or non-defaulter. The prediction of a trained multi-layer perceptron neural network is explained by mapping input features and target variables directly using a model-agnostic explanation as well as a model-specific explanation. Lastly, a comparison is performed between two explanation methods.",
    "year": 2020,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "fe22cc30255bfa6a995828e2433922d3",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "neural network",
      "deep learning",
      "backpropagation",
      "BP",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T01:58:08.672218"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on loan default risk prediction using multi-layer perceptron neural networks, which is a key aspect of credit risk modeling. Credit risk modeling is a subfield of financial risk management, as it involves assessing and mitigating the risk of financial losses due to borrower defaults.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on loan default risk prediction using multi-layer perceptron neural networks, which is a key aspect of credit risk modeling. Credit risk modeling is a subfield of financial risk management, as it involves assessing and mitigating the risk of financial losses due to borrower defaults.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:52:20.489522"
}