{
  "paper": {
    "id": 376,
    "title": "An AI-assisted method artefact for investing decision: automatic identification of winning stocks within a value portfolio",
    "abstract": "PurposeThis paper combines the key aspects of artefact-based systems. DSS and artificial intelligence in a unified approach to solve a typical financial analysis problem within the design science paradigm.Design/methodology/approachOur proposition is based on the seven design science guidelines. Our proposed method artefact is a financial application catering to the investment domain in particular. We present a detailed analysis of stock data from the Indian market for an extended period of 17 years by deploying state-of-the-art algorithms. The use of computational intelligence involving machine and deep learning helps in automatically identifying winning stocks within a value portfolio, that too, on a forward-looking basis.FindingsOur method artefact depicts superior results by identifying outperforming stocks, differentiated from the weak ones, within the value portfolio.Originality/valueThis has significant implications for the investing community, particularly the Indian investors. Traditional research in value stocks has shown underwhelming performance in differentiating lucrative stocks from the rest.",
    "year": 2025,
    "source": "WOS",
    "area": "portfolio",
    "method": "deep learning",
    "cache_key": "c2da302bc14fb98235fdbe8a2ed7e05f",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "neural network",
      "representation learning"
    ],
    "stage1_timestamp": "2025-05-15T00:35:17.495298"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是使用机器学习和深度学习算法自动识别价值投资组合中的优胜股票，这直接应用于投资组合管理的领域，旨在优化投资决策和提升投资组合表现。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是使用机器学习和深度学习算法自动识别价值投资组合中的优胜股票，这直接应用于投资组合管理的领域，旨在优化投资决策和提升投资组合表现。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:35:03.697136"
}