{
  "paper": {
    "id": 1380,
    "title": "An Analysis of Financial Distress Early-Warning System Based on Fuzzy Clustering and Fuzzy Recognition Models",
    "abstract": "Financial distress early-warning system is regarded as an effective instrument to control corporate financial risk. Considering the accessibility of the data, public company is adopted as our research object and divided into two groups: special treatment (ST) companies and non-ST companies. In this paper, financial indicator system is first set, and then integrated with the fuzzy clustering and fuzzy recognition model to categorize and forecast the corporate financial distress status. By utilizing fuzzy clustering model, our estimated sample is classified as severe, moderate, mild, and healthy based on different degrees of corporate financial distress. Then, fuzzy recognition is applied to the estimated sample according to the indicators' eigen values. The outcomes indicate that forecasting results obtained by the fuzzy clustering model are close to the realities, which suggest our financial distress early-warning system with four distress degrees, are feasible and satisfactory. For another side, it is shown that corporate financial status has the effect of accumulation and sustainability.",
    "year": 2015,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "65320b7d75fcceebe4da1d2dbf0760e8",
    "relevant_keywords": [
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T02:02:22.722353"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on developing a financial distress early-warning system using fuzzy clustering and recognition models to categorize and forecast corporate financial distress status, which is directly related to managing financial risks in corporations.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on developing a financial distress early-warning system using fuzzy clustering and recognition models to categorize and forecast corporate financial distress status, which is directly related to managing financial risks in corporations.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:49:25.865589"
}