{
  "paper": {
    "id": 4785,
    "title": "Landslide susceptibility assessment for Uttarakhand, a Himalayan state of India, using multi-criteria decision making, bivariate, and machine learning models",
    "abstract": "BackgroundLandslides, among the most catastrophic natural hazards, result from natural and anthropogenic factors, causing substantial financial losses, infrastructural damage, fatalities, and environmental degradation. Uttarakhand, with its unique topographical and hydrological conditions, unplanned human settlements, and changing precipitation patterns, is highly susceptible to landslides.MethodsThis study evaluates landslide susceptibility for Uttarakhand, a Himalayan state in India, by employing bivariate analysis, multi-criteria decision-making, and advanced machine learning models, such as Random Forest and Extreme Gradient Boosting (XGBoost). A total of sixteen landslide influencing factors were used for performing landslide hazard susceptibility zonation, including the innovative use of geomorphons for detailed terrain analysis.ResultsApproximately 18.47% of the study area was classified as high to very high landslide susceptibility zones, and 21% was classified into the moderate susceptibility category. High to very high susceptibility zones were concentrated in the Uttarkashi, Chamoli, and Pithoragarh districts of the Lesser and Higher Himalayas, areas characterized by rangelands and high annual rainfall. Conversely, very low to low susceptibility zones were predominantly located in the Tarai-Bhabar and Sub-Himalayan districts, including Haridwar and Udham Singh Nagar. The Random Forest and XGBoost models demonstrated superior predictive performance.ConclusionsThe spatially explicit landslide susceptibility maps provide critical insights for urban planners, disaster management agencies, and environmentalists, aiding in developing effective strategies for landslide risk reduction and promoting sustainable development in Uttarakhand. This study exemplifies applying advanced analytical techniques to address landslide susceptibility and related soil erosion and water resource management challenges in Uttarakhand.",
    "year": 2025,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "0b7869261aa244da75134ebc426dbf19",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "regression",
      "decision tree",
      "neural network",
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T02:41:00.844165"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究滑坡易发性评估，应用机器学习模型进行自然灾害风险评估，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究滑坡易发性评估，应用机器学习模型进行自然灾害风险评估，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:31:56.961558"
}