{
  "paper": {
    "id": 8581,
    "title": "Artificial intelligence in financial services: a qualitative research to discover robo-advisory services",
    "abstract": "Purpose The purpose of this study is to gauge the awareness and perception of Indian individual investors about a new fintech innovation known as robo-advisors in the wealth management scenario. Robo-advisors are comprehensive automated online advisory platforms that help investors in managing wealth by recommending portfolio allocations, which are based on certain algorithms. Design/methodology/approach This is a phenomenological qualitative study that used five focussed group discussions to gather the stipulated information. Purposive sampling was used and the sample comprised investors who actively invest in the Indian stock market. A semi-structured questionnaire and homogeneous discussions were used for this study. Discussion time for all the groups was 203 min. One of the authors moderated the discussions and translated the audio recordings verbatim. Subsequently, content analysis was carried out by using the NVIVO 12 software (QSR International) to derive different themes. Findings Factors such as cost-effectiveness, trust, data security, behavioural biases and sentiments of the investors were observed as crucial points which significantly impacted the perception of the investors. Furthermore, several suggestions on different ways to enhance the awareness levels of investors were brought up by the participants during the discussions. It was observed that some investors perceive robo-advisors as only an alternative for fund/wealth managers/brokers for quantitative analysis. Also, they strongly believe that human intervention is necessary to gauge the emotions of the investors. Hence, at present, robo-advisors for the Indian stock market, act only as a supplementary service rather than a substitute for financial advisors. Research limitations/implications Due to the explorative nature of the study and limited participants, the findings of the study cannot be generalised to the overall population. Future research is imperative to study the dynamic nature of artificial intelligence (AI) theories and investigate whether they are able to capture the sentiments of individual investors and human sentiments impacting the market. Practical implications This study gives an insight into the awareness, perception and opinion of the investors about robo-advisory services. From a managerial perspective, the findings suggest that additional attention needs to be devoted to the adoption and inculcation of AI and machine learning theories while building algorithms or logic to come up with effective models. Many investors expressed discontent with the current design of risk profiles of the investors. This helps to provide feedback for developers and designers of robo-advisors to include advanced and detailed programming to be able to do risk profiling in a more comprehensive and precise manner. Social implications In the future, robo-advisors will change the wealth management scenario. It is well-established that data is the new oil for all businesses in the present times. Technologies such as robo-advisor, need to evolve further in terms of predicting unstructured data, improvising qualitative analysis techniques to include the ability to gauge emotions of investors and markets in real-time. Additionally, the behavioural biases of both the programmers and the investors need to be taken care of simultaneously while designing these automated decision support systems. Originality/value This study fulfils an identified gap in the literature regarding the investors' perception of new fintech innovation, that is, robo-advisors. It also clarifies the confusion about the awareness level of robo-advisors amongst Indian individual investors by examining their attitudes and by suggesting innovations for future research. To the best of the authors' knowledge, this study is the first to investigate the awareness, perception and attitudes of individual investors towards robo-advisors.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "f2f79c7f195a6148feaf5122435387ec",
    "relevant_keywords": [
      "machine learning",
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T03:20:22.211449"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文主要研究robo-advisors在财富管理中的应用，特别是通过算法推荐投资组合分配，这属于投资组合管理的范畴。论文并未涉及衍生品定价或金融风险管理的具体应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文主要研究robo-advisors在财富管理中的应用，特别是通过算法推荐投资组合分配，这属于投资组合管理的范畴。论文并未涉及衍生品定价或金融风险管理的具体应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:25:36.133361"
}