{
  "paper": {
    "id": 674,
    "title": "Cryptocurrency Price Analysis With Artificial Intelligence",
    "abstract": "Cryptocurrency is playing an increasingly important role in reshaping the financial system due to its growing popular appeal and mechant acceptance. While many people are making investments in Cryptocurrency, the dynamical features, uncertainty, the predictability of Cryptocurrency are still mostly unknown, which dramatically risk the investments. It is a matter to try to understand the factors that infiuence the value formation. In this study, we use advanced artificial intelligence frameworks of fully connected Artificial Neural Network (ANN) and Long Short-Term Memory (LSTM) Recurrent Neural Network to analyse the price dynamics of Bitcoin, Etherum, and Ripple. We find that ANN tends to rely more on long-term history while LSTM tends to rely more on short-term dynamics, which indicate the efficiency of LSTM to utilise useful information hidden in historical memory is stronger than ANN. However, given enough historical information ANN can achieve a similar accuracy, compared with LSTM. This study provides a unique demonstration that Cryptocurrency market price is predictable. However, the explanation of the predictability could vary depending on the nature of the involved machine-learning model.",
    "year": 2019,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "c7fca992eb842191509a644adcc5b573",
    "relevant_keywords": [
      "machine learning",
      "neural network",
      "deep learning",
      "recurrent neural network",
      "long short-term memory",
      "LSTM"
    ],
    "stage1_timestamp": "2025-05-15T01:53:59.311365"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究使用人工智能模型（如ANN和LSTM）分析加密货币价格动态，并未明确指出其在衍生品定价、金融风险管理或投资组合管理等特定金融领域的应用。虽然加密货币价格预测可能与投资决策相关，但论文并未具体讨论这些金融领域的应用场景或目标。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究使用人工智能模型（如ANN和LSTM）分析加密货币价格动态，并未明确指出其在衍生品定价、金融风险管理或投资组合管理等特定金融领域的应用。虽然加密货币价格预测可能与投资决策相关，但论文并未具体讨论这些金融领域的应用场景或目标。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:55:52.397346"
}