{
  "paper": {
    "id": 2759,
    "title": "Predictors of Hospital-Acquired Urinary Tract-Related Bloodstream Infection",
    "abstract": "OBJECTIVE. Bloodstream infection (BSI) secondary to nosocomial urinary tract infection is associated with substantial morbidity, mortality, and additional financial costs. Our objective was to identify predictors of nosocomial urinary tract-related BSI. DESIGN. Matched case-control study. SETTING. Midwestern tertiary care hospital. PATIENTS. Cases () were patients with n = 298 a positive urine culture obtained more than 48 hours after admission and a blood culture obtained within 14 days of the urine culture that grew the same organism. Controls (n = 667), selected by incidence density sampling, included patients with a positive urine culture who were at risk for BSI but did not develop one. METHODS. Conditional logistic regression and classification and regression tree analyses. RESULTS. The most frequently isolated microorganisms that spread from the urinary tract to the bloodstream were Enterococcus species. Independent risk factors included neutropenia (odds ratio [OR], 10.99; 95% confidence interval [CI], 5.78-20.88), renal disease (OR, 2.96; 95% CI, 1.98-4.41), and male sex (OR, 2.18; 95% CI, 1.52-3.12). The probability of developing a urinary tract-related BSI among neutropenic patients was 70%. Receipt of immunosuppressants (OR, 1.53; 95% CI, 1.04-2.25), insulin (OR, 4.82; 95% CI, 2.52-9.21), and antibacterials (OR, 0.66; 95% CI, 0.44-0.97) also significantly altered risk. CONCLUSIONS. The heightened risk of urinary tract-related BSI associated with several comorbid conditions suggests that the management of nosocomial bacteriuria may benefit from tailoring to certain patient subgroups. Consideration of time-dependent risk factors, such as medications, may also help guide clinical decisions in reducing BSI. Infect Control Hosp Epidemiol 2012;33(10):1001-1007",
    "year": 2012,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "1508fc07737c24416dc9c47946a32ab4",
    "relevant_keywords": [
      "classification",
      "regression",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T02:18:37.224954"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究医院获得性尿路相关血流感染的预测因素，属于医学领域，与金融研究领域无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究医院获得性尿路相关血流感染的预测因素，属于医学领域，与金融研究领域无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:40:10.530908"
}