{
  "paper": {
    "id": 1685,
    "title": "An Application of the Smart Beta Portfolio Model: An Empirical Study in Indonesia Stock Exchange",
    "abstract": "Stock price fluctuations affect investor returns, particularly, in this pandemic situation that has triggered stock market shocks. As a result of this situation, investors prefer to move their money into a safer portfolio. Therefore, in this study, we approach an efficient portfolio model using smart beta and combining others to obtain a fast method to predict investment stock returns. Smart beta is a method to selects stocks that will enter a portfolio quickly and concisely by considering the level of return and risk that has been set according to the ability of investors. A smart beta portfolio is efficient because it tracks with an underlying index and is optimized using the same techniques that active portfolio managers utilize. Using the logistic regression method and the data of 100 low volatility stocks listed on the Indonesia stock exchange from 2009-2019, an efficient portfolio model was made. It can be concluded that an efficient portfolio is formed by a group of stocks that are aggressive and actively traded to produce optimal returns at a certain level of risk in the long-term period. And also, the portfolio selection model generated using the smart beta, beta, alpha, and stock variants is a simple and fast model in predicting the rate of return with an adjusted risk level so that investors can anticipate risks and minimize errors in stock selection.",
    "year": 2021,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "f7e12858a8fae8d8fa8dbe737c5499b3",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T00:58:18.417826"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文主要研究使用智能贝塔（smart beta）方法构建高效的投资组合，并通过回归分析预测股票回报率，这直接属于投资组合管理的范畴。论文的核心目标是优化投资组合以在特定风险水平下获得最优回报，并未涉及衍生品定价或金融风险管理的具体应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Portfolio Management\"],\n  \"justification\": \"该论文主要研究使用智能贝塔（smart beta）方法构建高效的投资组合，并通过回归分析预测股票回报率，这直接属于投资组合管理的范畴。论文的核心目标是优化投资组合以在特定风险水平下获得最优回报，并未涉及衍生品定价或金融风险管理的具体应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:19:35.317216"
}