{
  "paper": {
    "id": 3389,
    "title": "Population age structure and household portfolio choices in Italy",
    "abstract": "Based on the exceptional ageing of the Italian population, this paper aims to contribute to the current debate on population ageing and financial markets. To this end, we use the data taken by the Bank of Italy Survey of Household Income and Wealth over the period 1995-2006, and we analyse the average household portfolios in relation to age and net wealth (NW). Our analysis rests on a clustering of assets according to risk, which is different from the one used in Guiso and Jappelli (Guiso, L., and T. Jappelli. 2002. The portfolio of Italian households. In Household portfolios, eds. L. Guiso, M. Haliassos, and T. Jappelli. Cambridge: MIT Press). We find that age has affected financial choices of Italian households over the whole decade, but the portfolio age profile has significantly evolved over time with important differences across wealth quartiles. Overall, our analysis highlights a tendency towards a hump-shaped age profile of the allocation in risky assets for the most NW levels.",
    "year": 2010,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "7398e8c97bc5d126a14f4929017e1267",
    "relevant_keywords": [
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T02:25:40.182885"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "The paper analyzes household portfolio choices in relation to age and net wealth, focusing on the allocation of risky assets and the evolution of portfolio age profiles. This directly pertains to the field of portfolio management, as it examines how demographic factors influence investment decisions and asset allocation strategies.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Portfolio Management\"],\n  \"justification\": \"The paper analyzes household portfolio choices in relation to age and net wealth, focusing on the allocation of risky assets and the evolution of portfolio age profiles. This directly pertains to the field of portfolio management, as it examines how demographic factors influence investment decisions and asset allocation strategies.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:36:50.225092"
}