{
  "paper": {
    "id": 495,
    "title": "Optimization model for enterprise financial management utilizing genetic algorithms and fuzzy logic",
    "abstract": "This study explores the complexities of enterprise financial management by optimizing financial models with a particular focus on enhancing risk prediction performance. A multi-objective mathematical model is first developed to establish key optimization goals, including cost reduction, improved capital utilization, and increased economic benefits. This model systematically defines decision variables and optimization objectives, providing a comprehensive framework for enterprise financial management. To improve predictive accuracy, the study integrates genetic algorithms with back-propagation (BP) neural networks, leveraging genetic algorithms to optimize the neural network's parameters and structure. Additionally, a hierarchical reinforcement learning model based on fuzzy reasoning (HRL-FR) is proposed to enhance decision-making capabilities. This model employs hierarchical decision-making and policy optimization, incorporating fuzzy reasoning to address uncertainties in complex and dynamic financial environments. Experimental validation using the Compustat dataset confirms the effectiveness of the proposed model. Key financial variables, including the working capital asset ratio and debt-to-equity ratio, are identified as significant influencers of prediction accuracy, reinforcing the model's robustness. The genetic algorithm's search and optimization process identifies parameter combinations that maximize neural network performance, further improving predictive capabilities. Comprehensive evaluations conducted on the Center for Research in Security Prices (CRSP) and Compustat datasets for 2022 confirm the HRL-FR model's superior ability to predict and analyze enterprise financial management information accurately. The model demonstrates higher profitability, enhanced efficiency, and predictive curves that closely align with optimal financial models. These findings highlight the HRL-FR model's potential as a powerful tool for enterprise financial management optimization, offering valuable insights for risk mitigation and strategic decision-making.",
    "year": 2025,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "da66c8d818f075448cde5193083684cd",
    "relevant_keywords": [
      "machine learning",
      "reinforcement learning",
      "neural network",
      "deep learning",
      "backpropagation",
      "BP",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T01:51:31.309152"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要研究企业财务管理的优化模型，特别关注风险预测性能的提升，并使用了遗传算法和模糊逻辑来增强决策能力。这些技术和方法主要用于金融风险管理领域，以提高预测准确性和决策效率。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文主要研究企业财务管理的优化模型，特别关注风险预测性能的提升，并使用了遗传算法和模糊逻辑来增强决策能力。这些技术和方法主要用于金融风险管理领域，以提高预测准确性和决策效率。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:57:36.968009"
}