{
  "paper": {
    "id": 2525,
    "title": "ADVANCED ENTERPRISE ASSET MANAGEMENT SYSTEMS: IMPROVE PREDICTIVE MAINTENANCE AND ASSET PERFORMANCE BY LEVERAGING INDUSTRY 4.0 AND THE INTERNET OF THINGS (IOT)",
    "abstract": "Advanced Enterprise Asset Management (EAM) is an approach through which an organization's assets are systematically and proactively managed throughout their lifecycle - from installation through disposition. The objective of EAM is to prolong the service life and maximize utilization of the assets via adoption of leading-edge standards, practices, and technology. Organizations that implement advanced EAM benefit from reduced operating expenses (OPEX), reduced capital replacement expenses (CAPEX), increased uptime, and overall higher quality asset capability within their portfolio. Successful EAM leverages ISO55000 & IAM 2.0 standards to implement predictive, proactive and reliability centered maintenance best practices. Implementing an EAM provides leading edge technology to the rail industry to track and audit maintenance work using mobility tools, heads-up virtual reality displays, augmented reality expertise and the Internet of Things (IoT); combined with artificial intelligence and machine learning to bolster predictive maintenance and simulate asset performance based on different scenarios. EAM will evolve rapidly following the world's rapid transformation into the IoT over the next decade. As rail and transit assets become outfitted with interconnected intelligent sensors whose outputs are collected via active and passive devices, real-time data is available for EAM to track, plan and upgrade assets. As systems are modernized, EAM will leverage the IoT revolution to provide critical information to operations in planning railway management scenarios, including predictive maintenance functionality and edge analytics.",
    "year": 2021,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "364897754d31c10c65f4c00937459823",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "artificial intelligence"
    ],
    "stage1_timestamp": "2025-05-15T01:07:35.757899"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要讨论的是企业资产管理（EAM）系统，利用工业4.0和物联网（IoT）技术来改进预测性维护和资产性能。虽然提到了人工智能和机器学习，但其应用场景是铁路行业的资产管理和维护，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要讨论的是企业资产管理（EAM）系统，利用工业4.0和物联网（IoT）技术来改进预测性维护和资产性能。虽然提到了人工智能和机器学习，但其应用场景是铁路行业的资产管理和维护，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:14:08.016463"
}