{
  "paper": {
    "id": 3611,
    "title": "EXPLORATORY ANALYSIS ON INTERNAL RISKS IN SMES AND FINANCIAL INSTITUTIONS IN SERBIA",
    "abstract": "The subject of the research is the exploratory analysis of different types of internal risks which SMEs and banks in Republic of Serbia have identified to monitor in their operations, The methods used are questionnaires and interviews in the field research, descriptive statistical analysis, models of multiple regression analysis and logistic regression. In case of the whole sample of 113 examinees, the largest number of examinees monitors liquidity risk management, while the monitoring of operational and credit risks are identified to have a positive influence on the performance. On the other hand, the positive influence of isk management on performance is significantly more prominent in the sample of financial institutions, being mostly present in case of capital and financing risk management, The results of the research contribute to the economic theory in the field of risk management in Republic of Serbia.",
    "year": 2017,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "672e26d6883cc8d78b3239eddde9f568",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:27:54.151738"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on the analysis of internal risks such as liquidity, operational, and credit risks in SMEs and financial institutions, using statistical and regression models to assess their impact on performance. This clearly falls under the domain of Financial Risk Management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on the analysis of internal risks such as liquidity, operational, and credit risks in SMEs and financial institutions, using statistical and regression models to assess their impact on performance. This clearly falls under the domain of Financial Risk Management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:35:58.537889"
}