{
  "paper": {
    "id": 7033,
    "title": "Defusing the risk of borrowing: The psychology of payment protection insurance decisions",
    "abstract": "Consumers can defuse the financial risks of credit default by taking payment protection insurance (PPI). In two studies, predictions derived from Huber's risk defusing operator theory of decision making were tested. We investigated the effects on PPI judgements and decisions of previous experience, cognitive appraisal, emotion and changes in PPI cost and level of cover. In Study 1, a randomized groups experiment, 241 high street bank customers were presented with scenarios in which they chose whether or not to purchase PPI. Logistic regression showed that previous experience, the anticipated worry reduction (peace of mind) afforded by PPI, and its perceived value for money, all had direct effects on PPI decisions. In addition, standard regression analysis found that: (1) PPI cost and level of cover significantly predicted the perceived value for money of PPI; and (2) the subjective probability of repayment difficulties predicted anticipated worry about repayment difficulties, which in turn predicted the anticipated worry reduction of PPI. In Study 2, a survey of 300 bank customers, the above direct and indirect effects on PPI decisions were further investigated by path modeling. The final path model was a good fit to the data and confirmed the main relationships described above. Thus, in addition to judgements of the value for money of PPI, worry concerning repayment difficulties, and its anticipated reduction, are strong determinants of consumer credit insurance decisions. (C) 2012 Elsevier B.V. All rights reserved.",
    "year": 2012,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "fff5ea77e7250fe95be586a5a325852a",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T03:04:23.008765"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究消费者对支付保护保险（PPI）的决策心理，涉及心理学和行为经济学，但并未直接应用于衍生品定价、金融风险管理或投资组合管理等金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究消费者对支付保护保险（PPI）的决策心理，涉及心理学和行为经济学，但并未直接应用于衍生品定价、金融风险管理或投资组合管理等金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:27:05.945513"
}