{
  "paper": {
    "id": 2226,
    "title": "Socio-economic differentiation in experienced mortality modelling and its pricing implications",
    "abstract": "In recent years, increasing availability and quality of the portfolio data enables the life insurers to render fair and flexible pricing based on individual-level socio-economic attributes. Yet, many insurers price based on the experience factor; portfolio-specific mortality divided by population mortality. We incorporate the logistic regression in the experience mortality model by Plat (Insurance 45:123-132, 2009) and examine the effect of the differentiating factor(s) on the level and trend of mortality. The regression model accounts for socio-economic factors, such as salary, in the portfolio and constructs the corresponding differentiated experience factors. To address the varying uncertainty in each class of the differentiated experienced mortality, we provide the price of a simple survival benefit for a cohort with and without differentiation. We employ the EIOPA risk-margin price to examine how the differentiated mortality can be reflected in the required risk-loading, using the salary as an example differentiator. Further, we extend the risk margin price to a time-consistent price to address the considerable likelihood of the middle-time dynamics of the experience mortality in long-dated contracts. The Least Square Monte Carlo (LSMC) method serves as the numerical method to calculate the conditional operators in the time-consistent price. We find that differentiation is significant for different salary classes. For example, for the 40 years old male cohort, salary differentiation can result in around 7% discount for the low salary class and 7.9% surcharge for the high salary class.",
    "year": 2022,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "0f2acb16581a36c4bdae73f97d60ee5f",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:04:27.476144"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要研究基于社会经济因素的死亡率建模及其对保险定价的影响，特别是通过风险边际价格和时间一致价格来反映差异化的死亡率，这属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文主要研究基于社会经济因素的死亡率建模及其对保险定价的影响，特别是通过风险边际价格和时间一致价格来反映差异化的死亡率，这属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:16:40.497092"
}