{
  "paper": {
    "id": 2325,
    "title": "Using Machine Learning Algorithms to create a Credit Scoring Model for mobile money users",
    "abstract": "Statistical and artificial intelligence methods are used extensively to analyze credit and evaluate the credit risk of loan application clients. In this paper, mobile transaction data of agents from a digital payment switching company that is interested in offering microloans to its agents w ere used to determine the agent's creditworthiness. Traditional credit scoring methods do not work for these agents as the transaction data is not recorded by a full-service financial institution like a bank. Different data manipulation techniques were explored to present data into features that can he used for scoring. The effects of resulting features were explored using correlation and singular value decomposition, and clustered using K- means clustering to assess creditworthiness. After clustering agents into K groups, these groups were clustered again to determine low-risk agents, and a formula to determine how much credit can be extended to low-risk agents was devised.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "906712b7f5d467cca429ddc5d819320c",
    "relevant_keywords": [
      "machine learning",
      "unsupervised learning",
      "clustering",
      "feature representation"
    ],
    "stage1_timestamp": "2025-05-15T02:14:19.559701"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on developing a credit scoring model to evaluate the creditworthiness of mobile money users, which is a key aspect of credit risk management in financial institutions. The use of machine learning and clustering techniques to assess and mitigate credit risk directly aligns with the domain of Financial Risk Management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on developing a credit scoring model to evaluate the creditworthiness of mobile money users, which is a key aspect of credit risk management in financial institutions. The use of machine learning and clustering techniques to assess and mitigate credit risk directly aligns with the domain of Financial Risk Management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:43:18.099638"
}