{
  "paper": {
    "id": 3122,
    "title": "Automated Transformation from Competency List to Tree: Way to Competency-Based Adaptive Knowledge E-Evaluation",
    "abstract": "Featured Application The proposed model for competency list transformation to competency tree can be applied in e-learning and e-evaluation systems to ensure integration between systems, using competency lists and competency trees and, at the same time, providing some additional adaptability for the existing e-learning systems. E-learning is rapidly gaining its application. While actively adapting student-oriented learning with the competency evaluation model, the standard of competency support in existing e-learning systems is not implemented and varies. This complicated integration of different e-learning systems or transfer from one system to another might be challenging if the student had his or her competency portfolio in list form, while another system supports tree-based competency portfolios. Therefore, in this paper, we propose a transformation model dedicated to converting the competency list to a competency tree. This solution incorporates text processing and analysis, competency ranking based on Bloom's taxonomy, and competency topic area clustering. The case analysis illustrates the model's capability to generate a qualitative tree from the competency list, where the average accuracy of competency assignment to appropriate parent competency is 72%, but, in some cases, it reaches just 50%.",
    "year": 2022,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "130c5451473f2602b7910f3b19a9f00a",
    "relevant_keywords": [
      "clustering",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T01:13:45.242743"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是将能力列表转换为能力树的模型，应用于电子学习和电子评估系统，与金融领域的衍生品定价、金融风险管理和投资组合管理无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是将能力列表转换为能力树的模型，应用于电子学习和电子评估系统，与金融领域的衍生品定价、金融风险管理和投资组合管理无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:11:28.160902"
}