{
  "paper": {
    "id": 462,
    "title": "Crowdkeeping in Last-Mile Delivery",
    "abstract": "In order to improve the efficiency of the last -mile delivery system when customers are possibly absent for deliveries, we propose the idea of employing the crowd to work as keepers and to provide storage services for their neighbors. Crowd keepers have extra flexibility, more availability, and lower costs than fixed storage options such as automated lockers, and this leads to a more efficient and a more profitable system for last -mile deliveries. We present a bilevel program that jointly determines the assignment, routing, and pricing decisions while considering customer preferences, keeper behaviors, and platform operations. We develop an equivalent single -level program, a mixed -integer linear program with subtour elimination constraints, that can be solved to optimality using a row generation algorithm. To improve the efficiency of the solution procedure, we further derive exact best response sets for both customers and keepers, and approximate optimal travel times using linear regression. We present a numerical study using a real -world data set from Amazon. The fixed -storage and no -storage systems are used as benchmarks to assess the performance of the crowdkeeping system. The results show that the crowdkeeping delivery system has the potential to generate higher profits because of its ability to consolidate deliveries and to eliminate failed deliveries.",
    "year": 2024,
    "source": "WOS",
    "area": "derivatives_pricing",
    "method": "machine learning",
    "cache_key": "a16ba9eec4f69ef92129170645da79c1",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:32:30.154664"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是最后一英里配送系统中的众包存储服务优化问题，涉及配送效率、定价和路径优化，并未提及任何与衍生品定价、金融风险管理或投资组合管理相关的应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是最后一英里配送系统中的众包存储服务优化问题，涉及配送效率、定价和路径优化，并未提及任何与衍生品定价、金融风险管理或投资组合管理相关的应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:04:49.579731"
}