{
  "paper": {
    "id": 295,
    "title": "Dynamic Credit Risk Evaluation Method for E-Commerce Sellers Based on a Hybrid Artificial Intelligence Model",
    "abstract": "Credit risk evaluation is important for e-commerce platforms, due to the uncertainty and transaction risk associated with buyers and sellers. Moreover, it is the key ingredient for the development of the e-commerce ecosystem and sustainability of the financial market. The main objective of this paper is to develop an effective and user-friendly system for seller credit risk evaluation. Three hybrid artificial intelligent models, including (1) decision tree-artificial neural network (ANN), (2) decision tree-logistic regression, and (3) decision tree-dynamic Bayesian network have been investigated. The models were trained using sellers credit cases from Taobao, which has 609 cases, and each case had 23 categorical and numerical attributes. The results suggest that the combination of decision tree-ANN provides the highest accuracy, which can promote healthy and fast transactions between buyers and sellers on the platforms. This model is regarded as a powerful tool that allows us to build an advanced credit risk evaluation system, and meet the requirements of the platform transaction mode to be dynamic and self-learning-which will ultimately contribute to the sustainable development of the e-commerce ecosystem. The empirical results can serve as a reference for e-commerce platforms promoting an optimum credit risk evaluation model to improve e-commerce transaction environment and for buyers and investors making decisions.",
    "year": 2019,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "e8c344aa6f00b96c87959f86ee546623",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "decision tree",
      "neural network",
      "deep learning",
      "backpropagation",
      "BP",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T01:49:04.649538"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是开发一种基于混合人工智能模型的动态信用风险评估方法，用于评估电子商务卖家的信用风险。这直接涉及信用风险管理，属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是开发一种基于混合人工智能模型的动态信用风险评估方法，用于评估电子商务卖家的信用风险。这直接涉及信用风险管理，属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:59:27.545972"
}