{
  "paper": {
    "id": 2400,
    "title": "A further analysis of robust regression modeling and data mining corrections testing in global stocks",
    "abstract": "In this analysis of the risk and return of stocks in global markets, we build a reasonably large number of stock selection models and create optimized portfolios to outperform a global benchmark. We apply robust regression techniques, LAR regression, and LASSO regression modeling to estimate stock selection models. Markowitz-based optimization techniques is used in portfolio construction within a global stock universe. We apply the Markowitz-Xu data mining corrections test to a global stock universe. We find that (1) robust regression applications are appropriate for modeling stock returns in global markets; (2) weighted latent root regression robust regression techniques work as well as LAR and LASSO-Regressions in building effective stock selection models; (3) mean-variance techniques continue to produce portfolios capable of generating excess returns above transactions costs; and (4) our models pass several data mining tests such that regression models produce statistically significant asset selection for global stocks. Recent Sturdy-Regression modeling technique may offer the greatest potential for further research for statistically based stock selection modeling.",
    "year": 2021,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "19760ebab59043cda17294c20ebb401e",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:06:38.036418"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术包括使用稳健回归技术和Markowitz均值-方差优化方法来构建优化的投资组合，旨在超越全球基准。这些技术和方法直接应用于投资组合的构建和管理，因此属于投资组合管理领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术包括使用稳健回归技术和Markowitz均值-方差优化方法来构建优化的投资组合，旨在超越全球基准。这些技术和方法直接应用于投资组合的构建和管理，因此属于投资组合管理领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:14:46.701596"
}