{
  "paper": {
    "id": 216,
    "title": "Robust Mean-Variance Portfolio Selection with Time Series Clustering",
    "abstract": "This study presents a robust portfolio selection with time series clustering. The stocks are firstly grouped into several clusters using Partitioning Around Medoids (PAM) time series clustering base on autocorrelation function (ACF) dissimilarity. After clustering process, stocks are chosen to represent each cluster to build a portfolio. The stock chosen from each cluster is the stock that has the best Sharpe ratio. The optimum portfolio is determined using the robust Fast Minimum Covariance Determinant (FMCD) and S estimation. Using this procedure, we can efficiently obtain the best portfolio when there are large number of stocks involved in portfolio formulation process. This procedure is also robust against the probability of outlier presence in the data. To measure the performance of portfolios that are formed we use the Sharpe ratio. For empirical study, we used the daily closing price of stocks listed on the Indonesia Stock Exchange, which included in the LQ-45 indexed for the period of August 2017-July 2018. Results of this study showed that the performance of portfolio generated by the use of PAM time series clustering combined with robust FMCD estimation was better than performance of portfolio generated by other methods that we tested.",
    "year": 2021,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "be191f6070590903623d63ce2d644a7d",
    "relevant_keywords": [
      "unsupervised learning",
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T00:40:34.182517"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "The paper focuses on robust portfolio selection using time series clustering and optimization techniques, which is directly related to the field of Portfolio Management. The study aims to improve portfolio performance by selecting stocks with the best Sharpe ratio from clusters and using robust estimation methods, which are core aspects of portfolio construction and optimization.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Portfolio Management\"],\n  \"justification\": \"The paper focuses on robust portfolio selection using time series clustering and optimization techniques, which is directly related to the field of Portfolio Management. The study aims to improve portfolio performance by selecting stocks with the best Sharpe ratio from clusters and using robust estimation methods, which are core aspects of portfolio construction and optimization.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:32:46.263577"
}