{
  "paper": {
    "id": 1664,
    "title": "Digital Universal Financial Credit Risk Analysis Using Particle Swarm Optimization Algorithm with Structure Decision Tree Learning-Based Evaluation Model",
    "abstract": "Predictions of credit risk, model reliability, monitoring, and efficient loan processing are all important factors in decision-making and transparency. Machine learning method is providing these people new hope. However, it is up to banking or nonbanking institutions to determine how they will implement this advanced method in order to decrease human biases in loan decision-making. Objective. This paper proposed the novel machine learning-based credit risk analysis in the digital banking evaluation model. The purpose of this research is to compare various ML algorithms in order to develop an accurate model for credit risk assessment utilising data from a genuine credit registry dataset. Aim is to design the classification-based model using particle swarm optimization (PSO) algorithm with structure decision tree learning (SDTL) in predicting credit risk. This system has the potential to improve quality criteria such as dependability, robustness, extensibility, and scalability. Features have been extracted and classified by the proposed PSO_SL model. Experimental Results. The data have been collected based on real time for credit analysis. Simulation is carried out in Python and optimal results are obtained in comparative analysis with existing techniques. The accuracy obtained by proposed technique is enhanced and the error rate of the design is minimized.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "dd774e5d8f7ef91128d83cd6ce555652",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "decision tree",
      "feature learning",
      "feature representation"
    ],
    "stage1_timestamp": "2025-05-15T02:06:22.364039"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on developing a machine learning-based model for credit risk analysis, which is a key aspect of financial risk management. The proposed model aims to improve the accuracy and reliability of credit risk assessment, directly addressing risk management challenges in the financial sector.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on developing a machine learning-based model for credit risk analysis, which is a key aspect of financial risk management. The proposed model aims to improve the accuracy and reliability of credit risk assessment, directly addressing risk management challenges in the financial sector.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:47:17.726598"
}