{
  "paper": {
    "id": 1241,
    "title": "Estimating Historical Downside Risks of Global Financial Market Indices via Inflation Rate-Adjusted Dependence Graphs",
    "abstract": "In this study, we examine the application of a graph-based approach to predict the next day's entropic value-at-risk (EVaR) for 21 global financial market indices, focusing on the contemporary issue of high inflation exacerbated by the COVID-19 pandemic. By considering inflation as a conditioning variable, we construct daily networks that delineate interdependencies among key financial indices. Through the application of spatiotemporal graph embedding and machine learning, we predict the EVaR with inflation-adjusted information entropy. Our evaluation demonstrates significant improvements in prediction accuracy using metrics such as root mean squared error (RMSE) and mean absolute error (MAE). Our findings highlight the intricate relationships between inflation rates and downside risks, providing insights into downside risk contagion patterns under high-inflation conditions. This research enhances the understanding of financial market interdependence, the role of inflation in downside risk prediction, and the practicality of network-based analysis, contributing to more stable and refined downside risk predictions within the complex financial landscape during periods of high inflation, which was the different financial environment of the training period.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "634bfa34adefcfe5be4ffa96956bb7ba",
    "relevant_keywords": [
      "machine learning",
      "regression",
      "feature representation",
      "representation learning"
    ],
    "stage1_timestamp": "2025-05-15T02:00:30.575721"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on predicting entropic value-at-risk (EVaR) for global financial market indices using a graph-based approach, which is a key aspect of financial risk management. The study specifically addresses downside risks and their relationship with inflation rates, aiming to improve risk prediction accuracy in high-inflation environments.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on predicting entropic value-at-risk (EVaR) for global financial market indices using a graph-based approach, which is a key aspect of financial risk management. The study specifically addresses downside risks and their relationship with inflation rates, aiming to improve risk prediction accuracy in high-inflation environments.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:50:53.377084"
}