{
  "paper": {
    "id": 6793,
    "title": "Evaluation of the Value of Physiological Cues to Determining the Salience of a Risk Factor in a Situation of Screening Polygraph Test",
    "abstract": "The scientific validity of polygraph testing is regularly criticized by the scientific communi-ty in view of the subjectivity of data evaluation and the unclear predictive value of the pa-rameters obtained with the help of a polygraph. In order to clarify the contribution of the physiological cues used in identifying the salience of the topic during polygraph screening, the materials of an empirical study obtained from a sample of 67 volunteers who have a risk factor associated with forgery of documents and do not have it are presented. A psychophys-iological method was used with a preliminary questionnaire about the well-being at the time of the experiment. During the paid experiment, it was proposed to forge a financial docu-ment and lie about it to a polygraph examiner, or answer questions honestly. In order to eliminate subjectivity in data evaluation, all registered signals were digitized, standardized and processed using the discriminate analysis method. At the same time, a high accuracy of the discriminant model was found (92.5%). The parameters of a short-term rise in blood pressure and changes in the electrical activity of the skin were the main variables for the classification of persons with and without a risk factor. The data obtained complement pre-vious studies on the accuracy of the polygraph screening test, expanding the prognostic val-ue of the length of the respiratory signal line.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "4d59a633ee529a64f4f57981fb6e9787",
    "relevant_keywords": [
      "classification"
    ],
    "stage1_timestamp": "2025-05-15T03:01:31.459727"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究测谎仪测试中生理线索的价值评估，属于心理学和生理学领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究测谎仪测试中生理线索的价值评估，属于心理学和生理学领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:27:30.356698"
}