{
  "paper": {
    "id": 711,
    "title": "Default avoidance on credit card portfolios using accounting, demographical and exploratory factors: decision making based on machine learning (ML) techniques",
    "abstract": "Effective and thorough credit-risk management is a key factor for lending institutions, as significant financial losses can arise from the borrowers' default. Consequently, machine learning methods can measure and analyze credit risk objectively when at the same time they face increasingly attention. This study analyzes default payment data from a credit cards' portfolio containing some 30,000 clients from Taiwan with twenty-three attributes and with no missing information. We compare prediction accuracy of seven classification methods used, i.e. KNN, Logistic Regression, Naive Bayes, Decision Trees, Random Forest, SVC, and Linear SVC. The results indicate that only few out of most of the typical variables used can adequately analyze default characteristics in terms of lending decisions. The results provide effective feedback to credit evaluators, lending institutions and business analysts for in-depth analysis. Also, they mention to the importance of the precautionary borrowing techniques to be used to better understand credit-card borrowers' behavior, along with specific accounting, historical and demographical characteristics.",
    "year": 2020,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "02ae3abe6895020b5714b3e94ba74724",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T01:53:59.516390"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用机器学习方法（如KNN、逻辑回归、决策树等）来预测信用卡违约风险，这直接涉及信用风险管理，属于金融风险管理的范畴。论文的研究目标和应用场景明确指向了信用风险评估和违约预测，而非衍生品定价或投资组合管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"该论文的核心技术是使用机器学习方法（如KNN、逻辑回归、决策树等）来预测信用卡违约风险，这直接涉及信用风险管理，属于金融风险管理的范畴。论文的研究目标和应用场景明确指向了信用风险评估和违约预测，而非衍生品定价或投资组合管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:55:47.647374"
}