{
  "paper": {
    "id": 4904,
    "title": "Artificial intelligence applied to investment in variable income through the MACD (moving average convergence/divergence) indicator",
    "abstract": "Purpose-This study aims to determine whether, by means of the application of genetic algorithms (GA) through the traditional technical analysis (TA) using moving average convergence/divergence (MACD), is possible to achieve higher yields than those that would be obtained using technical analysis investment strategies following a traditional approach (TA) and the buy and hold (B&H) strategy. Design/methodology/approach-The study was carried out based on the daily price records of the NASDAQ financial asset during 2013-2017. TA approach was carried out under graphical analysis applying the standard MACD. GA approach took place by chromosome encoding, fitness evaluation and genetic operators. Traditional genetic operators (i.e. crossover and mutation) were adopted as based on the chromosome customization and fitness evaluation. The chromosome encoding stage used MACD to represent the genes of each chromosome to encode the parameters of MACD in a chromosome. For each chromosome, buy and sell indexes of the strategy were considered. Fitness evaluation served to defining the evaluation strategy of the chromosomes in the population according to the fitness function using the returns gained in each chromosome. Findings-The paper provides empirical-theoretical insights about the effectiveness of GA to overcome the investment strategies based on MACD and B&H by achieving 5 and 11% higher returns per year, respectively. GA-based approach was additionally capable of improving the return-to-risk ratio of the investment. Research limitations/implications-Limitations deal with the fact that the study was carried out on US markets conditions and data which hamper its application in some extend to markets with not as much development. Practical implications-The findings suggest that not only skilled but also amateur investors may opt for investment strategies based on GA aiming at refining profitable financial signals to their advantage. Originality/value-This paper looks at machine learning as an up-to-date tool with great potential for increasing effectiveness in profits when applied into TA investment approaches using MACD in well-developed stock markets.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "1ad7249c6902ce679f9a835f99e66da9",
    "relevant_keywords": [
      "machine learning",
      "genetic algorithms"
    ],
    "stage1_timestamp": "2025-05-15T02:42:04.926365"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是应用遗传算法优化基于MACD指标的投资策略，旨在提高投资回报率和风险调整后的收益，这直接属于投资组合管理的范畴。论文的研究目标和实验设计都集中在投资策略的优化上，而非衍生品定价或金融风险管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是应用遗传算法优化基于MACD指标的投资策略，旨在提高投资回报率和风险调整后的收益，这直接属于投资组合管理的范畴。论文的研究目标和实验设计都集中在投资策略的优化上，而非衍生品定价或金融风险管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:31:32.778221"
}