{
  "paper": {
    "id": 750,
    "title": "A modified genetic programming for behavior scoring problem",
    "abstract": "Behavior scoring is an important part of risk management in financial institutions, which is used to help financial institutions make better decisions in managing existing customers by forecasting their future credit performance. In this paper, a modified genetic programming (MGP) is introduced to solve the behavior scoring problems. A real fife credit data set in a Chinese commercial bank is selected as the experimental data to demonstrate the classification accuracy of this method. MGP is compared with back-propagation neural network (BPN), and another GP that uses normalized inputs (NGP), the experimental results show that the MGP has slight better classification accuracy rate than NGP, and outperforms BPN in dealing with behavior scoring problems because of less historical samples of credit data in Chinese commercial banks.",
    "year": 2007,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "13f4fc9c174ff4150fb91e6f2fdcf8cf",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "neural network",
      "backpropagation",
      "BP"
    ],
    "stage1_timestamp": "2025-05-15T01:54:34.122705"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on behavior scoring, which is a critical component of risk management in financial institutions, specifically for forecasting future credit performance to manage existing customers. This directly aligns with the domain of Financial Risk Management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on behavior scoring, which is a critical component of risk management in financial institutions, specifically for forecasting future credit performance to manage existing customers. This directly aligns with the domain of Financial Risk Management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:55:23.980401"
}