{
  "paper": {
    "id": 320,
    "title": "The Application of Data Mining Techniques for Financial Risk Management: A classification framework",
    "abstract": "Over the last few decades the world has witnessed a surge in the reliance on financial services (e.g. banking, credit cards, insurance), whilst the advent of the internet has led to a sharp rise in the number of online transactions. Both of these factors are driving an increase in the prevalence of financial fraud, precipitating the need for a novel approach to financial risk detection and management. One solution that has become feasible due to the availability of high amounts of storage spaces and computational power that has emerged over the past decade is data mining. This paper sets out to examine the usage of data mining to detect and mitigate financial risks arising from financial frauds. The study used a Kaggle dataset and conducted experiments using several different classification metrics. The best performance for identifying creditworthy customers in banks was achieved by the Random Forest classifier..",
    "year": 2020,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "baa8d58cd5e8010c33761cd333b12840",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T01:49:40.966328"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on using data mining techniques to detect and mitigate financial risks arising from financial fraud, specifically in the context of identifying creditworthy customers in banks. This clearly falls under the domain of Financial Risk Management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on using data mining techniques to detect and mitigate financial risks arising from financial fraud, specifically in the context of identifying creditworthy customers in banks. This clearly falls under the domain of Financial Risk Management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:59:04.941243"
}