{
  "paper": {
    "id": 214,
    "title": "Economic Disruptions in Repayment of Peer Loans",
    "abstract": "Economic disruptions can alter the likelihood of defaults on peer-to-peer loans, causing those impacted to adjust. The option to declare economic hardship and temporarily reduce the payment burden can provide some relief. When this occurs, the borrower's financial qualifications have changed. The qualities instrumental in successfully securing the original loan terms must be reanalyzed to manage risk. This is a critical point in the life of the loan because the declaration of financial hardship can signal that the borrower's ability to repay has diminished. We present a novel default detection scheme for borrowers experiencing an economic disruption based on the Two-Class Support Vector Machine, a data classification algorithm for supervised learning problems. The method utilizes data from actual loan records (15,355 loans from 2016 through 2020), specifically from borrowers who declared economic hardship. We provide a detailed description of the default detection process and present results that show defaults among borrowers experiencing financial hardship can be predicted accurately.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "806ba650da0d5fa04066f6b17b1a8f62",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM"
    ],
    "stage1_timestamp": "2025-05-15T01:48:30.632587"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on predicting defaults among borrowers experiencing financial hardship using a machine learning approach, which is directly related to assessing and managing credit risk, a key aspect of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on predicting defaults among borrowers experiencing financial hardship using a machine learning approach, which is directly related to assessing and managing credit risk, a key aspect of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:59:56.425502"
}