{
  "paper": {
    "id": 9411,
    "title": "Myocardial infarction in the Wisconsin Longitudinal Study: the interaction among environmental, health, social, behavioural and genetic factors",
    "abstract": "Objectives This study examined how environmental, health, social, behavioural and genetic factors interact to contribute to myocardial infarction (MI) risk. Design Survey data collected by Wisconsin Longitudinal Study (WLS), USA, from 1957 to 2011, including 235 environmental, health, social and behavioural factors, and 77 single- nucleotide polymorphisms were analysed for association with MI. To identify associations with MI we utilized recursive partitioning and random forest prior to logistic regression and chi-squared analyses. Participants 6198 WLS participants (2938 men; 3260 women) who (1) had a MI before 72years and (2) had a MI between 65 and 72years. Results In men, stroke (LR OR: 5.01, 95% CI 3.36 to 7.48), high cholesterol (3.29, 2.59 to 4.18), diabetes (3.24, 2.53 to 4.15) and high blood pressure (2.39, 1.92 to 2.96) were significantly associated with MI up to 72years of age. For those with high cholesterol, the interaction of smoking and lower alcohol consumption increased prevalence from 23% to 41%, with exposure to dangerous working conditions, a factor not previously linked with MI, further increasing prevalence to 50%. Conversely, MI was reported in <2.5% of men with normal cholesterol and no history of diabetes or depression. Only stroke (4.08, 2.17 to 7.65) and diabetes (2.71, 1.81 to 4.04) by 65 remained significantly associated with MI for men after age 65. For women, diabetes (5.62, 4.08 to 7.75), high blood pressure (3.21, 2.34 to 4.39), high cholesterol (2.03, 1.38 to 3.00) and dissatisfaction with their financial situation (4.00, 1.94 to 8.27) were significantly associated with MI up to 72years of age. Conversely, often engaging in physical activity alone (0.53, 0.32 to 0.89) or with others (0.34, 0.21 to 0.57) was associated with the largest reduction in odds of MI. Being non-diabetic with normal blood pressure and engaging in physical activity often lowered prevalence of MI to 0.2%. Only diabetes by 65 (4.25, 2.50 to 7.24) and being exposed to dangerous work conditions at 54 (2.24, 1.36 to 3.69) remained significantly associated with MI for women after age 65, while still menstruating at 54 (0.46, 0.23 to 0.91) was associated with reduced odds of MI. Conclusions Together these results indicate important differences in factors associated with MI between the sexes, that combinations of factors greatly influence the likelihood of MI, that MI-associated factors change and associations weaken after 65years of age in both sexes, and that the limited genotypes assessed were secondary to environmental, health, social and behavioral factors.",
    "year": 2017,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "f2501e97825c50804982d94c431dc1ac",
    "relevant_keywords": [
      "classification",
      "regression",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T03:28:17.675705"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究心肌梗塞的风险因素及其相互作用，属于医学和流行病学领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究心肌梗塞的风险因素及其相互作用，属于医学和流行病学领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:25:11.898749"
}