{
  "paper": {
    "id": 1349,
    "title": "Portfolio Selection Using Multivariate Semiparametric Estimators and a Copula PCA-Based Approach",
    "abstract": "This paper investigates the implications for portfolio theory of using multivariate semiparametric estimators and a copula-based approach, especially when the number of risky assets becomes substantial. Parametric, nonparametric, and semiparametric regression methods are compared to approximate their returns in large-scale portfolio selection problems. Semiparametric regression models are used to prove that, under certain assumptions, the variability of the errors decreases as the number of factors increases. Moreover, a copula principal component analysis (PCA)-based approach is proposed, and its superiority to the classical Pearson PCA approach is demonstrated. Empirical analyses validate the suggested approaches and evaluate the impact of different approximation methods on portfolio selection problems. Here, the ex-ante sample paths of several portfolio strategies aiming to maximize portfolio wealth using either reward-risk or drawdown-based performance measures are compared. The results show that the proposed methodologies outperform the traditional approach for out-of-sample portfolios, especially when the dependence structure is represented by the Pearson linear correlation.",
    "year": 2022,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "8d49e5d7a52778eaf23972bf40d3d80a",
    "relevant_keywords": [
      "regression",
      "principal components analysis"
    ],
    "stage1_timestamp": "2025-05-15T00:54:56.352531"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "The paper focuses on portfolio selection problems, comparing different approximation methods and proposing a copula PCA-based approach to maximize portfolio wealth. The empirical analyses and methodologies discussed are directly related to investment portfolio management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Portfolio Management\"],\n  \"justification\": \"The paper focuses on portfolio selection problems, comparing different approximation methods and proposing a copula PCA-based approach to maximize portfolio wealth. The empirical analyses and methodologies discussed are directly related to investment portfolio management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:21:38.840843"
}