{
  "paper": {
    "id": 1044,
    "title": "Stock Market Investment Advice: A Social Network Approach",
    "abstract": "Making investment decision on various available stocks in the market is a challenging task. Econometric and statistical models, as well as machine learning and data mining techniques, have proposed heuristic based solutions with limited long-range success. In practice, the capabilities and intelligence of financial experts is required to build a managed portfolio of stocks. However, for non-professional investors, it is too complicated to make subjective judgments on available stocks and thus they might be interested to follow an expert's investment decision. For this purpose, it is critical to find an expert with similar investment preferences. In this work, we propose to benefit from the power of Social Network Analysis in this domain. We first build a social network of financial experts based on their publicly available portfolios. This social network is then used for further analysis to recommend an appropriate managed portfolio to non-professional investors based on their behavioral similarities to the expert investors. This approach is evaluated through a case study on real portfolios. The result shows that the proposed portfolio recommendation approach works well in terms of Sharpe ratio as the portfolio performance metric.",
    "year": 2012,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "ebb790a1557e1e00ad01108c29955c6d",
    "relevant_keywords": [
      "machine learning",
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T00:51:25.830747"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是利用社交网络分析来推荐适合非专业投资者的投资组合，这直接涉及投资组合管理的领域。论文中提到的Sharpe ratio作为投资组合绩效指标也进一步证实了这一点。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是利用社交网络分析来推荐适合非专业投资者的投资组合，这直接涉及投资组合管理的领域。论文中提到的Sharpe ratio作为投资组合绩效指标也进一步证实了这一点。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:25:14.088079"
}