{
  "paper": {
    "id": 5527,
    "title": "A fuzzy multifactor asset pricing model",
    "abstract": "This paper introduces a new approach of multifactor asset pricing model estimation. This approach assumes that the monthly returns of financial assets are fuzzy random variables and estimates the multifactor asset pricing model as a fuzzy linear model. The fuzzy random representations allows us to incorporate bias on prices induced by the market microstructure noise and to reflect the intra-period activity in the analysis. The application of fuzzy linear regression enables the uncertainty assessment in an alternative way to confidence interval or hypothesis testing, which is subjected the binding assumption of normal distribution of returns. However, it is well known that the distribution of many asset returns deviates significantly from the normal assumption. We illustrate this estimation in the particular case of the Fama and French's (J Financ Econ 33:3-56, 1993) three factor model. Finally, empirical studies based on Fama and French's portfolios and risk factors, historical dataset highlight the effectiveness of our estimation method and a comparative analysis with the ordinary least square estimation shows its ability to be applied for an optimal decision decision making in the financial market.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "1183200aea2d539506c26f30b4913232",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:48:51.296123"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文提出了一种模糊多因子资产定价模型，用于估计金融资产的月度回报，并应用于Fama和French的三因子模型。这种模型主要用于资产定价和投资组合管理，帮助投资者做出更优的决策。论文并未涉及衍生品定价或金融风险管理的具体应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文提出了一种模糊多因子资产定价模型，用于估计金融资产的月度回报，并应用于Fama和French的三因子模型。这种模型主要用于资产定价和投资组合管理，帮助投资者做出更优的决策。论文并未涉及衍生品定价或金融风险管理的具体应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T14:24:02.445365"
}