{
  "paper": {
    "id": 1676,
    "title": "A user-friendly decision support tool to assist one-health risk assessors",
    "abstract": "One-Health risk assessments are integral to developing efficient responses to disease threats, including global pandemics. However, short timeframes, inadequate disease-specific information and an insufficient skill-base make it hard for inexperienced assessors to distinguish between a large portfolio of approaches. The wrong choice can detract from the disease response. Here, we present an interactive decision support tool to help with this choice. A workshop with participants from diverse professional backgrounds provided six themes that should be considered when deciding on the best approach. Questions based on these themes were then developed to populate a decision tree which guides users to their most appropriate approach. One-Health risk assessment tools and literature were used as examples of the different approaches. The tool provides links to these examples and short descriptions of the approaches. Answers are easily changed, facilitating exploration though different approaches. The simple data structure of the tool means it is easy to update with more resources and approaches. It provides a valuable source of guidance and information for less experienced risk assessors.",
    "year": 2021,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "c12731293629a8be2c5392ae3aaa76d3",
    "relevant_keywords": [
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T00:58:18.385641"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要讨论了一种用于One-Health风险评估的决策支持工具，其应用领域是公共卫生和疾病管理，而非金融领域。虽然提到了'portfolio'一词，但这里的'portfolio'指的是多种方法的选择，而非金融投资组合。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要讨论了一种用于One-Health风险评估的决策支持工具，其应用领域是公共卫生和疾病管理，而非金融领域。虽然提到了'portfolio'一词，但这里的'portfolio'指的是多种方法的选择，而非金融投资组合。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:19:36.595243"
}