{
  "paper": {
    "id": 3891,
    "title": "Consumption patterns of entrepreneurs in the People's Republic of China",
    "abstract": "Since the implementation of economic reforms in 1978 in the People's Republic of China, entrepreneurs have emerged as a new consumer group. With rising income and high consumption power, entrepreneurs have become major consumers for expensive goods and services. However, little research has been carried out to understand their consumption decisions. In this article, we study the consumption patterns of small business owners, getihu, in China by using a set of large-scale, nationwide sun;ey data. Their consumption is postulated to be affected by (1) risk factors which include failure risk and financial (leverage) risk, (2) household variables such as the household size, financial and labor resources in the family, (3) the future plans of their business, and (4) home ownership. The effects of these factors on consumption patterns are evaluated. Our empirical results, based on regression and Tobit analysis, showed that all these factors are important in the consumption decisions of the entrepreneurs' households. In particular, risk and household factors are statistically significant in accounting for the variations in their consumption patterns. The marketing implications are also discussed. (C) 2001 Elsevier Science Inc. All rights reserved.",
    "year": 2001,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "5099ac848a4510d8fe57d4754d69b453",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:30:58.358729"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究中国个体经营者的消费模式，虽然提到了风险因素（如失败风险和财务杠杆风险），但其核心研究内容是消费决策的影响因素，而非金融衍生品定价、风险管理或投资组合管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究中国个体经营者的消费模式，虽然提到了风险因素（如失败风险和财务杠杆风险），但其核心研究内容是消费决策的影响因素，而非金融衍生品定价、风险管理或投资组合管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:34:45.258401"
}