{
  "paper": {
    "id": 4646,
    "title": "Why do they gamble and what does it mean? Latent class analysis of gambling motives among young male gamblers",
    "abstract": "Background Motives to gamble are important in the functional analysis of problematic gambling. This study examines the possibility of classifying young male gamblers based on their motives to gamble and compares the identified groups to validate the obtained classification. Method Based on a screening survey among 2,681 young men from Bavaria, n=170 frequent or problem gamblers (M-age = 22.3 years, SD = 2.5) were recruited to participate in a survey with a 2-year follow-up. Latent class analyses (LCA) were conducted based on baseline answers to 10 items measuring five domains of gambling motives: enhancement, coping, self-gratification, and social and financial motives. The identified classes were compared regarding baseline gambling attitudes and impulsiveness as well as gambling behavior and gambling disorder (GD) criteria at baseline and follow-up. Results Analyses revealed a four-class solution based on reported motives: 'primarily fun-motivated gamblers' (n=100, 58.8%), who gambled mostly for fun; 'asset and self-gratification seekers' (n=19, 11.2%) with a high risk of GD at baseline; 'thrill seekers' (n=42, 24.7%) with high impulsiveness; and 'polymotivated coping gamblers' (n=9, 5.3%) with a higher risk of GD than the 'primarily fun-motivated gamblers' in cross-sectional and longitudinal analyses. Conclusions The identified group differences support the validity of the classification. 'Thrill seekers' and 'polymotivated coping gamblers' correspond to the impulsive and emotionally vulnerable pathways described by Blaszczynski and Nower (2002) respectively. The two other groups appear to be subtypes of the behaviorally conditioned type. Motivation-based classification offers a promising approach to identifying individuals with an elevated risk of GD.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "c9f389d2f0ff265791ca1ac3c9feae81",
    "relevant_keywords": [
      "classification",
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T02:39:27.007310"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究赌博动机的分类及其与赌博障碍的关系，属于心理学和行为科学领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究赌博动机的分类及其与赌博障碍的关系，属于心理学和行为科学领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:32:21.398816"
}