{
  "paper": {
    "id": 2119,
    "title": "Economic state classification and portfolio optimisation with application to stagflationary environments",
    "abstract": "Motivated by the current fears of a potentially stagflationary global economic environment, this paper uses new and recently introduced mathematical techniques to study multivariate time series pertaining to country inflation (CPI), economic growth (GDP) and equity index behaviours. We begin by assessing the temporal evolution among various economic phenomena, and complement this analysis with 'economic driver analysis,' where we decouple country economic trajectories and determine what is most important in their association. Next, we study the temporal self-similarity of global inflation, growth and equity index returns to identify the most anomalous historic periods, and windows in the past that are most similar to current market dynamics. We then introduce a new algorithm to construct economic state classifications and compute an economic state integral, where countries are determined to belong in one of four candidate states based on their inflation and growth behaviours. Finally, we implement a decade-by-decade portfolio optimisation to determine which equity indices and portfolio assets have been most beneficial in maximising portfolio risk-adjusted returns in various market conditions. This could be of great interest to those looking for asset allocation guidance in the current period of high economic uncertainty.",
    "year": 2022,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "a2930bb3c4d0466da045ad2cfe5aefb8",
    "relevant_keywords": [
      "classification",
      "clustering",
      "principal components analysis"
    ],
    "stage1_timestamp": "2025-05-15T01:03:03.761166"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心研究内容是经济状态分类和资产组合优化，特别是在不同市场条件下最大化投资组合的风险调整回报，这直接属于投资组合管理的范畴。论文并未涉及衍生品定价或金融风险管理的具体应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心研究内容是经济状态分类和资产组合优化，特别是在不同市场条件下最大化投资组合的风险调整回报，这直接属于投资组合管理的范畴。论文并未涉及衍生品定价或金融风险管理的具体应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T14:24:44.090288"
}