{
  "paper": {
    "id": 1395,
    "title": "Evaluation of Deep Learning Algorithms for Quadratic Hedging",
    "abstract": "We solve the quadratic hedging problem by deep learning in discrete time. We consider three deep learning algorithms corresponding to three architectures of neural network approximation: approximating controls of different periods by different feedforward neural networks (FNNs) as proposed by Han and Weinan (2016), using a single FNN with decision time as an input to approximate controls of different periods, and using a recursive neural network (RNN) to utilize historical information. We evaluate these algorithms under the discrete-time Black-Scholes model and the DCC-GARCH model for hedging basket options on portfolios of up to 100 assets with time to maturity up to one year. We compare them in terms of their hedging error on the test data, extent of overlearning, learned hedging strategy, training speed, and scalability. Our results favor the single FNN and RNN approximations overall; the multiple FNN approximation can fail for a large portfolio and a long maturity. We also evaluate the performance of the single FNN and RNN algorithms in a data-driven framework, where data is generated by resampling without assuming any parametric model.",
    "year": 2022,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "823bc98391c970cfb456fcea9dee467d",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "neural network",
      "recurrent neural network",
      "RNN",
      "feedforward neural networks",
      "FNNs",
      "representation learning"
    ],
    "stage1_timestamp": "2025-05-15T00:55:28.430667"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用深度学习算法解决二次对冲问题，特别是在离散时间的Black-Scholes模型和DCC-GARCH模型下对冲篮子期权。对冲是金融风险管理中的一个重要技术，旨在减少或消除金融资产的价格波动风险。因此，该论文的主要应用领域是金融风险管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是使用深度学习算法解决二次对冲问题，特别是在离散时间的Black-Scholes模型和DCC-GARCH模型下对冲篮子期权。对冲是金融风险管理中的一个重要技术，旨在减少或消除金融资产的价格波动风险。因此，该论文的主要应用领域是金融风险管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:21:12.592718"
}