{
  "paper": {
    "id": 218,
    "title": "Automated credit assessment framework using ETL process and machine learning",
    "abstract": "In the current business scenario, real-time analysis of enterprise data through Business Intelligence (BI) is crucial for supporting operational activities and taking any strategic decision. The automated ETL (extraction, transformation, and load) process ensures data ingestion into the data warehouse in near real-time, and insights are generated through the BI process based on real-time data. In this paper, we have concentrated on automated credit risk assessment in the financial domain based on the machine learning approach. The machine learning-based classification techniques can furnish a self-regulating process to categorize data. Establishing an automated credit decision-making system helps the lending institution to manage the risks, increase operational efficiency and comply with regulators. In this paper, an empirical approach is taken for credit risk assessment using logistic regression and neural network classification method in compliance with Basel II standards. Here, Basel II standards are adopted to calculate the expected loss. The required data integration for building machine learning models is done through an automated ETL process. We have concluded this research work by evaluating this new methodology for credit risk assessment.",
    "year": 2025,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "da232184703728946adc87933745c979",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "regression",
      "neural network",
      "logistic regression"
    ],
    "stage1_timestamp": "2025-05-15T01:48:30.639130"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on automated credit risk assessment using machine learning techniques, specifically logistic regression and neural networks, in compliance with Basel II standards. This directly addresses the management of credit risk, which is a key component of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on automated credit risk assessment using machine learning techniques, specifically logistic regression and neural networks, in compliance with Basel II standards. This directly addresses the management of credit risk, which is a key component of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:59:55.916100"
}