{
  "paper": {
    "id": 4418,
    "title": "Modelling collective effectiveness of voluntary vaccination with and without incentives",
    "abstract": "Control strategies of infectious diseases at a regional level can rely on vaccination. When the decision to vaccinate is made by each farmer on a voluntary basis, a farmer vaccinates to protect his own herd. If the vaccinated herds are protected against infection. the risk for other herds is reduced, creating a positive externality (i.e. an impact on a third party not directly involved in the decision). The objectives of this study are to evaluate the effectiveness at a regional level of voluntary vaccination and to analyse the effect of financial incentives and compensation for losses due to disease considering the externalities due to vaccination. We developed a dynamic deterministic model, based on a decision model interacting with an epidemiological state transition model. It determines the proportion of farmers who vaccinate over time, and the evolution of the prevalence of infected herds in a population of herds exposed to the same risk. The behaviour of farmers is modelled assuming perfect information (farmers are fully informed about prevalence, costs of disease and costs of vaccination). The decision to vaccinate is made according to a rational economic behaviour: farmers make their choices to maximize their expected utility, considering their risk aversion. The expected utility is calculated with a decision tree. The epidemiological model is based on a SIR (Susceptible, Infectious, Recovered) model modified to consider imperfect vaccination that protects herds for one year. The model is studied analytically and by simulation. For simulations, we define the epidemiological parameters of the model (transmission rate and average duration of the infectious and recovered states), the herd level effectiveness of the vaccination, the cost of vaccination, the reduction of income due to the disease, the incomes of the farmers and the risk aversion of the farmers. These parameters are based on an endemic disease, BVD (Bovine Viral Diarrhoea). The model shows that voluntary vaccination cannot eradicate the modelled disease. Risk aversion of farmers leads to a lower prevalence at the equilibrium than when farmers are risk neutral. Incentives for vaccination decrease the prevalence but do not result in eradication of the disease. Compensating for disease losses in newly infected farms leads to an increase in prevalence, due to moral hazard (farmers behave less carefully than if they were fully exposed to the risk), except if it is restricted to vaccinated herds. (C) 2009 Published by Elsevier Ltd.",
    "year": 2010,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "3c6a68e052b2dd28f9adf59f45205223",
    "relevant_keywords": [
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T02:37:16.740488"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是农业领域的自愿疫苗接种模型及其经济激励效果，虽然使用了决策树等经济模型，但其应用场景是农业流行病学而非金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是农业领域的自愿疫苗接种模型及其经济激励效果，虽然使用了决策树等经济模型，但其应用场景是农业流行病学而非金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:32:56.918995"
}