{
  "paper": {
    "id": 11,
    "title": "Portfolio construction using explainable reinforcement learning",
    "abstract": "While machine learning's role in financial trading has advanced considerably, algorithmic transparency and explainability challenges still exist. This research enriches prior studies focused on high-frequency financial data prediction by introducing an explainable reinforcement learning model for portfolio management. This model transcends basic asset prediction, formulating concrete, actionable trading strategies. The methodology is applied in a custom trading environment mimicking the CAC-40 index's financial conditions, allowing the model to adapt dynamically to market changes based on iterative learning from historical data. Empirical findings reveal that the model outperforms an equally weighted portfolio in out-of-sample tests. The study offers a dual contribution: it elevates algorithmic planning while significantly boosting transparency and interpretability in financial machine learning. This approach tackles the enduring 'black-box' issue and provides a holistic, transparent framework for managing investment portfolios.",
    "year": 2024,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "b674fb65efbbde5f5bf1811f3e9049f4",
    "relevant_keywords": [
      "machine learning",
      "reinforcement learning",
      "deep learning",
      "representation learning",
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T00:38:16.227451"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是使用可解释的强化学习模型来构建和管理投资组合，其研究目标是制定具体的、可操作的交易策略，并在模拟CAC-40指数金融环境的自定义交易环境中进行测试。这些内容明确指向投资组合管理领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是使用可解释的强化学习模型来构建和管理投资组合，其研究目标是制定具体的、可操作的交易策略，并在模拟CAC-40指数金融环境的自定义交易环境中进行测试。这些内容明确指向投资组合管理领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:34:27.256174"
}