{
  "paper": {
    "id": 3938,
    "title": "Building as a virtual power plant, magnitude and persistence of deferrable loads and human comfort implications",
    "abstract": "This work uses high resolution data from 130 electricity sub-meters to characterise a 12,500m(2) commercial building as a virtual power plant (VPP) by assessing magnitude and duration of electrical loads suitable for demand response (DR). In 2018, the building had a peak hourly demand of 48 W/m(2) and its electricity consumption (183.2 kWh/m(2)/yr.) was within low to medium range of air-conditioned UK portfolio. Deferrable loads from heat pumps, air handling units, lifts, lighting, circulating pumps and dry air coolers were used to illustrate building's DR capability over a maximum duration of 4 h per DR cycle. On average, deferrable loads form 46.4% of total building electricity consumption and across a 4-hour DR cycle can be characterised as having an initial power (and stored energies) of 28 kW (401 +/- 117 kWh); 109 kW (571 +/- 82 kWh); and finally 138 kW (625 +/- 18 kWh) for 100%, 41.5% and 24.6% of time respectively. Following a DR event, the HVAC ability to restore original indoor climate was found to be at least twice as fast as climatic drift during the event. A linear regression model was found to be weak in using external temperature to predict the magnitude of aggregated deferrable loads. (C) 2020 Elsevier B.V. All rights reserved.",
    "year": 2020,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "aaf0a29ea4f84b087e7fdee37a8bc7e9",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:22:11.988897"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究商业建筑作为虚拟发电厂的潜力，关注的是电力负荷的可延迟性和需求响应能力，与金融领域的衍生品定价、金融风险管理或投资组合管理无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究商业建筑作为虚拟发电厂的潜力，关注的是电力负荷的可延迟性和需求响应能力，与金融领域的衍生品定价、金融风险管理或投资组合管理无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:08:25.081017"
}