{
  "paper": {
    "id": 1950,
    "title": "How geopolitical tensions affect China's systemic financial risk contagion",
    "abstract": "This study calculates China's net risk from the perspective of the global systemic financial risk spillover network , constructs TVP-VAR-SV models for China to examine the time-varying effects of geopolitical exposure on aggregate systemic financial risk contagion , investigate the heterogeneous impacts across different financial submarkets. Furthermore, an innovative combination of machine learning techniques for contribution decomposition and time-varying effect analysis is introduced to identify time-varying channel effects, providing a reference for channel analysis in other studies. The conclusions of this paper are: Firstly, geopolitical exposure has a significant and time- varying impact on systemic risk, with reaching its maximum nine months after the shock oc- curs. From the time dimension of the sample, the impact is the greatest during the 2012-2013 Sino-Japanese Diaoyu Islands incident. Moreover, the impact during the U.S.-China trade friction lasted for longer time. Secondly, geopolitical volatility has a heterogeneous effect on risk in different financial submarkets. In the short run, it mostly raises the risk in the equity market; in the medium run, it is the treasury market; and in the long run, it is the foreign exchange market. Thirdly, geopolitical exposures increase systemic risk spillovers through the international trade channel, the international capital flows channel, and the market sentiment channel. The capital channel has the greatest response to shocks. However, the effect of these three channels on raising risk spillovers is diminishing over time, while the effect of economic policy uncertainty is grad- ually increasing. It is recommended in this paper that the department of systemic risk monitoring should add the assessment of the geopolitical situation to the risk management. In particular, foreign exchange market regulation should be strengthened during periods of geopolitical volatility to be vigilant against the possibility of long-term risks in the foreign exchange market. In terms of channels, China should develop diversified strategies. Given that the capital channel is the most dominant in terms of response strength, special efforts should be made to optimize the regulation of the capital market to enhance the resilience of China's financial market. China should also be vigilant about the level of economic policy uncertainty , its growing impact. Finally, China should actively strengthen international cooperation.",
    "year": 2025,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "bad40ea18d8c5147fd32dd9e29742f24",
    "relevant_keywords": [
      "machine learning"
    ],
    "stage1_timestamp": "2025-05-15T02:09:14.414975"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心研究内容是分析地缘政治紧张对中国系统性金融风险传染的影响，并构建了TVP-VAR-SV模型来研究这种影响的时变效应。此外，论文还探讨了不同金融子市场的异质性影响，并提出了风险管理建议。这些内容明确属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心研究内容是分析地缘政治紧张对中国系统性金融风险传染的影响，并构建了TVP-VAR-SV模型来研究这种影响的时变效应。此外，论文还探讨了不同金融子市场的异质性影响，并提出了风险管理建议。这些内容明确属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:45:10.709108"
}