{
  "paper": {
    "id": 920,
    "title": "Statistical and economic performance of combination methods for forecasting crude oil price volatility",
    "abstract": "This article aims to investigate whether a wide variety of combination methods, ranging from simple averaging approaches to time-varying techniques based on the past performance of the single models and regression tools, improve forecasting accuracy, risk management and economic gains across different forecasting horizons in a crude oil future framework. For this purpose, we implement various combination methods in fourteen HAR-RV models including different characteristics and uncertainty factors and evaluate their performance through statistical, risk management and economic loss functions. The empirical analysis yields some important conclusions: (i) sophisticated combinations improve the forecasting accuracy in all forecasting horizons, (ii) from a risk management perspective, regression-based combinations predict better potential loss of an investment on crude oil futures compared to individual models, (iii) machine learning and non-parametric combinations lead to higher economic gains across all forecasting horizons in a portfolio exercise and (iv) combinations are considered as a better alternative to single models using various robustness checks although the best performer among the combination methods is not stable across applications.",
    "year": 2022,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "e06b65ff22f23743dffa11ad5fc76283",
    "relevant_keywords": [
      "machine learning",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T00:49:36.355414"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk",
      "Portfolio Management"
    ],
    "justification": "The paper focuses on forecasting crude oil price volatility using combination methods, which directly relates to risk management as it discusses predicting potential losses in crude oil futures investments. Additionally, the paper mentions economic gains in a portfolio exercise, indicating relevance to portfolio management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\", \"Portfolio Management\"],\n  \"justification\": \"The paper focuses on forecasting crude oil price volatility using combination methods, which directly relates to risk management as it discusses predicting potential losses in crude oil futures investments. Additionally, the paper mentions economic gains in a portfolio exercise, indicating relevance to portfolio management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:26:37.978784"
}