{
  "paper": {
    "id": 180,
    "title": "A MCDM-Based Evaluation Approach for Imbalanced Classification Methods in Financial Risk Prediction",
    "abstract": "Various classifiers have been proposed for financial risk prediction. The traditional practice of using a singular performance metric for classifier evaluation is not sufficient for imbalanced classification. This paper proposes a multi-criteria decision making (MCDM)-based approach to evaluate imbalanced classifiers in credit and bankruptcy risk prediction by considering multiple performance metrics simultaneously. An experimental study is designed to provide a comprehensive evaluation of imbalanced classifiers using the proposed evaluation approach over seven financial imbalanced data sets from the UCI Machine Learning Repository. The TOPSIS, a well-known MCDM method, was applied to rank three categories of imbalanced classifiers using six popular evaluation criteria. The rankings results indicate that: 1) the rankings generated by the TOPSIS, which combine the results of six evaluation criteria, provide a more reasonable evaluation of imbalanced classifiers over any single performance criterion; and 2) Synthetic Minority Oversampling Technique (SMOTE)-based ensemble techniques outperform other groups of imbalanced learning approaches. Specifically, SMOTEBoost-C4.5, SMOTE-C4.5, and SMOTE-MLP were ranked as the top three classifiers based on their performances on the six criteria.",
    "year": 2019,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "53448742ecf305333ab140e9b98ad529",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "decision tree",
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T01:47:52.992887"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on evaluating imbalanced classifiers for credit and bankruptcy risk prediction, which are key aspects of financial risk management. The proposed MCDM-based approach is specifically designed to improve the evaluation of classifiers in these financial risk prediction scenarios.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on evaluating imbalanced classifiers for credit and bankruptcy risk prediction, which are key aspects of financial risk management. The proposed MCDM-based approach is specifically designed to improve the evaluation of classifiers in these financial risk prediction scenarios.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:00:22.157018"
}