{
  "paper": {
    "id": 836,
    "title": "Government accounting optimization based on computational linguistics",
    "abstract": "The level of moral development and moral intensity in cognitive psychology will not only affect the ethical behavior of accountants, but also have a direct impact on the quality and level of accounting work. Therefore, in this paper, the ethical behavior of accountants was analyzed from the perspective of cognitive psychology. Computer-aided data mining techniques were introduced, and government accounting risk assessment management of financial accountants was studied. In this paper, the principle of cognitive psychology to measure the ethical level of accountants was first described. The predicament of moral judgments was analyzed and an optimization plan to improve the ethical intention of accountants was proposed. Support Vector Machine classification technology in data mining was studied to explore how to conduct effective and reliable evaluation, so as to provide a scientific basis for decision-making in improving accounting management. After the simulation experiment, it is proved that continuously improving the ethical standards of accountants and strengthening the forecast of accounting risks can continue to optimize the accounting office management. (C) 2018 Published by Elsevier B.V.",
    "year": 2019,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "ba19b4e83e8722d4883cfa4dc6ff509d",
    "relevant_keywords": [
      "support vector machine",
      "SVM",
      "classification"
    ],
    "stage1_timestamp": "2025-05-15T01:55:41.568699"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究政府会计优化和会计师的伦理行为，虽然提到了会计风险评估管理，但其核心应用领域是会计管理和伦理心理学，而非特定的金融研究领域如衍生品定价、金融风险管理或投资组合管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究政府会计优化和会计师的伦理行为，虽然提到了会计风险评估管理，但其核心应用领域是会计管理和伦理心理学，而非特定的金融研究领域如衍生品定价、金融风险管理或投资组合管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:54:17.247546"
}