{
  "paper": {
    "id": 584,
    "title": "Machine learning-driven credit risk: a systemic review",
    "abstract": "Credit risk assessment is at the core of modern economies. Traditionally, it is measured by statistical methods and manual auditing. Recent advances in financial artificial intelligence stemmed from a new wave of machine learning (ML)-driven credit risk models that gained tremendous attention from both industry and academia. In this paper, we systematically review a series of major research contributions (76 papers) over the past eight years using statistical, machine learning and deep learning techniques to address the problems of credit risk. Specifically, we propose a novel classification methodology for ML-driven credit risk algorithms and their performance ranking using public datasets. We further discuss the challenges including data imbalance, dataset inconsistency, model transparency, and inadequate utilization of deep learning models. The results of our review show that: 1) most deep learning models outperform classic machine learning and statistical algorithms in credit risk estimation, and 2) ensemble methods provide higher accuracy compared with single models. Finally, we present summary tables in terms of datasets and proposed models.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "9460642a1cdd1f2ab35ae4db2e72529b",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "classification",
      "neural network",
      "representation learning",
      "ensemble methods"
    ],
    "stage1_timestamp": "2025-05-15T01:52:49.439298"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on the application of machine learning and deep learning techniques for credit risk assessment, which is a key component of financial risk management. The systematic review and proposed classification methodology specifically address the challenges and performance of these models in estimating credit risk, a core aspect of risk management in finance.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on the application of machine learning and deep learning techniques for credit risk assessment, which is a key component of financial risk management. The systematic review and proposed classification methodology specifically address the challenges and performance of these models in estimating credit risk, a core aspect of risk management in finance.\"\n}\n```"
  },
  "timestamp": "2025-05-20T14:24:24.073842"
}