{
  "paper": {
    "id": 2183,
    "title": "Bank provision reversals and income smoothing: A case study",
    "abstract": "Incentives for banks to achieve income targets have previously been identified as a strong motivation for income smoothing (IS). Extant literature captures bank IS indirectly via dis-cretionary provision estimations. In turn, our study directly locates IS through loan loss provision reversals. Drawing from bounded rationality perspectives, we investigate a sys-temic European Bank from January 2006 to September 2017, with 15,931 unique loan portfolio-quarter observations, employing a frequency and machine learning analysis. Our empirical investigation reveals both the main incentives underlying provision rever-sals recognition and the reported income consequences of such reversals, in times of reces-sion. In particular, we find that provision reversals are principally used to avoid negative reported income (i.e., net losses). There is also some evidence that provision reversals are used to avoid income decline compared to the previous quarter. Finally, we show an asymmetric pattern of provision reversals over time with an emphasis on the early reces-sion years. Our study contributes to the efforts of policy makers (both banking and accounting regulators) to reduce opportunistic, income-increasing actions by bank execu-tives in difficult times. & COPY; 2022 Elsevier Inc. All rights reserved.",
    "year": 2023,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "b788712e39c7b76a2ad5ac771b3df103",
    "relevant_keywords": [
      "machine learning"
    ],
    "stage1_timestamp": "2025-05-15T01:03:36.751793"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究银行通过贷款损失准备金的逆转来实现收入平滑的行为，虽然涉及金融领域，但其核心研究并不直接属于衍生品定价、金融风险管理或投资组合管理中的任何一个。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究银行通过贷款损失准备金的逆转来实现收入平滑的行为，虽然涉及金融领域，但其核心研究并不直接属于衍生品定价、金融风险管理或投资组合管理中的任何一个。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:16:45.064516"
}