{
  "paper": {
    "id": 3168,
    "title": "Chinese companies distress prediction: an application of data envelopment analysis",
    "abstract": "Bankruptcy prediction is a key part in corporate credit risk management. Traditional bankruptcy prediction models employ financial ratios or market prices to predict bankruptcy or financial distress prior to its occurrence. We investigate the predictive accuracy of corporate efficiency measures along with standard financial ratios in predicting corporate distress in Chinese companies. Data Envelopment Analysis (DEA) is used to measure corporate efficiency. In contrast to previous applications of DEA in credit risk modelling where it was used to generate a single efficiency-Technical Efficiency (TE), we assume Variable Returns to Scale, and decompose TE into Pure Technical Efficiency and Scale Efficiency. These measures are introduced into Logistic Regression to predict the probability of distress, along with the level of Returns to Scale. Effects of efficiency variables are allowed to vary across industries through the use of interaction terms, while the financial ratios are assumed to have the same effects across all sectors. The results show that the predictive power of the model is improved by this corporate efficiency information.",
    "year": 2014,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "9d554c14fb47a837c7d0b1bb78a507b0",
    "relevant_keywords": [
      "classification",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:23:33.493368"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on predicting corporate distress and bankruptcy, which is a key aspect of credit risk management, a subfield of financial risk management. The use of Data Envelopment Analysis (DEA) and Logistic Regression to improve predictive accuracy directly addresses risk assessment and mitigation in financial contexts.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on predicting corporate distress and bankruptcy, which is a key aspect of credit risk management, a subfield of financial risk management. The use of Data Envelopment Analysis (DEA) and Logistic Regression to improve predictive accuracy directly addresses risk assessment and mitigation in financial contexts.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:38:05.070019"
}