{
  "paper": {
    "id": 1922,
    "title": "Machine learning-based construction site dynamic risk models",
    "abstract": "In the last decade, injury statistics have not exhibited appreciable improvement within the construction industry, with current management strategies deployed reactively in response to typically safety lagging indicators (e.g., injury rates, lost workdays, and post-incident inspections). This situation suggests that proactive safety man-agement approaches that rely on leading indicators for key decision-making need to be developed. To propel the third wave of construction safety management research, the current study aims at developing site risk models that generate predictions for safety risk leading indicators across different work zones and over the entire project lifecycles. Such leading indicators can be used to proactively anticipate worksite risks such that preventative measures are implemented in advance and/or adjusted in real-time as projects progress to dynamically monitor and enhance safety performance. The developed risk models are driven by ensemble machine learning algo-rithms trained using previous injury precursors and outcomes. The ensemble algorithms consider five base al-gorithms subsequently tuned and validated: naive Bayes, decision trees, random forests, support vector machines, and artificial neural networks. A demonstration application is also presented herein, where the ensemble algorithms are employed to develop a risk model that forecasts leading indicators of site-specific risk levels, including financial implications of potential injuries and the most likely affected body parts. The results demonstrate that, unlike currently available approaches, machine learning-based site risk models may be able to proactively and dynamically assess and subsequently boost the safety performance of construction projects. Such site risk models are expected to provide project managers with key information to proactively prevent worksite accidents, prioritize their resources, enhance project safety culture, and minimize injury-related costs.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "9e5104051037529ae69fa2689fa6f8b8",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM",
      "decision tree",
      "neural network",
      "random forest"
    ],
    "stage1_timestamp": "2025-05-15T02:09:14.300460"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是建筑工地的动态风险模型，用于预测和预防工地安全事故，其应用场景属于建筑安全管理领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是建筑工地的动态风险模型，用于预测和预防工地安全事故，其应用场景属于建筑安全管理领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:45:12.272681"
}