{
  "paper": {
    "id": 1969,
    "title": "Banking on alternative credit scores: Auditing the calculative infrastructure of US consumer lending",
    "abstract": "Alternative credit scores have become an increasingly important tool for lenders to assess risk and authorize investment in consumer debt. Using alternative data and processing techniques that leverage machine learning (ML) and Artificial Intelligence (AI), these models are designed to bypass existing barriers to risk-based pricing, which is the idea that financial institutions offer different interest rates to consumers based on their likelihood of default. Through an algorithmic audit of one lender's (Upstart) credit scoring model, I find that alternative data, particularly whether an applicant has a bachelor's degree, strongly impacted loan outcomes. This raises important equity concerns about overhauling lending criteria via opaque models that restructure the logic of risk assessment. In following the logic of risk assessment generated by Upstart's model, I also audit three fintech-bank partnerships and examine the balance sheets of banks providing capital via Upstart's platform. This is done to demonstrate rising capital allocation to these types of loans at banks engaged in fintech-bank partnerships, in one case rising from 0.14% to 15.6% of the banks' balance sheet over three years. My analysis shows that alternative credit scoring systems function as a key piece of calculative infrastructure, which allows some institutions to bypass barriers to risk-based pricing, and becomes an infrastructural site for tech startups to partner with financial institutions seeking out new sources of revenue.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "10feabbaa2a1b4da0a9d40f234e795c3",
    "relevant_keywords": [
      "machine learning",
      "classification",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:09:48.272754"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用机器学习和人工智能来开发替代信用评分模型，用于评估消费者贷款的风险和授权投资。这直接涉及到金融风险管理中的信用风险评估和风险定价。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是使用机器学习和人工智能来开发替代信用评分模型，用于评估消费者贷款的风险和授权投资。这直接涉及到金融风险管理中的信用风险评估和风险定价。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:45:09.292128"
}