{
  "paper": {
    "id": 2072,
    "title": "Advancing Financial Inclusion and Data Ethics: The Role of Alternative Credit Scoring",
    "abstract": "Alternative credit scoring plays a vital role in advancing the goals of balancing economic progress with resolving social issues by promoting financial inclusion, supporting data-driven decision-making, fostering innovation, enhancing risk management, and addressing ethical considerations. This research investigates alternative data sources and credit-scoring algorithms to evaluate the creditworthiness of individuals with limited credit histories. The study conducts a systematic literature review and meta-analysis to explore and evaluate alternative data sources and advanced credit scoring algorithms used in assessing the creditworthiness of individuals. Alternative data such as Online Behaviour and E-commerce, Social Networks and Relationships, Location, and Property Details were identified, while Machine Learning techniques such as Gradient-Boosted Decision Trees and Light Gradient-Boosting Machine demonstrate superior performance. However, ethical and privacy concerns regarding alternative data sources are paramount. The study's implications extend to financial institutions and creditscoring agencies, offering insights to enhance credit assessment processes and stressing the importance of ethical data handling and privacy. This research contributes to understanding the dynamics between alternative data and credit-scoring algorithms, providing a roadmap for their responsible integration in credit assessments, thereby fostering financial inclusion and ethical data practices in the fut. Juristic society.",
    "year": 2025,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "4becb4000154e6f21cc3d77b64b0b991",
    "relevant_keywords": [
      "machine learning",
      "decision tree",
      "classification",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:10:58.951510"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文研究了替代数据源和信用评分算法，用于评估信用历史有限的个人的信用风险，这直接关联到金融风险管理中的信用风险评估。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文研究了替代数据源和信用评分算法，用于评估信用历史有限的个人的信用风险，这直接关联到金融风险管理中的信用风险评估。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:44:26.293291"
}