{
  "paper": {
    "id": 2239,
    "title": "Asymmetry and determinants of financial connectivity in G20: Evidence from a quantile-based and lasso regression analysis",
    "abstract": "As global financial markets become more integrated, the interconnected characteristics among these markets have become increasingly pronounced, making the network of interconnections among national financial markets a significant carrier of systemic financial risk contagion. Against the backdrop of frequent systemic financial risks, exploring the relationships among financial risks across countries in extreme market conditions holds substantial policy significance. To this end, this paper employs Lasso quantile regression to capture tail event linkages and explore the dependencies of tail events (TE) between Chinese macroeconomic conditions and major financial institutions (FI). Having verified the model's capability in effectively predicting financial risks, a network of financial risk connectivity including China and G20 countries is established using the quantile-based TVP- VAR method. The research finds that, firstly, in extreme market conditions, the spillover effects of financial risks are significantly intensified. At this time, the spillover effects of financial risks from developed countries are significantly greater than those from developing countries. Secondly, there is significant asymmetry in financial risk spillovers among different countries, and the left-tail risk spillover effects are higher than the right-tail under various extreme market conditions, indicating that under negative economic or financial news, the speed and impact of risk propagation are wider. Thirdly, under extreme market conditions, the financial risk connectivity of G20 countries is primarily driven by information transmission mechanisms, mainly through capital flows and cross-border credit, whereas under normal market conditions, the transmission of financial risks among nations is mainly due to deeper structural changes within their financial markets.",
    "year": 2025,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "0b877fb344c09f45f3daf7bf1eb448dd",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:12:51.028552"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要研究全球金融市场在极端市场条件下的金融风险溢出效应和传染机制，通过量化方法分析金融风险的传播路径和不对称性，这直接属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文主要研究全球金融市场在极端市场条件下的金融风险溢出效应和传染机制，通过量化方法分析金融风险的传播路径和不对称性，这直接属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:43:40.574546"
}