{
  "paper": {
    "id": 2149,
    "title": "A recent review on optimisation methods applied to credit scoring models",
    "abstract": "Purpose - This paper aims to present a literature review of the most recent optimisation methods applied to Credit Scoring Models (CSMs). Design/methodology/approach - The research methodology employed technical procedures based on bibliographic and exploratory analyses. A traditional investigation was carried out using the Scopus, ScienceDirect and Web of Science databases. The papers selection and classification took place in three steps considering only studies in English language and published in electronic journals (from 2008 to 2022). The investigation led up to the selection of 46 publications (10 presenting literature reviews and 36 proposing CSMs).Findings - The findings showed that CSMs are usually formulated using Financial Analysis, Machine Learning, Statistical Techniques, Operational Research and Data Mining Algorithms. The main databases used by the researchers were banks and the University of California, Irvine. The analyses identified 48 methods used by CSMs, the main ones being: Logistic Regression (13%), Naive Bayes (10%) and Artificial Neural Networks (7%). The authors conclude that advances in credit score studies will require new hybrid approaches capable of integrating Big Data and Deep Learning algorithms into CSMs. These algorithms should have practical issues considered consider practical issues for improving the level of adaptation and performance demanded for the CSMs.Practical implications - The results of this study might provide considerable practical implications for the application of CSMs. As it was aimed to demonstrate the application of optimisation methods, it is highly considerable that legal and ethical issues should be better adapted to CSMs. It is also suggested improvement of studies focused on micro and small companies for sales in instalment plans and commercial credit through the improvement or new CSMs. Originality/value - The economic reality surrounding credit granting has made risk management a complex decision-making issue increasingly supported by CSMs. Therefore, this paper satisfies an important gap in the literature to present an analysis of recent advances in optimisation methods applied to CSMs. The main contribution of this paper consists of presenting the evolution of the state of the art and future trends in studies aimed at proposing better CSMs.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "0da2ea56158f11185fceaf166e3a056a",
    "relevant_keywords": [
      "machine learning",
      "classification",
      "regression",
      "support vector machine",
      "SVM",
      "decision tree",
      "neural network",
      "deep learning",
      "representation learning",
      "backpropagation",
      "BP",
      "hidden layer",
      "convolutional neural network",
      "CNN",
      "recurrent neural network",
      "long short-term memory",
      "LSTM"
    ],
    "stage1_timestamp": "2025-05-15T02:11:40.607860"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on the application of optimization methods in Credit Scoring Models (CSMs), which are primarily used for assessing the creditworthiness of borrowers and managing credit risk. This directly falls under the domain of Financial Risk Management, as it deals with mitigating risks associated with lending and credit decisions.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on the application of optimization methods in Credit Scoring Models (CSMs), which are primarily used for assessing the creditworthiness of borrowers and managing credit risk. This directly falls under the domain of Financial Risk Management, as it deals with mitigating risks associated with lending and credit decisions.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:44:04.843761"
}