{
  "paper": {
    "id": 2532,
    "title": "A risk detection framework of Chinese high-tech firms using wide & deep learning model based on text disclosure",
    "abstract": "High-tech firms have been recognized as a major source of earnings in most of countries in the world, especially in China. A high degree of information asymmetry has led to the problem of difficult financing, high interest rates, and complicated audit procedures for high-tech firms. However, little works focus on an efficient automated framework to improve risk detection accuracy for high-tech firms. Our work proposes a new framework using wide & deep learning model with annual report text and financial data to detect risk of high-tech firms. We examine the effects of the proposed framework by comparing them with other mature classification methods utilizing real firms data in China. The results showed that the proposed framework with text improve classification performance compared to baseline methods with financial data. The rate of increase in accuracy, recall, AUC is 12.2%, 100% and 44.4%. Moreover, the results suggests that the importance of unstructured data and soft information of high-tech firms should be emphasized to improve risk detection accuracy. (C) 2021 The Authors. Published by Elsevier B.V.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "ad800f99f31f70a13cb51c30ec2bb352",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "classification",
      "neural network",
      "representation learning"
    ],
    "stage1_timestamp": "2025-05-15T02:16:32.638683"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文提出了一种基于宽深度学习的风险检测框架，用于提高高科技企业的风险检测准确性，这直接关联到金融风险管理中的信用风险评估和违约预测。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文提出了一种基于宽深度学习的风险检测框架，用于提高高科技企业的风险检测准确性，这直接关联到金融风险管理中的信用风险评估和违约预测。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:41:34.054790"
}