{
  "paper": {
    "id": 1386,
    "title": "Unveiling Roadway Hazards: Enhancing Fatal Crash Risk Estimation Through Multiscale Satellite Imagery and Self-Supervised Cross-Matching",
    "abstract": "Traffic accidents threaten human lives and impose substantial financial burdens annually. Accurate estimation of accident fatal crash risk is crucial for enhancing road safety and saving lives. This article proposes an innovative approach that utilizes multiscale satellite imagery and self-supervised learning for fatal crash risk estimation. By integrating multiscale imagery, our network captures diverse features at different scales, encompassing observations of surrounding environmental factors in low-resolution images that cover larger areas and learning detailed ground-level information from high-resolution images. One advantage of our work is its sole reliance on satellite imagery data, making it an efficient and practical solution, especially when other data modalities are unavailable. With the ability to accurately estimate fatal crash risk, our method exhibits a potential for enhancing road safety, optimizing infrastructure planning, preventing accidents, and ultimately saving lives.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "6a4ddbb45758449ab081a0a92be16b85",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "representation learning",
      "neural network",
      "self-supervised learning",
      "feature learning",
      "feature representation"
    ],
    "stage1_timestamp": "2025-05-15T02:02:22.731887"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究利用多尺度卫星图像和自监督学习进行致命交通事故风险估计，其应用场景集中在道路安全和基础设施规划，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究利用多尺度卫星图像和自监督学习进行致命交通事故风险估计，其应用场景集中在道路安全和基础设施规划，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:49:25.353911"
}