{
  "paper": {
    "id": 1384,
    "title": "Research on Financial Risk Prediction Based on Improved Random Subspace",
    "abstract": "In order to provide timely and effective information and decision support for financial market entities, combined with random subspace and weight fused Lasso, this paper constructs a financial risk prediction model based on the improved random subspace method. Firstly, the basic principles of random subspace and SVM algorithm are introduced. Then, WFL and Al methods are introduced to improve random subspace, so as to reduce the dimension of multisource heterogeneous data and realize the adaptive fusion of features. Then, a financial risk prediction model based on weighted fusion adaptive random subspace is constructed, in which SVM is used as the basic classifier and the output strategy of result integration is introduced. Finally, based on the data of some listed companies, the improved random subspace method is compared with other methods. The results show that the improved random subspace method has a higher prediction value, which indicates that the method is reasonable and effective in financial risk prediction. In the improved random subspace method, combined feature F1 + F2 + F3 is better than other methods in T - 3, T - 4, and T - 5, and the prediction value is more than 95%, which fully demonstrates the rationality of the improved random subspace method in financial risk prediction. The area under the ROC curve (AUC) predicted by weight fused adaptive integration-based random subspace (FAIB_RS) method is about 95% in T - 3, 93% in T - 4, and 95.5% in T - 5, which is obviously higher than that of the other eight methods.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "84685d7fe7ae0d48ce6996544cc934c7",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM",
      "feature learning",
      "feature representation"
    ],
    "stage1_timestamp": "2025-05-15T02:02:22.729843"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是构建一个基于改进随机子空间方法的金融风险预测模型，并应用于上市公司的财务数据。其主要研究目标是提高金融风险预测的准确性和有效性，这直接属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是构建一个基于改进随机子空间方法的金融风险预测模型，并应用于上市公司的财务数据。其主要研究目标是提高金融风险预测的准确性和有效性，这直接属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:49:25.531900"
}