{
  "paper": {
    "id": 1551,
    "title": "Graduate Admission Chance Prediction Using Deep Neural Network",
    "abstract": "Every year many students apply for graduate admission to different universities. To select an applicant, each university has different selection criteria such as GRE score, CGPA, research background, statement of purpose, letter of recommendation, university rating etc. There are some web applications as well as some consultancy services for suggesting the appropriate university based on students' portfolio. These help to give an idea which universities should be applied for admission. But they have limitations because humans are incapable of considering all the conditions and universities. Moreover, web applications have accuracy problems. In this study, we have proposed a deep neural network (DNN) to predict the chance of getting admitted to a university according to the students portfolio. All the selection criteria are considered here to predict the chance of admission. The DNN model has been compared with existing methods in terms of different performance metrics including mean squared error (MSE), root mean squared error (RMSE), mean absolute error (MAE), R-squared score. It has shown the most promising result that includes R-squared score of 0.8538 and MSE of 0.0031. The proposed method has also outperformed all the existing methods in each benchmark.",
    "year": 2020,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "a9a70739ea7824594c0b43a342128e38",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "regression",
      "neural network",
      "deep learning",
      "backpropagation",
      "BP",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T00:57:12.614456"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究使用深度神经网络预测研究生录取概率，其应用场景是教育领域而非金融领域。论文中未提及任何与衍生品定价、金融风险管理或投资组合管理相关的内容。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究使用深度神经网络预测研究生录取概率，其应用场景是教育领域而非金融领域。论文中未提及任何与衍生品定价、金融风险管理或投资组合管理相关的内容。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:20:12.761308"
}