{
  "paper": {
    "id": 958,
    "title": "Improving Portfolio Optimization Using Weighted Link Prediction in Dynamic Stock Networks",
    "abstract": "Portfolio optimization in stock markets has been investigated by many researchers. It looks for a subset of assets able to maintain a good trade-off control between risk and return. Several algorithms have been proposed to portfolio management. These algorithms use known return and correlation data to build subset of recommended assets. Dynamic stock correlation networks, whose vertices represent stocks and edges represent the correlation between them, can also be used as input by these algorithms. This study proposes the definition of constants of the classical mean-variance analysis using machine learning and weighted link prediction in stock networks (method named as MLink). To assess the performance of MLink, experiments were performed using real data from the Brazilian Stock Exchange. In these experiments, MLink was compared with mean-variance analysis (MVA), a popular method to portfolio optimization. According to the experimental results, using weighted link prediction in stock networks as input considerably increases the performance in portfolio optimization task, resulting in a gross capital increase of 41% in 84 days.",
    "year": 2019,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "31c4704acba91fd722fa816550f81c2b",
    "relevant_keywords": [
      "machine learning"
    ],
    "stage1_timestamp": "2025-05-15T00:50:08.718920"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "The paper focuses on improving portfolio optimization by using weighted link prediction in dynamic stock networks, which is a core aspect of investment portfolio management. The study compares the proposed method (MLink) with mean-variance analysis (MVA), a well-known technique in portfolio management, and demonstrates its effectiveness in increasing capital in stock market investments.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Portfolio Management\"],\n  \"justification\": \"The paper focuses on improving portfolio optimization by using weighted link prediction in dynamic stock networks, which is a core aspect of investment portfolio management. The study compares the proposed method (MLink) with mean-variance analysis (MVA), a well-known technique in portfolio management, and demonstrates its effectiveness in increasing capital in stock market investments.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:25:51.684700"
}