{
  "paper": {
    "id": 1662,
    "title": "Data-driven financial transmission right scenario generation and speculation",
    "abstract": "This paper proposes a data-driven framework to solve the financial transmission right (FTR) portfolio construction problem from the perspective of a speculator. FTR speculation is modeled as a stochastic programming problem in which uncertainty comes from the price spread across different pricing nodes over a certain holding period. Since it is difficult to model and forecast the joint distribution of prices for typical electricity markets with thousands of pricing nodes, k-means clustering with network congestion patterns is first used to help focus on important nodes and reduce the problem size. Then, a quantile regression (QR)-based method is proposed to predict the conditional distribution of average nodal prices. A Gaussian copula is further used to construct the joint conditional distribution of average nodal prices. The proposed method is tested on real market data obtained from the southwest power pool (SPP). The results show that the method has a steady performance in both node selection and price scenario generation and outperforms state-of-art methods, including copula-GARCH and truncated skew-t distributions. (c) 2021 Elsevier Ltd. All rights reserved.",
    "year": 2022,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "5f3b4ceea652658e8dcc2720da2278ad",
    "relevant_keywords": [
      "unsupervised learning",
      "clustering",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T00:58:18.331432"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是解决金融传输权（FTR）投资组合构建问题，通过数据驱动的方法进行节点选择和价格情景生成，这直接涉及投资组合管理的领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是解决金融传输权（FTR）投资组合构建问题，通过数据驱动的方法进行节点选择和价格情景生成，这直接涉及投资组合管理的领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:19:37.872136"
}