{
  "paper": {
    "id": 7090,
    "title": "A bibliometric analysis on the application of deep learning in finance: status, development and future directions",
    "abstract": "PurposeDeep learning (DL) is a new and relatively unexplored field that finds immense applications in many industries, especially ones that must make detailed observations, inferences and predictions based on extensive and scattered datasets. The purpose of this paper is to answer the following questions: (1) To what extent has DL penetrated the research being done in finance? (2) What areas of financial research have applications of DL, and what quality of work has been done in the niches? (3) What areas still need to be explored and have scope for future research?Design/methodology/approachThis paper employs bibliometric analysis, a potent yet simple methodology with numerous applications in literature reviews. This paper focuses on citation analysis, author impacts, relevant and vital journals, co-citation analysis, bibliometric coupling and co-occurrence analysis. The authors collected 693 articles published in 2000-2022 from journals indexed in the Scopus database. Multiple software (VOSviewer, RStudio (biblioshiny) and Excel) were employed to analyze the data.FindingsThe findings reveal significant and renowned authors' impact in the field. The analysis indicated that the application of DL in finance has been on an upward track since 2017. The authors find four broad research areas (neural networks and stock market simulations; portfolio optimization and risk management; time series analysis and forecasting; high-frequency trading) with different degrees of intertwining and emerging research topics with the application of DL in finance. This article contributes to the literature by providing a systematic overview of the DL developments, trajectories, objectives and potential future research topics in finance.Research limitations/implicationsThe findings of this paper act as a guide for literature review for anyone interested in doing research in the intersection of finance and DL. The article also explores multiple areas of research that have yet to be studied to a great extent and have abundant scope.Originality/valueVery few studies have explored the applications of machine learning (ML), namely, DL in finance, which is a much more specialized subset of ML. The authors look at the problem from the aspect of different techniques in DL that have been used in finance. This is the first qualitative (content analysis) and quantitative (bibliometric analysis) assessment of current research on DL in finance.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "50547f81de3ef9acb400f04941e2f756",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "neural network",
      "representation learning",
      "backpropagation",
      "BP",
      "hidden layer",
      "convolutional neural network",
      "CNN",
      "recurrent neural network",
      "long short-term memory",
      "LSTM",
      "autoencoder",
      "deep belief network",
      "DBM",
      "restricted Boltzmann machine"
    ],
    "stage1_timestamp": "2025-05-15T03:05:03.483797"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk",
      "Portfolio Management"
    ],
    "justification": "论文摘要中提到DL在金融领域的应用包括'portfolio optimization and risk management'，这直接对应投资组合管理和金融风险管理。此外，虽然论文也提到其他应用如股票市场模拟和高频交易，但这些不属于指定的三个领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\", \"投资组合管理\"],\n  \"justification\": \"论文摘要中提到DL在金融领域的应用包括'portfolio optimization and risk management'，这直接对应投资组合管理和金融风险管理。此外，虽然论文也提到其他应用如股票市场模拟和高频交易，但这些不属于指定的三个领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:27:05.432442"
}