{
  "paper": {
    "id": 396,
    "title": "Detecting firms with going-concern risk based on the industry affiliation, corporate governance characteristics, and financial performance",
    "abstract": "Detecting firms with going-concern risk is precisely critical to all financial professionals. The analytical features included three aspects: the industry domain, the corporate governance characteristics, and the financial performance. An enhanced two-step analytical approach was developed in this study. First, the multivariate analysis (MA) applied to explore influential factors affected the uncertain behaviors of a firm. Secondly, with the prioritized significant factors identified in MA model, the classification and regression tree (CART) technique was adopted to generate decision tree. There were nine significant factors: size of the board of directors, percentage of independent directors, ratio of shares pledged, family-owned type, ratio of cash right deviation, hiring Big 4 CPA firms, earnings per share, debt ratio, and return on assets. These practical finding provides comprehensive understandings of the behaviors of the firms with C-G risks. Weighing from the decision tree modeling, the testing results showed 87.5% successful rate which demonstrated itself as an effective and analytical tool and will suffice the practical needs for detecting firms with going-concern risk.",
    "year": 2011,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "ea02f6e26f4b5a2c23767c613fdcc050",
    "relevant_keywords": [
      "classification",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T01:50:14.086895"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on detecting firms with going-concern risk using a two-step analytical approach involving multivariate analysis and decision tree modeling. This is directly related to identifying and managing financial risks associated with firms' viability, which falls under the domain of Financial Risk Management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on detecting firms with going-concern risk using a two-step analytical approach involving multivariate analysis and decision tree modeling. This is directly related to identifying and managing financial risks associated with firms' viability, which falls under the domain of Financial Risk Management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:58:26.567993"
}