{
  "paper": {
    "id": 148,
    "title": "Portfolio Management Transformed: An Enhanced Black-Litterman Approach Integrating Asset Pricing Theory and Machine Learning",
    "abstract": "This study proposes a novel Black-Litterman portfolio model that leverages machine learning predictions based on size, book-to-market, momentum, and volatility. Our model integrates insights from the four-factor model and the low volatility anomaly, paving the way for a more systematic and automated process in view construction. The proposed methodology significantly augments the out-of-sample portfolio performance, outpacing benchmark strategies across various metrics, such as alpha and the Sharpe ratio. This improvement underscores the substantial economic gains offered by our model, with its Sharpe ratio being approximately 2.4 times that of the market index. Furthermore, the alpha of our portfolio exhibits an impressive annual rate of 18.7%. Additionally, forward-looking views based on machine learning prove superior to naive, backward-looking views based on historical means by more accurately aligning portfolio returns more closely with the actual distribution of future returns, further optimizing risk-adjusted returns. This study bridges the gap between asset pricing theory and portfolio management literature, demonstrating the potential of machine learning in enhancing portfolio management efficiency.",
    "year": 2025,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "b6373112283f3c88268873ea85415f22",
    "relevant_keywords": [
      "machine learning"
    ],
    "stage1_timestamp": "2025-05-15T00:40:02.065418"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心内容是提出一种改进的Black-Litterman投资组合模型，结合机器学习和资产定价理论来优化投资组合的表现。论文明确讨论了投资组合的构建、绩效评估（如夏普比率和alpha）以及风险调整后的回报优化，这些都是投资组合管理领域的核心议题。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心内容是提出一种改进的Black-Litterman投资组合模型，结合机器学习和资产定价理论来优化投资组合的表现。论文明确讨论了投资组合的构建、绩效评估（如夏普比率和alpha）以及风险调整后的回报优化，这些都是投资组合管理领域的核心议题。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:33:20.468348"
}