{
  "paper": {
    "id": 1323,
    "title": "Research on Real Estate Appraisal Method Based on Feature Engineering and BP Neural Network",
    "abstract": "With the rapid development and maturity of China's real estate industry, the financial risk of the real estate industry is crucial as the banking financial risk and the real estate mortgage evaluation system of the real estate market. Based on the GIS theme crawler framework, this paper collects data on related websites and combines the price theory of residential real estate to establish a Hedonic commodity housing price influencing factor model. The results of goodness-of-fit test and analysis of variance are performed on the various indicators of commodity housing. In order to study the influence of different factors on the price of commercial housing, and scientifically select the influence indicators that affect the price of commercial housing. According to the implementation steps of BP(Back Propagation) neural network prediction, explore the application of BP neural network in predicting the price of commercial housing in Hefei, obtain the price prediction value of commercial housing, and achieve high fitting accuracy. It has a certain guiding effect on the research of commercial housing prices in Hefei.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "663751057011d5431e5d332403524413",
    "relevant_keywords": [
      "machine learning",
      "neural network",
      "deep learning",
      "backpropagation",
      "BP",
      "hidden layer",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:01:44.713828"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究基于特征工程和BP神经网络的房地产评估方法，虽然提到了金融风险，但其核心应用是房地产价格预测，并未直接涉及衍生品定价、金融风险管理或投资组合管理等特定金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究基于特征工程和BP神经网络的房地产评估方法，虽然提到了金融风险，但其核心应用是房地产价格预测，并未直接涉及衍生品定价、金融风险管理或投资组合管理等特定金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:49:49.252792"
}