{
  "paper": {
    "id": 1835,
    "title": "Nonparametric expectile shortfall regression for functional data",
    "abstract": "This work addresses the issue of financial risk analysis by introducing a novel expected shortfall (ES) regression model, which employs expectile regression to define the shortfall threshold in financial risk management. We develop a nonparametric estimator for this model and provide mathematical support by proving both pointwise and uniform complete convergence of the estimator. These asymptotic results are derived under traditional assumptions and include precise convergence rates, emphasizing the impact of the regressor's dimensionality on the estimation approach. A key feature of our contribution is the straightforward implementation of the estimator, demonstrated through applications on both simulated and real data. Our findings indicate that the new ES-expectile model is more effective than the standard model based on quantile regression, offering improved relevance in financial risk management.",
    "year": 2025,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "9ca3f2aa85fdb308645478720b2e803d",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:08:03.942551"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper introduces a novel expected shortfall (ES) regression model specifically designed for financial risk analysis, demonstrating its effectiveness in financial risk management through both theoretical and empirical analysis. The focus on defining shortfall thresholds and improving risk management relevance clearly aligns with the financial risk management domain.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper introduces a novel expected shortfall (ES) regression model specifically designed for financial risk analysis, demonstrating its effectiveness in financial risk management through both theoretical and empirical analysis. The focus on defining shortfall thresholds and improving risk management relevance clearly aligns with the financial risk management domain.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:45:54.630850"
}