{
  "paper": {
    "id": 824,
    "title": "The Study on Credit Risk Warning of Regional Listed Companies in China Based on Logistic Model",
    "abstract": "The paper aims to propose a new method to state the credit risk characteristics of the regional listed companies in China and makes the listed companies avoid involving in credit crisis. The paper selects fifty-four listed companies of Hebei Province as the research sample and establishes the index system of listed company's credit risk evaluation from four financial index categories which included profitability, operating capacity, solvency, and growth capability. The paper first filtrates fifteen indexes by using the gray clustering method from the four financial categories and finds out the effective variables of the prediction model. Then the paper predicates the credit risk probability of the listed companies by using the logistic regression model. Finally, by analyzing the financial data of annual reports of fifty-four listed companies in Hebei Province from 2012 to 2017 as sample data, the simulation experiment empirical test is carried out by using SPSS software. The results show that the logistic regression model with gray clustering analysis has high predictive accuracy and has a strong predictive ability to evaluate the credit risk of listed companies. The gray logistics evaluation plays a very good role in financial early warning for regional listed companies in China.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "0d8d45e3cc5a7aef6f357e0a487ba827",
    "relevant_keywords": [
      "classification",
      "regression",
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T01:55:41.546035"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用逻辑回归模型和灰色聚类方法来预测区域上市公司的信用风险，这直接涉及信用风险管理的范畴，属于金融风险管理的一部分。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"该论文的核心技术是使用逻辑回归模型和灰色聚类方法来预测区域上市公司的信用风险，这直接涉及信用风险管理的范畴，属于金融风险管理的一部分。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:54:18.796341"
}