{
  "paper": {
    "id": 979,
    "title": "Assessment of financial risk pre-alarm mechanism based on financial ecosystem using BPNN and genetic algorithm",
    "abstract": "Enhancing the financial ecosystem encourages financial reform, stability, and the achievement of all-encompassing and sustainable development. Financial risk assessment is essential, because it affects not only a company's development but also the general economic progress of society. The backpropagation neural network (BPNN) was used in this study to create a proactive financial risk pre-alarm system by recognizing the critical role that risk assessment plays in promoting financial reform, stability, and sustainable development within the financial ecosystem. In this paper, we utilized the capabilities of the backpropagation neural network (BPNN) as a way of creating a proactive financial risk pre-alarm system by realizing the crucial significance of risk assessment in supporting financial reform, stability, and sustainable development within the financial ecosystem. First, data on assessing financial risk is collected, including earnings reports, economic indicators, political developments that have an impact on the economy, and some previous financial data. After the data have been acquired, it is preprocessed by being cleaned, having extra attributes removed, missing values removed, and normalized. An initial set of random parameters is used to create a BPNN architecture, which is then trained using a fraction of the collected data. Next, a genetic algorithm is employed to optimize the parameters of BPNN, including learning rate, neuronal count, hidden layer count, etc. The remaining data from the collection is then used to test the optimized BPNN, and its performance is assessed. The result of the developed model is carefully assessed and compared with other methodologies and with previously published works, showing that this method's accuracy is unquestionably superior to that of the other financial risk analysis algorithms. The mistake is reduced by 45.69%, and our model's accuracy is 97.94%, which is 21.32% greater than the accuracy of the comparison algorithm.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "04e165fc49b53f4e1871038da98dc543",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "neural network",
      "deep learning",
      "backpropagation",
      "BP",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T01:57:29.851074"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用BPNN和遗传算法构建金融风险预警系统，旨在通过分析财务报告、经济指标等数据来评估和预测金融风险，这直接属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"该论文的核心技术是使用BPNN和遗传算法构建金融风险预警系统，旨在通过分析财务报告、经济指标等数据来评估和预测金融风险，这直接属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:53:04.149379"
}