{
  "paper": {
    "id": 503,
    "title": "BACKPROPAGATION NEURAL SCHEME FOR ESTIMATING THE RISK OF BANKRUPTCY OF THE ROMANIAN INSURANCE AND REINSURANCE COMPANIES",
    "abstract": "This work contains a new model for estimating the risk of bankruptcy of the Romanian insurance and reinsurance companies. The model is developed based on the neural architecture of type backpropagation with input dates represented by the values of indicators from the financial statements of insurances and reinsurances companies. The memory vector of the architecture neuronal will provide useful information about the risk of bankruptcy for the next years compared to the period referenced for insurance companies used to training the algorithm proposed. In the last part of the paper is performed the testing capacity for estimate the risk of bankruptcy for all insurance companies by applying neural function determined by our algorithm and establishing a synthetic report on risk levels associated with each company.",
    "year": 2016,
    "source": "WOS",
    "area": "financial_risk",
    "method": "deep learning",
    "cache_key": "ed57ccafa9577ae53b65feba51bdb5b2",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "neural network",
      "backpropagation",
      "BP"
    ],
    "stage1_timestamp": "2025-05-15T01:38:59.307311"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on developing a neural network model to estimate the risk of bankruptcy for insurance and reinsurance companies, which is a specific application within financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on developing a neural network model to estimate the risk of bankruptcy for insurance and reinsurance companies, which is a specific application within financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:02:51.513723"
}