{
  "paper": {
    "id": 3300,
    "title": "Quantile frequency connectedness between energy tokens, crypto and renewable stock markets",
    "abstract": "Utilizing a quantile frequency connectedness approach, we explore the connectedness between energy tokens, crypto market, and renewable energy stock markets. The empirical results show that the connectedness measures of the series are characterized by asymmetry and heterogeneity across quantiles and different investment horizons. Specifically, the characteristic of clustering has been observed that energy tokens and crypto market are more interconnected, while the renewable energy stock markets are more interconnected with each other at median quantile. The linkages between energy tokens and renewable energy stock markets are quite weak under normal market conditions, suggesting the diversification opportunities in investing these financial assets. However, these series are more interconnected under extreme market conditions, with the renewable energy stock markets are on the dominating end of the propagation mechanism while the energy tokens and crypto market are net receivers of shocks. Further frequency decomposition shows that this strategy can hold in the short term, while in the long term investors could benefit from the diversification opportunities by investing both kinds of financial assets. Additionally, the dynamic analysis affirms that the connectedness measures are varied and event -dependent over time. Our results may help investors and policymakers have a better assessment and portfolio management.",
    "year": 2024,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "d1cc601b75cb5a9f8976df1c383c52da",
    "relevant_keywords": [
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T01:15:54.706343"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文研究了能源代币、加密货币和可再生能源股票市场之间的关联性，并讨论了在不同市场条件下的多样化投资机会，这直接关系到投资组合管理的决策。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文研究了能源代币、加密货币和可再生能源股票市场之间的关联性，并讨论了在不同市场条件下的多样化投资机会，这直接关系到投资组合管理的决策。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:10:12.824909"
}