{
  "paper": {
    "id": 763,
    "title": "Lifetime Probability of Default using Survival Tree-Based Models",
    "abstract": "Considering the need for the IFRS 9 accounting standard to estimate the loss of credit, for financial assets that presented a significant increase in risk, throughout the entire period until the maturity of a credit operation, the survival analysis models become techniques useful for modeling the Probability of Default. In this work, with the objective of evaluating the performance of tree-based survival analysis models for this purpose, PD was examined from different methodological approaches, more particularly, exploring different machine learning algorithms for this type of approach. A credit card refinancing dataset was used, and results from two tree-based survival analysis tools, Survival Tree and Random Survival Forest, were compared against the usual algorithm based on Cox Proportional Hazards Regression and classification models. The results show that Survival Analysis techniques with tree-based models are good alternatives to traditional survival analysis methods used for PD modeling.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "625f0e11a8da00c03e4e275f9f4baf90",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "regression",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T01:55:07.974207"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on modeling the Probability of Default (PD) for credit operations using survival analysis techniques, which is a key aspect of credit risk management under the IFRS 9 accounting standard. This directly relates to Financial Risk Management, specifically in assessing and managing credit risk.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on modeling the Probability of Default (PD) for credit operations using survival analysis techniques, which is a key aspect of credit risk management under the IFRS 9 accounting standard. This directly relates to Financial Risk Management, specifically in assessing and managing credit risk.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:55:22.341216"
}