{
  "paper": {
    "id": 4549,
    "title": "Measuring systemic risk of the Chinese banking industry: A wavelet-based quantile regression approach",
    "abstract": "In systemic risk measure, a large amount of literature has emerged, but few of them take into account the multi-scale natures of financial data. Considering these natures, we develop a novel W-QR-CoVaR method to measure systemic risk. To be specific, the W-QR-CoVaR method combines the wavelet multiresolution analysis (MRA) with the conditional value-at-risk (CoVaR) method based on the quantile regression (QR) framework. We then apply it to measure the systemic risk in the Chinese banking industry covering the period from September 2007 to September 2018. Our experiment results show that the hybrid W-QR-CoVaR method performs better than the traditional CoVaR method in terms of predictive accuracy. Furthermore, we also explore the relation between the systemic risk contribution of each individual bank and the bank-specific characteristics. Size and leverage appear to be the most robustness determinants. The findings suggest that regulators should pay more attention to the banks with smaller size and higher leverage.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "582de8c2c8de23869f157f1a412c253b",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:38:20.446787"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on developing a novel method (W-QR-CoVaR) to measure systemic risk in the Chinese banking industry, which is a key aspect of financial risk management. The study specifically addresses the predictive accuracy of systemic risk measurement and explores determinants of systemic risk contribution, aligning with the objectives of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on developing a novel method (W-QR-CoVaR) to measure systemic risk in the Chinese banking industry, which is a key aspect of financial risk management. The study specifically addresses the predictive accuracy of systemic risk measurement and explores determinants of systemic risk contribution, aligning with the objectives of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:32:53.762158"
}