{
  "paper": {
    "id": 1494,
    "title": "A Quantile Regression approach for the analysis of the diversification in non-life premium risk",
    "abstract": "This paper concerns the study of the diversification effect involved in a portfolio of non-life policies priced via traditional premium principles when individual pure premiums are calculated via Quantile Regression. Our aim is to use Quantile Regression to estimate the individual conditional loss distribution given a vector of rating factors. To this aim, we make a comparison of the outcomes obtained via Quantile Regression with the widely used industry standard method based on generalized linear models. Then, considering a specific premium principle, we calculate individual pure premium by means of a specific functional of the conditional loss distribution, the standard deviation. We determine the portfolio risk margin according to the Solvency 2 framework and then we allocate it over each policy in a way consistent with his/her riskiness. Indeed, considering a portfolio of heterogeneous policies, we determine the individual reduction of the safety loading, due to the diversification, and we measure the risk contribution of each individual.",
    "year": 2020,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "ce0f999915b0228765b3315222255e26",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T00:56:38.936398"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk",
      "Portfolio Management"
    ],
    "justification": "该论文主要研究非寿险保单组合的多样化效应，使用Quantile Regression来估计个体条件损失分布，并根据Solvency 2框架计算组合风险边际。这些内容直接涉及金融风险管理和投资组合管理领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\", \"投资组合管理\"],\n  \"justification\": \"该论文主要研究非寿险保单组合的多样化效应，使用Quantile Regression来估计个体条件损失分布，并根据Solvency 2框架计算组合风险边际。这些内容直接涉及金融风险管理和投资组合管理领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:20:40.085175"
}