{
  "paper": {
    "id": 699,
    "title": "Multi-Agent Ensemble Models Based on Weighted Least Square SVM for Credit Risk Assessment",
    "abstract": "Credit risk assessment has become an increasingly important area for financial institutions for recent financial crisis and implementation of Basel H. The quantitative credit scoring models have been developed to help credit managers evaluate customers' credit risk for several decades. Since even a small improvement in credit scoring accuracy can reduce significant loss, the most important objective of risk managers is to improve the decision accuracy In this study, we construct a new multi-agent ensemble model for credit risk assessment and make a comparison with other seven methods, including other two ensemble models. Each agent in each ensemble model is acted by a weighted least square support vector machines (SVM). The test results shows that weighted SVM and three ensemble models all have good classification accuracy when compared with the traditional methods. Some factors that affect the performance of ensemble method are also discussed.",
    "year": 2009,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "f29b8640c74578b97cffb7e2473437cc",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM"
    ],
    "stage1_timestamp": "2025-05-15T01:53:59.433189"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on developing a multi-agent ensemble model for credit risk assessment, which is a key aspect of financial risk management. The study aims to improve decision accuracy in evaluating customers' credit risk, a critical task for financial institutions under Basel regulations.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on developing a multi-agent ensemble model for credit risk assessment, which is a key aspect of financial risk management. The study aims to improve decision accuracy in evaluating customers' credit risk, a critical task for financial institutions under Basel regulations.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:55:49.200514"
}