{
  "paper": {
    "id": 229,
    "title": "Distributed Generative Adversarial Networks for Fuzzy Portfolio Optimization",
    "abstract": "Financial time series is one of the most important data in the field of economics and finance, and it is important to forecast and simulate such data effectively based on historical patterns and trends. Existing forecasting models mainly forecasting one-step ahead, and cannot retain the complex characteristics of financial time series data such as serial correlation and the long-term time-dependent relationship. On the other hand, the large-scale data makes the training of the deep learning models a time-consuming process. Therefore, how to forecast financial time series multi-step ahead efficiently has become a key point to improve the asset management capability. At the same time, constructing a fuzzy portfolio optimization for different distributions is also an important direction to improve the robustness of a portfolio model. This paper proposes a distributed financial time series simulating model AssetGANs that simulating multi-step ahead based on GANs, and apply GANs as a parameter simulation method to fuzzy portfolio optimization to provide users with better strategy choices. The paper carries on numerical experiments on real market stock data, compares the results with LSTM and achieves a training speedup of over 573 with 8 GPUs compared to the CPU version.",
    "year": 2024,
    "source": "WOS",
    "area": "portfolio",
    "method": "deep learning",
    "cache_key": "7c3dab8f226cee671cb6363274989b93",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "neural network",
      "long short-term memory",
      "LSTM",
      "generative adversarial network",
      "GAN"
    ],
    "stage1_timestamp": "2025-05-15T00:33:39.486038"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是使用生成对抗网络（GANs）进行金融时间序列模拟，并将其应用于模糊投资组合优化，旨在提高投资组合模型的稳健性和提供更好的策略选择。这明确属于投资组合管理领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是使用生成对抗网络（GANs）进行金融时间序列模拟，并将其应用于模糊投资组合优化，旨在提高投资组合模型的稳健性和提供更好的策略选择。这明确属于投资组合管理领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:35:29.346979"
}