{
  "paper": {
    "id": 2645,
    "title": "Measuring Factors Affecting Non-performing Assets Using Neuro Fuzzy Model",
    "abstract": "COVID-19 affects the banking sector to its maximum and moreover the repayments of the loans have become very dicey. Financial Industries like SBI are one of the major elements of the economic development of India. In the pandemic the Government has formulated various monetary and fiscal policies to deal with crisis for commercial banks under the supervision of Reserve Bank of India. To pursue these policies forward ensuring economic, industrial, sociopolitical and methodical development, they need proper funds to support lending to various corporate and individual customers. If any of the loan facilities granted become bad debt or doubtful debts then the goal of the policies is not fulfilled and it will mount the record of bad debt in the books of commercial banking especially after demonetization and pandemic. The paper deals with the factors like Loan Portfolio Management, Term Loan, Monetary Policies, and Change in Tax Rates and Loan performances. It represents and compares the input variables and its relations to predict the upcoming low performer of the credits. It determines to what extent the factors are affecting an individual and a corporate customer of the State Bank of India. A model through fuzzy logic and neural network is being developed to predict the low performing creditors. The factors are evaluated on the platform of python and the results are satisfactory.",
    "year": 2023,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "1f4acd3c49e766366e46a6e563348578",
    "relevant_keywords": [
      "neural network",
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T01:09:14.857489"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on predicting non-performing assets (NPAs) using a neuro-fuzzy model, which is directly related to assessing and managing credit risk in the banking sector. This falls under the domain of financial risk management, as it aims to identify and mitigate potential loan defaults.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on predicting non-performing assets (NPAs) using a neuro-fuzzy model, which is directly related to assessing and managing credit risk in the banking sector. This falls under the domain of financial risk management, as it aims to identify and mitigate potential loan defaults.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:13:38.572261"
}