{
  "paper": {
    "id": 865,
    "title": "The underlying coherent behavior in intraday dynamic market equilibrium",
    "abstract": "PurposeThis paper applies a volume-price probability wave differential equation to propose a conceptual theory and has innovative behavioral interpretations of intraday dynamic market equilibrium price, in which traders' momentum, reversal and interactive behaviors play roles.Design/methodology/approachThe authors select intraday cumulative trading volume distribution over price as revealed preferences. An equilibrium price is a price at which the corresponding cumulative trading volume achieves the maximum value. Based on the existence of the equilibrium in social finance, the authors propose a testable interacting traders' preference hypothesis without imposing the invariance criterion of rational choices. Interactively coherent preferences signify the choices subject to interactive invariance over price.FindingsThe authors find that interactive trading choices generate a constant frequency over price and intraday dynamic market equilibrium in a tug-of-war between momentum and reversal traders. The authors explain the market equilibrium through interactive, momentum and reversal traders. The intelligent interactive trading preferences are coherent and account for local dynamic market equilibrium, holistic dynamic market disequilibrium and the nonlinear and non-monotone V-shaped probability of selling over profit (BH curves).Research limitations/implicationsThe authors will understand investors' behaviors and dynamic markets through more empirical execution in the future, suggesting a unified theory available in social finance.Practical implicationsThe authors can apply the subjects' intelligent behaviors to artificial intelligence (AI), deep learning and financial technology.Social implicationsUnderstanding the behavior of interacting individuals or units will help social risk management beyond the frontiers of the financial market, such as governance in an organization, social violence in a country and COVID-19 pandemics worldwide.Originality/valueIt uncovers subjects' intelligent interactively trading behaviors.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "deep learning",
    "cache_key": "37032a34cc71d8f4e3e977ba835240d2",
    "relevant_keywords": [
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T01:43:20.742620"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究日内动态市场均衡和交易者行为，虽然涉及金融市场，但并未明确指出其核心技术应用于衍生品定价、金融风险管理或投资组合管理。论文的重点在于行为解释和市场均衡理论，而非上述特定金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究日内动态市场均衡和交易者行为，虽然涉及金融市场，但并未明确指出其核心技术应用于衍生品定价、金融风险管理或投资组合管理。论文的重点在于行为解释和市场均衡理论，而非上述特定金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:02:01.319891"
}