{
  "paper": {
    "id": 2516,
    "title": "The Analysis on Fama and French Asset-Pricing Model to select stocks in Tehran Security and Exchange Organization (TSEO)",
    "abstract": "Employing quantitative techniques has been dramatically increased in financing industry during 20 recent years. These models have been primarily utilized in risk management and through measurement models of risk different sources. Fama-French Asset Pricing Model has been explored to select stocks in Tehran Security and Exchange Organization (TSEO) in this study. The time period (2008-2012) has been used to test hypotheses. Statistical population of this study includes stocks in all admitted enterprises in Bourse Market. Stocks of some enterprises have entered in and also exited from bourse market within period of this survey. Some constraints have been exerted to exclude these enterprises from domain of this study in order to improve reliability of study as well as reducing negative effects of such stocks. In this course, multivariate and three-variable regression model was primarily employed to compute expected efficiency rate and then the given portfolios were compared according to criteria including portfolio real efficiency, portfolio risk, and market efficiency index. The monthly, quarterly, and annual time-series of data have been utilized to test hypotheses. Statistical techniques were used to test hypotheses along with three-variable regression, Kolmogorov-Smirnov test and Durbin-Watson statistic, and also P-P Plot and scatter diagram (homogeneity of variance) as well as Pearson's correlation coefficient test. (C) 2016 The Authors. Published by Elsevier B.V.",
    "year": 2016,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "75438251c9f3c98ea4bf15949179c54f",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:07:35.726258"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文主要探讨了Fama-French资产定价模型在德黑兰证券交易所股票选择中的应用，并比较了不同投资组合的实际效率、风险和效率指数，这直接涉及投资组合管理的核心内容。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文主要探讨了Fama-French资产定价模型在德黑兰证券交易所股票选择中的应用，并比较了不同投资组合的实际效率、风险和效率指数，这直接涉及投资组合管理的核心内容。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:14:09.497681"
}