{
  "paper": {
    "id": 2790,
    "title": "Which startup to invest in: a personalized portfolio strategy",
    "abstract": "Recent years have witnessed a venture capital boom. By offering capitals and mentoring, venture investors would receive high returns if their portfolio companies successfully exit, namely being acquired or going Initial Public Offering. However, the screening and evaluation of startups for investment largely depends on the investors' personal experiences, social relationships, and qualitative evaluation on firms. The entrepreneurial finance industry thus has a strong call for the methodologically sound, quantitative study of venture capital deals. Plus, more accessible data and more sophisticated analytics techniques signal the opportunity for methodical decision-making in investing the venture financing market. To this end, in this paper, we aim at developing a personalized portfolio strategy for assisting investors to target the right startups and determine the proper amount of capital to fund. Specifically, we first develop a Probabilistic Latent Factor model to estimate the investment preferences of all the investors in a collaborative way. The model is fitted with not only the historical investment records but also the profiles of the venture capitalists and the startups. Then, we assess the startups' investment outcomes by regressing the potential returns and risks. We improve the regression performances by nonparametric methods. At last, we use modern portfolio theory to optimize the investment strategy over the startups recommended by the investment preference model. As a result, the investment strategy can yield maximized returns with suppressed potential risks, and meanwhile meet the investment preferences of the venture capitalists. The proposed method is evaluated using data from venture financing markets in USA, and the results show that our method outperforms other state-of-the-art methods on various metrics.",
    "year": 2018,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "f5f1660683e45197b5919a89b32bec0a",
    "relevant_keywords": [
      "regression",
      "feature representation"
    ],
    "stage1_timestamp": "2025-05-15T01:10:49.393385"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心目标是开发一种个性化的投资组合策略，用于帮助投资者选择初创公司并确定投资金额。论文中提到的现代投资组合理论、风险评估和回报最大化等概念，都是投资组合管理领域的典型应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心目标是开发一种个性化的投资组合策略，用于帮助投资者选择初创公司并确定投资金额。论文中提到的现代投资组合理论、风险评估和回报最大化等概念，都是投资组合管理领域的典型应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:13:09.805486"
}