{
  "paper": {
    "id": 6716,
    "title": "Differential impacts of economic and demographic variables on substance use patterns during the COVID-19 pandemic",
    "abstract": "Background The COVID-19 pandemic and subsequent economic crisis has provided a unique opportunity to investigate the effects of economic shifts on substance use. Existing literature on this relationship is limited and conflicting, warranting further exploration. Objective This study aimed to identify relationships between socioeconomic status (SES), demographic variables, and substance use patterns before and after government-mandated business closures due to COVID-19. Methods Participants were recruited based on self-reported substance use through Amazon's Mechanical Turk (MTurk). Qualifying participants (N = 315, 43% female, mean age = 35.35) reported their substance use and SES for two-week periods before and after pandemic-related business closures. Regression models analyzed relationships between substance use and study variables. Results Regression models found that, during COVID-19 closures, greater financial strain predicted decreased benzodiazepine (beta = -1.12) and tobacco (beta = 1.59) use. Additionally, certain predictor variables (e.g., participants' age [beta = 1.22], race [beta = -4.43], psychiatric disorders including ADHD [beta = -2.73] and anxiety [beta = 1.53], and concomitant substance use [beta = 3.38]) predicted changes in substance use patterns; however, the directionality of these associations varied across substances. Conclusion Specific substance use patterns were significantly and differentially impacted by economic strain, psychiatric diagnoses, and concomitant substance use. These results can help direct harm reduction efforts toward populations at greatest risk of harmful substance use following the pandemic.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "ec4597fb4422a904ab050a859e7d0043",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T03:01:03.525117"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究社会经济状况和人口变量对物质使用模式的影响，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究社会经济状况和人口变量对物质使用模式的影响，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:27:31.170985"
}