{
  "paper": {
    "id": 4758,
    "title": "Inference for joint quantile and expected shortfall regression",
    "abstract": "Quantiles and expected shortfalls are commonly used risk measures in financial risk management. The two measurements are correlated while having distinguished features. In this project, our primary goal is to develop a stable and practical inference method for the conditional expected shortfall. We consider the joint modelling of conditional quantile and expected shortfall to facilitate the statistical inference procedure. While the regression coefficients can be estimated jointly by minimizing a class of strictly consistent joint loss functions, the computation is challenging, especially when the dimension of parameters is large since the loss functions are neither differentiable nor convex. We propose a two-step estimation procedure to reduce the computational effort by first estimating the quantile regression parameters with standard quantile regression. We show that the two-step estimator has the same asymptotic properties as the joint estimator, but the former is numerically more efficient. We develop a score-type inference method for hypothesis testing and confidence interval construction. Compared to the Wald-type method, the score method is robust against heterogeneity and is superior in finite samples, especially for cases with many confounding factors. The advantages of our proposed method over existing approaches are demonstrated by simulations and empirical studies based on income and college education data.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "687ba936dbbfac6a5ae93e457eff3f2d",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:40:28.006174"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on developing inference methods for quantile and expected shortfall regression, which are key risk measures in financial risk management. The abstract explicitly mentions their use in this context and discusses applications in risk assessment, aligning with the financial risk management domain.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on developing inference methods for quantile and expected shortfall regression, which are key risk measures in financial risk management. The abstract explicitly mentions their use in this context and discusses applications in risk assessment, aligning with the financial risk management domain.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:31:57.628622"
}