{
  "paper": {
    "id": 202,
    "title": "A Decision Support Approach for Online Stock Forum Sentiment Analysis",
    "abstract": "The Internet provides the opportunity for investors to post online opinions that they share with fellow investors. Sentiment analysis of online opinion posts can facilitate both investors' investment decision making and stock companies' risk perception. This paper develops a novel sentiment ontology to conduct context-sensitive sentiment analysis of online opinion posts in stock markets. The methodology integrates popular sentiment analysis into machine learning approaches based on support vector machine and generalized autoregressive conditional heteroskedasticity modeling. A typical financial website called Sina Finance has been selected as an experimental platform where a corpus of financial review data was collected. Empirical results suggest solid correlations between stock price volatility trends and stock forum sentiment. Computational results show that the statistical machine learning approach has a higher classification accuracy than that of the semantic approach. Results also imply that investor sentiment has a particularly strong effect for value stocks relative to growth stocks.",
    "year": 2014,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "0a6736eb6275e63dd394d4f88dd8842a",
    "relevant_keywords": [
      "machine learning",
      "classification",
      "support vector machine",
      "SVM"
    ],
    "stage1_timestamp": "2025-05-15T01:47:53.069016"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文主要研究在线股票论坛情绪分析，旨在帮助投资者做出投资决策，这与投资组合管理领域相关，因为情绪分析可以用于优化投资策略和资产配置。然而，论文并未直接涉及衍生品定价或金融风险管理的具体应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文主要研究在线股票论坛情绪分析，旨在帮助投资者做出投资决策，这与投资组合管理领域相关，因为情绪分析可以用于优化投资策略和资产配置。然而，论文并未直接涉及衍生品定价或金融风险管理的具体应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:59:57.935160"
}