{
  "paper": {
    "id": 6157,
    "title": "Predictors of loneliness and different types of social isolation of rural-living older adults in the United Kingdom",
    "abstract": "Loneliness and social isolation are recognised, conceptually distinct threats to health and wellbeing in older age but limited evidence is available on their predictors in rural populations. This study performed logistical regression modelling to explore the predictors of loneliness, isolation from one's family and isolation from one's community in 884 British rural-living older adults (57.9% female; mean age = 71.5, standard deviation = 8.1 years) within the Grey and Pleasant Land data-set. While 13 per cent of participants reported feeling lonely, 49 per cent reported isolation from their family and 9 per cent reported isolation from their community. Minimal cross-over between groups was observed. Widowhood, financial difficulties, area deprivation, and self-reported impairments in physical and mental health predicted loneliness. Greater financial difficulty gave lower odds of isolation from one's family, and higher levels of community engagement gave lower odds of isolation from the community. Ageing in place (longer residency) was the only common predictor for all three dependent variables. Initiatives aimed at tackling loneliness and social isolation in rural-living older people must recognise that the two concepts are distinct, affecting different population sub-groups with mostly different risk factor profiles. Future interventions and policies should clearly identify whether their target is loneliness or social isolation and tailor their interventions appropriately.",
    "year": 2017,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "d2200094aa09e95f64c314f979d971b6",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:55:12.992336"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究农村老年人的孤独感和社会隔离的预测因素，虽然提到了财务困难等经济因素，但其核心技术（逻辑回归模型）和研究目标均与衍生品定价、金融风险管理或投资组合管理无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究农村老年人的孤独感和社会隔离的预测因素，虽然提到了财务困难等经济因素，但其核心技术（逻辑回归模型）和研究目标均与衍生品定价、金融风险管理或投资组合管理无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:28:31.777886"
}