{
  "paper": {
    "id": 661,
    "title": "MCN portfolio: An efficient portfolio prediction and selection model using multiserial cascaded network with hybrid meta-heuristic optimization algorithm",
    "abstract": "Generally, financial investments are necessary for portfolio management. However, the prediction of a portfolio becomes complicated in several processing techniques which may cause certain issues while predicting the portfolio. Moreover, the error analysis needs to be validated with efficient performance measures. To solve the problems of portfolio optimization, a new portfolio prediction framework is developed. Initially, a dataset is collected from the standard database which is accumulated with various companies' portfolios. For forecasting the benefits of companies, a Multi-serial Cascaded Network (MCNet) is employed which constitutes of Autoencoder, 1D Convolutional Neural Network (1DCNN), and Recurrent Neural Network (RNN) is utilized. The prediction output for the different companies is stored using the developed MCNet model for further use. After predicting the benefits, the best company with the highest profit is selected by Integration of Artificial Rabbit and Hummingbird Algorithm (IARHA). The major contribution of our work is to increase the accuracy of prediction and to choose the optimal portfolio. The implementation is conducted in Python platform. The result analysis shows that the developed model achieves 0.89% and 0.56% regarding RMSE and MAE measures. Throughout the analysis, the experimentation of the developed model shows enriched performance.",
    "year": 2024,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "d21f8dab11543933c11d6bb8d5ef4a9d",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "neural network",
      "autoencoder",
      "convolutional neural network",
      "CNN",
      "recurrent neural network",
      "representation learning"
    ],
    "stage1_timestamp": "2025-05-15T00:46:24.438068"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是开发一个多序列级联网络（MCNet）和混合元启发式优化算法（IARHA）用于预测和选择最优投资组合，这直接属于投资组合管理的范畴。论文明确提到其目标是提高预测准确性并选择最优投资组合，且实验设计围绕公司投资组合的预测和优化展开。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是开发一个多序列级联网络（MCNet）和混合元启发式优化算法（IARHA）用于预测和选择最优投资组合，这直接属于投资组合管理的范畴。论文明确提到其目标是提高预测准确性并选择最优投资组合，且实验设计围绕公司投资组合的预测和优化展开。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:28:54.560172"
}