{
  "paper": {
    "id": 4266,
    "title": "Efficiency Analysis of Machine Learning Intelligent Investment Based on K-Means Algorithm",
    "abstract": "With the rapid development of technologies such as big data, intelligent data analysis and cloud computing, the application of Internet financial technology has become more and more extensive, and with the advent of the era of large asset management in the domestic wealth management industry, in order to improve the efficiency of financial services, traditional finance is needed. The products and services provided by the industry have been innovated, resulting in smart investment. Compared with traditional investment, smart investment as a new business model has the advantages of low threshold, low cost and high efficiency. However, as far as its nature is concerned, smart investment must first play the role of an investment adviser. Therefore, for enterprises or individuals who invest, the investment efficiency of smart investment is the most important. At present, the research on the efficiency analysis of smart investment, due to the improper selection of algorithm models or the lack of deep data mining, leads to the analysis of the investment efficiency of smart investment products is inconsistent with or even deviated from the actual situation. In view of these problems, this paper selects China Merchants Bank's Capricorn Intelligence as the research object, and analyzes the investment efficiency of smart investment based on K-means cluster analysis and data mining technology. The results show that Capricorn has a certain randomness in the selection process of the fund, and chooses to reduce the rate of return in order to control the risk. The investment portfolio formulated for the customer has obvious timing. The results show that the machine learning based on K-means algorithm makes a concrete analysis of the investment efficiency of Capricorn Smart Investment, this method can also be used for the efficiency analysis of other smart investment products.",
    "year": 2020,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "9134e962365876663ff3f2ac2b33f978",
    "relevant_keywords": [
      "machine learning",
      "unsupervised learning",
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T02:35:26.227601"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文主要研究基于K-means算法的智能投资效率分析，其核心应用场景是评估和优化投资组合的制定过程，这直接属于投资组合管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文主要研究基于K-means算法的智能投资效率分析，其核心应用场景是评估和优化投资组合的制定过程，这直接属于投资组合管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:33:50.970727"
}