{
  "paper": {
    "id": 1018,
    "title": "Addressing the economic and demographic complexity via a neural network approach: risk measures for reverse mortgages",
    "abstract": "The study deals with the application of a neural network algorithm for fronting and solving problems connected with the riskiness in financial contexts. We consider a specific contract whose characteristics make it a paradigm of a complex financial transaction, that is the Reverse Mortgage. Reverse Mortgages allow elderly homeowners to get a credit line that will be repaid through the selling of their homes after their deaths, letting them continue to live there. In accordance with regulatory guidelines that direct prudent assessments of future losses to ensure solvency, within the perspective of the risk assessment of Reverse Mortgage portfolios, the paper deals with the estimation of the Conditional Value at Risk. Since the riskiness is affected by nonlinear relationships between risk factors, the Conditional Value at Risk is estimated using Neural Networks, as they are a suitable method for fitting nonlinear functions. The Conditional Value at Risk estimated by means of Neural Network approach is compared with the traditional Value at Risk in a numerical application.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "b958a9c5db9ceaa492b9965b70946e93",
    "relevant_keywords": [
      "neural network",
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T01:58:08.440194"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on estimating the Conditional Value at Risk (CVaR) for Reverse Mortgage portfolios using neural networks to address nonlinear relationships between risk factors. This is a clear application in the field of financial risk management, as CVaR is a key metric for assessing and managing financial risks.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on estimating the Conditional Value at Risk (CVaR) for Reverse Mortgage portfolios using neural networks to address nonlinear relationships between risk factors. This is a clear application in the field of financial risk management, as CVaR is a key metric for assessing and managing financial risks.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:52:42.334150"
}