{
  "paper": {
    "id": 848,
    "title": "Cryptocurrency Financial Risk Analysis Based on Deep Machine Learning",
    "abstract": "Digital currency is considered a form of currency which is used in the digital world such as digital forms or electronic devices. Several terms are synonyms for digital currency like digital money, electronic money, and cyber cash. Accurate prediction of the digital currency is an urgent necessity due to its impacts on the economic community. The electronic economy is very dangerous and must be approached with great caution, so as to avoid or minimize the risks that occur in such cases. Deep neural network (DNN) algorithm was improved to predict the Bitcoin price and then achieve the main goal of reducing financial risks to proceed with electronic business, and good estimation was achieved by using informative data such as transactions and currency return. The proposed method extracted features of related Bitcoin and used the informative ones. Transaction plan considered building nodes in terms of network. Development of deep learning algorithms opens the horizons for the development of electronic businesses that use digital currency. The proposed method achieved worthy results in terms of accuracy (53.4%) and correct prediction (MSE 1.02) and offers the prospect of other research in this area.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "1358c37e90a022c5061a4711aff9356e",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "neural network",
      "representation learning",
      "backpropagation",
      "BP",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T01:55:41.658927"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心目标是使用改进的深度神经网络算法预测比特币价格，以减少电子业务中的金融风险。这直接涉及金融风险管理领域，特别是加密货币市场的风险预测和管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心目标是使用改进的深度神经网络算法预测比特币价格，以减少电子业务中的金融风险。这直接涉及金融风险管理领域，特别是加密货币市场的风险预测和管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:54:16.114602"
}