{
  "paper": {
    "id": 2765,
    "title": "The challenge in managing new financial risks: adopting an heuristic or theoretical approach",
    "abstract": "The financial crisis began with the collapse of Lehman Brothers and the subprime asset backed securities debacle. Credit risk was turned into liquidity risk, resulting in a lack of confidence among financial institutions. In this article, we will propose a way to model liquidity risk and the credit risk in best practices. We will show that liquidity risk is a new type of risk and the current way to deal with it is based solely on observed variables without any theoretical link. We propose an heuristic approach to combine the numerous liquidity risk indicators with a logistic regression for the first time. In regards to credit risk, several articles prove that the best practice is to use an option model to appreciate this risk. We will present our methodology using stochastic diffusion for the interest rate because currently the yield curves aren't liquid. This approach is more relevant because the basis model in prior publications has a constant interest rate or a forward rate. Both models allow a better understanding of liquidity and credit risks and the further development of research deals with the link between these two financial risks.",
    "year": 2016,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "f4aea9c4f4f57e54bd98f996589a8ce3",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:19:08.333856"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on modeling liquidity risk and credit risk, proposing heuristic approaches and stochastic diffusion for interest rates to better understand these risks. This clearly falls under the domain of financial risk management, as the primary goal is to improve risk assessment and modeling techniques.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on modeling liquidity risk and credit risk, proposing heuristic approaches and stochastic diffusion for interest rates to better understand these risks. This clearly falls under the domain of financial risk management, as the primary goal is to improve risk assessment and modeling techniques.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:40:10.123425"
}