{
  "paper": {
    "id": 1061,
    "title": "Credit Risk Scoring Using a Data Fusion Approach",
    "abstract": "Credit scoring is a vital task in the financial industry for assessing the creditworthiness of companies and mitigating credit risks. In recent years, machine learning algorithms have shown promising results in credit scoring by leveraging large amounts of tabular data. However, the traditional tabular data alone may not capture all the information relevant to credit scoring that is typically used by credit risk analysts. In this paper, we propose a novel approach for company credit scoring that integrates text and tabular data. Our method uses natural language processing techniques to extract key features from risk assessments made by credit risk experts which are then combined with financial data to predict the likelihood of default within a one-year horizon. We compare different Machine Learning based models for different text embedding techniques. Our results show that the fact of adding a textual feature improves the ability of the model to capture defaulted companies. More concretely, adding a categorical feature generated by the application of sentiment analysis over text risk assessments yields the best results.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "56c65472f14727d1d30590716748bbaf",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "feature learning",
      "feature representation",
      "neural network",
      "deep learning",
      "representation learning"
    ],
    "stage1_timestamp": "2025-05-15T01:58:08.688690"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on credit scoring to assess the creditworthiness of companies and predict the likelihood of default, which is a core aspect of financial risk management, specifically credit risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on credit scoring to assess the creditworthiness of companies and predict the likelihood of default, which is a core aspect of financial risk management, specifically credit risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:52:20.324127"
}