{
  "paper": {
    "id": 3987,
    "title": "A heterogeneous ensemble credit scoring model based on adaptive classifier selection: An application on imbalanced data",
    "abstract": "In the domain of credit scoring, the number of bad clients is far less than that of good ones. So imbalanced data classification is a realisitc and critical issue in the credit scoring process. In this study, a novel heterogeneous ensemble credit scoring model is proposed for the problem of imbalanced data classification. This proposed model is on basis of five standard classifiers, namely LSVM, KNN, MDA, DT, LR, and adaptively selects the base classifiers with highest AUC according to the data distribution, then integrates all base classifiers to obtain a prediction. Finally, by using five comprehensive performance measures and four classical credit datasets, we find that the proposed model is better than other baseline models. This novel model can be applied to actual credit scoring and assist financial institutions in credit risk management.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "3d44b915d2baa348d5bd844c00630ae9",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T02:31:58.640313"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on developing a credit scoring model to classify imbalanced data, which is directly applicable to credit risk management in financial institutions. This falls under the domain of Financial Risk Management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on developing a credit scoring model to classify imbalanced data, which is directly applicable to credit risk management in financial institutions. This falls under the domain of Financial Risk Management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:34:42.900080"
}