{
  "paper": {
    "id": 1815,
    "title": "A deep learning-based sentiment flow analysis model for predicting financial risk of listed companies",
    "abstract": "With the advancement of natural language processing technology, more studies are applying deep learning models to extract features from unstructured data and predict corporate financial risk through horizontal comparisons. This paper proposes the Sentiment Flow Analysis (SFA) model designed to capture the nuanced emotional dynamics present in corporate annual reports and analyst reports from a longitudinal perspective. By leveraging advanced contextual embeddings from a Transformer architecture and employing a sophisticated recurrent neural network, the model effectively processes sequential data, allowing for a comprehensive understanding of sentiment trends over a five-year period. The effectiveness of our model was validated through experiments predicting the removal of special treatment (ST) status for 344 listed companies under special treatment in 2022 and 2023, achieving a prediction accuracy of up to 82.27%. Compared to stateof-the-art models in the same field, our model demonstrates improvements in prediction accuracy and recall, showcasing the application of Artificial Intelligence (AI) in financial risk assessment.",
    "year": 2025,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "992b297e5ad8af59fc337d029a75a3ab",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "neural network",
      "recurrent neural network",
      "representation learning",
      "attention mechanism",
      "Transformer"
    ],
    "stage1_timestamp": "2025-05-15T02:08:03.848364"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用深度学习模型（如Transformer和循环神经网络）分析企业年报和分析师报告中的情感动态，以预测上市公司的财务风险。这直接应用于金融风险管理领域，特别是企业财务风险评估。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是使用深度学习模型（如Transformer和循环神经网络）分析企业年报和分析师报告中的情感动态，以预测上市公司的财务风险。这直接应用于金融风险管理领域，特别是企业财务风险评估。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:45:56.332116"
}