{
  "paper": {
    "id": 883,
    "title": "Optimization of Hotel Financial Management Information System Based on Computational Intelligence",
    "abstract": "Nowadays, the hotel management concept cannot keep pace with the times. Traditional concepts are often adopted to manage hotel financial personnel, for the hotel financial personnel cannot take timely and effective training. All these lead to the hotel financial staff designing the hotel's related business without sufficient understanding of the hotel industry and judging and deciding if they do not master the hotel's professional knowledge, which makes the participating projects unable to give correct and reasonable answers to the substantive problems of the hotel. This leads to the hotel management not going up; extensive management makes the hotel benefit not go up. Hotel intelligent technology can solve these problems and not only save manpower and material resources but also intelligently predict the financial crisis of hotels. In the context of the accelerated development of globalization and informatization, there are still many problems in the financial management process of my country's hotel industry. Based on these questions, the article draws on foreign advanced experience, puts forward effective suggestions in financial management, and uses computational intelligence technology to design a centralized and intelligent financial management system. The research results show the following: (1) the financial crisis model is created by using the principle of support vector machine and logistic regression method, which greatly reduces the financial crisis of the enterprise. (2) The system can straightforwardly summarize the data for easy query. Taking three domestic hotels as an example, a comprehensive study has been carried out on the three aspects of pricing assessment risk, financial integration risk, and debt risk. In 2016, the financial leverage coefficient has been relatively high, the quick ratio has fluctuated greatly, and the interest protection coefficient has shown a downward trend. (3) The performance of the system is compared with traditional development mode, framework development mode, and intelligent optimization mode. The intelligent optimization system has the lowest response time and the highest success rate. The new system has reduced response time by about 57% compared with the original response time, and the access success rate has been greatly improved.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "69c49cbcb1487350f7ade31bfa3e18ca",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "regression",
      "support vector machine",
      "SVM"
    ],
    "stage1_timestamp": "2025-05-15T01:56:17.526818"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究酒店财务管理信息系统的优化，虽然提到了财务危机预测，但其应用场景是酒店行业，而非特定的金融研究领域如衍生品定价、金融风险管理或投资组合管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究酒店财务管理信息系统的优化，虽然提到了财务危机预测，但其应用场景是酒店行业，而非特定的金融研究领域如衍生品定价、金融风险管理或投资组合管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:53:55.767873"
}