{
  "paper": {
    "id": 3477,
    "title": "Predicting Public Corruption with Neural Networks: An Analysis of Spanish Provinces",
    "abstract": "We contend that corruption must be detected as soon as possible so that corrective and preventive measures may be taken. Thus, we develop an early warning system based on a neural network approach, specifically self-organizing maps, to predict public corruption based on economic and political factors. Unlike previous research, which is based on the perception of corruption, we use data on actual cases of corruption. We apply the model to Spanish provinces in which actual cases of corruption were reported by the media or went to court between 2000 and 2012. We find that the taxation of real estate, economic growth, the increase in real estate prices, the growing number of deposit institutions and non-financial firms, and the same political party remaining in power for long periods seem to induce public corruption. Our model provides different profiles of corruption risk depending on the economic conditions of a region conditional on the timing of the prediction. Our model also provides different time frameworks to predict corruption up to 3years before cases are detected.",
    "year": 2018,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "0d0d05cc9cd8004ce7aeeca4282a2653",
    "relevant_keywords": [
      "machine learning",
      "neural network",
      "deep learning",
      "unsupervised learning",
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T02:26:48.480913"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究使用神经网络预测公共腐败行为，虽然涉及经济因素，但其核心应用领域是公共治理和反腐败，而非金融研究领域中的衍生品定价、金融风险管理或投资组合管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究使用神经网络预测公共腐败行为，虽然涉及经济因素，但其核心应用领域是公共治理和反腐败，而非金融研究领域中的衍生品定价、金融风险管理或投资组合管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:36:25.472364"
}