{
  "paper": {
    "id": 3887,
    "title": "Empirical Research on Operational Risk of China's Commercial Banks on the Revenue Model",
    "abstract": "According to Basel II, operational risk, which is one of the three most significant risks in bank's operating, and the other two are credit risk and market risk, is another major risk for commercial banks. In recent years, operational risk brings huge losses and even collapse to commercial banks. With the economic globalization, the financial integration, and the development of financial derivatives, operational risk is increasingly becoming the significant risk which our commercial banks must be faced. Considering the availability and the understandability of the data, this paper uses weighted least squares regression analysis to analyses the operational risk of Min sheng Banldng,Bank of China and Pu Dong Development Bank based on the revenue model. The study shows the absolute operational risk value in Bank of China is greater than Minsheng Banking,which is greater than Pu Dong Development Bank. Relative operational risk value in Minsheng Banking is greater than Pu Dong Development Bank,which is greater than Bank of China. In three banks,the operational risk value in the Bank of China is the smallest. In Bank of China,in order to get 100 million net profit,it will lose 1.0044 million yuan that caused by operational risk,at the same, Pu Dong Development Bank will lose 2.4059 million yuan,and the Minsheng Banking will lose 3.4272 million yuan. Minsheng Banking should focus on preventing the threat of potential which comes to the operational risk.",
    "year": 2013,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "f62f324268c921a735001bbf93e1a0c4",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:30:58.328403"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要研究商业银行的操作风险，使用回归分析方法评估风险，这属于金融风险管理的范畴。论文未涉及衍生品定价或投资组合管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文主要研究商业银行的操作风险，使用回归分析方法评估风险，这属于金融风险管理的范畴。论文未涉及衍生品定价或投资组合管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:35:06.119361"
}