{
  "paper": {
    "id": 3007,
    "title": "Is portfolio diversification possible in integrated markets? Evidence from South Eastern Europe",
    "abstract": "A remarkable process of financial integration has taken place throughout the world capital markets over the last decades. In line with this integration process, the effect of financial integration locally and/or globally has been one of the contemporary topics of interest to academics, practitioners as well as policy makers. In this study, we investigate the availability of portfolio diversification benefits after the initiation of the South Eastern Europe Link (the SEE Link) trading platform in 2016 as a connecting hub for stock markets in the South Eastern European region. Our empirical methodology is primarily based on various static and dynamic correlation (Dynamic Conditional Correlation-GARCH) and regression (Autoregressive Distributed Lag, Fully Modified Ordinary Least Squares, Dynamic Ordinary Least Squares, Markov Switching Regression Model and Kalman Filter Model) analyses. We employ our methods for a daily frequency stock exchange (namely, the Zagreb Stock Exchange and Bulgarian Stock Exchange) return data between January 4, 2005 and December 30, 2019. The findings reveal that the two stock exchanges have a significantly decreasing pattern of correlation and regression relationship over the sample period implying the existence of diversification opportunities in the SEE Link markets.",
    "year": 2021,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "1b8b100f1ac6ed7bbe47dd17571bc7ca",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:12:43.030778"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "The paper investigates the availability of portfolio diversification benefits in integrated markets, specifically analyzing the correlation and regression relationships between stock exchanges in South Eastern Europe. This directly pertains to the field of portfolio management, as it focuses on optimizing investment strategies through diversification.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Portfolio Management\"],\n  \"justification\": \"The paper investigates the availability of portfolio diversification benefits in integrated markets, specifically analyzing the correlation and regression relationships between stock exchanges in South Eastern Europe. This directly pertains to the field of portfolio management, as it focuses on optimizing investment strategies through diversification.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:11:55.731032"
}