{
  "paper": {
    "id": 1201,
    "title": "Portfolio design and optimization using neural network based multiagent system of investing agents",
    "abstract": "Efficiency of the simulation methods in the social domain remains jeopardized by the multi scale complexity and vague representation of it in the mostly symbolic models applied. There is a clear need for connectionist approach in designing robust real-life applications. This paper reports about a new approach meant for designing intelligent investing agents capable to simulate well known investing strategies by making timely market decisions and optimizing their multi asset portfolios in terms of profit-risk estimates in the real life investment markets. For this reason proposed multi-layered framework constructs (i) an intelligent agent composed by a few trained neural networks each specialized to make investment decisions according to the assigned investment strategy in the different markets, (ii) multi-agent system of such agents, which are trained to follow different investing strategies in order to optimize their portfolios. Simulation gives an opportunity to simulate multi-agent competitive system for the search of the best profit-risk performing agents, i.e. investing strategies. This gives an edge over costly and time consuming actual experimenting in the diversified investment markets having real-life index funds (or stocks) and non-risky financial assets. In our model, agents follow different investing strategies according to the defined portfolio, saving and risk aversion preferences using forecasts based on the technical analysis. Simulations show that proposed NN-based multi-agent system produces similar results in terms of e.g. wealth distribution comparing with empirical evidences from the real investment markets behaviour as described by Pareto wealth and Levy returns distributions. The proposed approach is flexible and complex enough to be extended using field-based framework and evolutionary computation, which will lead to the dynamic system of adaptive and collaborating agents capable to change their behaviour on the fly depending on the profit-risk performance and market situation. The author argues that in the near future such evolving multi-agent platforms designed to learn from experience added with fundamental analysis facilities will produce superior agents capable to substitute humans in terms of profit-risk optimization in the investing markets",
    "year": 2008,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "0d48f26e12465bde878eec42758fb799",
    "relevant_keywords": [
      "machine learning",
      "neural network",
      "deep learning",
      "representation learning",
      "backpropagation",
      "BP",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T00:53:09.872078"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是使用神经网络和多智能体系统来设计和优化多资产投资组合，主要关注于利润-风险估计和投资策略的优化，这直接属于投资组合管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是使用神经网络和多智能体系统来设计和优化多资产投资组合，主要关注于利润-风险估计和投资策略的优化，这直接属于投资组合管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:23:24.239670"
}