{
  "paper": {
    "id": 2352,
    "title": "Deciphering the US metropolitan house price dynamics",
    "abstract": "In this article, we propose a novel estimator that builds on recent advances in heterogenous estimators to introduce the concepts of cross-sectional heterogeneity and cross-sectional dependency in the machine learning (ML) literature. The performance of the proposed method is evaluated in forecasting house prices at the county level for the 56 most populated Metropolitan Statistical Areas in the U.S., identifying bubbles in local house markets as they form and measuring the returns on a trading strategy based on model's forecasts. In doing so, we find that the proposed method achieves an out-of-sample error of 0.252 in house prices forecasting, while the most accurate econometric estimator has a forecasting error of 0.678 and the most accurate ML 0.763. In terms of bubble identification, the proposed model achieves a 0.470 recall against 0.390 and 0.380 of the most accurate econometric and ML, respectively. Finally, in terms of economic significance, a diversified portfolio of Real Estate Investment Trust stocks achieves an averaged return of 13.1%, which is twice as large as the second most profitable trading strategy. Our work has direct policy implications to market participants and monetary policy authorities as it shapes a new local approach to monitoring the real estate market.",
    "year": 2024,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "62c3ed1087020ff7dddb21eb8bc0d5c1",
    "relevant_keywords": [
      "machine learning",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:06:10.670882"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术应用于预测房价动态和识别房地产泡沫，并基于这些预测构建了房地产投资信托(REITs)的投资组合策略，这直接关联到投资组合管理领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术应用于预测房价动态和识别房地产泡沫，并基于这些预测构建了房地产投资信托(REITs)的投资组合策略，这直接关联到投资组合管理领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:15:30.774408"
}