{
  "paper": {
    "id": 918,
    "title": "Improving REITs Time Series Prediction Using ML and Technical Analysis Indicators",
    "abstract": "One of the most popular ways to reduce the risk of an investment portfolio is by holding shares of Real Estate Investment Trusts (REITs), which own and manage real estate. An important aspect of this process is to be able to forecast future REITs prices, as this allows investors to achieve higher returns at lower risk. This paper examines the performance of five different machine learning algorithms in the task of REITs price forecasting: Ordinary Least Squares Linear Regression, Support Vector Regression, k-Nearest Neighbours Regression, Extreme Gradient Boosting, and Long/Short-Term Memory Neural Networks. In addition to past REITs prices, we also use Technical Analysis indicators to assist the algorithms in the task of price prediction. While such indicators are very popular in stocks forecasting, they have never been used to forecast REITs. Our experiments show that (i) all ML algorithms produce low error and standard deviation, and are able to outperform the well-known statistical benchmark of AutoRegressive Integrated Moving Average (ARIMA), and (ii) the introduction of Technical Analysis (TA) indicators into the feature set leads to an error reduction of up to 50%.",
    "year": 2023,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "2f5393a47e70c45143d10f2c31223c3c",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "regression",
      "support vector machine",
      "SVM",
      "neural network",
      "deep learning",
      "long short-term memory",
      "LSTM"
    ],
    "stage1_timestamp": "2025-05-15T00:49:36.347352"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是使用机器学习算法预测REITs价格，目的是帮助投资者在投资组合中实现更高回报和更低风险，这直接关联到投资组合管理的领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是使用机器学习算法预测REITs价格，目的是帮助投资者在投资组合中实现更高回报和更低风险，这直接关联到投资组合管理的领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:26:38.593480"
}