{
  "paper": {
    "id": 3204,
    "title": "On downside risk predictability through liquidity and trading activity: A dynamic quantile approach",
    "abstract": "Most downside risk models implicitly assume that returns are a sufficient statistic with which to forecast the daily conditional distribution of a portfolio. In this paper, we analyze whether the variables that proxy for market-wide liquidity and trading conditions convey valid information for forecasting the quantiles of the conditional distribution of several representative market portfolios, including volume- and value-weighted market portfolios, and several Book-to-Market- and Size-sorted portfolios. Using dynamic quantile regression techniques, we report evidence of conditional tail predictability in terms of these variables. A comprehensive backtesting analysis shows that this link can be exploited in dynamic quantile modelling, in order to considerably improve the performances of day-ahead Value at Risk forecasts. (C) 2012 International Institute of Forecasters. Published by Elsevier B.V. All rights reserved.",
    "year": 2013,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "e59f14167263efa3ead64f7a26df1ada",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:14:54.871868"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on forecasting the quantiles of the conditional distribution of market portfolios to improve Value at Risk (VaR) forecasts, which is a key aspect of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on forecasting the quantiles of the conditional distribution of market portfolios to improve Value at Risk (VaR) forecasts, which is a key aspect of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:10:33.611324"
}