{
  "paper": {
    "id": 653,
    "title": "Extreme Learning Machine for Credit Risk Analysis",
    "abstract": "Credit risk analysis is important for financial institutions that provide loans to businesses and individuals. Banks and other financial institutions generally face risks that are mostly of financial nature; hence, such institutions must balance risks and returns. Analyzing or determining risk levels involved in credits, finances, and loans can be performed through predictive analytic techniques, such as an extreme learning machine (ELM). In this work, we empirically evaluated the performance of an ELM for credit risk problems and compared it to naive Bayes, decision tree, and multi-layer perceptron (MLP). The comparison was conducted on the basis of a German credit risk dataset. The simulation results of statistical measures of performance corroborated that the ELM outperforms naive Bayes, decision tree, and MLP classifiers by 1.8248%, 16.6346%, and 5.8934%, respectively.",
    "year": 2020,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "e0903b292215559bdc601658c331419e",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "decision tree",
      "neural network",
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T01:53:24.958960"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on using extreme learning machine (ELM) for credit risk analysis, which is a key aspect of financial risk management. The study evaluates the performance of ELM in predicting credit risk, a critical task for financial institutions to manage their exposure to potential defaults.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on using extreme learning machine (ELM) for credit risk analysis, which is a key aspect of financial risk management. The study evaluates the performance of ELM in predicting credit risk, a critical task for financial institutions to manage their exposure to potential defaults.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:56:14.035668"
}