{
  "paper": {
    "id": 3897,
    "title": "RISK ASSESSMENT OF THE BANKING GROUPS USAGE IN THE SHADOW ACTIVITIES",
    "abstract": "In a market economy, financial intermediaries become direct or indirect participants in most shadow schemes. Taking to account the bank-centric nature of the Ukrainian financial sector, banks and banking groups are a critical element of shadow operations. The article presents the analysis of indicators that characterize the risks of using banking groups in shadow schemes. According to the results of cluster analysis, four clusters of banking groups were formed. This will allow a more systematic and reasonable analysis of the performance of banking groups to identify common qualitative and quantitative characteristics that will describe their risks of participation in illegal transactions. In the second stage, the principal components method revealed the indicators that most significantly affect the potential risks of participation of banking groups in shadow operations. Such indicators include the number of financial institutions in the group, the residency of the group controllers, and the total number of group members. At the third stage, a statistically significant regression model was formed, which confirms the influence of the number of financial institutions in the banking group and the total number of banking group members on the potential risk of using banking groups in shadow operations. The obtained results can be further used to form an integrated assessment of the potential risk of using banking groups in shadow operations and improve banking supervision.",
    "year": 2020,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "6c784e131b790af3d449b76cf7897812",
    "relevant_keywords": [
      "clustering",
      "principal components analysis",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:30:58.380388"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要分析了银行集团参与影子活动的风险，并使用了聚类分析、主成分分析和回归模型来评估这些风险。这些技术和方法主要用于识别和管理金融风险，因此属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文主要分析了银行集团参与影子活动的风险，并使用了聚类分析、主成分分析和回归模型来评估这些风险。这些技术和方法主要用于识别和管理金融风险，因此属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:34:45.134346"
}