{
  "paper": {
    "id": 4400,
    "title": "A Forward-Looking IFRS 9 Methodology, Focussing on the Incorporation of Macroeconomic and Macroprudential Information into Expected Credit Loss Calculation",
    "abstract": "The International Financial Reporting Standard (IFRS) 9 relates to the recognition of an entity's financial asset/liability in its financial statement, and includes an expected credit loss (ECL) framework for recognising impairment. The quantification of ECL is often broken down into its three components, namely, the probability of default (PD), loss given default (LGD), and exposure at default (EAD). The IFRS 9 standard requires that the ECL model accommodates the influence of the current and the forecasted macroeconomic conditions on credit loss. This enables a determination of forward-looking estimates on impairments. This paper proposes a methodology based on principal component regression (PCR) to adjust IFRS 9 PD term structures for macroeconomic forecasts. We propose that a credit risk index (CRI) is derived from historic defaults to approximate the default behaviour of the portfolio. PCR is used to model the CRI with the macroeconomic variables as the set of explanatory variables. A novice all-subset variable selection is proposed, incorporating business decisions. We demonstrate the method's advantages on a real-world banking data set, and compare it to several other techniques. The proposed methodology is on portfolio-level with the recommendation to derive a macroeconomic scalar for each different risk segment of the portfolio. The proposed scalar is intended to adjust loan-level PDs for forward-looking information.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "21322de5289d0032b09243da15915b57",
    "relevant_keywords": [
      "principal components analysis",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:36:38.539158"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用主成分回归（PCR）来调整IFRS 9的违约概率（PD）期限结构，以纳入宏观经济预测信息，从而改进预期信用损失（ECL）的计算。这直接涉及信用风险的管理和评估，属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是使用主成分回归（PCR）来调整IFRS 9的违约概率（PD）期限结构，以纳入宏观经济预测信息，从而改进预期信用损失（ECL）的计算。这直接涉及信用风险的管理和评估，属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:33:19.072564"
}