{
  "paper": {
    "id": 573,
    "title": "T2V_TF: An adaptive timing encoding mechanism based Transformer with multi-source heterogeneous information fusion for portfolio management: A case of the Chinese A50 stocks",
    "abstract": "The Stock prediction has traditionally been an attractive and challenging topic for investors and researchers. Traditionally, people concern more about predicting stock prices, less effort has been made to recommend stocks for constructing a profitable portfolio. Moreover, in existing methods for stock prediction, most of them construct models based on one or two kinds of features like stock prices, news sentiment, or simple technical indicators, and disregard the importance of multi-source information fusion. In response to this concern, we propose a novel model T2V_TF based on deep learning by combining both Time2Vec and Transformer technologies. To introduce more diverse information into the proposed model, we further conduct an in-depth exploration of the extraction and fusion of multi-source heterogeneous information, which includes the trading data, time-frequency features, Alpha 101 and Alpha 191 technical indicators, and sentiment scores. Moreover, to increase the ranking ability of our model, T2V_TF takes the ranking loss as the loss function instead of the widely used regression loss. Finally, all the technological innovations of this paper are verified on the portfolio constructed based on the A50 stocks from the Chinese stock market. The experimental results demonstrate that our proposed T2V_TF can get better portfolio cumulative return, compared with other models including the multi-layer perceptron, the support vector machine, the gradient boosting decision trees, the long short-term memory model, and the attention-based long short-term memory model, and the Transformer.",
    "year": 2023,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "79a26da5ec1fb07dc189b36f69e36e7b",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "neural network",
      "long short-term memory",
      "LSTM",
      "attention mechanism",
      "support vector machine",
      "SVM",
      "decision tree",
      "representation learning",
      "feature representation",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T00:45:01.333297"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是提出了一种基于深度学习的模型T2V_TF，用于推荐股票以构建盈利的投资组合，并在中国A50股票上进行了验证。这明确属于投资组合管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是提出了一种基于深度学习的模型T2V_TF，用于推荐股票以构建盈利的投资组合，并在中国A50股票上进行了验证。这明确属于投资组合管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:29:34.023966"
}