{
  "paper": {
    "id": 8592,
    "title": "Predicting Estuarine Algal Blooms Utilising Neural Network Modelling-A Preliminary Investigation",
    "abstract": "Algal blooms are prevalent within the Berowra Estuary. When algal species are present in high numbers they pose serious problems for commercial and recreational users of the estuary. Management authorities require an understanding of the relationship between the incidence of algal blooms and the environmental conditions required to initiate and promote these populations. An Artificial Neural Network (ANN) is currently being developed to predict the occurrence and risk of algal blooms within the Berowra Estuary. Modelling the algal dynamics for this project is based on a unique data set, for South Eastern Australia, obtained from a deployed probe which monitors Chlorophyll-a (Chl-a), temperature and salinity at 15 minute intervals. Distinguishing features of the present study are that it is being conducted in an estuarine environment with prediction horizons of the order of hours to several weeks. This is in contrast to previous studies which are more commonly set within freshwater environments with the relevant time scales ranging from biweekly to seasonal. Preliminary network development for this project has utilised the back-propagation training algorithm and the sigmoid activation function. A multilayer perceptron architecture containing an input, hidden and output layer was selected. Data pre-processing and division into training, selection and test subsets occurred prior to being incorporated into the network. Prediction outputs have been generated which aim to provide predictions for 1, 3 and 7 days in advance. Preliminary analysis of the data indicates the best predictive results (i.e. lowest selection error) are obtained with models with the lowest number of variables. Specifically, time-lagged Chl-a concentrations provide the best data set from which a prediction is made. This suggests initially that antecedent algal concentrations within the previous week are the most significant variable to be used when predicting future Chl-a levels. However, it is acknowledged that with further refinement of internal network geometries and potential alteration to the data preprocessing techniques this may not be the case. This paper outlines initial model results and compares each individual model on its predictive ability whilst maintaining constant internal model geometries between models. Future improvements to the models developed in this paper are expected. Prediction of Chl-a within the estuarine environment is a suitable application of ANNs. This predictive tool provides opportunities for proactive rather than reactive management regimes with regard to mitigating the effects of estuarine algal blooms. Essential to the implementation and adoption of a proactive strategy is the requirement for a specified degree of certainty in the model outputs, an understanding of problematic algal concentrations and their duration. These requirements are essential to ensure logistics staff and financial support are maintained for an algal bloom early warning system.",
    "year": 2005,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "775d975c9e28094e4611164a3c242cbc",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "neural network",
      "backpropagation",
      "BP",
      "sigmoid",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T03:20:22.280200"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究利用神经网络模型预测河口藻华的发生，属于环境科学和生态管理领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究利用神经网络模型预测河口藻华的发生，属于环境科学和生态管理领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:25:36.020518"
}