{
  "paper": {
    "id": 737,
    "title": "Clustering-Based Monarch Butterfly Optimization for Constrained Optimization",
    "abstract": "Monarch butterfly optimization (MBO) algorithm is a newly-developed metaheuristic approach that has shown striking performance on several benchmark problems. In order to enhance the performance of MBO, many scholars proposed various strategies for benchmark evaluation and practical applications. As an application of artificial intelligence (AI), machine learning (ML) developed fast and succeeded in dealing with so many complicated problems. However, up to now, MI, did not use to improve the performance of MBO algorithm. In this paper, one of ML techniques, clustering, is introduced into the basic MBO algorithm, so an improved clustering-based MBO namely CBMBO is proposed. In CBMBO algorithm, the whole population is divided into two subpopulations according to k-means clustering. Also, only the individuals having better fitness can be passed to the next generation instead of accepting all the updated individuals used in the basic MBO algorithm. In order to improve the diversity of the population, few individuals having worse fitness are accepted as new individuals. In order to verify the performance of our proposed CBMBO algorithm, CBMBO is compared with six basic and four improved metaheuristic algorithms on twenty-eight CEC 2017 constrained problems with dimension of 30, 50, and 100, respectively. The experimental results suggest a significant addition to the portfolio of computational intelligence techniques. (C) 2020 The Authors. Published by Atlantis Press B.V.",
    "year": 2020,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "64626ffa19ac7533b4cd6dac03244afc",
    "relevant_keywords": [
      "machine learning",
      "unsupervised learning",
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T00:47:18.654398"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究一种基于聚类的帝王蝶优化算法（CBMBO），并对其在约束优化问题上的性能进行了评估。虽然该算法可能具有广泛的潜在应用，包括金融领域，但论文中并未明确指出或讨论其在衍生品定价、金融风险管理或投资组合管理等特定金融领域的应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究一种基于聚类的帝王蝶优化算法（CBMBO），并对其在约束优化问题上的性能进行了评估。虽然该算法可能具有广泛的潜在应用，包括金融领域，但论文中并未明确指出或讨论其在衍生品定价、金融风险管理或投资组合管理等特定金融领域的应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:28:19.394443"
}