{
  "paper": {
    "id": 2576,
    "title": "A Deep Machine Learning-Based Assistive Decision System for Intelligent Load Allocation under Unknown Credit Status",
    "abstract": "Nowadays, the banks are facing increasing business pressure in loan allocations, because more and more enterprises are applying for it and financial risk is becoming vaguer. To this end, it is expected to investigate effective autonomous loan allocation decision schemes that can provide guidance for banks. However, in many real-world scenarios, the credit status information of enterprises is unknown and needs to be inferred from business status. To handle such an issue, this paper proposes a two-stage loan allocation decision framework for enterprises with unknown credit status. And the proposal is named as TLAD-UC for short. For the first stage, the idea of deep machine learning is introduced to train a prediction model that can generate credit status prediction results for enterprises with unknown credit status. For the second stage, a dynamic planning model with both optimization objective and constraint conditions is established. Through such model, both the profit and risk of banks can be well described. Solving such a dynamic planning model via computer simulation programs, the optimal allocation schemes can be suggested.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "462ef0bf22e07aa0b1fd07ab9d502b4d",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "neural network",
      "representation learning",
      "hidden layer",
      "backpropagation",
      "BP"
    ],
    "stage1_timestamp": "2025-05-15T02:17:01.633371"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文提出了一种两阶段贷款分配决策框架，旨在通过深度学习和动态规划模型来预测企业信用状况并优化贷款分配，以平衡银行的利润和风险。这直接涉及金融风险管理中的信用风险评估和贷款决策优化。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文提出了一种两阶段贷款分配决策框架，旨在通过深度学习和动态规划模型来预测企业信用状况并优化贷款分配，以平衡银行的利润和风险。这直接涉及金融风险管理中的信用风险评估和贷款决策优化。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:41:09.338304"
}