{
  "paper": {
    "id": 3074,
    "title": "Stock return predictability in emerging markets: Does the choice of predictors and models matter across countries?",
    "abstract": "This study aims to examine return predictability in 24 emerging markets disaggregated in different regions. We propose four specifications, including a benchmark model. Then, an augmented model appropriate for each country, including a large set of potential factors, is evaluated. Furthermore, a dynamic multifactor model is investigated for all countries. Finally, we relax the symmetric hypothesis in asset return predictability based on a non-parametric non-linear approach: the projection pursuit regression model. Our study reveals three main findings. First, we reject all previous findings supporting a standard model of asset return predictability that is valuable for all countries, as we show that each country has specific domestic factors (both macroeconomic and financial) useful to predict future returns. Second, our empirical framework shows that asset return predictability might be robustly modelled based on non-linear specification based on the projection pursuit regression model. Our findings' explanatory power of out-of-sample estimations is economically relevant. Our results are useful for investors and policy-makers for portfolio diversification and regulation policies.",
    "year": 2017,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "7b77696746068f2ad70cde0baa5850eb",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:13:09.890984"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文主要研究新兴市场中股票收益的可预测性，并探讨了不同预测因子和模型的选择对预测效果的影响。研究结果对投资者和政策制定者在投资组合多样化和监管政策方面具有实际应用价值，因此属于投资组合管理领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文主要研究新兴市场中股票收益的可预测性，并探讨了不同预测因子和模型的选择对预测效果的影响。研究结果对投资者和政策制定者在投资组合多样化和监管政策方面具有实际应用价值，因此属于投资组合管理领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:11:31.261684"
}