{
  "paper": {
    "id": 999,
    "title": "CREDIT RISK MEASUREMENT IN BANKS: MODEL SELECTION ACCORDING CLASSIFICATION ACCURACY",
    "abstract": "Credit risk means incapacity of debtors to implement their financial liabilities for bank. Banks in their activity solve a problem how to reduce potential loss due to crediting not reliable clients. Various internal credit risk models can be applied to measure this risk of each client. Also bank must use the most efficient model which has the highest classification accuracy. In this paper 3 methods were applied for data analysis: discriminant analysis, logistic regression and artificial neural networks (multilayer perceptrons). 9 models were constructed for the credit risk estimation. Analysis indicated that the most efficient model to classify reliable and not reliable clients (Lithuanian companies) is logistics regression analyzing 3 years financial data of companies.",
    "year": 2009,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "8648d4439d5671db2443b3da85192245",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "regression",
      "neural network",
      "logistic regression"
    ],
    "stage1_timestamp": "2025-05-15T01:57:29.947016"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on measuring and managing credit risk in banks by selecting the most efficient model for classifying reliable and unreliable clients, which is a core aspect of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on measuring and managing credit risk in banks by selecting the most efficient model for classifying reliable and unreliable clients, which is a core aspect of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:52:44.111209"
}