{
  "paper": {
    "id": 594,
    "title": "Classification algorithms based on neural network and its application in the credit market",
    "abstract": "The different types of classification algorithms for credit scoring systems are used to evaluate credit risk Neural Network-based systems that allow the system, through an analysis of historical data to determine the relationship between account characteristics and the probability of default.The backpropagation algorithm - the multilayer feedforward network structure is described based on data with nine financial ratios from 81 firms listed in china, A simulation on network is made. Neural Network model for classification algorithms are established. By varying Network Parameters we demonstrate that LevenbergMarque training error is smallest among 4 learning algorithms and its performance is better. Increasing the number of hidden layer can result in minor improvement.",
    "year": 2007,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "588647804b52e6623aad0118abce5b03",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "neural network",
      "deep learning",
      "backpropagation",
      "BP",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T01:52:49.500064"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on using neural networks for credit scoring systems to evaluate credit risk and predict the probability of default, which is a key aspect of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on using neural networks for credit scoring systems to evaluate credit risk and predict the probability of default, which is a key aspect of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:56:39.365731"
}