{
  "paper": {
    "id": 3250,
    "title": "U.S. small bank failures and the Financial Crisis of 2007-2009",
    "abstract": "This study utilizes logistic regression to identify annual financial statement and performance ratio factors that influenced the failure rate of U.S. small banks before and after the Financial Crisis identified during December 2007 through June, 2009. The study includes rates of small bank failure before and Financial Crisis spanning the years 2001 through 2014. The aim of the paper is to describe in large increase in U.S. small bank failure after the Financial Crisis. The Financial Crisis created drastic sustained changes of the financial system that were designed for large financial institutions. These changes may have created undue hardship for small banks and elevated the rate of small bank failures in the post-Financial Crisis period. Post-Financial Crisis bank failures had lower capital ratios and increased loan portfolio risk relative to the prior period. The combined effect of expansionist monetary policy, increased regulatory costs, and possession of illiquid real estate assets contributed to the higher rate of failure. The identification of factors that contribute to the increase in small bank failures after the Financial Crisis should assist bank managers, policy analysts, and scholars in developing alternative solutions for the future.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "0a00c928380a576a5398453bf84fb291",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:24:05.240949"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文利用逻辑回归分析美国小型银行在金融危机前后的失败率及其影响因素，主要关注银行的风险因素和失败预测，这属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文利用逻辑回归分析美国小型银行在金融危机前后的失败率及其影响因素，主要关注银行的风险因素和失败预测，这属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:37:20.350945"
}