{
  "paper": {
    "id": 417,
    "title": "Financial Management Early Warning Based on Three BP-NNs Improved Algorithms",
    "abstract": "Enterprises face more and more risks, including policy risk, market risk, employment risk and financial risk. In order to avoid the occurrence of corporate crisis, it is necessary to monitor corporate financial risks and adopt possible early warning systems. The purpose of this paper is to study early financial management warnings based on three advanced BP-NNs algorithms. On the basis of the standard BP-NNs prediction model, three different training modes of additional momentum term, additional momentum term and LM optimization method (Levenberg-Marquardt) are adopted as the technology to optimize the BP network algorithm. Improved analysis of company sample data. By comparing the training process and simulation results of the three advanced algorithms, it is found that LM-BP is significantly better than the additional shock enhancement method and the conjugate enhancement method in terms of network speed, training error and result satisfaction, and the average recognition rate of LM-BP is as high as 97%. %.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "deep learning",
    "cache_key": "37b2a5da9e7e0fdd817cf6279e45811c",
    "relevant_keywords": [
      "machine learning",
      "neural network",
      "backpropagation",
      "BP",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T01:38:17.286181"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on monitoring corporate financial risks and developing early warning systems using improved BP-NNs algorithms, which directly addresses financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on monitoring corporate financial risks and developing early warning systems using improved BP-NNs algorithms, which directly addresses financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:03:38.417519"
}