{
  "paper": {
    "id": 1688,
    "title": "Analysis of International Capital Inflows and Institutional Quality in Emerging Markets",
    "abstract": "This study investigates the cointegrating and causality relationships between foreign direct investment (FDI), foreign portfolio investment (FPI) and institutional quality in a sample of 12 emerging market economies for the period from 2007 to 2017. A composite index for institutional quality composed of the Worldwide Governance Indicators was constructed using the Principal Components Analysis (PCA) method. The panel autoregressive distributed lag (ARDL) model and the error correction model (ECM) were applied to assess the cointegrating and causal relationships between the key variables. In addition to finding significant cointegrating relationships between institutional quality and the foreign capital inflows (FDI and FPI), the results confirmed unidirectional causality from FDI and FPI to institutional quality in the long run. The results further suggested that the long-run relationship between the two foreign capital inflows was more of a trade-off nature, dependent upon the dynamics of the institutional environment in the host economy. The recommendations suggested include that emerging markets should continue to open their economies in pursuit of capital inflows, which will reciprocally strengthen their domestic institutional environment. Strengthening institutions could curtail the persistence of institutional weaknesses and insulate emerging economies from the adverse effects of volatile capital flows and, over the long run, enhance capital inflows.",
    "year": 2021,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "236bdd7f0c4bad7450bfddc8ddf59450",
    "relevant_keywords": [
      "principal components analysis"
    ],
    "stage1_timestamp": "2025-05-15T00:58:18.435444"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究国际资本流入与新兴市场制度质量之间的关系，使用了主成分分析和面板自回归分布滞后模型等方法，但其核心内容并不涉及衍生品定价、金融风险管理或投资组合管理等特定金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究国际资本流入与新兴市场制度质量之间的关系，使用了主成分分析和面板自回归分布滞后模型等方法，但其核心内容并不涉及衍生品定价、金融风险管理或投资组合管理等特定金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:19:17.260155"
}