{
  "paper": {
    "id": 5082,
    "title": "Evaluating Work Impairment as a Source of Financial Toxicity in Cancer Healthcare and Negative Impacts on Health Status",
    "abstract": "How the socioeconomic factors intersect for a particular patient can deter-mine their susceptibility to financial toxicity, what costs they will encounter during treatment, the type and quality of their care, and the potential work impairments they face. The primary goal of this study was to evaluate finan-cial factors leading to worsening health outcomes by the cancer subtype. A logistic model predicting worsening health outcomes while assessing the most influential economic factors was constructed by the University of Michigan Health and Retirement Study. A forward stepwise regression procedure was implemented to identify the social risk factors that im-pact health status. Stepwise regression was done on data subsets based on the cancer types of lung, breast, prostate, and colon cancer to determine whether significant predictors of worsening health status were different or the same across cancer types. Independent covariate analysis was also con-ducted to cross-validate our model. On the basis of the model fit statistics, the two-factor model has the best fit, that is, the lowest AIC among po-tential models of 3270.56, percent concordance of 64.7, and a C-statistics of 0.65. The two-factor model used work impairment and out-of-pocket costs, significantly contributing to worsening health outcomes. Covariate analysis demonstrated that younger patients with cancer experienced more financial burdens leading to worsening health outcomes than elderly pa-tients aged 65 years and above. Work impairment and high out-of-pocket costs were significantly associated with worsening health outcomes among cancer patients. Matching the participants who need the most financial help with appropriate resources is essential to mitigate the financial burden. Significance: Among patients with cancer, work impairment and out-of-pocket are the two primary factors contributing to adverse health outcomes. Women, African American or other races, the Hispanic popula-tion, and younger individuals have encountered higher work impairment and out-of-pocket costs due to cancer than their counterparts.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "53b27437ef3d28879cfdc711f3197399",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:44:11.001810"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究癌症患者的财务负担与健康结果之间的关系，涉及社会经济因素和医疗成本分析，但并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究癌症患者的财务负担与健康结果之间的关系，涉及社会经济因素和医疗成本分析，但并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:31:09.599996"
}