{
  "paper": {
    "id": 2838,
    "title": "DEVELOPMENT OF ENTERPRISE CREDIT RISK ASSESSMENT MODEL FOR LITHUANIAN CREDIT UNIONS",
    "abstract": "As credit unions expand the expert credit risk assessment methods are becoming ineffective. It becomes essential to apply quantitative risk assessment methods by employing objective analytical information. Credit unions should apply statistical credit risk assessment models to assess credit risk of potential loan recipients as accurately as possible. However, current credit risk assessment models are usually adapted to the banking sector. Thus, the aim of this article is to form a logistic regression model of enterprise credit risk assessment for Lithuanian credit unions. Definitions of good and bad debtor are reconsidered when developing the model; financial and nonfinancial ratios able to best describe the probability of default are researched Model development methodology has been improved and original logistic regression model of enterprise credit risk has been provided",
    "year": 2018,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "767fe2fc21b1bbda7be11b0fa090d93c",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:19:46.656819"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on developing a logistic regression model for assessing enterprise credit risk in credit unions, which is a core aspect of financial risk management, specifically credit risk assessment.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on developing a logistic regression model for assessing enterprise credit risk in credit unions, which is a core aspect of financial risk management, specifically credit risk assessment.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:39:45.103475"
}