{
  "paper": {
    "id": 5363,
    "title": "A time-dependent proportional hazards survival model for credit risk analysis",
    "abstract": "In the consumer credit industry, assessment of default risk is critically important for the financial health of both the lender and the borrower. Methods for predicting risk for an applicant using credit bureau and application data, typically based on logistic regression or survival analysis, are universally employed by credit card companies. Because of the manner in which the predictive models are fit using large historical sets of existing customer data that extend over many years, default trends, anomalies, and other temporal phenomena that result from dynamic economic conditions are not brought to light. We introduce a modification of the proportional hazards survival model that includes a time-dependency mechanism for capturing temporal phenomena, and we develop a maximum likelihood algorithm for fitting the model. Using a very large, real data set, we demonstrate that incorporating the time dependency can provide more accurate risk scoring, as well as important insight into dynamic market effects that can inform and enhance related decision making. Journal of the Operational Research Society (2012) 63, 306-321. doi:10.1057/jors.2011.34 Published online 11 May 2011",
    "year": 2012,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "1476267d8facf481a37c69d5bc6c1839",
    "relevant_keywords": [
      "supervised learning",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:47:13.858652"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是改进的比例风险生存模型，用于信用风险分析，旨在更准确地预测违约风险。这直接应用于金融风险管理中的信用风险管理领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"该论文的核心技术是改进的比例风险生存模型，用于信用风险分析，旨在更准确地预测违约风险。这直接应用于金融风险管理中的信用风险管理领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:30:32.402759"
}