{
  "paper": {
    "id": 1127,
    "title": "Time Series Data Prediction using IoT and Machine Learning Technique",
    "abstract": "Time series analysis and prediction have been widely accepted in various domains from last two decades. Business analytics, Medical drugs & pharmaceutical, Dynamic Marketing, Weather forecasting, Pollution measures, fmancial portfolio analysis and Stock market prediction are the favorite domains among research communities under time series analysis. Since air quality is one of the paramount factors which make life possible on earth and monitoring air quality data as time series analysis is a one of prime area. The most affected air quality parameters on health are carbon monoxide (CO),carbon dioxide (CO2), Ammonia(NH3) and Acetone ((CH3)2CO). In this paper we have taken the sensor's data of three specific locations of Delhi and National Capital Region (NCR) and predict air quality of next day using linear regression as machine learning algorithm. Model is evaluated through four performance measures Mean Absolute Error (MAE), Mean Square Error (MSE), Root Mean Square Error (RMSE) and Mean Absolute Percentage Error (MAPE). The study further assesses with benchmark model and obtains significant results. (C) 2020 The Authors. Published by Elsevier B.V.",
    "year": 2020,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "f69b0571d95fa67999e27ce03f73ff5a",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T00:52:00.373632"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究使用机器学习和时间序列分析预测空气质量，虽然提到了金融投资组合分析作为时间序列分析的一个应用领域，但论文的核心技术和研究目标集中在环境监测和预测，并未具体应用于衍生品定价、金融风险管理或投资组合管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究使用机器学习和时间序列分析预测空气质量，虽然提到了金融投资组合分析作为时间序列分析的一个应用领域，但论文的核心技术和研究目标集中在环境监测和预测，并未具体应用于衍生品定价、金融风险管理或投资组合管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:23:59.725412"
}