{
  "paper": {
    "id": 3946,
    "title": "Comparative Analysis of the Methods for Assessing the Probability of Bankruptcy for Ukrainian Enterprises",
    "abstract": "Various models and methods for analyzing the risk of enterprises bankruptcy using discriminant analysis, artificial neural networks and statistical approaches are presented. The specific problems of the Ukrainian economy are described - the lack of a large number of enterprises in the stock market, the inaccessibility of information about the real financial condition of some enterprises, the vagueness of the definition of bankruptcy. The possibility of using foreign models for Ukrainian enterprises is considered. The advantages, disadvantages and practical significance of the considered models in modern economic conditions are determined. Experimental studies have been carried out to compare statistical models, artificial neural networks of the perceptron type, regression models and binary trees in bankruptcy risk problems. A comparative analysis of the effectiveness of the use of these approaches to assess the financial stability of Ukrainian enterprises has been carried out. The most adequate methods were determined by the example of a specific enterprise actually functioning in Ukraine.",
    "year": 2020,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "ad6274f600f10d012e39e4a8bd103450",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "regression",
      "decision tree",
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T02:31:28.447974"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要研究企业破产风险的评估方法，包括判别分析、人工神经网络和统计方法，这些技术直接应用于金融风险管理中的信用风险评估。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文主要研究企业破产风险的评估方法，包括判别分析、人工神经网络和统计方法，这些技术直接应用于金融风险管理中的信用风险评估。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:34:43.927414"
}