{
  "paper": {
    "id": 5641,
    "title": "Measurement and risk adjustment of prelabor cesarean rates in a large sample of California hospitals",
    "abstract": "OBJECTIVE: Prelabor cesareans in women without a prior cesarean is an important quality measure, yet one that is seldom tracked. We estimated patient-level risks and calculated how sensitive hospital rankings on this proposed quality metric were to risk adjustment. STUDY DESIGN: This retrospective cohort study linked Californian patient data from the Agency for Healthcare Research and Quality with hospital-level operational and financial data. Using the outcome of primary prelabor cesarean, we estimated patient-level logistic regressions in progressively more detailed models. We assessed incremental fit and discrimination, and aggregated the predicted patient-level event probabilities to construct hospital-level rankings. RESULTS: Of 408,355 deliveries by women without prior cesareans at 254 hospitals, 11.0% were prelabor cesareans. Including age, ethnicity, race, insurance, weekend and unscheduled admission, and 12 well-known patient risk factors yielded a model c-statistic of 0.83. Further maternal comorbidities, and hospital and obstetric unit characteristics only marginally improved fit. Risk adjusting hospital rankings led to a median absolute change in rank of 44 places compared to rankings based on observed rates. Of the 48 (49) hospitals identified as in the best (worst) quintile on observed rates, only 23 (18) were so identified by the risk-adjusted model. CONCLUSION: Models predict primary prelabor cesareans with good discrimination. Systematic hospital-level variation in patient risk factors requires risk adjustment to avoid considerably different classification of hospitals by outcome performance. An opportunity exists to define this metric and report such risk-adjusted outcomes to stakeholders.",
    "year": 2014,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "c38c57c53a07f7218a9eb35357531aa0",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:49:50.329347"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究医疗质量评估和风险调整，特别是针对剖宫产率的测量和医院排名的风险调整。虽然使用了回归分析等统计方法，但其应用领域是医疗保健而非金融。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究医疗质量评估和风险调整，特别是针对剖宫产率的测量和医院排名的风险调整。虽然使用了回归分析等统计方法，但其应用领域是医疗保健而非金融。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:30:01.954194"
}