{
  "paper": {
    "id": 2644,
    "title": "Analysis on Risk Features of International Engineering Projects Based on SVM Method",
    "abstract": "With the implementation of The Belt and Road Initiative, Chinese companies have accumulated a lot of experience and academic researches after years of development. Compared with domestic ones, overseas projects are confronted with severer risks and challenges due to the complexity of their external environment. With considerable researches start with projects and focus on single projects or portfolio, seldom attention has been paid to overall risk features of international engineering contracting market. In this work, 73 cases of 8 industries are collected from CNKI to analyze risk features of different industries, with categories chosen based on Annual Report on China International Project Contracting (2017-2018). Firstly, a thorough identified risks list is established through literature review. Secondly, secondary risk factors of each project are counted as features stand for the industry it belongs. Then, SVM method is adopted here to train classifiers for distinguishing risk identities from each other. The existence of risk differences among industries is proved through accuracy. Finally, risk characteristics of transportation projects, electric power construction projects and others are analyzed to provide companies with advices on project risk management in their fields.",
    "year": 2020,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "4897b031f659d0cc761bef3c30bf96e7",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM"
    ],
    "stage1_timestamp": "2025-05-15T01:09:14.850422"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究国际工程项目的风险特征分析，使用SVM方法对不同行业的风险进行分类和管理。虽然涉及风险管理，但其应用场景是工程项目而非金融领域，因此不属于上述任何金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究国际工程项目的风险特征分析，使用SVM方法对不同行业的风险进行分类和管理。虽然涉及风险管理，但其应用场景是工程项目而非金融领域，因此不属于上述任何金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:13:38.730202"
}