{
  "paper": {
    "id": 78,
    "title": "Machine Learning for ESG Rating Classification: An Integrated Replicable Model with Financial and Systemic Risk Parameters",
    "abstract": "The concept of Sustainability has been identified as a key factor in investment strategies for over a decade. Due to empirical evidence suggesting better risk-return profiles for sustainable investments than non-sustainable ones (under similar conditions), investors consider ESG ratings essential information for investment choices. Despite persistent inconsistencies and methodological uncertainties, new risk measures are perceived as useful in identifying risks associated with the Environmental, Social, and Governance pillars, both individually and collectively. This study aims to assess whether a selected set of financial statement variables and a dynamic measure of systemic risk observed at time t can provide useful information for identifying the ESG rating class of a company at time t + 1. To test this hypothesis, we use companies in the EuroStoxx 600 index for the period 2016-2021 and apply a Machine Learning (ML) model. Using a Random Forest (RF) classification model, we estimate the ESG rating class at time t+ 1 with unprecedented accuracy. This agile and parsimonious model can provide valuable information to sustainable investors for making strategic investment decisions.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "05d7a708dae029e57fbe473f4086080c",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "decision tree",
      "Random Forest"
    ],
    "stage1_timestamp": "2025-05-15T01:46:39.551237"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是使用机器学习模型（Random Forest）预测公司的ESG评级，目的是为可持续投资者提供战略投资决策的信息。这直接关联到投资组合管理，因为ESG评级是投资选择和资产配置的重要依据。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是使用机器学习模型（Random Forest）预测公司的ESG评级，目的是为可持续投资者提供战略投资决策的信息。这直接关联到投资组合管理，因为ESG评级是投资选择和资产配置的重要依据。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:01:10.185167"
}