{
  "paper": {
    "id": 5099,
    "title": "Study on real estate investment value based on cluster and discriminant analysis",
    "abstract": "The characteristics of real estate investment value have made it faced with high risk and uncertainty. The investors mainly focus on the economic benefit of investment in real estate development. As the Market investment concepts gradually shifted investment value, value pursuing investors pay attention to the accounting and financial report of listed Real Estate companies. As a new real estate capital markets plate, the small and medium Real Estate enterprises (SMREEs) board has attracted more attention than other firms. Therefore, the study of small and medium-sized real estate enterprises have important significance The traditional analytical method is greatly limited in analyzing real estate investment value. Cluster and discriminant analysis are applied to study sample data of 20 SMREEs' accounting and financial reports of 2005, and accordingly concluded the entire real estate industry classification and characteristics. Through quantitative analysis, the Results show that these enterprises are different in the capabilities of return, growth and expansion development. It is concluded that cluster and discriminant analyses are useful for Real Estate investment value analysis. The investors and Market participants can effectively grasp small and medium-sized real estate enterprises listed company and its growth trend from the results.",
    "year": 2007,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "82c6086f494b27f512b228b46258ebd6",
    "relevant_keywords": [
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T02:44:11.069789"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要应用聚类和判别分析来研究中小型房地产企业的投资价值，虽然涉及金融分析，但并未明确涉及衍生品定价、金融风险管理或投资组合管理等特定金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要应用聚类和判别分析来研究中小型房地产企业的投资价值，虽然涉及金融分析，但并未明确涉及衍生品定价、金融风险管理或投资组合管理等特定金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:31:09.390032"
}