{
  "paper": {
    "id": 334,
    "title": "Complex nonlinear neural network prediction with IOWA layer",
    "abstract": "Neural network methods are widely used in business problems for prediction, clustering, and risk management to improving customer satisfaction and business outcome. The ability of a neural network to learn complex nonlinear relationship is due to its architecture that uses weight parameters to transform input data within the hidden layers. Such methods perform well in many situations where the ordering of inputs is simple. However, for a complex reordering of a decision-maker, the process is not enough to get an optimal prediction result. Moreover, existing machine learning algorithms cannot reduce computational complexity by reducing data size without losing any information. This paper proposes an induced ordered weighted averaging (IOWA) operator for the artificial neural network IOWA-ANN. The operator reorders the data according to the order-inducing variable. The proposed sorting mechanism in the neural network can handle a complex nonlinear relationship of a dataset, which results in reduced computational complexities. The proposed approach deals with the complexity of the neuron, collects the data and allows a degree of customisation of the structure. The application further extended to IGOWA and Quasi-IOWA operators. We present a numerical example in a financial decision-making process to demonstrate the approach's effectiveness in handling complex situations. This paper opens a new research area for various complex nonlinear predictions where the dataset is big enough, such as cloud QoS and IoT sensors data. The approach can be used with different machine learning, neural networks or hybrid fuzzy neural methods with other extensions of the OWA operator.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "6f13ce01efa381c96db56c001afb2917",
    "relevant_keywords": [
      "machine learning",
      "neural network",
      "deep learning",
      "hidden layer",
      "backpropagation",
      "BP"
    ],
    "stage1_timestamp": "2025-05-15T01:49:41.025945"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要提出了一种改进的神经网络方法（IOWA-ANN），用于处理复杂非线性关系的数据预测问题。虽然论文提到在金融决策过程中进行了数值示例演示，但并未明确指出其核心技术应用于衍生品定价、金融风险管理或投资组合管理等特定金融领域。论文的应用范围更广泛，包括云计算QoS和物联网传感器数据等非金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要提出了一种改进的神经网络方法（IOWA-ANN），用于处理复杂非线性关系的数据预测问题。虽然论文提到在金融决策过程中进行了数值示例演示，但并未明确指出其核心技术应用于衍生品定价、金融风险管理或投资组合管理等特定金融领域。论文的应用范围更广泛，包括云计算QoS和物联网传感器数据等非金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:59:03.020180"
}