{
  "paper": {
    "id": 3703,
    "title": "Solving group multi-objective optimization problems by optimizing consensus through multi-criteria ordinal classification",
    "abstract": "In this paper good consensus is associated with a high level of group satisfaction and a low level of dissatisfaction. A new method to improve consensus through a reformulation of the original group multi objective optimization problem is introduced. For each point in the feasible decision set, the level of satisfaction or dissatisfaction from each group member is determined by multi-criteria ordinal classification approaches. Intense satisfaction and dissatisfaction are both modeled. Group satisfaction (respectively, dissatisfaction) is maximized (resp. minimized), finding the best possible consensus solutions in correspondence with a current stage of closeness among group members' preferences, judgments, beliefs, and conservatism attitudes. Logic models are introduced to evaluate conditions for best consensus. Imperfect information (imprecision, uncertainty, ill-definition, arbitrariness) on the values of objective functions, required and available resources, and decision model parameters is handled by using interval numbers. Two different kinds of multi-criteria decision model are considered: i) an interval outranking approach and ii) an interval weighted-sum value function. The proposal can handle very general cases of group multi-objective optimization problems. The method is illustrated by solving a real size multi-objective project portfolio optimization problem using evolutionary computation tools. (c) 2021 Elsevier B.V. All rights reserved.",
    "year": 2022,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "d9b1b99b915fd8172e008f719d41f4ac",
    "relevant_keywords": [
      "classification"
    ],
    "stage1_timestamp": "2025-05-15T01:20:03.403788"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究群体多目标优化问题中的共识优化方法，虽然提到了项目组合优化的应用，但并未明确指出其在衍生品定价、金融风险管理或投资组合管理等特定金融领域的应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究群体多目标优化问题中的共识优化方法，虽然提到了项目组合优化的应用，但并未明确指出其在衍生品定价、金融风险管理或投资组合管理等特定金融领域的应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:09:12.524021"
}