{
  "paper": {
    "id": 3999,
    "title": "Classifying problematic gaming using a latent profile approach based on personality traits in Chinese young adolescent",
    "abstract": "BackgroundInternet gaming has gained widespread popularity in China, yet the classification of problematic gaming subtypes based on personality traits remains limited. This study aimed to employ latent profile analysis (LPA) to identify distinct groups of online gamers and compare key variables across these groups.MethodsAn online survey was conducted within 5593 internet gaming users, including a demographic questionnaire, queries on internet gaming usage, the Video Gaming Dependency Scale, and the Chinese Big Five Inventory-brief version. LPA was applied to identify distinct user groups, followed by an examination of associations between profile membership and auxiliary variables.ResultsLPA identified three gamer categories for problematic gaming: high-risk (64.78%), medium-risk (3.22%), and low-risk (32%). High-risk gamers allocated more time and financial resources to gaming for escapism and leisure purposes. The medium-risk group sought enjoyable experiences, exhibiting traits that were intermediate between the high- and low-risk groups. High-risk gamers demonstrated elevated levels of neuroticism, accompanied by lower scores in other Big Five personality traits. In contrast, medium-risk gamers scored low across all Big Five dimensions, while low-risk gamers achieved higher scores in all traits except neuroticism. Notably, the low-risk group reported forming the fewest new online friendships, despite sharing similar social motivations with the other groups.ConclusionTraits such as low neuroticism and high conscientiousness serve as protective factors against gaming addiction, while being unmarried or an only child provides additional safeguards. Conversely, increased time and financial investment in gaming activities are associated with a heightened risk of addiction. These findings are crucial for identifying high-risk gamers and informing the development of targeted interventions.",
    "year": 2025,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "0a18f46c009ebb7646eda9aa7bd89e82",
    "relevant_keywords": [
      "classification",
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T02:31:58.697243"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是基于人格特质对问题游戏玩家进行分类，属于心理学和行为科学领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是基于人格特质对问题游戏玩家进行分类，属于心理学和行为科学领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T14:24:24.281755"
}