{
  "paper": {
    "id": 6243,
    "title": "An empirical study of the determinants of UK oil and gas voluntary disclosures",
    "abstract": "Significant oil and gas firm market value is derived from their physical reserve quantum, assets which are not recorded on their statements of financial position. This article provides empirical evidence regarding voluntary disclosure of such reserves in line with the previously unresearched UK sector with regard to its unique reporting guidelines. The study considers both the reporting of the reserve quantum and the quality of that reporting. This article seeks to inform the International Accounting Standards Board's (IASB's) on-going consideration of mineral resource reporting. Listed companies are considered to evidence forms of reserve disclosure with a logistical regression approach applied to measure determinants of reporting. The risk associated with mineral reporting reserves is hypothesized as the key disclosure driver whilst controlling other relevant variables. The majority of firms disclosed reserve quantities in some form but only a minority disclosed in line with recommended practice, disclosure quality being more variable between companies. The findings indicate that a voluntary disclosure approach is ineffective, partially explained by agency related behaviour. Risk, proxied by the stage of production, drives reserve disclosure showing that producer firms are more likely to disclose reserve quantum balances and of a significantly higher quality.",
    "year": 2015,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "c8cde142628c5dc5ada95c287b2372b3",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:56:10.974221"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究英国石油和天然气公司自愿披露储备量的决定因素，属于会计和公司治理领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究英国石油和天然气公司自愿披露储备量的决定因素，属于会计和公司治理领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:28:30.914939"
}