{
  "paper": {
    "id": 76,
    "title": "Forecasting Chinese Stock Markets Volatility Based on Neural Network Combining",
    "abstract": "Volatility plays a key role in asset and portfolio management and derivatives pricing. As such, more accurate measures and better forecasts of volatility are crucial for the implementation and evaluation of asset and derivative pricing models in addition to trading and hedging strategies. However, whilst GARCH models are able to capture the observed clustering effect in asset price volatility, they appear to provide relatively poor out-of-sample forecasts. In order to improve volatility forecasts, we put forward three combining volatility forecasting methods through simple averaging, an ordinary least squares model and an artificial neural network using daily closing data of the Shanghai Stock Exchange Composite index. The empirical study reveals that combining volatility forecasting methods have better forecast performance, and the non-linear method simulated by neural network are especially superior.",
    "year": 2008,
    "source": "WOS",
    "area": "derivatives_pricing",
    "method": "machine learning",
    "cache_key": "0c04e6780b782bc255e99004095be82e",
    "relevant_keywords": [
      "neural network",
      "deep learning",
      "backpropagation",
      "BP"
    ],
    "stage1_timestamp": "2025-05-15T01:28:03.924287"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk",
      "Portfolio Management",
      "Derivatives Pricing"
    ],
    "justification": "该论文的核心技术是使用神经网络结合方法来预测股票市场的波动性。波动性预测在资产和投资组合管理、衍生品定价以及交易和对冲策略中起着关键作用。论文明确提到了波动性预测对于资产和衍生品定价模型的实施和评估的重要性，同时也提到了其在交易和对冲策略中的应用，这些都是金融风险管理、投资组合管理和衍生品定价的核心领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\", \"投资组合管理\", \"衍生品定价\"],\n  \"justification\": \"该论文的核心技术是使用神经网络结合方法来预测股票市场的波动性。波动性预测在资产和投资组合管理、衍生品定价以及交易和对冲策略中起着关键作用。论文明确提到了波动性预测对于资产和衍生品定价模型的实施和评估的重要性，同时也提到了其在交易和对冲策略中的应用，这些都是金融风险管理、投资组合管理和衍生品定价的核心领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:07:02.340095"
}