{
  "paper": {
    "id": 2459,
    "title": "Combinatorial Optimisation Algorithms for Strategic Biopharmaceutical Portfolio & Capacity Management",
    "abstract": "The development of a stochastic combinatorial multi-objective optimisation framework is presented which addresses the challenge of exploring large decision spaces while also capturing the multitude of decisions, trade-offs and uncertainties involved in R&D portfolio management. Detailed process economic models were linked to models of the drug development pathway to predict the technical, financial and risk implications of alternative strategies for portfolios of biopharmaceutical drugs proceeding through development. Machine learning and evolutionary computation techniques were harnessed to evolve strategies to multi-objective optimality. An industrially-relevant case study is presented that focuses on the following decisions for a portfolio of therapeutic antibodies: the portfolio composition, the scheduling of critical development and manufacturing activities, and the involvement of third parties for these activities. The impact of budgetary constraints on the optimal set of solutions is also illustrated.",
    "year": 2009,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "1bdc2b00b9655d99be64474dc8dbffe1",
    "relevant_keywords": [
      "machine learning",
      "evolutionary computation"
    ],
    "stage1_timestamp": "2025-05-15T02:15:27.115163"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是开发一个随机组合多目标优化框架，用于生物制药研发组合管理，包括组合构成、关键开发和生产活动的调度等决策。这属于投资组合管理的范畴，尽管是在生物制药领域，但其方法和目标与金融领域的投资组合管理高度相似。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Portfolio Management\"],\n  \"justification\": \"该论文的核心技术是开发一个随机组合多目标优化框架，用于生物制药研发组合管理，包括组合构成、关键开发和生产活动的调度等决策。这属于投资组合管理的范畴，尽管是在生物制药领域，但其方法和目标与金融领域的投资组合管理高度相似。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:42:26.609336"
}