{
  "paper": {
    "id": 2527,
    "title": "Markov regime-switching quantile regression models and financial contagion detection",
    "abstract": "In this paper, we propose a Markov regime-switching quantile regression model, which considers the case where there may exist equilibria jumps in quantile regression. The parameters are estimated by the maximum likelihood estimation (MLE) method. A simulation study of this new model is conducted covering many scenarios. The simulation results show that the MLE method is efficient in estimating the model parameters. An empirical analysis is also provided, which focuses on the detection of financial crisis contagion between United States and some European Union countries during the period of sub prime crisis from the angle of financial risk. The degree of financial contagion between markets is subsequently measured by utilizing the quantile regression coefficients. The empirical results show that in a crisis situation, the interdependence between United States and European Union countries dramatically increases. (C) 2015 Elsevier B.V. All rights reserved.",
    "year": 2016,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "8c3f33c20482cae016782df75c06d7a9",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:16:32.607378"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on detecting financial crisis contagion between markets using a Markov regime-switching quantile regression model, which is directly related to assessing and managing financial risks during crises.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on detecting financial crisis contagion between markets using a Markov regime-switching quantile regression model, which is directly related to assessing and managing financial risks during crises.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:41:34.312988"
}