{
  "paper": {
    "id": 1151,
    "title": "Financial Early Warning System Model Combining Hybrid Semantic Hierarchy with Group Method of Data Handling Neural Network for Detection of Banks' Risks",
    "abstract": "Banks, financial, and credit institutions encountering the weakening financial system and increased risk factors cause high inflation and great losses for an economy. Detecting financial risks in advance could help financial institutions avoid losses, and the financial system could be eventually affected less. Early warning systems for banks could be helpful to identify financial risks and take measures to deal with hazardous situations. Various approaches have already been put forward. However, inaccuracy issues in risk detection are one of the main issues. Combining semantic hierarchy with the GMDH neural network to predict financial risks is proposed. A semantic hierarchy approach based on converting risk-related values and picking influential variables could be practical in risk detection. Besides, the GMDH algorithm utilizing neural networks based on available data has the capability of predicting possible risks that could occur in the future. The outcomes of the proposed method when compared to non-data mining methods suggest that it improves accuracy by almost 20%.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "08f07b4f71346a5fc690a21338bde60f",
    "relevant_keywords": [
      "neural network",
      "deep learning",
      "representation learning"
    ],
    "stage1_timestamp": "2025-05-15T01:59:21.712443"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on developing an early warning system for detecting banks' financial risks using a hybrid semantic hierarchy and GMDH neural network, which is directly related to financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on developing an early warning system for detecting banks' financial risks using a hybrid semantic hierarchy and GMDH neural network, which is directly related to financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:51:40.370622"
}