{
  "paper": {
    "id": 3816,
    "title": "Risk Estimation With Composite Quantile Regression",
    "abstract": "New methods for the estimation of the popular risk measures expected shortfall (ES) and Value-at-Risk (VaR) are introduced. These are based on a novel variant of composite quantile regression (CQR), which allows for the simultaneous estimation of quantiles at several levels at once. An extensive simulation study is performed, along with a data analysis based on two major US market indices and two financial sector stocks. The results suggest that the method has a good finite sample performance. This is the first methodology to use CQR for risk estimation. (c) 2022 EcoSta Econometrics and Statistics. Published by Elsevier B.V. All rights reserved.",
    "year": 2025,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "c7e4966b92aa9c21df4860325345158d",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:30:28.620930"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper introduces new methods for estimating risk measures such as expected shortfall (ES) and Value-at-Risk (VaR), which are fundamental tools in financial risk management. The application of composite quantile regression (CQR) for risk estimation directly addresses the need for accurate risk assessment in financial markets, as evidenced by the analysis of US market indices and financial sector stocks.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper introduces new methods for estimating risk measures such as expected shortfall (ES) and Value-at-Risk (VaR), which are fundamental tools in financial risk management. The application of composite quantile regression (CQR) for risk estimation directly addresses the need for accurate risk assessment in financial markets, as evidenced by the analysis of US market indices and financial sector stocks.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:35:08.227045"
}