{
  "paper": {
    "id": 509,
    "title": "Testing the Application of Support Vector Machine (SVM) to Technical Trading Rules",
    "abstract": "The stock price movements result from many factors that are often difficult to be detected and modelled. The investigation of price trends and the use of the information available to evaluate investments and identify trading opportunities can be promising. However, financial data are non-stationary, i.e., their statistical characteristics constantly change. Therefore, the financial market is a challenging environment for the application of Machine Learning techniques, since they can only make reliable predictions to data consistent with what they have seen before. This paper test the use of a Machine Learning technique known as Support Vector Machines (SVM) aiming at being a tool to support the decision making process of trading at the stock market. SVM aggregates some input signals and, based on a set of technical indicators and historical price changes, create buy/sell recommendations of a given security as outputs. The dataset comprises several Brazilian stocks time-series traded on both the Brazilian (B3) and American (NYSE) stock exchange. These time-series belong to various economic sectors and present different market dynamics. The computational simulations are based on a fictitious strategy that does not consider the trading costs and only long positions are allowed. Using two risk-adjusted performance metrics, the results show that strategies based on the SVM model achieve better performance than the Buy & Hold benchmark.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "88cf1b29cf1f4f3e1e16130ab582b958",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM"
    ],
    "stage1_timestamp": "2025-05-15T01:51:31.351819"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究支持向量机（SVM）在股票市场交易决策支持中的应用，重点在于生成买卖建议，而非衍生品定价、金融风险管理或投资组合管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究支持向量机（SVM）在股票市场交易决策支持中的应用，重点在于生成买卖建议，而非衍生品定价、金融风险管理或投资组合管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:57:34.992861"
}