{
  "paper": {
    "id": 2777,
    "title": "A Forecasting Model of Financial Risk for Manufacturing Listed Companies in China",
    "abstract": "Manufacturing industry plays an important role in every country. At present, most of the ST companies in Shanghai and Shenzhen Stock Exchange are manufacturing companies. Therefore, it's very necessary to work out suitable prediction method. Selecting 27 specially treated manufacturing listed companies which are newly added in 2006 and their 27 corresponding manufacturing listed companies which are in normal financial conditions as the comparative samples, the present article makes use of 22 financial ratios based on public accounting data from 2003 to 2005 to analyze the most important financial ratios for forecasting the financial risk of manufacturing companies. After a series of tests such as K-S test, T test, M-W-W test, and collinearity diagnostics, a logistic regression model is set up, on the basis of which the article finally concludes that five financial ratios such as growth rate of net assets and net assets per share, etc, have very significant effects on judging whether a manufacturing listed company will plunge into financial risk, among them growth rate of net assets is the most significant one.",
    "year": 2008,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "72e8bbe7fe7d1cb390fc9606fef9ce07",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:19:08.421287"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on developing a logistic regression model to forecast financial risk for manufacturing listed companies, which is a direct application in the field of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on developing a logistic regression model to forecast financial risk for manufacturing listed companies, which is a direct application in the field of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:40:09.648460"
}