{
  "paper": {
    "id": 1630,
    "title": "FinBPM: A Framework for Portfolio Management-based Financial Investor Behavior Perception Model",
    "abstract": "The goal of portfolio management is to simultaneously maximize the accumulated return and also to control risk. In consecutive trading periods, portfolio manager needs to continuously adjust the portfolio weights based on the factors which can cause price fluctuation in the market. In the stock market, the factors affecting the stock price can be divided into two categories. The first is price fluctuations caused by irrational investment of the speculators. The second is endogenous value changes caused by operations of the company. In recent years, with the advancement of artificial intelligence technology, reinforcement learning (RL) algorithms have been increasingly employed by scholars to address financial problems, particularly in the area of portfolio management. However, the deep RL models proposed by these scholars in the past have focused more on analyzing the price changes caused by the investment behavior of speculators in response to technical indicators of actual stock prices. In this research, we introduce an RL-based framework called FinBPM, which takes both the factor pertaining to the impact on operations of the company and the factor of the irrational investment of the speculator into consideration. For our experimentation, we randomly selected 12 stocks from the Dow Jones Industrial Index to construct our portfolio. The experimental results reveal that, in comparison to conventional reinforcement learning methods, our approach with at least 13.26% increase over other methods compared. Additionally, it achieved the best Sharpe ratio of 2.77, effectively maximizing the return per unit of risk.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "283afc613966f262b32a296a8f7b5436",
    "relevant_keywords": [
      "reinforcement learning",
      "deep learning",
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T02:05:42.501028"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "The paper explicitly discusses the use of reinforcement learning to optimize portfolio weights, aiming to maximize returns and control risk, which are core objectives of portfolio management. The framework FinBPM is specifically designed for this purpose, as evidenced by the focus on adjusting portfolio weights based on market factors and the experimental setup involving stock selection from the Dow Jones Industrial Index.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Portfolio Management\"],\n  \"justification\": \"The paper explicitly discusses the use of reinforcement learning to optimize portfolio weights, aiming to maximize returns and control risk, which are core objectives of portfolio management. The framework FinBPM is specifically designed for this purpose, as evidenced by the focus on adjusting portfolio weights based on market factors and the experimental setup involving stock selection from the Dow Jones Industrial Index.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:47:20.299567"
}