{
  "paper": {
    "id": 1368,
    "title": "Research on optimization of an enterprise financial risk early warning method based on the DS-RF model",
    "abstract": "The financial risk early warning process of enterprises faces problems such as uncertainty and complexity. In the big data environment, scholars and enterprises that continue to use traditional evaluation methods will face large challenges. It is essential for an enterprise's sustainable operation to combine artificial intelligence algorithms, dynamically monitor its financial risks, and carry out financial risk early warning processes accurately and effectively. This study proposes an early warning method for corporate financial risks based on the evidence theory-random forest (DS-RF) model. The classic algorithm of machine learning-random forest was introduced into the framework of evidence theory to construct a random forest model with four dimensions: profitability, asset quality, debt risk, and operating growth. While predicting the risk, the credibility of the evidence was determined, and then the D-S synthesis rule was used for information fusion. An example was analyzed, taking JS Reclamation Group as the study subject. The comparison with the early warning results of the random forest algorithm and the traditional model shows that the DS-RF model proposed in this paper has a higher early warning accuracy and the results are presented more comprehensively and systematically, which effectively improves the efficiency of enterprise financial risk early warning and helps managers to make relevant decisions efficiently and scientifically.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "2b27362a99224fcf02c2c567b65a92df",
    "relevant_keywords": [
      "machine learning",
      "classification",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T02:02:22.653872"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on developing a financial risk early warning method for enterprises using the DS-RF model, which is aimed at improving the accuracy and efficiency of financial risk monitoring and decision-making. This directly pertains to the field of Financial Risk Management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on developing a financial risk early warning method for enterprises using the DS-RF model, which is aimed at improving the accuracy and efficiency of financial risk monitoring and decision-making. This directly pertains to the field of Financial Risk Management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:49:26.927665"
}