{
  "paper": {
    "id": 3170,
    "title": "An examination of green bonds as a hedge and safe haven for international equity markets",
    "abstract": "Green bonds are a type of fixed-income instrument that specifically designed to fund environ-mentally friendly projects. Investigating the performance of green bonds is essential to gain in-sights into the risk-return characteristics and dynamics within sustainable finance and their potential role in portfolio diversification. In this paper, we comprehensively examine the ability of green bonds to act as a hedge or a safe haven against nineteen international equity market movements (most of the G20 and Switzerland) over the 2014-2022 period. Using regression analysis, we find that green bonds had acted as a strong hedge for many countries but have lost such property for utmost after the COVID-19 outbreak, while they still provide safe haven benefit for many countries' equity indexes. By the use of a novel CAViaR-based TVP-VAR connectedness approach, we further examine the tail risk spillovers among green bond and international equities which extends the consideration in extreme loss (VaR) perspective. We show that the spillovers rapidly increased during the first wave of COVID-19 and has remained at relatively high level until recent days. In combination of all metrics, we argue that Saudi Arabia might be the only country that has received as good (or even better) protection from green bond in the post -pandemic era as (than) before. Overall, these should increase the attractiveness of green bonds as elements of a portfolio, enhancing the green transition.",
    "year": 2023,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "d09b597eebf147303944a0a7c79043ac",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:14:16.239406"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk",
      "Portfolio Management"
    ],
    "justification": "该论文研究了绿色债券作为对冲和避险工具的能力，以及它们在国际股票市场中的风险溢出效应，这直接涉及金融风险管理。同时，论文还探讨了绿色债券在投资组合多样化中的潜在作用，这属于投资组合管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\", \"投资组合管理\"],\n  \"justification\": \"该论文研究了绿色债券作为对冲和避险工具的能力，以及它们在国际股票市场中的风险溢出效应，这直接涉及金融风险管理。同时，论文还探讨了绿色债券在投资组合多样化中的潜在作用，这属于投资组合管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:10:35.625782"
}