{
  "paper": {
    "id": 188,
    "title": "Portfolio Selection Based on Hierarchical Clustering and Inverse-Variance Weighting",
    "abstract": "This paper presents a remarkable model for portfolio selection using inverse-variance weighting and machine learning techniques such as hierarchical clustering algorithms. This method allows building diversified portfolios that have a good balance sector exposure and style exposure, respect to momentum, size, value, short-term reversal, and volatility. Furthermore, we compare performance for seven hierarchical algorithms: Single, Complete, Average, Weighted, Centroid, Median and Ward Linkages. Results show that the Average Linkage algorithm has the best Cophenetic Correlation Coefficient. The proposed method using the best linkage criteria is tested against real data over a two-year dataset of one-minute American stocks returns. The portfolio selection model achieves a good financial return and an outstanding result in the annual volatility of 3.2%. The results suggest good behavior in performance indicators with a Sharpe ratio of 0.89, an Omega ratio of 1.16, a Sortino ratio of 1.29 and a beta to S&P of 0.26.",
    "year": 2019,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "8143c8dd39534dc27912e8398d51cebd",
    "relevant_keywords": [
      "machine learning",
      "unsupervised learning",
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T00:40:02.143550"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "The paper focuses on developing a portfolio selection model using hierarchical clustering and inverse-variance weighting, which is directly related to constructing and managing investment portfolios. The study evaluates performance metrics such as Sharpe ratio and volatility, which are key concerns in portfolio management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Portfolio Management\"],\n  \"justification\": \"The paper focuses on developing a portfolio selection model using hierarchical clustering and inverse-variance weighting, which is directly related to constructing and managing investment portfolios. The study evaluates performance metrics such as Sharpe ratio and volatility, which are key concerns in portfolio management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:32:52.896187"
}