{
  "paper": {
    "id": 2340,
    "title": "Optimizing trading company capital structure on the basis of using bankruptcy logistic models under conditions of economy digitalization",
    "abstract": "The publication gives consideration to the directions of using logistic models of bankruptcy of the companies in the algorithms of determining optimal capital structure on the basis of trade-off approach. A variant of determining company's financial distress costs has been offered proceeding from the bankruptcy risk assessment. The bankruptcy risk can be calculated on the basis of logistic regression models. Unlike the more widespread discriminate bankruptcy risk models, the bankruptcy risk models based on the logistic regression assess a probability of the bankruptcy risk occurrence. An algorithm of calculating the cost of financial distress has been offered proceeding from the risk level assessment. It will be possible to calculate the optimal level of company's debt burden on the basis of calculating this indicator in future. The suggested approach helps to take into account quite a great number of factors affecting the bankruptcy risk and use these data in the summarized form to determine the optimal level of the of company's debt burden.",
    "year": 2019,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "b70963b673e2e6577bc79b288aa7b385",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:14:19.623387"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on using logistic regression models to assess bankruptcy risk and optimize a company's capital structure, which is directly related to managing financial risks associated with bankruptcy and debt burden.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on using logistic regression models to assess bankruptcy risk and optimize a company's capital structure, which is directly related to managing financial risks associated with bankruptcy and debt burden.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:42:57.012680"
}