{
  "paper": {
    "id": 3526,
    "title": "Statistical models to infer gas end-use efficiency in individual dwellings using smart metered data",
    "abstract": "Residential buildings can significantly contribute to the European Union's 2020 efficiency energy targets. For this reason, energy distributors and suppliers are required to provide assistance to householders to reduce energy end-use. This paper develops statistical modelling methods that can be used by suppliers to infer the gas fuel efficiency of buildings in their residential portfolio, in order to deliver improved energy management services to consumers. The study begins by estimating individual statistical building energy models for a sample of consumers and presents the resulting distribution of independent parameters. These parameter distributions are then characterised by regression models using descriptive household data that is generally known by the consumer and can be easily gathered by the energy supply company. These models are then used to compare the inferred energy end-use efficiency of the household (cooking, hot-water and space heating) to similar dwellings. Buildings with higher-than-expected gas consumption can be targeted for energy efficiency programmes. (C) 2016 Elsevier Ltd. All rights reserved.",
    "year": 2016,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "047c736dd1c1f8a9ef2bd82085730e2e",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:17:54.175911"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究利用统计模型推断住宅建筑的燃气使用效率，以帮助能源供应商提供更好的能源管理服务。虽然使用了回归分析等统计方法，但其应用领域是能源效率管理，而非金融领域的衍生品定价、金融风险管理或投资组合管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究利用统计模型推断住宅建筑的燃气使用效率，以帮助能源供应商提供更好的能源管理服务。虽然使用了回归分析等统计方法，但其应用领域是能源效率管理，而非金融领域的衍生品定价、金融风险管理或投资组合管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:09:40.180054"
}