{
  "paper": {
    "id": 759,
    "title": "Electric Power Enterprise Financial Risk Evaluation Based On Rough Set and BP Network",
    "abstract": "The comprehensive evaluation problem of electric power listed corporation has always been a focus since Market-oriented reform of the electric power industry, and financial risk evaluation play a key role to science investment decision of electric power listed corporation This paper presents a new composite forecasting method for financial risk of electric power corporation, modeling and forecasting based on Rough Set and Back-propagation Neural Network model. Combing reality financial data of electric power listed corporation and using Rough Set theory to select financial indexes, which are as modeling variables, then establishing financial risk estimation model based on Back-propagation Neural Network. Through training for the financial data, it shows that this model has a high accuracy to the results of financial risks evaluation, and it offers effective technical support to financial risk evading of electric power enterprise.",
    "year": 2008,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "dce2934ae3c8f9a2748ff34a07175bda",
    "relevant_keywords": [
      "neural network",
      "backpropagation",
      "BP"
    ],
    "stage1_timestamp": "2025-05-15T01:54:34.168784"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on developing a composite forecasting method for financial risk evaluation of electric power corporations using Rough Set and Back-propagation Neural Network models. The primary goal is to provide technical support for financial risk evasion, which clearly falls under the domain of Financial Risk Management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on developing a composite forecasting method for financial risk evaluation of electric power corporations using Rough Set and Back-propagation Neural Network models. The primary goal is to provide technical support for financial risk evasion, which clearly falls under the domain of Financial Risk Management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:55:22.875759"
}