{
  "paper": {
    "id": 1532,
    "title": "ENHANCING TRUST IN DIGITAL FINANCE: BLOCKCHAIN AND AI FOR SECURE AND TRANSPARENT FINTECH SOLUTIONS",
    "abstract": "The rapid advancement of financial technology (FinTech) has brought significant innovations while raising concerns about security, transparency, and trust. This study explores how blockchain and artificial intelligence (AI) enhance trust in digital finance by strengthening security, improving fraud detection, and ensuring regulatory compliance. This study systematically reviews the integration of blockchain and AI in financial operations using a qualitative research approach. The findings indicate that blockchain enhances transaction security through decentralization and immutability, while AI significantly improves fraud detection and risk assessment through predictive analytics and machine learning. These advancements are driven by blockchain's ability to ensure data integrity and AI's capacity to analyse vast datasets in real time. This research highlights the potential of these technologies to boost consumer confidence, promote financial inclusion, and enhance the resilience of digital financial systems. However, regulatory complexities, high integration costs, and interoperability issues must be addressed to enable broader adoption.",
    "year": 2025,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "e891447be1533a7e1bd7f2be46fbaf0d",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T02:04:20.068623"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要探讨区块链和人工智能在增强数字金融安全和透明度方面的应用，如欺诈检测和风险分析，但并未明确指出这些技术应用于衍生品定价、金融风险管理或投资组合管理等特定金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要探讨区块链和人工智能在增强数字金融安全和透明度方面的应用，如欺诈检测和风险分析，但并未明确指出这些技术应用于衍生品定价、金融风险管理或投资组合管理等特定金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T14:24:23.351319"
}