{
  "paper": {
    "id": 2518,
    "title": "Quantile regression, VaR and CVAR. An empirical beta comparison of the techniques in relation to credit risk.",
    "abstract": "This study focuses on the credit risk of Australian financial institutions relative to that of the US. These two countries are chosen because the study is undertaken in Australia, and because Australia is widely considered to have fared far better than the US during the Global Financial (GFC) in terms of both share market volatility and credit defaults, our comparison involves two countries experiencing very different circumstances. The key questions addressed by the paper are firstly, the extent to which the credit risk of Australian financial institutions compares favourably (or otherwise) to the US, and secondly whether credit risk of financial institutions increases (decreases) in a similar fashion over varying time periods. As part of the analysis we will look at a number of aspects. Firstly we will examine the relative financial institution capital levels of the two countries. Although bank capital covers a number of different risks, credit risk is an extremely important component of capital adequacy, and higher credit risk should be reflected in higher capital levels. Secondly we will examine relative levels of credit risk for these countries using nonperforming loans and fluctuating asset values, applying various metrics, including Value at Risk (VaR), Conditional Value at Risk (CVaR) and quantile regression. Following the Global Financial Crisis, there has been much criticism leveled at risk management techniques which measure volatility below a specified threshold. One such technique is Value at Risk (VaR). A major criticism is VaR says nothing of the risk beyond that threshold. Conditional Value at Risk (CVaR), on the other hand, measures extreme risk, those risks beyond VaR. Quantile regression divides a dataset into parts, allowing the extreme quantiles to be isolated and measured. Using these techniques, we compare the credit risk of two data sets (US and Australia) over an eleven year time period from 2004 to 2014. This period includes a range of economic circumstances, spanning pre-GFC, GFC and post-GFC. For credit risk we use non-performing loans, as well as a Merton type model which measures volatility in the market asset values of borrowers. We derive a beta which measures credit risk relative to a benchmark. We then compare relative beta changes over time for the two countries. There are a number of important elements and findings highlighted by the paper. Firstly, on an absolute capital basis (equity to assets), as measured by the World Bank, Australian financial institutions have low capital in comparison to their global peers, with a capital ratio that is about half that of US banks. However, the ratio improves substantially on a risk-weighted basis (per the Basel approach), to one that is much closer to US Banks. Australian Banks have a very high home loan component, with home loans attracting a low risk weighting for capital adequacy requirements. Thus there is a much bigger differential between absolute capital ratios and risk weighted capital ratios for Australia than for the US. Secondly the credit risk of Australian financial institutions as measured by the World Bank for non-performing loans is very low in relation to global banks, and is about half that of the US. Thirdly, when we apply measurements such as VaR, CVaR and quantlile regression to non-performing assets and conduct a Beta analysis to measure fluctuations in credit risk, we find that risk for Australian financial institutions moves in line with that of the US. During the GFC, the risk for Australia increased by very similar levels to that of the US, although off a much smaller base. The findings can be important to banks and regulators in understanding credit risk in these countries as well as choosing modelling techniques which are able to measure extreme risk and respond to changing economic circumstances, and thus provide early warning signs of changes in credit risk.",
    "year": 2015,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "94f119618bb33cd08df2d87d029ec776",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:16:32.570829"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on measuring and comparing credit risk between Australian and US financial institutions using techniques like Value at Risk (VaR), Conditional Value at Risk (CVaR), and quantile regression. These methods are primarily used in financial risk management to assess and mitigate potential losses.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on measuring and comparing credit risk between Australian and US financial institutions using techniques like Value at Risk (VaR), Conditional Value at Risk (CVaR), and quantile regression. These methods are primarily used in financial risk management to assess and mitigate potential losses.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:41:34.814288"
}