{
  "paper": {
    "id": 1536,
    "title": "Investigating the determinants of Chinese residents' intention to purchase green housing: a dual-stage structural equation modeling-artificial neural network approach",
    "abstract": "Despite the rapid development of green housing, significant challenges remain, including limited market demand. Accordingly, this research aims to elucidate the pivotal antecedents that influence residents' perceived value and purchase intention with regard to green housing. The hybrid structural equation modeling and artificial neural network method is employed to validate the research model developed from the perceived value theory and the attitude-behavior-condition theory. The results indicated that perceived functional benefit, perceived emotional benefit, publicity education, administrative regulation and social atmosphere have significant relationships with both perceived value and purchase intention. In addition, perceived social benefit and perceived performance risk only significantly impact perceived value, whereas perceived financial risk and financial incentive only significantly affect purchase intention. The artificial neural network method results showed that social atmosphere is the most crucial driver for perceived value, while perceived value is the strongest determinant for purchase intention. The theoretical contribution of the present study lies in the development of an integrated model that incorporates both psychological perception factors and external contextual factors, while also providing rigorous empirical evidence through the utilization of two statistical techniques. Moreover, this study presents insightful implications for policymakers and industry practitioners regarding the key determinants of green housing acceptance.",
    "year": 2025,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "afc61028e405e999d1f286033674df90",
    "relevant_keywords": [
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T02:04:20.085698"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究中国居民购买绿色住房的意愿影响因素，虽然提到了金融风险（financial risk），但这是作为影响购买意愿的一个因素，而非论文的核心技术或研究目标。论文的核心技术是结构方程模型和人工神经网络方法，用于分析消费者行为，而非应用于衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究中国居民购买绿色住房的意愿影响因素，虽然提到了金融风险（financial risk），但这是作为影响购买意愿的一个因素，而非论文的核心技术或研究目标。论文的核心技术是结构方程模型和人工神经网络方法，用于分析消费者行为，而非应用于衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:48:21.505316"
}