{
  "paper": {
    "id": 3655,
    "title": "Understanding of Macro Factors That Affect Yield of Government Bonds",
    "abstract": "Government bonds are one of the safest and most attractive instruments in the investment portfolio for private investors and investment funds. Although bonds are perceived as an alternative to bank deposits, a number of macroeconomic factors influence their yield. The goal of the research is to investigate the relationship between macroeconomic factors and the yield of government bonds. We use regression models on a dataset of 22 countries with post-industrial economics for ten years. The main criteria for selecting countries are membership in the Organization for Economic Cooperation and Development and inclusion in the Top-25 countries on the competitiveness index. The results revealed a negative association between the yield of government bonds and gold. Moreover, we indicate a positive association between the yield of government bonds and the following indicators-inflation, oil prices, and GDP per capita. In the case of the influence of population savings and the uncertainty index, we obtain inconclusive results. The study contributes to ongoing research in the field of financial management with respect to investigating determinants of the yield of government bonds.",
    "year": 2022,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "b19fcd3569ca1a95b344e5074a975a93",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:19:26.151790"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文研究了宏观经济因素对政府债券收益率的影响，这对于投资者在构建和管理投资组合时评估债券投资的风险和回报具有直接的应用价值。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文研究了宏观经济因素对政府债券收益率的影响，这对于投资者在构建和管理投资组合时评估债券投资的风险和回报具有直接的应用价值。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:09:15.583265"
}