{
  "paper": {
    "id": 90,
    "title": "Intelligent Feature Selection with Deep Learning Based Financial Risk Assessment Model",
    "abstract": "Due to global financial crisis, risk management has received significant attention to avoid loss and maximize profit in any business. Since the financial crisis prediction (FCP) process is mainly based on data driven decision making and intelligent models, artificial intelligence (AI) and machine learning (ML) models are widely utilized. This article introduces an intelligent feature selection with deep learning based financial risk assessment model (IFSDL-FRA). The proposed IFSDL-FRA technique aims to determine the financial crisis of a company or enterprise. In addition, the IFSDL-FRA technique involves the design of new water strider optimization algorithm based feature selection (WSOA-FS) manner to an optimum selection of feature subsets. Moreover, Deep Random Vector Functional Link network (DRVFLN) classification technique was applied to properly allot the class labels to the financial data. Furthermore, improved fruit fly optimization algorithm (IFFOA) based hyperparameter tuning process is carried out to optimally tune the hyperparameters of the DRVFLN model. For enhancing the better performance of the IFSDL-FRA technique, an extensive set of simulations are implemented on benchmark financial datasets and the obtained state of art approaches.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "deep learning",
    "cache_key": "9769ffe39aa80d9abd71464c642f6562",
    "relevant_keywords": [
      "machine learning",
      "classification",
      "feature learning",
      "neural network",
      "deep learning",
      "representation learning"
    ],
    "stage1_timestamp": "2025-05-15T01:33:49.036730"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on developing a financial risk assessment model to predict financial crises in companies, which is a core aspect of financial risk management. The proposed techniques, including feature selection and classification, are specifically aimed at improving risk assessment accuracy.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on developing a financial risk assessment model to predict financial crises in companies, which is a core aspect of financial risk management. The proposed techniques, including feature selection and classification, are specifically aimed at improving risk assessment accuracy.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:04:45.330089"
}