{
  "paper": {
    "id": 870,
    "title": "Forecasting Crude Oil Risk Using a Multivariate Multiscale Convolutional Neural Network Model",
    "abstract": "In light of the increasing level of correlation and dependence between the crude oil markets and the external influencing factors in the related financial markets, we propose a new multivariate empirical decomposition convolutional neural network model to incorporate the external influence of financial markets such as stock market and exchange market in a multiscale setting into the modeling of crude oil market risk movement. We propose a multivariate empirical model decomposition to analyze the finer details of interdependence among risk movement of different markets across different time horizons or scales. We also introduce the convolutional neural network to construct a new nonlinear ensemble algorithm to reduce the estimation bias and improve the forecasting accuracy. We used the major crude oil price data, stock market index, and the euro/United States dollar exchange rate data to evaluate the performance of the multivariate empirical model decomposition convolutional neural network model. The combination of both the multivariate empirical model decomposition and the convolutional neural network model in this paper has produced the risk forecasts with significantly improved risk forecasting accuracy.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "2ee28fd2cec473aba8efc8f3af4dad79",
    "relevant_keywords": [
      "machine learning",
      "neural network",
      "deep learning",
      "convolutional neural network",
      "CNN"
    ],
    "stage1_timestamp": "2025-05-15T01:56:17.472464"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用多元多尺度卷积神经网络模型来预测原油市场风险变动，并整合了股票市场和外汇市场的外部影响。研究目标是提高风险预测的准确性，这直接属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是使用多元多尺度卷积神经网络模型来预测原油市场风险变动，并整合了股票市场和外汇市场的外部影响。研究目标是提高风险预测的准确性，这直接属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:54:13.817958"
}