{
  "paper": {
    "id": 868,
    "title": "Arbitrage pricing theory-based Gaussian temporal factor analysis for adaptive portfolio management",
    "abstract": "Ever since the inception of Markowitz's modem portfolio theory, static portfolio optimization techniques were gradually phased out by dynamic portfolio management due to the growth of popularity in automated trading. In view of the intensive computational needs, it is common to use machine learning approaches on Sharpe ratio maximization for implementing dynamic portfolio optimization. In the literature, return-based approaches which directly used security prices or returns to control portfolio weights were often used. Inspired by the arbitrage pricing theory (APT), some other efforts concentrate on indirect modelling using hidden factors. On the other hand, with regard to the proper risk measure in the Sharpe ratio, downside risk was considered a better substitute for variance. In this paper, we investigate how the Gaussian temporal factor analysis (TFA) technique can be used for portfolio optimization. Since TFA is based on the classical APT model and has the benefit of removing rotation indeterminacy via temporal modelling, using TFA for portfolio management allows portfolio weights to be indirectly controlled by several hidden factors. Moreover, we extend the approach to some other variants tailored for investors according to their investment objectives and degree of risk tolerance. (C) 2003 Elsevier B.V. All rights reserved.",
    "year": 2004,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "3fbc8dbc66d1e114665fa8323009435e",
    "relevant_keywords": [
      "machine learning",
      "principal components analysis",
      "feature representation"
    ],
    "stage1_timestamp": "2025-05-15T00:49:03.160704"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是使用高斯时间因子分析（TFA）技术进行投资组合优化，并讨论了如何根据投资者的目标和风险承受度调整投资组合权重。这明确属于投资组合管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是使用高斯时间因子分析（TFA）技术进行投资组合优化，并讨论了如何根据投资者的目标和风险承受度调整投资组合权重。这明确属于投资组合管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:26:49.096021"
}