{
  "paper": {
    "id": 1100,
    "title": "Systemic Risk Identification, Modelling, Analysis, and Monitoring: An Integrated Approach",
    "abstract": "Over the last fifteen years, computational intelligence applications have proliferated solutions to financial engineering problems, bringing a new fertile area of collaboration between professional engineering and financial communities. Computational systems based on machine learning techniques have become indispensable in virtually all financial applications, from portfolio selection to proprietary trading and risk management. The new challenges for the financial community involve working with the abundance of data from a variety of types that were not previously available and could now help solve financial problems proven hard to solve earlier. The bar has been raised with new regulatory, and compliance and risk management requirements. As the field is intensively evolving, we need a new set of tools and methods to face the challenges posed.",
    "year": 2014,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "16e540a45dfaa1d948a8b046ad9f2927",
    "relevant_keywords": [
      "machine learning"
    ],
    "stage1_timestamp": "2025-05-15T01:58:43.499301"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on systemic risk identification, modeling, analysis, and monitoring, which are core aspects of financial risk management. It also mentions the use of machine learning techniques to address new regulatory and compliance requirements in risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on systemic risk identification, modeling, analysis, and monitoring, which are core aspects of financial risk management. It also mentions the use of machine learning techniques to address new regulatory and compliance requirements in risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:52:01.072201"
}