{
  "paper": {
    "id": 2588,
    "title": "Risk scenario-based value estimation of Bitcoin",
    "abstract": "The wild swings in Bitcoin's valuation keep attracting authorities' and policy-makers interest. Thus at present, many researchers are focus on analyzing and forecasting. The existing studies on Bitcoin price prediction are mainly in two ways: (1) study how economic factors, market and investor sentiment indicators influence Bitcoin price; (2) apply machine learning and artificial neural networks to predict the value of Bitcoin. This paper aims to implement a scenario analysis method to generate various hypothetical events and then determine their effects on the value of Bitcoin price. Scenario analysis is normally used to measure financial risk. In this paper, we propose a method that combines scenario analysis with historical data. We further aim to find the correlations among scenarios and examine the relationship between the significant shocks and Bitcoin prices. Our findings suggest that what-if analysis is a good way to measure the risk exposure of Bitcoin. The method can also be used for worse-scenario analysis to check how Bitcoin performs during crisis periods. (C) 2021 The Authors. Published by Elsevier B.V.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "3a21b900c9f7e87aab83899a593dbd9e",
    "relevant_keywords": [
      "machine learning",
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T02:17:01.698353"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on implementing a scenario analysis method to measure the risk exposure of Bitcoin and examines the relationship between significant shocks and Bitcoin prices, which is a core aspect of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on implementing a scenario analysis method to measure the risk exposure of Bitcoin and examines the relationship between significant shocks and Bitcoin prices, which is a core aspect of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:41:08.496180"
}