{
  "paper": {
    "id": 352,
    "title": "Deep learning for decision making and the optimization of socially responsible investments and portfolio",
    "abstract": "A socially responsible investment portfolio takes into consideration the environmental, social and governance aspects of companies. It has become an emerging topic for both financial investors and researchers recently. Traditional investment and portfolio theories, which are used for the optimization of financial investment portfolios, are inadequate for decision-making and the construction of an optimized socially responsible investment portfolio. In response to this problem, we introduced a Deep Responsible Investment Portfolio (DRIP) model that contains a Multivariate Bidirectional Long Short-Term Memory neural network, to predict stock returns for the construction of a socially responsible investment portfolio. The deep reinforcement learning technique was adapted to retrain neural networks and rebalance the portfolio periodically. Our empirical data revealed that the DRIP framework could achieve competitive financial performance and better social impact compared to traditional portfolio models, sustainable indexes and funds.",
    "year": 2019,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "3eed3176ad285db16abf6c7c16e9b840",
    "relevant_keywords": [
      "machine learning",
      "reinforcement learning",
      "deep learning",
      "neural network",
      "long short-term memory",
      "LSTM"
    ],
    "stage1_timestamp": "2025-05-15T00:42:32.468575"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是使用深度学习和强化学习来优化社会责任投资组合的构建和再平衡，这直接属于投资组合管理的范畴。论文明确提到使用神经网络预测股票收益并构建投资组合，以及定期重新平衡投资组合，这些都是投资组合管理的典型应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是使用深度学习和强化学习来优化社会责任投资组合的构建和再平衡，这直接属于投资组合管理的范畴。论文明确提到使用神经网络预测股票收益并构建投资组合，以及定期重新平衡投资组合，这些都是投资组合管理的典型应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:31:39.121349"
}