{
  "paper": {
    "id": 1933,
    "title": "Systemic Financial Risk Forecasting: A Novel Approach with IGSA-RBFNN",
    "abstract": "Accurate measurement of systemic financial risk is crucial for maintaining the stability of financial markets. Taking China as the subject of investigation, the Chinese Financial Stress Index (CFSI) indicator system was constructed by integrating six dimensions and employing Gray Relation Analysis (GRA) to reduce the dimensionality of the indicators. The CFSI was derived using the Attribute Hierarchy Model (AHM) method with the Criteria Importance Through the Intercriteria Correlation (CRITIC) method, and an Improved Gravitational Search Algorithm (IGSA)-optimized Radial Basis Function Neural Network (RBFNN) was proposed for out-of-sample prediction of CFSI trends from 2024 to 2026. By analyzing the trends in financial pressure indicators, the intricate relationship between financial pressure and economic activity can be effectively discerned. The research findings indicate that (1) the CFSI is capable of accurately reflecting the current financial stress situation in China, and (2) the IGSA-RBFNN demonstrates strong robustness and generalization capabilities, predicting that the CFSI index will reach a peak value of 0.543 by the end of 2024, and there exists a regular pattern of stress rebound towards the end of each year. The novel methodology enables policymakers and regulatory authorities to proactively identify potential risks and vulnerabilities, facilitating the formulation of preventive measures.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "cca7ee278920509c5ebfed47960697e1",
    "relevant_keywords": [
      "machine learning",
      "neural network",
      "deep learning",
      "representation learning",
      "backpropagation",
      "BP",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T02:09:14.359767"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on the accurate measurement and prediction of systemic financial risk using a novel machine learning approach, specifically targeting the construction and forecasting of the Chinese Financial Stress Index (CFSI). This directly pertains to the identification and management of financial risks, which is a core aspect of Financial Risk Management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on the accurate measurement and prediction of systemic financial risk using a novel machine learning approach, specifically targeting the construction and forecasting of the Chinese Financial Stress Index (CFSI). This directly pertains to the identification and management of financial risks, which is a core aspect of Financial Risk Management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:45:11.541704"
}