{
  "paper": {
    "id": 4635,
    "title": "Structural equation model of construction contract dispute potential",
    "abstract": "This paper presents the results of a structural equation model (SEM) for describing and quantifying the fundamental factors that affect contract disputes between owners and contractors in the construction industry. Through this example, the potential impact of SEM analysis in construction engineering and management research is illustrated. The purpose of the specific model developed in this research is to explain how and why contract related construction problems occur. This study builds upon earlier work, which developed a disputes potential index, and the likelihood of construction disputes was modeled using logistic regression. In this earlier study, questionnaires were completed on 159 construction projects, which measured both qualitative and quantitative aspects of contract disputes, management ability, financial planning, risk allocation, and project scope definition for both owners and contractors. The SEM approach offers several advantages over the previously employed logistic regression methodology. The final set of structural equations provides insight into the interaction of the variables that was not apparent in the original logistic regression modeling methodology.",
    "year": 2000,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "7b4d501534fc33fc936322eaa00ac20f",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:39:26.981310"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究建筑行业中的合同纠纷潜在因素，使用结构方程模型（SEM）来分析合同纠纷的根本原因，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究建筑行业中的合同纠纷潜在因素，使用结构方程模型（SEM）来分析合同纠纷的根本原因，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:32:21.637649"
}