{
  "paper": {
    "id": 340,
    "title": "The Effectiveness of Supervised Learning Models in Detection of Pump and Dump Activity in Dogecoin",
    "abstract": "B Investment into hazardous assets should always be made with caution, if not avoided completely by risk-averse groups, such as the older workforce. However, as society and technology advance, it becomes almost impossible for regulators to make effective enough laws to mitigate the risk of newly invented financial instruments, such as cryptocurrency. This paper analyzed how effective are modern data science techniques: supervised learning models, such as random forest, K Nearest Neighbors, decision tree, combined with bagging and stacking techniques, could be used to catch the notorious pump and dump activities in the Dogecoin market, which is the cryptocurrency that had a close to positive infinity return in May 2021 during the COVID-19 pandemic. This paper concluded that random forest algorithm, when trained with a five-folded cross-validation technique, could reach an out-of-sample testing accuracy of 100%. Furthermore, the F1 score of 0.84101, precision score of 0.94402, and recall score of 0.77700 could alleviate one's concern about overfitting. In conclusion, the model results suggest modern supervised learning techniques are quite effective in catching suspicious activities in modern financial instruments.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "fd394811799a8f5b8792f8a30341a171",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "decision tree",
      "random forest",
      "K Nearest Neighbors",
      "bagging",
      "stacking"
    ],
    "stage1_timestamp": "2025-05-15T01:49:41.054265"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用监督学习模型检测Dogecoin市场中的pump and dump活动，这属于识别和防范金融欺诈行为，是金融风险管理的重要组成部分。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是使用监督学习模型检测Dogecoin市场中的pump and dump活动，这属于识别和防范金融欺诈行为，是金融风险管理的重要组成部分。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:59:02.170431"
}