{
  "paper": {
    "id": 8148,
    "title": "Demonstration of an End-To-End Workflow Using Atmospheric Solids Analysis Probe-Mass Spectrometry (ASAP-MS) With Real-Time Sample Recognition Software for the Identification of Falsified and Substandard Pharmaceutical Tablets",
    "abstract": "Counterfeit pharmaceuticals are a subclass of falsified and substandard medicines. They are illicit products, purporting to be genuine medicines, that are made and sold by criminal organisations. They represent a significant risk to patient safety, as well as a financial and reputational threat to the companies who make the genuine medicines. It is essential to have analytical methods to determine if suspect samples seized by law enforcement agencies are counterfeit, with mass spectrometry (MS) being a commonly used technique in forensic cases. Speed-to-answer is vital to enable law enforcement agencies to progress investigations, as well as for pharmaceutical companies so that they can notify health authorities of the circulation of counterfeit medicines. In this work, an atmospheric solids analysis probe (ASAP)-MS was assessed as a fast and simple-to-use approach to analyse tablets on a commercially available instrument. Complementing the analytics with real-time sample recognition software demonstrated that the classification of tablets as authentic or counterfeit could be achieved quickly (< 2 min) and without the need for MS interpretation skills. Authentication of five tablets (two authentic pharmaceuticals, one placebo and two counterfeits containing the correct active pharmaceutical ingredient [API] but at lower quantities than in the genuine medicine and with different excipient contents) of unknown origin was achieved with 100% success. This creates the opportunity to deploy the end-to-end workflow as a tool for non-scientists, such as law enforcement officers and border control staff, for use in-territory to obtain fast answers and make data-led decisions to control the illegal trading of medicines.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "2ea2c0a7329de8b1f09f9164cdbe4753",
    "relevant_keywords": [
      "classification"
    ],
    "stage1_timestamp": "2025-05-15T03:15:38.437255"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是使用大气固体分析探针质谱（ASAP-MS）和实时样品识别软件来识别伪造和劣质药品，其核心技术应用于法医和药品安全领域，与金融研究领域无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是使用大气固体分析探针质谱（ASAP-MS）和实时样品识别软件来识别伪造和劣质药品，其核心技术应用于法医和药品安全领域，与金融研究领域无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:25:54.008425"
}