{
  "paper": {
    "id": 2515,
    "title": "Coarse Graining on Financial Correlation Networks",
    "abstract": "Community structure detection is an important and valuable task in financial network studies as it forms the basis of many statistical applications such as prediction, risk analysis, and recommendation. Financial networks have a natural multi-grained structure that leads to different community structures at different levels. However, few studies pay attention to these multi-part features of financial networks. In this study, we present a geometric coarse graining method based on Voronoi regions of a financial network. Rather than studying the dense structure of the network, we perform our analysis on the triangular maximally filtering of a financial network. Such filtered topology emerges as an efficient approach because it keeps local clustering coefficients steady and it underlies the network geometry. Moreover, in order to capture changes in coarse grains geometry throughout a financial stress, we study Haantjes curvatures of paths that are the farthest from the center in each of the Voronoi regions. We performed our analysis on a network representation comprising the stock market indices BIST (Borsa Istanbul), FTSE100 (London Stock Exchange), and Nasdaq-100 Index (NASDAQ), across three financial crisis periods. Our results indicate that there are remarkable changes in the geometry of coarse grains.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "33039f364499b8e1eb45dd49356f0d38",
    "relevant_keywords": [
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T02:16:32.561796"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文研究了金融网络中的社区结构检测及其在金融压力期间的变化，这些分析可以用于风险分析和预测，属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文研究了金融网络中的社区结构检测及其在金融压力期间的变化，这些分析可以用于风险分析和预测，属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:41:35.063721"
}