{
  "paper": {
    "id": 964,
    "title": "Unsupervised machine learning to reveal South African risk behaviour archetypes in the domain of discretionary investment decisions",
    "abstract": "The mediated risk models of decision making under conditions of risk propose that individuals' recent experiences of investments can lead to them making investment switching decisions that would be different to those based on their long term risk preferences. This study used the medoids clustering algorithm applied to a large, novel, dataset to identify four statistically significant patterns of switching behaviour based on the dimensions highlighted by this body of theory. Individual decision makers exhibit three consistent patterns or archetypes of risk-seeking (termed 'assertive'), loss aversion (termed 'anxious') and risk aversion (termed 'avoider') behaviour over most time periods. Each consistent behaviour pattern is, however, susceptible to temporary deviations from 'normal' behaviour. Loss averse investors are on occasion drawn into both risk averse and risk seeking behaviour. Similarly, risk seeking investors are sometimes drawn into both loss averse and risk averse switching behaviour. This provides evidence to support the mediated perspective on risk-based decision-making behaviour and demonstrates the viability of this machine learning-based method for segmenting investors from a financial advice, marketing, and communications perspective. (c) 2022 Elsevier B.V. All rights reserved.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "87bae6cd142f2e4caf2969079628419a",
    "relevant_keywords": [
      "machine learning",
      "unsupervised learning",
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T01:57:29.802537"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文主要研究投资者在投资决策中的风险行为模式，通过无监督学习识别投资者的风险偏好和行为偏差，这些研究内容直接关联到投资组合管理中的投资者行为分析和资产配置策略。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文主要研究投资者在投资决策中的风险行为模式，通过无监督学习识别投资者的风险偏好和行为偏差，这些研究内容直接关联到投资组合管理中的投资者行为分析和资产配置策略。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:53:05.996115"
}