{
  "paper": {
    "id": 394,
    "title": "Construction of Artificial Intelligence Application Model for Supply Chain Financial Risk Assessment",
    "abstract": "An artificial intelligence integrated application model of supply chain financial risk assessment is constructed. Based on the financial data and supply chain data of listed companies in China's new energy electric vehicle industry, the supply chain financial credit risk evaluation index system is constructed. The data samples are preprocessed by PCA as the input data of the support vector machine, which effectively solves the problem of high-dimensional data in supply chain finance. By improving the inertia weight of particle swarm optimization and introducing mutation operation, a dynamic mutation particle swarm optimization algorithm is proposed to avoid the problem of particles falling into a local minimum in the process of optimization. Finally, the improved optimization algorithm is used to optimize the parameters of SVM and input AdaBoost integration as a weak classifier to build an integrated model with good performance in many aspects. The model has been successfully applied to the credit risk assessment of China's new energy vehicle supply chain finance. The comparison with other models shows that the constructed model has certain advantages in performance.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "3fdb9c27c4173e74e703cf700d9f8077",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM",
      "principal components analysis",
      "feature learning",
      "feature representation"
    ],
    "stage1_timestamp": "2025-05-15T01:50:14.084328"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是构建一个基于人工智能的供应链金融风险评估模型，并成功应用于中国新能源汽车供应链金融的信用风险评估。这直接属于金融风险管理的范畴，特别是信用风险管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是构建一个基于人工智能的供应链金融风险评估模型，并成功应用于中国新能源汽车供应链金融的信用风险评估。这直接属于金融风险管理的范畴，特别是信用风险管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:58:26.908901"
}