{
  "paper": {
    "id": 3430,
    "title": "Disentangling the drivers of renewable energy investments: The role of behavioral factors",
    "abstract": "The scope of this study is to investigate the main determinants of renewable energy investments in Greece. For this reason, we build an appropriate framework to infer the decision-making process in the renewable energy sources (RES). The main drivers are then categorized under two groups as economic, and behavioral ones. In the next stage, we rely on binomial (logit and probit) and quantile regression analysis to estimate the impact of these factors on investment decisions towards RES. Our findings indicate that investors who gain better access to knowledge and exhibit a more positive attitude towards the contribution of artificial intelligence (AI) on the RES industry have a higher share of renewables in their portfolio. We argue that these investors are willing to invest a higher amount in the RES industry today. At the same time, quantile regression models illustrate that this relationship is nonmonotonic (i.e., inverted U shaped curve), arguing that positive attitudes towards the contribution of behavioral factors on RES are not adequate to encourage investments after crossing a certain point (threshold). Based on the empirical findings, we argue that the message to policymakers and government officials is to promote a faster penetration of low carbon technologies to achieve sustainable economic and social growth.",
    "year": 2020,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "ca0f8e05a1f5c9188ed9ce2489510111",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:16:55.579664"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究可再生能源投资的决定因素，包括经济和行为因素，并使用了回归分析方法。虽然提到了投资组合中的可再生能源份额，但研究重点在于投资决策的驱动因素，而非投资组合管理本身。因此，该论文不属于上述任何一个特定的金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究可再生能源投资的决定因素，包括经济和行为因素，并使用了回归分析方法。虽然提到了投资组合中的可再生能源份额，但研究重点在于投资决策的驱动因素，而非投资组合管理本身。因此，该论文不属于上述任何一个特定的金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:09:45.180159"
}