{
  "paper": {
    "id": 1263,
    "title": "The impact of technology optimisation incorporating machine learning algorithms on the financial sustainability of new energy companies",
    "abstract": "New energy companies in the industry have differences in financial performance from traditional companies. To help new energy companies develop sustainably, it is necessary to analyse and monitor their financial characteristics. To optimise the financial technology of new energy enterprises, this research uses GoogleNet convolutional neural network to construct a financial risk analysis model, which can judge financial risks and issue early warnings based on enterprise financial data. The experimental results of the financial risk analysis model show that the test loss value of the model is as low as 2.97%, which is very close to the loss value of the training set. The financial risk analysis model shows a large advantage over similar models, with an accuracy rate of 91.14%. In addition, the model's predictive ability and the actual situation are well fitted with an overall accuracy of 85%. In general, the outstanding performance of this model is that its judgment accuracy is significantly higher than that of similar models, and the timeliness of early warning is significantly higher than that of human early warning.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "08252d5e35761cca98e6cd453ac68a12",
    "relevant_keywords": [
      "machine learning",
      "classification",
      "neural network",
      "deep learning",
      "convolutional neural network",
      "CNN"
    ],
    "stage1_timestamp": "2025-05-15T02:01:11.788596"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用GoogleNet卷积神经网络构建财务风险分析模型，用于判断和预警新能源企业的财务风险，这直接属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"该论文的核心技术是使用GoogleNet卷积神经网络构建财务风险分析模型，用于判断和预警新能源企业的财务风险，这直接属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:50:33.177798"
}