{
  "paper": {
    "id": 4300,
    "title": "REDD+ in Theory and Practice: How Lessons From Local Projects Can Inform Jurisdictional Approaches",
    "abstract": "Local projects for reducing emissions from deforestation and forest degradation (REDD+) were frequently designed as pilot actions to inform future upscaled initiatives. Drawing lessons from these project experiences may thus help improve the design of jurisdictional programs, which is the focus of REDD+ implementation in the Paris Agreement. Here we first scrutinize how REDD+ was historically conceptualized, the most prominent model being that of a multitier payments for environmental services (PES) scheme of passing on carbon mitigation responsibilities and credits across scales, from international buyers to forestland owners. Then we analyze two REDD+ project databases, ID-RECCO and GCS-REDD, using principal component and regression analysis. Among 226 conservation-oriented REDD+ projects, only 88 had planned conditional incentives to landowners-the key feature of PES. Intentions to apply PES rose after 2007, and correlate strongly with efforts to seek certification, including as a benefit-sharing strategy, and with carbon sales. Zooming closer into a portfolio of 23 local REDD+ projects that were actually implemented on the ground, we found project implementers reported conditional incentives as potentially being both the most promising and effective intervention. Likewise, treated households identified conditional incentives as comparatively effective in changing their land-use plans, while also providing above-average welfare returns. Still, these conditional incentives remained underutilized in implementation, with only one-third of the treatment intensity compared to non-conditional incentives. Project implementers cited insecure land tenure and uncertain REDD+ financial flows as key impediments to using conditional incentives. The original vision of a multitier PES model for REDD+ thus ran into both supply and demand side problems, jointly explaining the discrepancy between REDD+ theory and practice. Since jurisdictional approaches to REDD+ so far also receive only hesitant and slow climate financing flows, coming mostly in non-conditional form, and operate under forest-frontier governance with similar tenure restrictions, jurisdictions would seem well-advised to plan for conditional landowner incentives only in scenarios where the preconditions for PES are met. Implementers of jurisidictional approaches may also want to avoid conceptualizing their new model too narrowly and prescriptively, as was arguably the case with the conceptualization of REDD+ as a multitier PES scheme.",
    "year": 2020,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "bb06a5e12de27fa18737728a172498da",
    "relevant_keywords": [
      "principal components analysis",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:25:50.492877"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究REDD+项目的实施和效果评估，涉及环境保护和碳排放减少，并未提及或应用于衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究REDD+项目的实施和效果评估，涉及环境保护和碳排放减少，并未提及或应用于衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:07:56.598646"
}