{
  "paper": {
    "id": 401,
    "title": "Dimension reduction for Quasi-Monte Carlo methods via quadratic regression",
    "abstract": "Quasi-Monte Carlo (QMC) methods have been gaining popularity in computational finance as they are competitive alternatives to Monte Carlo methods that can accelerate numerical accuracy. This paper develops a new approach for reducing the effective dimension combined with a randomized QMC method. A distinctive feature of the proposed approach is its sample- based transformation that enables us to choose a flexible manipulation via regression. In the proposed approach, the first step is to perform a regression using the samples to estimate the parameters of the regression model. An optimal transformation is proposed based on the regression result to minimize the effective dimension. An advantage of this approach is that adopting a statistical approach allows greater flexibility in selecting the regression model. In addition to a linear model, this paper proposes a dimension reduction method based on a linear-quadratic model for regression. In numerical experiments, we focus on pricing different types of exotic options to test the effectiveness of the proposed approach. The numerical results show that different regression models are chosen depending on the underlying risk process and the type of derivative securities. In particular, we show several examples where the proposed method works while existing dimension reductions are ineffective.",
    "year": 2025,
    "source": "WOS",
    "area": "derivatives_pricing",
    "method": "machine learning",
    "cache_key": "17d667e7bf1f411af266930b9bb79885",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:31:50.629858"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Derivatives Pricing"
    ],
    "justification": "该论文的核心技术是开发一种新的降维方法结合随机化QMC方法，并在数值实验中专注于定价不同类型的奇异期权，这明确属于衍生品定价领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"衍生品定价\"],\n  \"justification\": \"该论文的核心技术是开发一种新的降维方法结合随机化QMC方法，并在数值实验中专注于定价不同类型的奇异期权，这明确属于衍生品定价领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:05:11.242439"
}