{
  "paper": {
    "id": 8793,
    "title": "The effect of global crises on stock market correlations: Evidence from scalar regressions via functional data analysis",
    "abstract": "This paper presents a novel, mixed-frequency based regression approach, derived from functional data analysis (FDA), to analyze the effect of global crises on stock market correlations, using a long span of data, dating as far back as early 1800s, thus covering a wide range of global crises that have not yet been examined in the literature in this context. Focusing on the advanced nations in the G7 group, we observe heterogeneous effects of global crises on the convergence patterns across developed stock markets. While the post World War II period experienced a general rise in the level of correlations among developed stock market returns, we find that global crises in general have led to a stronger association of stock market returns in the US, UK and Canada, whereas the opposite holds when it comes to how European and Japanese stock markets co-move with the US. Overall, our results suggest that crises that are global in nature generally contribute to the convergence of global stock markets, while the effect largely depends on the context and nature of the crises that possibly drive the perception of risk and/or contagion in financial markets. From an investment perspective, our findings suggest that, in the wake of global crises, diversification benefits will be limited by moving funds across the US and UK stock markets whereas possible diversification benefits would have been possible during the crises-ridden period of the early twentieth century by holding positions in equities in the remaining G7 nations to supplement positions in the US. However, these diversification benefits seem to have frittered away in the post World War II period, highlighting the role of emerging markets and alternative assets to improve diversification benefits in the modern era. (C) 2019 Elsevier B.V. All rights reserved.",
    "year": 2019,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "6b7e7da3ae855980f407586784c5e306",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T03:22:26.070520"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文研究了全球危机对股票市场相关性的影响，并讨论了投资组合多样化的潜在收益，这直接关系到投资组合管理的决策。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文研究了全球危机对股票市场相关性的影响，并讨论了投资组合多样化的潜在收益，这直接关系到投资组合管理的决策。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:25:35.442597"
}