{
  "paper": {
    "id": 1226,
    "title": "Hybrid Model for Credit Risk Prediction: An Application of Neural Network Approaches",
    "abstract": "Credit risk prediction is essential for banks and financial institutions as it helps them to evade any inappropriate assessments that can lead to wasted opportunities or monetary losses. In recent times, the hybrid prediction model, a combination of traditional and modern artificial intelligence (AI) methods that provides better prediction capacity than the use of single techniques, has been introduced. Similarly, using conventional and topical artificial intelligence (AI) technologies, researchers have recommended hybrid models which amalgamate logistic regression (LR) with multilayer perceptron (MLP). To investigate the efficiency and viability of the proposed hybrid models, we compared 16 hybrid models created by combining logistic regression (LR), discriminant analysis (DA), and decision trees (DT) with four types of neural network (NN): adaptive neurofuzzy inference systems (ANFISs), deep neural networks (DNNs), radial basis function networks (RBFs) and multilayer perceptrons (MLPs). The experimental outcome, investigation, and statistical examination express the capacity of the planned hybrid model to develop a credit risk prediction technique different from all other approaches, as indicated by ten different performance measures. The classifier was authenticated on five real-world credit scoring data sets.",
    "year": 2019,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "d6a859f48dabd886bfa170074778b98b",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "decision tree",
      "neural network",
      "deep learning",
      "backpropagation",
      "BP",
      "hidden layer",
      "multilayer perceptron"
    ],
    "stage1_timestamp": "2025-05-15T02:00:30.500895"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on credit risk prediction, which is a key aspect of financial risk management, particularly in assessing the likelihood of default by borrowers. The hybrid models discussed are specifically designed to improve the accuracy of credit risk assessments, a core activity in managing financial risks for banks and financial institutions.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on credit risk prediction, which is a key aspect of financial risk management, particularly in assessing the likelihood of default by borrowers. The hybrid models discussed are specifically designed to improve the accuracy of credit risk assessments, a core activity in managing financial risks for banks and financial institutions.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:50:54.725611"
}