{
  "paper": {
    "id": 1066,
    "title": "Probability of default for lifetime credit loss for IFRS 9 using machine learning competing risks survival analysis models",
    "abstract": "This study introduces a machine learning competing risks survival analysis model aiming at exploring the Probability of Default component of credit risk. Due to modeling of a cumulative probability of default over time, the model is applicable to assess Lifetime Expected Credit Loss under the International Financial Reporting Standard (IFRS) 9 regulation for financial institutions. Whilst most credit models focus on the default event itself, in many loan transactions, there is a competing event affecting risk: the possibility of the borrower prepay their debt before maturity. In this case, credit risk ceases to exist. We derive a statistical model that supports handling competing risks (credit risk and prepayment risk) in a machine learning survival analysis setup. As there is no available implemented computer package or library, we build the computational algorithm with subdistribution hazards using boosting as an ensemble method and componentwise least square models as base learners. Results of the model are generated using a dataset of credit card refinancing operations a US financial institution. We observe, comparing different survival analysis techniques, that ComponentWise Gradient Boosting (CWGB) models showed competetive performance on both scenarios (subdistribution hazards and cause -specific models) compared to benchmark models. The derived model is useful to address the guidelines of the IFRS 9 for credit risk, taking into account the context of lifetime credit exposure.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "ed08e78a354c54e8e893d6bf305f1621",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "regression",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T01:58:43.344766"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用机器学习竞争风险生存分析模型来探索信用风险的违约概率，并应用于评估国际财务报告准则（IFRS）9下的终身预期信用损失。这直接涉及信用风险管理，属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"该论文的核心技术是使用机器学习竞争风险生存分析模型来探索信用风险的违约概率，并应用于评估国际财务报告准则（IFRS）9下的终身预期信用损失。这直接涉及信用风险管理，属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T14:24:24.257473"
}