{
  "paper": {
    "id": 632,
    "title": "A Practitioner-Informed Decision Tree for Selecting Harmful Cyanobacteria Bloom Control and Mitigation Techniques",
    "abstract": "Harmful Cyanobacterial Blooms (HCBs) threaten ecological and human health, and their incidence and magnitude appear to be rising globally. However, a lack of guidance exists on how to choose the best HCB control and mitigation strategy for different types of water bodies. The portfolio of available in situ control techniques is diverse, ranging from experimental to well established, with complicated and poorly-documented records of effectiveness across different settings and a range of unintended ecological consequences. We introduce a decision tree that synthesizes current science and practitioner experience in a framework that can be used to examine conditions under which HCB control techniques are likely to be appropriate and most effective. The factors that establish branching and the classification of techniques within the decision tree were based on the review of peer-reviewed and gray literature, and on responses to a national survey. Key factors influencing the feasibility and effectiveness of HCB control include whether nutrient loads are sourced externally or internally, the size of the treatment area, and the vulnerability of and regulations governing the receiving water body. Survey results point to important regional differences in the application of HCB control techniques, whereas demonstration of the decision tree with real-world case studies highlights some of the practical issues managers face in making decisions about treatment techniques. Supporting Information provides a comprehensive review of current science, appropriate use, and costs for individual techniques.",
    "year": 2025,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "b440553352039e2332696088ea40edb5",
    "relevant_keywords": [
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T00:45:39.188856"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究有害蓝藻水华的控制和缓解技术的决策树方法，属于环境科学和生态管理领域，与金融研究领域无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究有害蓝藻水华的控制和缓解技术的决策树方法，属于环境科学和生态管理领域，与金融研究领域无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:29:02.182539"
}