{
  "paper": {
    "id": 1309,
    "title": "Research on Credit Risk Evaluation of Commercial Banks Based on Artificial Neural Network Model",
    "abstract": "Credit risk, as the main risk currently faced by commercial banks, is largely determined by whether the borrower can repay the credit loan on schedule. Therefore, the research on credit risk of commercial banks has important theoretical and practical significance. This article mainly predicts the credit risk of corporate customers of commercial banks by constructing Artificial Neural Network model. First, this article selects 14 financial indicators to construct a credit risk evaluation index system based on the results of previous studies; second, combined with cluster analysis and factor analysis to determine the actual credit rating of the sample data, thereby giving the sample data the category label; finally, combining the above research, established and compared two traditional credit risk prediction models and three commonly used Artificial Neural Network models, and finally compared the prediction performance to select the best model to achieve prediction and evaluation of the credit risk of corporate customers of commercial banks. (C) 2021 The Authors. Published by Elsevier B. V.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "ccfad41bb3f1574280de45ddb3c9b377",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "neural network",
      "deep learning",
      "backpropagation",
      "BP",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T02:01:11.925287"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on predicting credit risk for corporate customers of commercial banks using Artificial Neural Network models, which is a core aspect of financial risk management, specifically credit risk assessment.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on predicting credit risk for corporate customers of commercial banks using Artificial Neural Network models, which is a core aspect of financial risk management, specifically credit risk assessment.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:49:50.487239"
}