{
  "paper": {
    "id": 608,
    "title": "Financial distress prediction using integrated Z-score and multilayer perceptron neural networks",
    "abstract": "The COVID-19 pandemic led to a great deal of financial uncertainty in the stock market. An initial drop in March 2020 was followed by unexpected rapid growth over 2021. Therefore, financial risk forecasting continues to be a central issue in financial planning, dealing with new types of uncertainty. This paper presents a stock market forecasting model combining a multi-layer perceptron artificial neural network (MLP-ANN) with the traditional Altman Z-Score model. The contribution of the paper is presentation of a new hybrid enterprise crisis warning model combining Z-score and MLP-ANN models. The new hybrid default prediction model is demonstrated using Chinese data. The results of empirical analysis show that the average correct classification rate of thew hybrid neural network model (99.40%) is higher than that of the Altman Z-score model (86.54%) and of the pure neural network method (98.26%). Our model can provide early warning signals of a company's deteriorating financial situation to managers and other related personnel, investors and creditors, government regulators, financial institutions and analysts and others so that they can take timely measures to avoid losses.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "c6b8c2eee6df1fdf5f606150e7077481",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "neural network",
      "deep learning",
      "backpropagation",
      "BP",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T01:52:49.557542"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on developing a hybrid model for financial distress prediction, which is a key aspect of financial risk management. The model aims to provide early warning signals for deteriorating financial situations, helping stakeholders mitigate potential losses.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on developing a hybrid model for financial distress prediction, which is a key aspect of financial risk management. The model aims to provide early warning signals for deteriorating financial situations, helping stakeholders mitigate potential losses.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:56:37.540233"
}