{
  "paper": {
    "id": 2042,
    "title": "Measuring cryptocurrency moment convergence using distance analysis",
    "abstract": "This study measures the convergence and divergence of major cryptocurrencies by applying two distance measures used in machine learning. Particularly, the time-varying Euclidean distance measure was constructed by combining the first four moments (i.e. mean, variance, skewness and kurtosis) of the return distributions of cryptocurrencies following the l(2)-normalisation. It was found that major cryptocurrencies converged to the centroid during the 2018 market crash, but diverged before and after the crash. Their divergence could be due to the uncertainty arising frommarket news and regulatory events. In addition, Bitcoin cosine similarity measure was developed to provide further insights into the relationship between Bitcoin and other cryptocurrencies. This cosine similarity shows how each cryptocurrency moves relative to Bitcoin, which is not captured by the Euclidean distance. More importantly, it was demonstrated that the divergence of major cryptocurrencies from their centroids can improve Markowitz's efficient frontier and provide more diversification benefits to investors and portfolio fund managers. Finally, a profitable trading strategy was provided based on the Euclidean distance.",
    "year": 2024,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "286a30ae65f5ac736126e1a889061bc8",
    "relevant_keywords": [
      "machine learning",
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T01:02:32.791281"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是使用距离分析来测量加密货币的收敛和发散，并展示了这些发现如何改进Markowitz的有效前沿，为投资者和投资组合基金经理提供更多的多样化收益。此外，论文还提供了一个基于欧几里得距离的盈利交易策略。这些内容直接关联到投资组合管理的领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是使用距离分析来测量加密货币的收敛和发散，并展示了这些发现如何改进Markowitz的有效前沿，为投资者和投资组合基金经理提供更多的多样化收益。此外，论文还提供了一个基于欧几里得距离的盈利交易策略。这些内容直接关联到投资组合管理的领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:17:23.750821"
}