{
  "paper": {
    "id": 3516,
    "title": "Does health aid matter to financial risk protection? A regression analysis across 159 household surveys, 2000-2016",
    "abstract": "Introduction: Universal Health Coverage (UHC) is a widely accepted objective among entities providing development assistance for health (DAH) and DAH recipient governments. One key metric to assess progress with UHC is financial risk protection, but empirical evidence on the extent to which DAH is associated to financial risk protection (and hence UHC) is scarce. Methods: Our sample is comprised of 65 countries whose DAH per capita is above the population-weighted average DAH per capita across all countries. The sample comprises of 1.7 million household observations, for the period 2000-2016. We run country and year fixed effects regressions, and pseudo-panel models, to assess the association between DAH and three measures of financial risk protection: catastrophic health expenditure (i.e., out-of-pocket health expenditures larger than 10% of total household expenditures ['CHE10%']), out-of-pocket health expenditure as a share of total expenditure ('OOP%'), and impoverishment due to health expenditures, at the 1.90US$ per day poverty line ('IMP190'). Results: on average, DAH investment does not appear to be significantly associated with financial risk protection outcomes. However, we find suggestive evidence that a 1 US$ increase in DAH per capita is negatively associated (i.e., an improvement) with at least one financial risk protection outcome for the poorest household quintile within countries (in fixed effects models, IMP190: 0.05 percentage points, p < 0.1; in pseudo-panel models, CHE10%: 0.12 percentage points, p < 0.01). DAH is also negatively associated (i.e., an improvement) with most financial risk protection outcomes when it is largely channelled via government systems (i.e., when it is on- budget) (CHE10%: 0.68 percentage points, p < 0.05). Several robustness checks confirm these results. Discussion: DAH investments require careful planning to improve financial risk protection. For example, positive DAH effects for the poorest quintiles of the population might be driven by DAH targeting poorer populations and doing so effectively. Our results also suggest that channelling more resources via governments might be a promising avenue to enhance the impact of DAH on financial risk protection.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "e003bb710ab79fedaacb13cbedccf1e4",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:27:19.059668"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究健康援助与家庭财务风险保护之间的关系，虽然提到了金融风险保护，但其核心内容属于公共卫生和经济发展领域，而非特定的金融研究领域如衍生品定价、金融风险管理或投资组合管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究健康援助与家庭财务风险保护之间的关系，虽然提到了金融风险保护，但其核心内容属于公共卫生和经济发展领域，而非特定的金融研究领域如衍生品定价、金融风险管理或投资组合管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:36:23.881064"
}