{
  "paper": {
    "id": 2301,
    "title": "PREDICTING THE RISK OF ENCOUNTERING FINANCIAL DIFFICULTIES BY THE EXAMPLE OF ESTONIAN MUNICIPALITIES",
    "abstract": "The objective of the study is to determine the financial and non-financial indicators which describe the financial difficulties encountered by Estonian municipalities and to prepare a model to predict the risk of encountering financial difficulties. In order to achieve the objective, the study employs multidimensional statistical analysis methods: discriminant analysis and logit analysis. The predictive model is based on the financial and non-financial indicators of Estonian municipalities for the years 2004-2014 and the risk of encountering financial difficulties is defined as the value of the variable primary operating outcome to depreciation of tangible fixed assets of the population over the years 2011-2014. The classification accuracy of the discriminant model comprising seven independent variables found as a result of the analysis is 88% and the same indicator for the logit model is 87%. The variable with the highest descriptive capacity in predicting the risk of encountering financial difficulties is the ratio of primary operating outcome to the primary operating revenues. The methods of the study and the predictive model prepared make a significant contribution to the development of this field of study in Estonia and are applicable also to other countries where municipalities operate under similar financial management principles.",
    "year": 2016,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "fe0817a7b56b82a81eb00fb0d3e94f3d",
    "relevant_keywords": [
      "classification"
    ],
    "stage1_timestamp": "2025-05-15T02:13:31.889519"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的主要目标是预测爱沙尼亚市政当局遇到财务困难的风险，并为此构建了一个预测模型。这属于金融风险管理的范畴，因为它涉及识别和评估潜在的财务风险，并采取措施进行预测和管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的主要目标是预测爱沙尼亚市政当局遇到财务困难的风险，并为此构建了一个预测模型。这属于金融风险管理的范畴，因为它涉及识别和评估潜在的财务风险，并采取措施进行预测和管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:43:19.476725"
}