{
  "paper": {
    "id": 2657,
    "title": "A Machine Learning Frontier for Predicting LCOE of Photovoltaic System Economics",
    "abstract": "In this research article, the objective is to determine the return on investment (ROI) of photovoltaic (PV) power plants by employing machine learning (ML) techniques. Special focus is done on the levelized cost of electricity (LCOE) as a pivotal economic parameter crucial for facilitating economic decision-making and enabling quantitative comparisons among different energy generation technologies. Traditional methods of calculating LCOE often rely on fixed singular input values, which may fall short in addressing uncertainties associated with assessing the financial feasibility of PV projects. In response, a dynamic model that integrates essential demographic, energy, and policy data, is introduced encompassing factors such as interest rates, inflation rates, and energy yield, which are anticipated to undergo changes over the lifetime of a PV system. This dynamic model provides a more accurate estimation of LCOE. The comparative analysis of ML algorithms indicates that the auto-regression integration moving average (ARIMA) model exhibits a high accuracy of 93.8% in predicting consumer electricity prices. The validation of the model is highlighted through two case studies in the United States and the Philippines underscores the potential impact on LCOE values. For instance, in California, LCOE values could vary by nearly 30% (5.03 cents kWh-1 for singular values vs 7.09 cents kWh-1 using our ML model), influencing the perceived risk or economic feasibility of a PV power plant. Additionally, the ML model estimates the ROI for a grid-connected PV plant in the Philippines at 5.37 years, in contrast to 4.23 years using traditional methods. The research article aims to determine the return on investment (ROI) of photovoltaic (PV) power plants by implementing machine learning (ML) techniques with a specific focus on accurately predicting the levelized cost of electricity (LCOE) parameter. We introduced a dynamic model that integrates essential demographic, energy, and policy data, encompassing factors such as interest rates, inflation rates, and energy yield which are anticipated to undergo changes over the lifetime of the PV system. The validation of our model is highlighted through two case studies in the USA and the Philippines underscoring the potential impact on LCOE values.image (c) 2024 WILEY-VCH GmbH",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "40a4f2163d15b8332dd2e7a0d5cf9186",
    "relevant_keywords": [
      "machine learning",
      "regression",
      "ARIMA"
    ],
    "stage1_timestamp": "2025-05-15T02:17:32.295729"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究使用机器学习技术预测光伏系统的电力成本（LCOE）和投资回报率（ROI），虽然涉及经济决策和风险评估，但其核心应用领域是能源经济学和可再生能源投资分析，而非衍生品定价、金融风险管理或投资组合管理等特定金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究使用机器学习技术预测光伏系统的电力成本（LCOE）和投资回报率（ROI），虽然涉及经济决策和风险评估，但其核心应用领域是能源经济学和可再生能源投资分析，而非衍生品定价、金融风险管理或投资组合管理等特定金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:40:40.678253"
}