{
  "paper": {
    "id": 2024,
    "title": "Valuation of project portfolios: An endogenously discounted method",
    "abstract": "Real options analysis (ROA) has been developed to value assets in which managerial flexibilities create significant value. The methodology is ideal for the valuation of projects in which frequent adjustments (e.g. investment deferral, project scope changes, etc) are necessary in response to the realization of market and technological uncertainties. However, ROA has no practical application when valuing portfolios of multiple concurrent projects sharing resources, as the size of the problem grows exponentially with the number of projects and the length of the time horizon. In this paper an extension of ROA suitable for the valuation of project portfolios with substantial technological uncertainty (e.g. R&D portfolios) is proposed. The method exploits the distributed decision making strategy encountered in most organizations to decompose the portfolio valuation problem into a decision-making sub-problem and a set of single project valuation sub-problems that can be sequentially solved. Discrete event simulation is used for the first sub-problem, while a tailored ROA based strategy is used for the set of valuation sub-problems. A case study from the pharmaceutical industry is used to compare the decision tree analysis (DTA) method and the proposed method. (C) 2010 Elsevier B.V. All rights reserved.",
    "year": 2010,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "b15420c6cd031e54cb98888938e06cd6",
    "relevant_keywords": [
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T01:02:10.240343"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文提出了一种扩展的实物期权分析方法，用于评估共享资源的多个并发项目的投资组合价值，特别是在存在重大技术不确定性的情况下（如研发投资组合）。这直接涉及到投资组合管理的核心问题，即如何在不确定环境下优化资源配置和项目选择。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文提出了一种扩展的实物期权分析方法，用于评估共享资源的多个并发项目的投资组合价值，特别是在存在重大技术不确定性的情况下（如研发投资组合）。这直接涉及到投资组合管理的核心问题，即如何在不确定环境下优化资源配置和项目选择。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:17:44.676024"
}