{
  "paper": {
    "id": 1622,
    "title": "Early warning of regime switching in a complex financial system from a spillover network dynamic perspective",
    "abstract": "Early warning of regime switching in a complex financial system is a critical and challenging issue in risk management. Previous research has examined regime switching through analyzing the fluctuation features in a single point in time series; however, it has rarely examined the dynamic spillovers across multivariable time series. This paper develops an early warning model of regime switching that incorporates a spillover network model and a machine learning model. Typical energy prices and stock market indices are selected as the sample data. The key spillover networks can be detected according to the distribution of the network indicators. The early warning signals can be captured by six typical machine learning models, and the random forest model has better performance. The robustness of the model is also discussed. Our study enriches regime switching research and provides important early warning signals for policymakers and market investors.",
    "year": 2025,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "b04548fd1d3398b62e04603f1459e640",
    "relevant_keywords": [
      "machine learning",
      "classification",
      "regression",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T02:05:42.486028"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on developing an early warning model for regime switching in a complex financial system, which is directly related to identifying and managing financial risks. The use of spillover network dynamics and machine learning models to detect early warning signals is aimed at risk management for policymakers and market investors.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on developing an early warning model for regime switching in a complex financial system, which is directly related to identifying and managing financial risks. The use of spillover network dynamics and machine learning models to detect early warning signals is aimed at risk management for policymakers and market investors.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:47:20.798447"
}