{
  "paper": {
    "id": 3578,
    "title": "Detecting High Risk Taxpayers Using Data Mining Techniques",
    "abstract": "Risk refers to a set of events that lead to loss but risk from the tax perspective refers to the taxpayers' behaviors that may lead to negligence from the public property by the taxpayers due to tax evasion. Such actions cause unusual volatilities in the amounts envisaged in the government budgeting. The fiscal and financial transactions outside the scope of the precautionary bound and failure to achieve the expected revenues of the country. One of the most important types of tax risks is concealing the information on buying, selling and contracts that in case of being uncovered in the financial sector it leads to the issuance of amendments to taxpayers. But if it is uncovered in the due course, it leads to the non-fulfillment of tax collection and thus negative financial waves at the national level and ultimately leads to detrimental financial impact to the financial framework of states and countries. The main purpose of this paper is to analyze, design and implement a system to extract high risk taxpayers and provide a model to forecast the amount of tax assessment notification of the taxpayers for the coming years so that it would play the role of the assistance system for the tax experts to issue the assessment notifications with realistic amounts during the assessment and tax audit to prevent major errors in the tax assessment. To extract high risk taxpayers using the variance and the mean standard deviation the suspicious financial behavior is detected and then the previously supervised data that exist in the tax base as amendment forms are used to classify the taxpayers and also the job coefficient field is used and high risk occupations are identified and classified. One of the strongest and best practices in this field is the use of statistical and financial calculations in time domain. The main feature is the amount of taxable income based on which the purchasing, sales, revenue and profit can be calculated. By studying the volatilities and noise detection in the amounts paid by taxpayers during the past years and also creating linear regression analysis it has been possible to discover the risk levels and forecast of the tax assessment notification for the coming years. Also using this technique tax assessment notification error tolerance of the previous years is obtained. Finally the high risk taxpayer detection system known as HTS is provided with the best and quickest manner possible.",
    "year": 2016,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "df3571cdb7a42778bb89d6deacc5c6e1",
    "relevant_keywords": [
      "classification",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:27:54.015375"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是使用数据挖掘技术检测高风险纳税人，其应用场景是税务风险评估和管理，并不直接涉及衍生品定价、金融风险管理或投资组合管理等金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是使用数据挖掘技术检测高风险纳税人，其应用场景是税务风险评估和管理，并不直接涉及衍生品定价、金融风险管理或投资组合管理等金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:35:59.669030"
}