{
  "paper": {
    "id": 61,
    "title": "The Effect of Company's Interest Coverage Ratio on the Structural and Reduced-Form Models in Predicting Credit Derivatives Price",
    "abstract": "Derivative pricing models use either fixed or variable interest rates at the corporate level to compensate for the devaluation, which results in an estimated accounting profit caused by the cash inflation at the maturity date. These models also fail to take into account the lost opportunity costs, which are considered a deficiency. Accordingly, the present study set out to remove this problem by adding the company's Interest Coverage Ratio (ICR) to pricing models, which is the novelty of this study. The research data was extracted from the Bloomberg Terminal for an eight-year period from 2008 to 2015. The statistical population of the research included the North American and European companies recognized as the reference entities for Credit Default Swaps (CDS) in the given period, and the statistical sample consisted of 125 companies. The data was analyzed using four Artificial Neural Network (ANN) algorithms, namely ANFIS, NNARX, AdaBoost, and SVM. The research results indicated the increased predictive accuracy of the pricing models under scrutiny after adding the ICR. The findings also shed light on the superiority of the intensity model over the structural model in prognosticating the price of CDS contracts.",
    "year": 2022,
    "source": "WOS",
    "area": "derivatives_pricing",
    "method": "machine learning",
    "cache_key": "843108272df3938ee47e2dab1a27106b",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "support vector machine",
      "SVM",
      "neural network",
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T01:28:03.839160"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Derivatives Pricing"
    ],
    "justification": "该论文的核心研究内容是改进信用衍生品（Credit Default Swaps, CDS）的定价模型，通过引入公司的利息覆盖率（ICR）来提高预测准确性。这直接涉及衍生品定价领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"衍生品定价\"],\n  \"justification\": \"该论文的核心研究内容是改进信用衍生品（Credit Default Swaps, CDS）的定价模型，通过引入公司的利息覆盖率（ICR）来提高预测准确性。这直接涉及衍生品定价领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:07:04.367360"
}