{
  "paper": {
    "id": 351,
    "title": "Internet financial supervision based on machine learning and improved neural network",
    "abstract": "The research on the risk pricing of Internet finance online loans not only enriches the theory and methods of online loan pricing, but also helps to improve the level of online loan risk pricing. In order to improve the efficiency of Internet financial supervision, this article builds an Internet financial supervision system based on machine learning algorithms and improved neural network algorithms. Moreover, on the basis of factor analysis and discretization of loan data, this paper selects the relatively mature Logistic regression model to evaluate the credit risk of the borrower and considers the comprehensive management of credit risk and the matching with income. In addition, according to the relevant provisions of the New Basel Agreement on expected losses and economic capital, starting from the relevant factors, this article combines the credit risk assessment results to obtain relevant factors through regional research and conduct empirical analysis. The research results show that the model constructed in this paper has certain reliability.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "6730aac5f4bad98ff00b33488900f084",
    "relevant_keywords": [
      "machine learning",
      "neural network",
      "deep learning",
      "Logistic regression",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:49:41.091324"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要研究基于机器学习和改进神经网络算法的互联网金融监管系统，重点在于评估借款人的信用风险，并综合考虑信用风险管理和收益匹配，这属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文主要研究基于机器学习和改进神经网络算法的互联网金融监管系统，重点在于评估借款人的信用风险，并综合考虑信用风险管理和收益匹配，这属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T14:23:36.520144"
}