{
  "paper": {
    "id": 700,
    "title": "Loan Default Risk Prediction Using Knowledge Graph",
    "abstract": "Credit risk, also known as loan default risk, is one of the significant financial challenges in banking and financial institutions since it involves the uncertainty of the borrowers' ability to perform their contractual obligation. Banks and financial institutions rely on statistical and machine learning methods in predicting loan default to reduce the potential losses of issued loans. These machine learning applications may never achieve their full potential without the semantic context in the data. A knowledge graph is a collection of linked entities and objects that include semantic information to contextualize them. Knowledge graphs allow machines to incorporate human expertise into their decision-making and provide context to machine learning applications. Therefore, we proposed a loan default prediction model based on knowledge graph technology to improve the prediction model's accuracy and interpretability. The experimental results demonstrated that incorporating knowledge graph embedding as features can boost the performance of the conventional machine learning classifiers in predicting loan default risk.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "40928b45338dd786b3be186f7cc39e8d",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "feature representation",
      "representation learning"
    ],
    "stage1_timestamp": "2025-05-15T01:53:59.441576"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用知识图谱技术来预测贷款违约风险，这直接涉及信用风险管理，属于金融风险管理的范畴。论文的研究目标和实验设计都集中在提高贷款违约预测的准确性和可解释性，这是金融风险管理中的关键问题。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"该论文的核心技术是使用知识图谱技术来预测贷款违约风险，这直接涉及信用风险管理，属于金融风险管理的范畴。论文的研究目标和实验设计都集中在提高贷款违约预测的准确性和可解释性，这是金融风险管理中的关键问题。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:55:49.097164"
}