{
  "paper": {
    "id": 485,
    "title": "Forecasting and Inventory Planning: An Empirical Investigation of Classical and Machine Learning Approaches for Svanehoj's Future Software Consolidation",
    "abstract": "Challenges related to effective supply and demand planning and inventory management impose critical planning issues for many small and medium-sized enterprises (SMEs). In recent years, data-driven methods in machine learning (ML) algorithms have provided beneficial results for many large-scale enterprises (LSE). However, ML applications have not yet been tested in SMEs, leaving a technological gap. Limited recourse capabilities and financial constraints expose the risk of implementing an insufficient enterprise resource planning (ERP) setup, which amplifies the need for additional support systems for data-driven decision-making. We found the forecasts and determination of inventory management policies in SMEs are often based on subjective decisions, which might fail to capture the complexity of achieving performance goals. Our research aims to utilize the leverage of ML models for SMEs within demand and inventory management by considering various key performance indicators (KPI). The research is based on collaboration with a Danish SME that faced issues related to forecasting and inventory planning. We implemented the following ML models: Artificial Neural Network (ANN), Long Short-Term Memory (LSTM), Support Vector Regression (SVR), Random Forest (RF), Wavelet-ANN (W-ANN), and Wavelet-LSTM (W-LSTM) for forecasting purposes and reinforcement learning approaches, namely Q-learning and Deep Q Network (DQN) for inventory management. Results demonstrate that predictive ML models perform superior concerning the statistical forecasting approaches, but not always if we focus on industrial KPIs. However, when ML models are solely considered, the results indicate careful consideration must be regarded, given that model evaluation can be perceived from an academic and managerial perspective. Secondly, Q-learning is found to yield preferable economic results in terms of inventory planning. The proposed models can serve as an extension to modern ERP systems by offering a data-driven approach to demand and supply planning decision-making.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "3348538c5a00883427be680493903a8b",
    "relevant_keywords": [
      "machine learning",
      "reinforcement learning",
      "support vector machine",
      "SVM",
      "neural network",
      "deep learning",
      "long short-term memory",
      "LSTM"
    ],
    "stage1_timestamp": "2025-05-15T01:51:31.268408"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究机器学习模型在中小企业需求预测和库存管理中的应用，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究机器学习模型在中小企业需求预测和库存管理中的应用，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:57:38.009706"
}