{
  "paper": {
    "id": 1810,
    "title": "Stronger relationships higher risk? Credit risk evaluation based on SMEs network microstructure",
    "abstract": "Relationships between firms and between firms and financial institutions influence firms' credit risk. Thus, these relationships should be crucial considerations in credit evaluation. This paper constructs a comprehensive SME network, which integrates multiple types of inter-firm associations and considers lender-borrower relationships, and then establish credit evaluation models utilizing network microstructure and machine learning. We find that complex interfirm relationships contained in network-based features can significantly enhance the credit risk evaluation of SMEs and the predictive contribution of different levels of network structural features varies. We further find that specific network microstructures containing lender-borrower relationships tend to be associated with high defaulting probabilities. It suggests that if a SME is closely linked to microlending institutions through multiple relationships, its defaulting probability will increase.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "eab84da7aad0645397f7d6dbf0e8274b",
    "relevant_keywords": [
      "machine learning",
      "classification"
    ],
    "stage1_timestamp": "2025-05-15T02:07:25.787787"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on constructing a comprehensive SME network to enhance credit risk evaluation using network microstructure and machine learning, which directly pertains to assessing and managing credit risk, a key aspect of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on constructing a comprehensive SME network to enhance credit risk evaluation using network microstructure and machine learning, which directly pertains to assessing and managing credit risk, a key aspect of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:45:56.851488"
}