{
  "paper": {
    "id": 119,
    "title": "Credit risk assessment in commercial banks based on fuzzy support vector machines",
    "abstract": "Credit risk assessment plays an important role in banks credit risk management. The objective of credit assessment is to decide credit ranks, which denote the capacity of enterprises to meet their financial commitments. Traditional one-versusone approach has been commonly used in the multi-classification method based on Support Vector Machine (SVM). Since SVM for pattern recognition is based on binary classification, there will be unclassifiable regions when extended to multi-classification problems. Focus on this problem, a new credit risk assessment model based on fuzzy SVM is introduced in this paper that can give a reasonable classification for unclassifiable examples. Experiment results show that the fuzzy SVM method provides a better performance in generalization ability and assessment accuracy than conventional one-versus-one multi-classification approach.",
    "year": 2006,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "4bad1edd8e6bd3d3f84f958729302ee8",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM"
    ],
    "stage1_timestamp": "2025-05-15T01:47:13.988472"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on credit risk assessment in commercial banks using fuzzy support vector machines, which is a core aspect of financial risk management, specifically in the area of credit risk evaluation.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on credit risk assessment in commercial banks using fuzzy support vector machines, which is a core aspect of financial risk management, specifically in the area of credit risk evaluation.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:00:48.211136"
}