{
  "paper": {
    "id": 1447,
    "title": "Weight bound constraints in mean-variance models: a robust control theory foundation via machine learning",
    "abstract": "Using an innovative representation of the weight bound constrained Markowitz's (Portfolio selection. J. Finance, 1952, 7, 77-91) mean-variance model, developed using the support vector data description, a machine learning algorithm introduced by Tax and Duin (Support vector data description. Mach. Learn., 2004, 54, 45-66), we provide an innovative interpretation of the robustness of these bound constraints in terms of robust control theory in the sense of Hansen and Sargent (Robust control and model uncertainty. Am. Econ. Rev., 2001, 91, 60-66). Building on these insights, firstly, we detail the method for quantifying the degree of misspecification in Markowitz's (1952) mean-variance model using its counterpart with weight upper bounds. Additionally, we show that this degree of misspecification is a decreasing piecewise linear function of the bound. Secondly, we empirically investigate two simulation-based methods, inspired by Michaud's (The Markowitz optimization enigma: Is 'optimized' optimal? Financ. Anal. J., 1989, 45, 31-42) resampling technique, for choosing the bound. Thirdly, we compare the robustness of the weight upper bound constrained mean-variance model with that of Goldfarb and Iyengar's (Robust portfolio selection problems. Math. Oper. Res., 2003, 28, 1-38) robust maximum return model.",
    "year": 2024,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "076141bdfaaee75cf8aeb64018ca98ca",
    "relevant_keywords": [
      "machine learning",
      "support vector machine",
      "SVM"
    ],
    "stage1_timestamp": "2025-05-15T00:56:08.256053"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是基于机器学习的支持向量数据描述方法，用于改进Markowitz的均值-方差模型，并探讨了权重约束在投资组合优化中的作用。论文的研究目标和实验设计都集中在投资组合管理领域，特别是如何通过约束权重来提高模型的稳健性和减少模型误设。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是基于机器学习的支持向量数据描述方法，用于改进Markowitz的均值-方差模型，并探讨了权重约束在投资组合优化中的作用。论文的研究目标和实验设计都集中在投资组合管理领域，特别是如何通过约束权重来提高模型的稳健性和减少模型误设。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:21:04.251529"
}