{
  "paper": {
    "id": 2710,
    "title": "AdaRisk: Risk-Adaptive Deep Reinforcement Learning for Vulnerable Nodes Detection",
    "abstract": "Vulnerable node detection in uncertain graphs is a typical graph mining problem that seeks to identify nodes at a high risk of breakdown under the joint effect from both the self and contagion risk probability. This is an NP-hard problem that is crucial for risk management in many real-world applications such as networked loans and smart grids. Monte Carlo (MC) simulation and its optimized algorithms are commonly used to approximate the breakdown probability, but these methods require a large number of samples to ensure accuracy, which is computationally expensive for large-scale networks. Although recent studies employ Graph Neural Networks (GNNs) to model the contagion process and accelerate the inference, many of these methods suffer from the over-smoothing problem, leading to suboptimal performance under the long-distance risk contagion process. To this end, we propose a novel risk-adaptive deep reinforcement learning-based framework (AdaRisk) for vulnerable nodes detection in uncertain graphs. In particular, we design the Markov Decision Process (MDP) of the vulnerability estimation process in which our agent would approach the risk adaptively based on contagion probability accumulated in prior iterations. To encode state embeddings that incorporate multi-hop contagion information, the agent utilizes a long-distance adaptable policy network to process the input graph and output actions as the vulnerable probability of nodes. We conducted extensive experiments on four benchmark networks and three real-world financial networks to evaluate our proposed framework's performance. Our results demonstrate that AdaRisk outperforms state-of-the-art baselines in terms of detection performance, and also offers significant running time reductions compared to MC simulation.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "cfb4d9a50084d9a8ffb870ef0d77987a",
    "relevant_keywords": [
      "machine learning",
      "reinforcement learning",
      "deep learning",
      "neural network",
      "representation learning"
    ],
    "stage1_timestamp": "2025-05-15T02:18:06.276927"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文提出了一种风险自适应的深度强化学习框架（AdaRisk），用于在不确定图中检测脆弱节点，这在金融领域可以应用于网络贷款等场景中的风险管理。论文明确提到了在三个真实世界金融网络上的实验，表明其技术直接应用于金融风险管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文提出了一种风险自适应的深度强化学习框架（AdaRisk），用于在不确定图中检测脆弱节点，这在金融领域可以应用于网络贷款等场景中的风险管理。论文明确提到了在三个真实世界金融网络上的实验，表明其技术直接应用于金融风险管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:40:37.521302"
}