{
  "paper": {
    "id": 7645,
    "title": "Payment reform and changes in health care in China",
    "abstract": "This paper is intended to assess the primary effects on cost, utilization and quality of care from payment reform of capitation and open enrollment in Changde city, Hunan Province of China. Open enrollment policy was introduced to deal with possible cream skimming associated with capitation. Based on the longitudinal Urban Resident Basic Medical Insurance (URBMI) Household Survey, this study analyses the URBMI data through a set of regression models. The original data included over five thousand inpatient admissions during the study period between 2008 and 2010. The study finds the payment reform to reduce its inpatient out-of-pocket cost by 19.7%, out-of-pocket ratio by 9.5%, and length of stay by 17.7%. However, the total inpatient cost, drug cost ratio, treatment effect, and patient satisfaction showed little difference between Fee-For-Service and capitation models. We conclude that the payment reform in Changde did not reduce overall inpatient expenditure, but it decreased the financial risk and length of stay of inpatient patients without compromising quality of care. The findings would contribute to the health care payment literatures from developing countries and open further research tracks on the ability of open enrollment to compensate for capitation drawbacks. (C) 2014 Elsevier Ltd. All rights reserved.",
    "year": 2014,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "b9e2bc23546cd93a1df6aaf685a2f117",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T03:10:33.068377"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究医疗支付改革对成本、利用率和护理质量的影响，属于医疗卫生政策领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究医疗支付改革对成本、利用率和护理质量的影响，属于医疗卫生政策领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:26:14.625248"
}