{
  "paper": {
    "id": 3200,
    "title": "An intelligent payment card fraud detection system",
    "abstract": "Payment cards offer a simple and convenient method for making purchases. Owing to the increase in the usage of payment cards, especially in online purchases, fraud cases are on the rise. The rise creates financial risk and uncertainty, as in the commercial sector, it incurs billions of losses each year. However, real transaction records that can facilitate the development of effective predictive models for fraud detection are difficult to obtain, mainly because of issues related to confidentially of customer information. In this paper, we apply a total of 13 statistical and machine learning models for payment card fraud detection using both publicly available and real transaction records. The results from both original features and aggregated features are analyzed and compared. A statistical hypothesis test is conducted to evaluate whether the aggregated features identified by a genetic algorithm can offer a better discriminative power, as compared with the original features, in fraud detection. The outcomes positively ascertain the effectiveness of using aggregated features for undertaking real-world payment card fraud detection problems.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "66251a1e67b552241b9d1db12b90bb72",
    "relevant_keywords": [
      "machine learning",
      "classification",
      "feature learning",
      "feature representation"
    ],
    "stage1_timestamp": "2025-05-15T02:23:33.587673"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要研究支付卡欺诈检测系统，通过机器学习和统计模型来识别和预防欺诈行为，这直接涉及金融风险管理中的操作风险和信用风险控制。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文主要研究支付卡欺诈检测系统，通过机器学习和统计模型来识别和预防欺诈行为，这直接涉及金融风险管理中的操作风险和信用风险控制。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:38:03.759890"
}