{
  "paper": {
    "id": 1323,
    "title": "Portfolio Selection via Topological Data Analysis",
    "abstract": "Portfolio management is an essential part of investment decision-making. However, traditional methods often fail to deliver reasonable performance. This problem stems from the inability of these methods to account for the unique characteristics of multivariate time series data from stock markets. We present a two-stage method for constructing an investment portfolio of common stocks. The method involves the generation of time series representations followed by their subsequent clustering. Our approach utilizes features based on Topological Data Analysis (TDA) for the generation of representations, allowing us to elucidate the topological structure within the data. Experimental results show that our proposed system outperforms other methods. This superior performance is consistent over different time frames, suggesting the viability of TDA as a powerful tool for portfolio selection.",
    "year": 2024,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "8858ff4a88a3ea455f1819dfae71f2ff",
    "relevant_keywords": [
      "unsupervised learning",
      "clustering",
      "feature representation",
      "representation learning"
    ],
    "stage1_timestamp": "2025-05-15T00:54:24.669123"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "The paper explicitly discusses the construction of an investment portfolio using Topological Data Analysis (TDA) and demonstrates its application in portfolio selection, which is a core aspect of portfolio management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Portfolio Management\"],\n  \"justification\": \"The paper explicitly discusses the construction of an investment portfolio using Topological Data Analysis (TDA) and demonstrates its application in portfolio selection, which is a core aspect of portfolio management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:21:42.877598"
}