{
  "paper": {
    "id": 685,
    "title": "Regression analysis of supply chain financial risk based on machine learning and fuzzy decision model",
    "abstract": "Supply chain financial risk control has become the biggest obstacle restricting financial institutions from developing supply chain financial services. If financial institutions want to make a difference in the supply chain finance business, they need to implement strong control measures against supply chain finance risks. Based on the research of supply chain finance and risk related theories, this paper uses fuzzy preference relations and selects the main risk criteria to construct a risk evaluation index system. Moreover, this paper takes the development of J company's supply chain finance business as a background to conduct an empirical analysis and proposes the risk management measures and development strategies of J company's actual supply chain finance business. The combination of quantitative analysis and qualitative evaluation is more comprehensive and operational value for the research and management of supply chain financial risks. In addition, this paper uses the evaluation index system constructed in this paper to conduct a more comprehensive summary and analysis of the internal and external environment of risk influencing factors. The research results show that the performance of the model constructed in this paper is good.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "462ffe13ca1cc0358a43ab2b548351e1",
    "relevant_keywords": [
      "machine learning",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:53:59.357338"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要研究供应链金融风险控制，通过构建风险评价指标体系和使用模糊决策模型进行风险管理，这属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文主要研究供应链金融风险控制，通过构建风险评价指标体系和使用模糊决策模型进行风险管理，这属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:55:50.987080"
}