{
  "paper": {
    "id": 4148,
    "title": "An evolving possibilistic fuzzy modeling approach for Value-at-Risk estimation",
    "abstract": "Market risk exposure plays a key role in risk management. A way to measure risk exposure is to evaluate the losses likely to incur when the assets prices of a portfolio decline. Most financial institutions rely on Value-at-Risk (VaR) estimates to measure downside market risk. This paper suggests an evolving possibilistic fuzzy modeling (ePFM) approach to estimate VaR. The approach is an extension of the possibilistic fuzzy c-means clustering and functional fuzzy rule-based modeling within the framework of incremental learning. Evolving possibilistic modeling employs memberships and typicalities to update the cluster structure and corresponding fuzzy rules using a statistical control distance-based criterion. A utility measure evaluates the quality of the current cluster structure and associated model. Data from the main global equity market indexes of United States, United Kingdom, Germany, Spain, and Brazil from January 2000 to December 2012 are used to estimate VaR using ePFM. The performance of ePFM is evaluated and compared with traditional VaR benchmarks such as Historical Simulation, GARCH, EWMA, and Extreme Value Theory based VaR, as well as with state of the art evolving approaches. The results suggest that ePFM is a potential candidate for VaR modeling because it achieves better results than the alternative approaches. (C) 2017 Elsevier B.V. All rights reserved.",
    "year": 2017,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "60a002502e2b22320739d5495cc3358d",
    "relevant_keywords": [
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T02:33:42.100223"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on developing an evolving possibilistic fuzzy modeling approach for Value-at-Risk (VaR) estimation, which is a key tool in financial risk management for measuring downside market risk. The study compares the proposed method with traditional VaR benchmarks and other evolving approaches, demonstrating its application in assessing market risk exposure.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on developing an evolving possibilistic fuzzy modeling approach for Value-at-Risk (VaR) estimation, which is a key tool in financial risk management for measuring downside market risk. The study compares the proposed method with traditional VaR benchmarks and other evolving approaches, demonstrating its application in assessing market risk exposure.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:33:53.714238"
}