{
  "paper": {
    "id": 90,
    "title": "A Deep Neural Network-Based Assistive Decision Method for Financial Risk Prediction in Carbon Trading Market",
    "abstract": "The price of carbon emission rights in the market fluctuates greatly due to various factors from economy, finance, and climate. For an enterprise that needs to conduct carbon trading activities, it is extremely necessary to fully grasp the price of carbon trading in the future period. Thus in this paper, a deep neural network-based assistive decision model for financial risk prediction in carbon trading market is proposed for this purpose. Specifically, the dynamic risk spillover effects of domestic and international carbon trading markets are studied, and a frontier time-varying model is utilized to measure the risk spillover effects. Then, the deep neural network is used for quantitative research and to construct an intelligent decision scheme that outputs financial risk prediction results. Four perspectives, energy price, climate environment, carbon market price, and macroeconomics, are selected as the input to analyze the influence factors of carbon emission rights price. Finally, several linear regression models are adopted as the baseline methods for comparison, and experimental results show that the proposed method can achieve better prediction performance compared with baseline methods.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "57906898ce1c0ac67279858dc1b93e20",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "neural network",
      "regression",
      "hidden layer",
      "backpropagation",
      "BP"
    ],
    "stage1_timestamp": "2025-05-15T01:46:39.583957"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on predicting financial risks in the carbon trading market using a deep neural network model, which is a direct application in financial risk management. It specifically addresses risk spillover effects and provides a decision-making tool for risk prediction, aligning with the objectives of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on predicting financial risks in the carbon trading market using a deep neural network model, which is a direct application in financial risk management. It specifically addresses risk spillover effects and provides a decision-making tool for risk prediction, aligning with the objectives of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:01:08.483346"
}