{
  "paper": {
    "id": 2769,
    "title": "Could traditional financial indicators predict the default of small and medium-sized enterprises? -Evidence from Chinese Small and Medium-sized enterprises",
    "abstract": "Whether an enterprise could pay up its loan largely depends on its financial situation. Thus, former researches mainly focus on identifying and recognizing potential risk of default by financial analysis. However, we believe that though analysis of traditional financial indicators has been proved effective for prediction of large companies' financial crisis, it might not be so useful in predicting the default of small and medium-sized enterprises (SMEs) owing to their special features which are different from the larger ones ominously. In order to certify our opinion, we take samples from the credit database of SMEs in Beijing, China. By comparing the fitness of models with different candidate indicators and the order of variables picked up according to the improvement of likelihood ratio with Binary logistic regression, we find the qualitative indicators, which reflect the features of enterprises and their owners, turn, out to be more effective in default forecasting of SMEs than traditional financial indicators. As a result, searching useful qualitative variables and other special financial indicators should be focused on risk management of banks.",
    "year": 2011,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "7c37f07db83531347c5a42314d39f03d",
    "relevant_keywords": [
      "classification",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:19:08.355807"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on predicting the default of small and medium-sized enterprises (SMEs) using financial and qualitative indicators, which is a key aspect of credit risk management within the broader field of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on predicting the default of small and medium-sized enterprises (SMEs) using financial and qualitative indicators, which is a key aspect of credit risk management within the broader field of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:40:09.881947"
}