{
  "paper": {
    "id": 483,
    "title": "Forecasting returns with machine learning and optimizing global portfolios: evidence from the Korean and US stock markets",
    "abstract": "This study employs a variety of machine learning models and a wide range of economic and financial variables to enhance the forecasting accuracy of the Korean won-U.S. dollar (KRW/USD) exchange rate and the U.S. and Korean stock market returns. We construct international asset allocation portfolios based on these forecasts and evaluate their performance. Our analysis finds that the Elastic Net and LASSO regression models outperform traditional benchmark models in predicting exchange rate and stock market returns, as evidenced by their superior out-of-sample R-squared values. We also identify the key factors crucial for improving the accuracy of forecasting the KRW/USD exchange rate and stock market returns. Furthermore, a machine learning-driven global portfolio that accounts for exchange rate fluctuations demonstrated superior performance. Global portfolios constructed using LASSO (Sharpe ratio = 3.45) and Elastic Net (Sharpe ratio = 3.48) exhibit a notable performance advantage over traditional benchmark portfolios. This suggests that machine learning models outperform traditional global portfolio construction methods.",
    "year": 2024,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "a4e0f22cdcd644cc71d451a94f0b8380",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "regression",
      "support vector machine",
      "SVM",
      "decision tree",
      "neural network",
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T00:43:47.428119"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是使用机器学习模型预测汇率和股票市场回报，并基于这些预测构建和评估国际资产配置组合。这直接涉及投资组合管理的领域，特别是通过优化全球投资组合来提高绩效。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是使用机器学习模型预测汇率和股票市场回报，并基于这些预测构建和评估国际资产配置组合。这直接涉及投资组合管理的领域，特别是通过优化全球投资组合来提高绩效。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:30:32.275769"
}