{
  "paper": {
    "id": 2308,
    "title": "Deep Learning Algorithm-Based Financial Prediction Models",
    "abstract": "In this paper, a new FEPA portfolio forecasting model is based on the EMD decomposition method. The model is based on the special empirical modal decomposition of financial time series, principal component analysis, and artificial neural network to model and forecast for nonlinear, nonstationary, multiscale complex financial time series to predict stock market indices and foreign exchange rates and empirically investigate this hot area in financial market research. The combined forecasting model proposed in this paper is based on the idea of decomposition-reconstruction synthesis, which effectively improves the model's prediction of internal financial time series. In this paper, we select the CSI 300 Index and foreign exchange rate as the empirical market and data and establish seven forecasting models to make predictions about the short-term running trend of the closing price. The interval EMD decomposition algorithm is introduced in this paper, considering both high and low prices to be contained in the input and output. By analyzing the closing price, high and low prices of the stock index at the same time, the volatility of this interval time series of the index and its trend can be better captured.",
    "year": 2021,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "c1a4f7a8a4b0bc6961148710ee2e76fc",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "neural network",
      "principal components analysis",
      "feature representation",
      "representation learning"
    ],
    "stage1_timestamp": "2025-05-15T01:05:39.617937"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是基于深度学习的金融时间序列预测模型，主要用于预测股票市场指数和外汇汇率的短期运行趋势，这直接关联到投资组合管理中的资产价格预测和投资决策支持。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是基于深度学习的金融时间序列预测模型，主要用于预测股票市场指数和外汇汇率的短期运行趋势，这直接关联到投资组合管理中的资产价格预测和投资决策支持。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:15:53.876576"
}