{
  "paper": {
    "id": 1444,
    "title": "A new active portfolio risk management for an electricity retailer based on a drawdown risk preference",
    "abstract": "This paper addresses the deciding under uncertainty of an electricity retailer in order to maximise its total expected rate of return. The developed methodology is based on the modelling of the stochastic evolution of zonal prices that seeks to manage a portfolio of different contracts. Retailer's load and the price at each zone are forecasted using the seasonal autoregressive integrated moving average (SARIMA) model and a clustering technique is used for scenario reduction. Supply sources include the pool, self production facilities, forward and bilateral contracts. The risk of cost fluctuation due to uncertainties is explicitly modelled using the multi-scenario drawdown methodology. This risk function quantifies in aggregated format the frequency and magnitude of the portfolio drawdowns over planning horizon. In sample and out-of-sample runs are performed for a portfolio allocation problem. Carried out experimental results on the basis of realistic data, show that imposing risk constraints improve the real performance of a portfolio management in out-of-sample runs. (C) 2016 Elsevier Ltd. All rights reserved.",
    "year": 2017,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "ae0211a92647946351ce78ce493fdab6",
    "relevant_keywords": [
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T00:56:08.249053"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk",
      "Portfolio Management"
    ],
    "justification": "The paper focuses on managing a portfolio of different contracts for an electricity retailer to maximize expected return while explicitly modeling the risk of cost fluctuations using a multi-scenario drawdown methodology. This directly relates to both financial risk management (through risk quantification and scenario reduction) and portfolio management (through the allocation and optimization of supply sources).",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\", \"Portfolio Management\"],\n  \"justification\": \"The paper focuses on managing a portfolio of different contracts for an electricity retailer to maximize expected return while explicitly modeling the risk of cost fluctuations using a multi-scenario drawdown methodology. This directly relates to both financial risk management (through risk quantification and scenario reduction) and portfolio management (through the allocation and optimization of supply sources).\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:21:04.479382"
}