{
  "paper": {
    "id": 611,
    "title": "Application of Data Mining Technology in Financial Intervention Based on Data Fusion Information Entropy",
    "abstract": "Finance, as the core of the modern economy, supports sustained economic growth through financing and distribution. With the continuous development of the market economy, finance plays an increasingly important role in economic development. A new economic and financial phenomenon, known as financial intervention, has emerged in recent years, which has created a series of new problems, promoting the rapid increase both in credit and investment and causing many problems on normal operation of financial bodies. In the long run, it will inevitably affect the stability and soundness of the entire economic and financial system. In order to maximize the effect of financial intervention, in response to the above problems, this article uses a series of US practices in financial intervention as the survey content, combined with the loan data provided by the US government financial intervention department, and mines the data of the general C4.5 algorithm of the decision tree algorithm. Generate a decision tree and convert it into classification rules. Next, we will discover the laws hidden behind the loan data, further discover information that may violate relevant financial policies, provide a reliable basis for financial intervention, and improve the efficiency of financial intervention. Experiments show that the method used in this article can effectively solve the above problems and has certain practicability in fiscal intervention. With stratified sampling, the risky accuracy rate increased by 10%, probably because stratified sampling increased the number of high-risk samples.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "587c6d3af27e7f4af6fadec1ceaed260",
    "relevant_keywords": [
      "decision tree",
      "classification"
    ],
    "stage1_timestamp": "2025-05-15T01:52:49.570752"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究数据挖掘技术在金融干预中的应用，目的是发现贷款数据中可能违反金融政策的信息，以提高金融干预的效率。虽然涉及金融领域，但其核心技术并未直接应用于衍生品定价、金融风险管理或投资组合管理等特定领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究数据挖掘技术在金融干预中的应用，目的是发现贷款数据中可能违反金融政策的信息，以提高金融干预的效率。虽然涉及金融领域，但其核心技术并未直接应用于衍生品定价、金融风险管理或投资组合管理等特定领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:56:37.100263"
}