{
  "paper": {
    "id": 665,
    "title": "A Deep Learning-Based Ensemble Framework to Predict IPOs Performance for Sustainable Economic Development",
    "abstract": "Addressing resource scarcity and climate change necessitates a transition to sustainable consumption and circular economy models, fostering environmental, social, and economic resilience. This study introduces a deep learning-based ensemble framework to optimize initial public offering (IPO) performance prediction while extending its application to circular economy processes, such as resource recovery and waste reduction. The framework incorporates advanced techniques, including hyperparameter optimization, dynamic metric adaptation (DMA), and the synthetic minority oversampling technique (SMOTE), to address challenges such as class imbalance, risk-adjusted metric enhancement, and robust forecasting. Experimental results demonstrate high predictive performance, achieving an accuracy of 76%, precision of 83%, recall of 75%, and an AUC of 0.9038. Among ensemble methods, Bagging achieved the highest AUC (0.90), outperforming XGBoost (0.88) and random forest (0.75). Cross-validation confirmed the framework's reliability with a median AUC of 0.85 across ten folds. When applied to circular economy scenarios, the model effectively predicted sustainability metrics, achieving R-2 values of 0.76 for both resource recovery and waste reduction with a low mean absolute error (MAE = 0.11). These results highlight the potential to align financial forecasting with environmental sustainability objectives. This study underscores the transformative potential of deep learning in addressing financial and sustainability challenges, demonstrating how AI-driven models can integrate economic and environmental goals. By enabling robust IPO predictions and enhancing circular economy outcomes, the proposed framework aligns with Industry 5.0's vision for human-centric, data-driven, and sustainable industrial innovation, contributing to resilient economic growth and long-term environmental stewardship.",
    "year": 2025,
    "source": "WOS",
    "area": "financial_risk",
    "method": "deep learning",
    "cache_key": "7d772e600950f2c704dffd4b1e98ff00",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "deep learning",
      "neural network",
      "representation learning",
      "backpropagation",
      "BP",
      "hidden layer",
      "dropout regularization"
    ],
    "stage1_timestamp": "2025-05-15T01:40:51.242542"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究使用深度学习模型预测IPO表现及其在循环经济中的应用，并未涉及衍生品定价、金融风险管理或投资组合管理等特定金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究使用深度学习模型预测IPO表现及其在循环经济中的应用，并未涉及衍生品定价、金融风险管理或投资组合管理等特定金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:02:28.939006"
}