{
  "paper": {
    "id": 1080,
    "title": "Portfolio Generation for Indian Stock Markets using Unsupervised Machine Learning",
    "abstract": "Portfolio Management is a concept of selecting the proportions of various assets that is to be held in a portfolio to have a good return without a significant risk exposure. Portfolio optimization is one important building block in financial management and investment banking. One possible strategy for minimisation of risk is by enlarging or varying its field of operation for the portfolio. Constructing an optimal portfolio by judging and selecting the best possible combinations of different portfolio is a computationally challenging problem since it comes up with an exponential complexity. Here, we have proposed a simple k-means based clustering strategy for an optimal portfolio. BSE100 stocks are represented by their fundamental financial ratios. Clustering is performed, and a prototype stock is selected from each of the clusters. An equal investment strategy demonstrates superior return as compared to the indices as well as top mutual funds. The classification is done by considering a host of investment parameters. We compare the rate of return of these stocks to the benchmark of Indian Stock Exchange.",
    "year": 2018,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "23cbce6effe63e49dc4fcc35cc3e4eee",
    "relevant_keywords": [
      "machine learning",
      "unsupervised learning",
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T01:58:43.377625"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心内容是使用无监督学习（k-means聚类）来构建最优投资组合，并比较其回报率与印度股市基准的表现。这直接涉及投资组合管理的核心问题，即资产选择和比例分配，以实现良好的回报和风险控制。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心内容是使用无监督学习（k-means聚类）来构建最优投资组合，并比较其回报率与印度股市基准的表现。这直接涉及投资组合管理的核心问题，即资产选择和比例分配，以实现良好的回报和风险控制。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:52:18.791640"
}