{
  "paper": {
    "id": 3569,
    "title": "Correlations in operational risk stress testing: use and abuse",
    "abstract": "Correlations between operational risk loss severity, frequency and economic factors have been used as a de facto tool to assess economic and regulatory capital since 1990. We demonstrate, using data from a single retail bank, that such correlations do not apply universally, and that projections of capital requirements are subject to wide error margins. Some correlations can be explained in terms of data trends. Given worldwide regulatory requirements to assess the resilience of financial institutions to economic shocks, an alternative to using correlations that makes use of economic data is proposed. The proposal is consistent with a much broader interpretation of capital allocation than has applied to date. Evidence that the Covid-19 pandemic had minimal effect on operational risk losses in 2020 is presented and the effect of model risk is emphasized. Our results show that the existence or otherwise of significant correlations depends on the regression model used, whether data series show trends, the time window concerned, geographical location and the type of financial institution.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "0adb79f3f1f6c93ff2ab33b92e8a13f8",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:27:53.944872"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on operational risk stress testing and the use of correlations to assess economic and regulatory capital, which are key aspects of financial risk management. It discusses the impact of economic factors on operational risk losses and proposes an alternative approach for capital allocation, aligning with the objectives of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on operational risk stress testing and the use of correlations to assess economic and regulatory capital, which are key aspects of financial risk management. It discusses the impact of economic factors on operational risk losses and proposes an alternative approach for capital allocation, aligning with the objectives of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:35:59.975949"
}