{
  "paper": {
    "id": 1430,
    "title": "Creating a Comprehensive Method for the Evaluation of a Company",
    "abstract": "For investment purposes, the evaluation of a company is not only a matter for a company itself, but also for shareholders and external persons. There are many methods for evaluating a company. This contribution therefore focuses on the creation of a comprehensive method for the evaluation of an industrial enterprise, one that can be used to predict potential future bankruptcies, using a dataset of financial statements of active companies and those in liquidation in the period 2015-2019. Artificial neural networks were used to process the data, specifically logistic regressions from the data processed in the Statistica and Mathematica software programmes. The results showed that the models created using the Mathematica software are not applicable in practice due to the parameters of the obtained results. In contrast, the artificial neural structures obtained using the neural network model in the Statistica software were prospective due to their performance, which is almost always above 0.8, and the logical economic interpretation of the relevant variables. All the generated and retained networks show excellent performance and few errors. However, one of the artificial structures, network no. 4 (MLP 16-16-2), produces better results than the others. Overall, accuracy is almost 81%. In the case of the classification of companies capable of surviving financial distress, accuracy is almost 90%, with that for the classification of companies at risk of going into bankruptcy at nearly 55%.",
    "year": 2020,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "1a55002abdc2ad8fa875c14a47da35e4",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "regression",
      "neural network",
      "backpropagation",
      "BP",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T02:03:00.665965"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要研究使用人工神经网络预测企业破产风险，这属于金融风险管理中的信用风险评估范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文主要研究使用人工神经网络预测企业破产风险，这属于金融风险管理中的信用风险评估范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:49:03.561558"
}