{
  "paper": {
    "id": 3,
    "title": "Financial Risk Early-Warning of Neusoft Group Based on Support Vector Machine",
    "abstract": "As an emerging development industry, the information technology industry faces the most internal and external problems without effective risk prevention measures, which requires an effective financial risk early-warning system to be established to control risks. Nowadays, the advantages of support vector machine (SVM) have gradually appeared. The research on financial risk early-warning using SVM mostly stays in dichotomy. However, the financial risk of an enterprise will not only exist in absolute risk and no risk. There are many other levels of risk categories. Therefore, this paper proposes a new financial warning idea, which extends the support vector machine dichotomous to multidivision. This article focuses on the data modeling based on the financial data of listed companies in China's A-share information technology industry and applied to the case company Neusoft Group. First, the principal component analysis method is applied to assign the weights of financial indicators, and then the efficacy coefficient method is applied to comprehensively evaluate risk classification. Finally, the classified data were input into SVM for training and testing, and the model was applied to the financial risk early warning of Neusoft Group. The research results show that the model can better predict the financial risk of Neusoft Group.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "79986b6f259b471615675856a14a8e93",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM",
      "principal components analysis"
    ],
    "stage1_timestamp": "2025-05-15T01:45:16.433667"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用支持向量机（SVM）进行财务风险预警，并应用于Neusoft集团的财务风险管理。研究目标是建立一个有效的财务风险预警系统，以控制企业的财务风险，这明确属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"该论文的核心技术是使用支持向量机（SVM）进行财务风险预警，并应用于Neusoft集团的财务风险管理。研究目标是建立一个有效的财务风险预警系统，以控制企业的财务风险，这明确属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:01:36.854823"
}