{
  "paper": {
    "id": 2195,
    "title": "Seismic fragility assessment of regional building portfolios using machine learning and Poisson binomial distribution",
    "abstract": "Ongoing urbanization trends and the growing concentration of buildings in earthquake-prone urban areas underscore the importance of probabilistic seismic performance assessments of building portfolios for earthquake risk management and reduction. While various machine learning (ML) techniques have been used in seismic fragility analysis of structures, their deterministic predictions often fall short in propagating input uncertainties (e.g., building-to-building variability within a given building type). This study introduces a probabilistic ML method for predicting the damage probability of individual buildings within a region. It also presents a probabilistic approach derived from the Poisson binomial distribution model that considers independent building functionalities to provide regional fragility models for building portfolios. A virtual testbed of simplified multi-degree of freedom (MDoF) models for each building in the portfolio is generated by randomly sampling uncertain structural design parameters. The results demonstrate that the probabilistic ML model can directly predict the damage probability parameters of each building, eliminating the need for deterministic ML methods to train models for different buildings repeatedly. The proposed probabilistic model derived by the Poisson binomial distribution effectively evaluates the seismic fragility of building portfolios, considering both structural and nonstructural damage.",
    "year": 2025,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "a0d5d1e92027e913fa3fecee1e8ee29c",
    "relevant_keywords": [
      "machine learning",
      "classification",
      "regression",
      "neural network",
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T01:04:27.388160"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究地震脆弱性评估和建筑组合的风险管理，属于自然灾害工程领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究地震脆弱性评估和建筑组合的风险管理，属于自然灾害工程领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:16:43.873497"
}