{
  "paper": {
    "id": 2939,
    "title": "INTEGRATED PART CLASSIFICATION FOR PRODUCT COST AND COMPLEXITY REDUCTION",
    "abstract": "The manufacturing industry is moving towards a truly global arena. Organizations are adopting the philosophy of design anywhere, manufacture anywhere, and sell anywhere. Global operations with local focus have become the core of an organization's strategy. Organizations are trying to have a vast product portfolio with mass customization to meet the customers' increasing demand for personalized products. While expanding the product portfolio and bringing new products to the market the aspect of product sustenance across its life cycle is often missed out. With regulatory standards becoming more stringent, product maintenance and retirement are becoming challenging and costly. The aspect of circular economy is extending the life of the product and individual parts beyond the traditional end of life with re-fabrication, reconditioning and recycling of parts. The part-level detailing is becoming very important at the design stage. This provides huge growth opportunities for organizations, but comes with challenges of increased complexity, variety and cost. One of the potential ways to address the challenges listed above is the availability and maintenance of part-level information and dynamic traceability across the lifecycle, enriched with cross functional inputs. This is important for business decision making during product portfolio planning and product design in both proactive and reactive scenarios. Based on the authors' industry experience across multiple product development organizations, it is evident that there is limited awareness of the potential of classification and its impact beyond basic part search and reuse. In this paper, we discuss the need for an integrated, cross-functional model and a common database for part information management. We present an agent-based simulation to show the benefits of such an integrated modeling strategy. In the process, the approach has the potential to also bring configurability of the product till the end of life. Configurability is from the aspect of making a product that will perform to meet customer needs along with delivering profit for business and being compliant with various regulatory norms.",
    "year": 2014,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "5be08588cff7ca843215ca98c7a4003b",
    "relevant_keywords": [
      "classification"
    ],
    "stage1_timestamp": "2025-05-15T01:11:48.506495"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要讨论制造业中的零件分类和产品生命周期管理，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要讨论制造业中的零件分类和产品生命周期管理，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:12:01.702469"
}