{
  "paper": {
    "id": 3710,
    "title": "Development of a Predictive Hospitalization Model for Skilled Nursing Facility Patients",
    "abstract": "Objectives: Identifying skilled nursing facility (SNF) patients at risk for hospitalization or death is of interest to SNFs, patients, and patients' families because of quality measures, financial penalties, and limited clinical staffing. We aimed to develop a predictive model that identifies SNF patients likely to be hospitalized or die within the next 7 days and validate the model's performance against clinician judgment. Design: Retrospective multivariate prognostic model development study. Setting and Participants: Patients in US SNFs that use the PointClickCare electronic health record (EHR) system. We used data from the first 100 days of skilled stays for 5,642,474 patients in 8440 SNFs, from January 1, 2019, through March 31, 2023. Methods: We used data collected in the course of clinical care to develop a machine learning model to predict the likelihood of patient hospitalization or death within the next 7 days. The data included vital signs, diagnoses, laboratory results, food intake, and clinical notes. We also asked SNF nurses and hospital case managers to make their own predictions as a comparison. The EHR was used as the source of information on whether the patient died or was hospitalized. Results: The model had sensitivity of 35%, specificity of 92%, positive predictive value (PPV) of 18%, and area under the receiver operator curve (AUC) of 0.75. A variation of the model in which we did not include progress notes and food intake achieved an AUC of 0.70. Nurse raters achieved a sensitivity of 61%, specificity of 73%, and PPV of 10%. Conclusions and Implications: Machine learning models can accurately predict the likelihood of hospitalization or death within the next 7 days among SNF patients. These models do not require additional SNF staff time and may be useful in readmission reduction programs by targeting more frequent monitoring proactively to those at highest risk. (c) 2024 The Author(s). Published by Elsevier Inc. on behalf of Post-Acute and Long-Term Care Medical Association. This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/ licenses/by-nc-nd/4.0/).",
    "year": 2025,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "37de01b9c2c1a09032fcf0e51d8576de",
    "relevant_keywords": [
      "machine learning",
      "classification"
    ],
    "stage1_timestamp": "2025-05-15T02:29:00.229258"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究使用机器学习模型预测护理机构患者的住院或死亡风险，属于医疗健康领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究使用机器学习模型预测护理机构患者的住院或死亡风险，属于医疗健康领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T14:24:44.042111"
}