{
  "paper": {
    "id": 722,
    "title": "The determinants of main stock exchange index changes in emerging countries: evidence from Turkey in COVID-19 pandemic age",
    "abstract": "With the emergence and spreading of COVID-19 pandemic all over the world, the uncertainty has been increasing for countries. Depending on this condition, especially emerging countries have been affected negatively by foreign portfolio investment outflows from stock exchanges, and main stock exchange indices have been collapsed. The study examines the causes of the main stock exchange index changes in Turkey in the COVID-19 period. In this context, 14 variables (3 global, 6 country-level, 5 market-level) are analyzed by employing random forest and support vector machine algorithms and using daily data between 01.02.2020 and 05.15.2020, which includes the pre-pandemic and the pandemic periods. The findings prove that (i) the most important variables are the retention amount of foreign investors in the equity market, credit default swap spreads, government bonds interest rates, Morgan Stanley Capital International (MSCI) emerging markets index, and volatility index in the pre-pandemic period; (ii) the importance of variables changes as MSCI emerging markets index, the volatility index, retention amount of foreign investors in the equity market, amount of securities held by the Central Bank of Republic of Turkey (CBRT), equity market traded value in the pandemic period; (iii) support vector machine has superior estimation accuracy concerning random forest algorithms in both pre-pandemic and pandemic period.",
    "year": 2020,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "6409ac9ed3591a2ee288a0be20a44476",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "support vector machine",
      "SVM",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T00:47:18.582427"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是COVID-19疫情期间土耳其主要股票交易所指数变化的原因，使用了随机森林和支持向量机算法来分析影响指数变化的变量。虽然涉及金融市场和投资行为，但并未明确指出其核心技术应用于衍生品定价、金融风险管理或投资组合管理中的任何一个特定领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是COVID-19疫情期间土耳其主要股票交易所指数变化的原因，使用了随机森林和支持向量机算法来分析影响指数变化的变量。虽然涉及金融市场和投资行为，但并未明确指出其核心技术应用于衍生品定价、金融风险管理或投资组合管理中的任何一个特定领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:28:23.120227"
}