{
  "paper": {
    "id": 65,
    "title": "A study of Taiwan's issuer credit rating systems using support vector machines",
    "abstract": "By providing credit risk information, credit rating systems benefit most participants in financial markets, including issuers, investors, market regulators and intermediaries. In this paper, we propose an automatic classification model for issuer credit ratings, a type of fundamental credit rating information, by applying the support vector machine (SVM) method. This is a novel classification algorithm that is famous for dealing with high dimension classifications. We also use three new variables: stock market information, financial support by the government, and financial support by major shareholders to enhance the effectiveness of the classification. Previous research has seldom considered these variables. The data period of the input variables used in this study covers three years, while most previous research has only considered one year. We compare our SVM model with the back propagation neural network (BP), a well-known credit rating classification method. Our experiment results show that the SVM classification model performs better than the BP model. The accuracy rate (84.62%) is also higher than previous research. (c) 2005 Elsevier Ltd. All rights reserved.",
    "year": 2006,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "64066f8cb46a584e9ae7d74a4e8272f9",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM",
      "neural network",
      "backpropagation",
      "BP"
    ],
    "stage1_timestamp": "2025-05-15T01:46:39.458657"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用支持向量机（SVM）方法构建发行人信用评级的自动分类模型，旨在提供信用风险信息。信用评级是金融风险管理的重要组成部分，用于评估和预测信用风险，因此该论文的主要应用领域是金融风险管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"该论文的核心技术是使用支持向量机（SVM）方法构建发行人信用评级的自动分类模型，旨在提供信用风险信息。信用评级是金融风险管理的重要组成部分，用于评估和预测信用风险，因此该论文的主要应用领域是金融风险管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:01:11.552223"
}