{
  "paper": {
    "id": 2993,
    "title": "Financial performance persistence in serial entrepreneurship",
    "abstract": "This study aims to determine whether financial performance is persistent in serial entrepreneurship and, if so, whether good performance is more persistent than bad. It is novel as studies focusing on financial performance in successive firms ran by serial entrepreneurs are scarce. The paper creates a multi-theoretical framework from which four hypotheses are drawn. These focus on the persistence of firm size, export intensity, financial risk level, and payment defaults in serial entrepreneurship, all of which have been rarely utilized in such research. The validation of hypotheses is conducted by using ordinary least squares regression with a sample of 1599 Estonian serial entrepreneurs, being further divided into those with earlier good or bad performance. The dependent and independent variables, supplemented by various controls, portray the four performance measures in serial entrepreneurs' new and old firms. The regression analyses show that financial performance persists in serial entrepreneurship in general. Good performance is more persistent than bad, indicating inter-firm transfer of financial success. In most cases, bad performance is not persistent at all, indicating that some serial entrepreneurs repeat their earlier poor results, while others improve their future performance.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "08d0b928cfc043004790f16179e55a56",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:21:19.272701"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究连续创业中财务表现的持续性，涉及企业规模、出口强度、财务风险水平和支付违约等方面，但并未明确指出其核心技术或研究成果应用于衍生品定价、金融风险管理或投资组合管理等特定金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究连续创业中财务表现的持续性，涉及企业规模、出口强度、财务风险水平和支付违约等方面，但并未明确指出其核心技术或研究成果应用于衍生品定价、金融风险管理或投资组合管理等特定金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:39:17.354418"
}