{
  "paper": {
    "id": 466,
    "title": "Development of an adaptive business insolvency classifier prototype (AVICENA) using hybrid intelligent algorithms",
    "abstract": "Confronted by an increasingly competitive environment and chaotic economy conditions, businesses are facing with the need to accept greater risk. Businesses do not become insolvent overnight, rather many times creditors, investors and the financial community will receive either direct or indirect indications that a company is experiencing financial distress. Thus, this paper analyzed the ability of AVICENA in classifying business insolvency performance events. Neural networks (Multi layer Perceptron - Backpropagation) serves as a classifier mechanism while Apriori algorithms (Auto Association Rules) supports the decision made by the neural networks, in which rules are generated. The conventional model in predicting business performances, called as Altman- Z Scores model is used for performance comparison.",
    "year": 2002,
    "source": "WOS",
    "area": "financial_risk",
    "method": "deep learning",
    "cache_key": "d099816a54569ce4aa02434c64a44895",
    "relevant_keywords": [
      "machine learning",
      "classification",
      "neural network",
      "backpropagation",
      "BP",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T01:38:59.132325"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on developing a classifier prototype (AVICENA) to predict business insolvency, which is a key aspect of financial risk management, particularly in assessing credit risk and financial distress of companies.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on developing a classifier prototype (AVICENA) to predict business insolvency, which is a key aspect of financial risk management, particularly in assessing credit risk and financial distress of companies.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:02:53.608998"
}