{
  "paper": {
    "id": 151,
    "title": "Enhancing Currency Option Pricing Models: Incorporating Dynamic Information Costs and Machine Learning Techniques",
    "abstract": "The concept of information cost has evolved over time and has been applied to various decision problems, including currency option pricing. This research delves into the impact of dynamic information costs on the currency option pricing model, innovatively developed by Dammak et al. (J Econ Asymmetries 28:e00337, 2023a https://doi.org/10.1016/j.jeca.2023.e00337, Global Finance J, 2023b https://doi.org/10.1016/j.gfj.2023.100897). We utilize the Differential Evolution algorithm to calibrate the novel information cost parameters, using data from various currency call options pairs from January 1, 2018, to November 24, 2022. A satisfactory approximation of real market currency option prices is achieved through this methodology. Additionally, we harness the power of machine learning to predict the values of effective domestic and foreign interest rates within a changing information cost landscape. By partitioning our dataset into training and test sets, our study demonstrates that the new model, incorporating dynamic information costs, generates more accurate and stable pricing outcomes. This research marks a substantive contribution to the evolving field of option pricing, emphasizing the potential of machine learning techniques in solving complex financial problems.",
    "year": 2025,
    "source": "WOS",
    "area": "derivatives_pricing",
    "method": "machine learning",
    "cache_key": "c82b9d254d40f127f794cb13a8b474fd",
    "relevant_keywords": [
      "machine learning",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:29:08.991176"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Derivatives Pricing"
    ],
    "justification": "该论文的核心研究内容是改进货币期权定价模型，通过引入动态信息成本和机器学习技术来更准确地定价货币期权。这直接属于衍生品定价领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"衍生品定价\"],\n  \"justification\": \"该论文的核心研究内容是改进货币期权定价模型，通过引入动态信息成本和机器学习技术来更准确地定价货币期权。这直接属于衍生品定价领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:06:28.702273"
}