{
  "paper": {
    "id": 7509,
    "title": "The prevalence and risk of symptom and function clusters in colorectal cancer survivors",
    "abstract": "Purpose Our purpose was to describe the prevalence and predictors of symptom and function clusters in a diverse cohort of colorectal cancer survivors. Methods We used data from a cohort of 909 adult colorectal cancer survivors. Participants were surveyed at a median of 9 months after diagnosis to ascertain the co-occurrence of eight distinct symptom and functional domains. We used factor analysis to identify co-occurring domains and latent profile analysis (LPA) to identify subgroups of survivors with different symptom and function clusters. Multinomial logistic regression models were used to identify risk/protective factors. Results Factor analysis demonstrated a single underlying factor structure that included all eight health domains with depression and anxiety highly correlated (r = 0.87). The LPA identified three symptom and function clusters, with 30% of survivors in the low health-related quality of life (HRQOL) profile having the highest symptom burden and lowest functioning. In multivariable models, survivors more likely to be in the low HRQOL profile included being non-White, female, those with a history of cardiac or mental health conditions, and chemotherapy recipients. Survivors less likely to be in the low HRQOL profile included those with older age, greater financial well-being, and more spirituality. Conclusion Nearly one-third of colorectal cancer survivors experienced a cluster of physical and psychosocial symptoms that co-occur with clinically relevant deficits in function. Implications for Cancer Survivors Improving the identification of risk factors for having the highest symptom and lowest function profile can inform the development of clinical interventions to mitigate their adverse impact on cancer survivors' HRQOL.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "976fdc0fec74e09bada03c0c8dd5248d",
    "relevant_keywords": [
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T03:09:07.368689"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究结直肠癌幸存者的症状和功能集群的流行率和风险因素，属于医学和健康研究领域，与金融领域的衍生品定价、金融风险管理和投资组合管理无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究结直肠癌幸存者的症状和功能集群的流行率和风险因素，属于医学和健康研究领域，与金融领域的衍生品定价、金融风险管理和投资组合管理无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:26:15.875669"
}