{
  "paper": {
    "id": 1182,
    "title": "Deep learning for efficient frontier calculation in finance",
    "abstract": "We propose deep neural network algorithms to calculate the efficient frontier in mean-variance and mean-conditional value-at-risk (mean-CVaR) portfolio optimization problems. Starting with the mean-variance portfolio optimization problem in the Black-Scholes framework, we first compare the analytical solution with the computed one, and we show the efficiency of the methodology in high dimensions. Adding additional constraints, we compare different formulations and, obtaining the same frontier, show that the no short selling and no borrowing problem can be solved with all formulations. Then, a new projected feedforward network is shown to be able to deal with some local and global constraints on the weights of the portfolio while outperforming classical penalization methods. We extend our numerical results to assets following the Heston model, and we show that the results obtained in the Black-Scholes method still hold. Finally, we present numerical results for the more difficult mean-CVaR optimization problem, which we show are realistic only for algorithms with a global resolution of the problem.",
    "year": 2022,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "2f17334014f2915447017a3e64834e95",
    "relevant_keywords": [
      "machine learning",
      "neural network",
      "deep learning",
      "representation learning",
      "backpropagation",
      "BP",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T00:52:33.926473"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心内容是使用深度神经网络算法计算均值-方差和均值-CVaR投资组合优化问题中的有效前沿，这直接属于投资组合管理的研究领域。论文还讨论了在不同约束条件下的投资组合优化问题，进一步证实了其应用领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心内容是使用深度神经网络算法计算均值-方差和均值-CVaR投资组合优化问题中的有效前沿，这直接属于投资组合管理的研究领域。论文还讨论了在不同约束条件下的投资组合优化问题，进一步证实了其应用领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:23:28.217911"
}