{
  "paper": {
    "id": 421,
    "title": "Forecasting spot prices of agricultural commodities in India: Application of deep-learning models",
    "abstract": "Food price fluctuations can impact both producers and consumers. Forecasting the prices of the agricultural commodities is of prime concern not only to the government but also to farmers and agribusiness firms. In developing countries like India, management of food security needs competent and efficient forecasting of food prices. With the availability of data, recent innovation in deep-learning models provides a feasible solution to accurately forecast the prices. In this study, we examine the superiority of these models using the daily spot prices of five major commodities traded on the National Commodity and Derivatives Exchange: cotton seed, castor seed, rape mustard seed, soybean seed, and guar seed. The results were obtained from the application of the traditional univariate autoregressive integrated moving average model and deep-learning techniques like the time-delay neural network (TDNN) and long short-term memory (LSTM) network. The empirical results indicate that the LSTM model is indeed suitable for the financial domain and captures the directional movement of the spot price changes with high accuracy compared with the TDNN and other linear models. Accuracy of the performance of these models has been compared using out-of-sample performance measure. The overall objective of this paper is to demonstrate the utility of spot price forecasting for farmers and traders in offering them the best predictions of the price movements. Our results provide a possibility of developing pricing models that can help in fairly regulating agricultural commodity prices.",
    "year": 2021,
    "source": "WOS",
    "area": "derivatives_pricing",
    "method": "machine learning",
    "cache_key": "20f332b2ba07284b724d6b71b22470e4",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "neural network",
      "long short-term memory",
      "LSTM",
      "representation learning"
    ],
    "stage1_timestamp": "2025-05-15T01:31:50.723005"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究使用深度学习模型预测农产品现货价格，虽然涉及金融市场数据，但其核心应用是价格预测而非衍生品定价、金融风险管理或投资组合管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究使用深度学习模型预测农产品现货价格，虽然涉及金融市场数据，但其核心应用是价格预测而非衍生品定价、金融风险管理或投资组合管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:05:09.763758"
}