{
  "paper": {
    "id": 651,
    "title": "The absorption and multiplication of uncertainty in machine-learning-driven finance",
    "abstract": "Uncertainty about market developments and their implications characterize financial markets. Increasingly, machine learning is deployed as a tool to absorb this uncertainty and transform it into manageable risk. This article analyses machine-learning-based uncertainty absorption in financial markets by drawing on 182 interviews in the finance industry, including 45 interviews with informants who were actively applying machine-learning techniques to investment management, trading, or risk management problems. We argue that while machine-learning models are deployed to absorb financial uncertainty, they also introduce a new and more profound type of uncertainty, which we call critical model uncertainty. Critical model uncertainty refers to the inability to explain how and why the machine-learning models (particularly neural networks) arrive at their predictions and decisions-their uncertainty-absorbing accomplishments. We suggest that the dialectical relation between machine-learning models' uncertainty absorption and multiplication calls for further research in the field of finance and beyond.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "6f0ecffb147d6c6cd38aa1dd01ff7e82",
    "relevant_keywords": [
      "machine learning",
      "neural network",
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T01:53:24.940906"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk",
      "Portfolio Management"
    ],
    "justification": "The paper discusses the application of machine learning techniques to absorb and manage uncertainty in financial markets, specifically mentioning their use in investment management, trading, and risk management problems. This indicates relevance to both financial risk management and portfolio management, as these areas involve dealing with market uncertainties and making investment decisions.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\", \"Portfolio Management\"],\n  \"justification\": \"The paper discusses the application of machine learning techniques to absorb and manage uncertainty in financial markets, specifically mentioning their use in investment management, trading, and risk management problems. This indicates relevance to both financial risk management and portfolio management, as these areas involve dealing with market uncertainties and making investment decisions.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:56:14.334093"
}