{
  "paper": {
    "id": 3761,
    "title": "Risk hedging properties of infrastructure: a quantile regression approach",
    "abstract": "PurposeThis paper aims to examine the hedge, diversifier and safe haven properties of the global listed infrastructure sector and subsector indices against two traditional asset classes, stocks and bonds, and four alternative asset classes, including commodities, real estate, private equity and hedge funds during extreme negative stock market movements. Design/methodology/approachUsing dynamic conditional correlation and quantile regression, the authors analyze a data set of 12 indices comprising listed infrastructure and traditional asset classes from 2010 to 2019. FindingsOverall, the findings indicate that listed infrastructure acts as an effective diversifier but not as a strong safe haven or hedge when considered in a multiasset context. With minor exceptions, listed infrastructure cannot be concluded as a safe haven against other asset classes under investigation. Practical implicationsThe present study has implications for institutional investors looking to incorporate infrastructure in their multiasset portfolios for increased portfolio diversification benefits. Originality/valueDespite the increased influence of infrastructure as an asset class, to the best of the authors' knowledge, this is the first study to investigate the hedge, safe haven and diversifying properties of infrastructure in a multi-asset context.",
    "year": 2023,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "bfc7df218efd9919c27ad3b32d926c87",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:20:36.010835"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk",
      "Portfolio Management"
    ],
    "justification": "该论文研究了基础设施资产类别在极端市场条件下的对冲、分散和避险特性，这直接涉及金融风险管理中的风险对冲和分散策略。同时，论文还讨论了基础设施资产在多资产投资组合中的多样化效益，这属于投资组合管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\", \"投资组合管理\"],\n  \"justification\": \"该论文研究了基础设施资产类别在极端市场条件下的对冲、分散和避险特性，这直接涉及金融风险管理中的风险对冲和分散策略。同时，论文还讨论了基础设施资产在多资产投资组合中的多样化效益，这属于投资组合管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T14:20:20.180241"
}