{
  "paper": {
    "id": 341,
    "title": "Financial Risk Measurement and Prediction Modelling for Sustainable Development of Business Entities Using Regression Analysis",
    "abstract": "The issue of the debt, bankruptcy or non-bankruptcy of a company is presented in this article as one of the ways of conceiving risk management. We use the Amadeus database to obtain the financial and accounting data of Slovak enterprises from 2015 and 2016 to calculate the most important financial ratios that may affect the financial health of the company. The main aim of the article is to reveal financial risks of Slovak entities and to form a prediction model, which is done by the identification of significant predictors having an impact on the health of Slovak companies and their future prosperity. Realizing the multiple regression analysis, we identified the significant predictors in conditions of the specific economic environment to estimate the corporate prosperity and profitability. The results gained in the research are extra important for companies themselves, but also for their business partners, suppliers and creditors to eliminate financial and other corporate risks related to the unhealthy or unfavorable financial situation of the company.",
    "year": 2018,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "c1eaf5ae73d6307b6b04e7f6351aa25b",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:49:41.057130"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心目标是揭示斯洛伐克实体的财务风险并构建预测模型，通过回归分析识别影响公司财务健康和未来繁荣的重要预测因子。这直接涉及金融风险管理领域，特别是企业财务风险评估和预测。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"该论文的核心目标是揭示斯洛伐克实体的财务风险并构建预测模型，通过回归分析识别影响公司财务健康和未来繁荣的重要预测因子。这直接涉及金融风险管理领域，特别是企业财务风险评估和预测。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:59:02.055126"
}