{
  "paper": {
    "id": 5192,
    "title": "A multicriteria decision support tool for modelling bank credit ratings",
    "abstract": "We introduce an application of the SMAA-Fuzzy-FlowSort approach to the case of modelling bank credit ratings. Its stochastic nature allows for imprecisions and uncertainty that naturally surround a decision-making exercise to be embedded into the proposed framework, whilst its output complements the ordinal nature of a crisp classification with cardinal information that shows the degree of membership to each rating category. Combined with the SMAA variant of GAIA that offers a visual of a bank's judgmental analysis, both recent approaches provide a holistic multicriteria decision support tool in the hands of a credit analyst and enable a rich inferential procedure to be conducted. To illustrate the assets of this framework, we provide a case study evaluating the credit risk of 55 EU banks according to their financial fundamentals.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "451745dc8e537db14f6a099d8c365bb1",
    "relevant_keywords": [
      "classification"
    ],
    "stage1_timestamp": "2025-05-15T02:45:17.111436"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on modeling bank credit ratings and evaluating credit risk, which are key components of financial risk management. The proposed multicriteria decision support tool is specifically designed to assist credit analysts in assessing the creditworthiness of banks, a critical aspect of risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on modeling bank credit ratings and evaluating credit risk, which are key components of financial risk management. The proposed multicriteria decision support tool is specifically designed to assist credit analysts in assessing the creditworthiness of banks, a critical aspect of risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:31:07.379486"
}