{
  "paper": {
    "id": 3803,
    "title": "Revolving credit card holders: Who are they and how can they be identified?",
    "abstract": "All major credit card issuers, to a greater or lesser extent, are holding a portfolio consisting of three types of credit card holder: (i) non-active card holders; (ii) non-interest paying active card holders; and (iii) interest paying active card holders. This article, using two quantitative techniques more commonly associated with credit risk management or credit scoring, is concerned with identifying the characteristics of active card holders with the greatest propensity to revolve (i.e. pay interest). The sample consists of 27,681 bank credit card holders who had held and used their card in the 14 month sample period. Data was available on 313 socio-demographic and behavioural variables for which, a priori, there was good reason to include so as to discriminate between users who paid interest on their outstanding balances (i.e. revolvers) and those who did not. The main result of this research is that the most important discriminating variables are derived from the card holder's behaviour (i.e. cash advances, minimum payment due, interest paid in previous periods). This result is derived from and supported ky the two competing techniques used for the analysis: Linear Discriminant Analysis and Logistic Regression.",
    "year": 2001,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "4222269ccd6e8f4a4628dee96f15f6ad",
    "relevant_keywords": [
      "supervised learning",
      "classification",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:21:08.201282"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要研究使用监督学习技术（线性判别分析和逻辑回归）来识别信用卡持有人的还款行为特征，特别是那些倾向于支付利息的持卡人。这属于信用风险管理的范畴，是金融风险管理的一个重要方面。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文主要研究使用监督学习技术（线性判别分析和逻辑回归）来识别信用卡持有人的还款行为特征，特别是那些倾向于支付利息的持卡人。这属于信用风险管理的范畴，是金融风险管理的一个重要方面。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:08:48.651737"
}