{
  "paper": {
    "id": 5812,
    "title": "Potentials and challenges of deep-learning- assisted porosity prediction based on thermo- graphic in situ monitoring in laser powder bed fusion",
    "abstract": "Laser powder bed fusion is one of the most promising additive manufacturing techniques for printing complex-shaped metal components. However, the formation of subsurface porosity poses a significant risk to the service lifetime of the printed parts. In situ monitoring offers the possibility to detect porosity already during manufacturing. Thereby, process feedback control or a manual process interruption to cut financial losses is enabled. Short-wave infrared thermography can monitor the thermal history of manufactured parts which is closely connected to the probability of porosity formation. Artificial intelligence methods are increasingly used for porosity prediction from the obtained large amounts of complex monitoring data. In this study, we aim to identify the potential and the challenges of deep-learning-assisted porosity prediction based on thermographic in situ monitoring. Therefore, the porosity prediction task is studied in detail using an exemplary dataset from the manufacturing of two Haynes282 cuboid components. Our trained 1D convolutional neural network model shows high performance (R-2 score of 0.93) for the prediction of local porosity in discrete sub-volumes with dimensions of (700 x 700 x 40) mu m(3). It could be demonstrated that the regressor correctly predicts layer-wise porosity changes but presumably has limited capability to predict differences in local porosity. Furthermore, there is a need to study the significance of the used thermogram feature inputs to streamline the model and to adjust the monitoring hardware. Moreover, we identified multiple sources of data uncertainty resulting from the in situ monitoring setup, the registration with the ground truth X-ray-computed tomography data and the used preprocessing workflow that might influence the model's performance detrimentally.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "8f774163e5aa0057ddf2a940e1966eab",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "regression",
      "neural network",
      "deep learning",
      "convolutional neural network",
      "CNN"
    ],
    "stage1_timestamp": "2025-05-15T02:51:30.143777"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究深度学习在激光粉末床熔融过程中的孔隙率预测，属于材料科学和制造工程领域，与金融研究领域无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究深度学习在激光粉末床熔融过程中的孔隙率预测，属于材料科学和制造工程领域，与金融研究领域无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:29:36.736306"
}