{
  "paper": {
    "id": 8626,
    "title": "Variability of Social Inclusion Patterns Involving Personal, Family and Social Characteristics in Latino Migrant Families in Spain",
    "abstract": "Migration entails important changes for families. Despite existing evidence on the process of adaptation, little is known about the degree of social inclusion in a context of high cultural affinity. We examine the variability of social inclusion patterns, indexed by personal, family and social conditions, in 263 Latin American families, with at least one child under 12 years, migrating to Spain. Three profiles of social inclusion were identified using cluster analysis: High inclusion (32%), characterized by a good financial and job situation, low perception of economic difficulty, good social support and medium scores in attraction to neighbourhood and community belonging and high scores in neighbourly relationship. Partial inclusion (35%) was characterized by ratings of extreme economic difficulties and lack of job, high scores in perceived economic hardship, high scores in all types of social support (instrumental, emotional and affectionate support and positive social interaction) and high scores in attraction to neighbourhood and community belonging, and medium scores in neighbourly relationship. Finally, Low inclusion cluster (33%) was characterized by moderate economic difficulties and lack of a job, high scores in perceived economic hardship, low scores in all types of social support and low neighbourhood cohesion in all the factors. Multinomial logistic regression analysis showed that a model comprising family composition, size of social networks and years of residence in the community increased the probability of belonging to the Partial or Low inclusion profiles compared with the High inclusion one. In conclusion, the heterogeneity in the patterns of social inclusion and their intersection with family conditions suggests the need for targeted intervention actions to reduce the risk of social exclusion.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "7b9000ec44464dec3c25b354ba8a33a3",
    "relevant_keywords": [
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T03:20:55.855018"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究拉丁美洲移民家庭在西班牙的社会融入模式，涉及社会学和心理学领域，并未提及任何与衍生品定价、金融风险管理或投资组合管理相关的应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究拉丁美洲移民家庭在西班牙的社会融入模式，涉及社会学和心理学领域，并未提及任何与衍生品定价、金融风险管理或投资组合管理相关的应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:25:35.904122"
}