{
  "paper": {
    "id": 4524,
    "title": "ANFIS-AMAL: Android Malware Threat Assessment Using Ensemble of ANFIS and GWO",
    "abstract": "The Android malware has various features and capabilities. Various malware has distinctive characteristics. Ransomware threatens financial loss and system lockdown. This paper proposes a threat-assessing approach using the Grey Wolf Optimizer (GWO) to train and tune the Adaptive Neuro-Fuzzy Inference System (ANFIS) to categorize Android malware accurately. GWO improves efficiency and efficacy in ANFIS training and learning for Android malware feature selection and classification. Our approach categorizes Android malware as a high, moderate, or low hazard. The proposed approach qualitatively assesses risk based on critical features and threats. Our threat-assessing mechanism's scale categorizes Android malware. The proposed approach resolves the issue of overlapping features in different types of malware. Comparative results with other classifiers show that the ensemble of GWO is effective in the training and learning process of ANFIS and thus achieves 95% F-score, 94% specificity, and 94% accuracy. The ensemble makes fast learning possible and improves classification accuracy.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "960f0e9cef053619af79eae436ba6f32",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "feature learning",
      "neural network",
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T02:38:20.304020"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是使用ANFIS和GWO进行Android恶意软件的分类和威胁评估，其核心技术应用于网络安全领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是使用ANFIS和GWO进行Android恶意软件的分类和威胁评估，其核心技术应用于网络安全领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:32:54.593490"
}