{
  "paper": {
    "id": 1853,
    "title": "Artificial intelligence and machine learning in finance: Identifying foundations, themes, and research clusters from bibliometric analysis",
    "abstract": "Artificial intelligence (AI) and machine learning (ML) are two related technologies that are emergent in financial scholarship. However, no review, to date, has offered a wholistic retrospection of this research. To address this gap, we provide an overview of AI and ML research in finance. Using both co-citation and bibliometric-coupling analyses, we infer the thematic structure of AI and ML research in finance for 1986-April 2021. By uncovering nine (co-citation) and eight (bibliometric coupling) specific clusters of finance that apply AI and ML, we further identify three overarching groups of finance scholarship that are roughly equivalent for both forms of analysis: (1) portfolio construction, valuation, and investor behavior; (2) financial fraud and distress; and (3) sentiment inference, forecasting, and planning. Additionally, using co-occurrence and confluence analyses, we highlight trends and research directions regarding AI and ML in finance research. Our results provide assessment of AI and ML in finance research. (C) 2021 Elsevier B.V. All rights reserved.",
    "year": 2021,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "f18d3426bc3ac43337f4df19d7189984",
    "relevant_keywords": [
      "machine learning",
      "neural network",
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T01:00:27.323126"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "论文摘要中明确提到'portfolio construction'作为AI和ML在金融研究中的一个主要应用集群，这直接对应于投资组合管理领域。虽然论文也提到其他应用如金融欺诈和情绪推断，但这些不属于指定的三个领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"论文摘要中明确提到'portfolio construction'作为AI和ML在金融研究中的一个主要应用集群，这直接对应于投资组合管理领域。虽然论文也提到其他应用如金融欺诈和情绪推断，但这些不属于指定的三个领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:18:40.972658"
}