{
  "paper": {
    "id": 854,
    "title": "MCDM APPROACH TO EVALUATING BANK LOAN DEFAULT MODELS",
    "abstract": "Banks and financial institutions rely on loan default prediction models in credit risk management. An important yet challenging task in developing and applying default classification models is model evaluation and selection. This study proposes an evaluation approach for bank loan default classification models based on multiple criteria decision making (MCDM) methods. A large real-life Chinese bank loan dataset is used to validate the proposed approach. Specifically, a set of performance metrics is utilized to measure a selection of statistical and machine-learning default models. The technique for order preference by similarity to ideal solution (TOPSIS), a MCDM method, takes the performances of default classification models on multiple performance metrics as inputs to generate a ranking of default risk models. In addition, feature selection and sampling techniques are applied to the data pre-processing step to handle high dimensionality and class unbalancedness of bank loan default data. The results show that K-Nearest Neighbor algorithm has a good potential in bank loan default prediction.",
    "year": 2014,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "9b780b022a496d08263d45b040de79cd",
    "relevant_keywords": [
      "machine learning",
      "classification",
      "feature learning",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T01:55:41.691210"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on evaluating bank loan default prediction models using MCDM methods, which is directly related to credit risk management—a key aspect of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on evaluating bank loan default prediction models using MCDM methods, which is directly related to credit risk management—a key aspect of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:54:15.650689"
}