{
  "paper": {
    "id": 978,
    "title": "Banks' stock price crash risk prediction with textual analysis: a machine learning approach",
    "abstract": "This study develops models that predict banks' stock price crash risk using novel machine learning techniques. A key element of our approach is that we retrieve textual information from ECB presidents' speeches. To this end, we employ quarter-bank level data and various measures for stock price crash risk, ensuring the robustness of our findings. First, we find that the machine learning models can generally perform better than the simple regressions. Next, our results also suggest that textual information from the ECB president's speeches has significant predictive power. Finally, when we jointly use textual information and macro-financial variables as inputs, the performance of our models is substantially increased compared to models using a single type of input. Our empirical findings provide significant policy implications for investors and policymakers as they can help regulators assess the financial system's stability and identify any potential systemic risks, allowing them to take proactive measures to prevent or mitigate a financial crisis.",
    "year": 2025,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "e5a8cfb2e4a8df27bd26ea900d51e7df",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "regression",
      "feature representation"
    ],
    "stage1_timestamp": "2025-05-15T01:57:29.842021"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用机器学习模型预测银行股票价格的崩盘风险，这直接涉及金融风险管理领域。研究目标是通过分析ECB主席演讲的文本信息和宏观金融变量来评估金融系统的稳定性并识别潜在的系统性风险，这些都是金融风险管理的典型应用场景。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是使用机器学习模型预测银行股票价格的崩盘风险，这直接涉及金融风险管理领域。研究目标是通过分析ECB主席演讲的文本信息和宏观金融变量来评估金融系统的稳定性并识别潜在的系统性风险，这些都是金融风险管理的典型应用场景。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:53:04.255447"
}