{
  "paper": {
    "id": 854,
    "title": "Automated Bitcoin Trading dApp Using Price Prediction from a Deep Learning Model",
    "abstract": "Distributed ledger technology (DLT) and cryptocurrency have revolutionized the financial landscape and relevant applications, particularly in investment opportunities. Despite its growth, the market's volatility and technical complexities hinder widespread adoption. This study proposes a cryptocurrency trading system powered by advanced machine learning (ML) models to address these challenges. By leveraging random forest (RF), long short-term memory (LSTM), and bi-directional LSTM (Bi-LSTM) models, the cryptocurrency trading system is equipped with strong predictive capacity and is able to optimize trading strategies for Bitcoin. The up-to-date price prediction information obtained by the machine learning model is incorporated by custom oracle contracts and is transmitted to portfolio smart contracts. The integration of smart contracts and on-chain oracles ensures transparency and security, allowing real-time verification of portfolio management. The deployed cryptocurrency trading system performs these actions automatically without human intervention, which greatly reduces barriers to entry for ordinary users and investors. The results demonstrate the feasibility of creating a cryptocurrency trading system, with the LSTM model achieving a return on investment (ROI) of 488.74% for portfolio management during the duration of 9 December 2022 to 23 May 2024. The ROI obtained by the LSTM model is higher than the performance of Bitcoin at 234.68% and that of other benchmarking models with RF and Bi-LSTM over the same timeframe. This approach offers significant cost savings, transparent portfolio management, and a trust-free platform for investors, paving the way for broader cryptocurrency adoption. Future work will focus on enhancing prediction accuracy and achieving greater decentralization.",
    "year": 2025,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "92879ae2077986fe4f392d5f9bb84bbc",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "neural network",
      "long short-term memory",
      "LSTM",
      "representation learning"
    ],
    "stage1_timestamp": "2025-05-15T00:49:03.127572"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是使用深度学习模型（如LSTM）进行比特币价格预测，并自动优化交易策略，其应用场景明确指向投资组合管理，旨在通过实时验证和自动化交易来提高投资回报率。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是使用深度学习模型（如LSTM）进行比特币价格预测，并自动优化交易策略，其应用场景明确指向投资组合管理，旨在通过实时验证和自动化交易来提高投资回报率。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:27:18.335052"
}