{
  "paper": {
    "id": 4045,
    "title": "Integrating spatial and biomass planning for the United States",
    "abstract": "Biomass is low-carbon energy and has tremendous potential as an alternative to fossil fuels. However, the significant role of biomass in future low-carbon energy portfolio depends heavily on its consumption. The paper presents a first attempt to examine the spatial-temporal patteins of biomass consumption in the United States (US), using a novel method-spatial Seemingly Unrelated Regression (SUR) model, in order to strengthen the link between energy planning and spatial planning. In order to obtain the robust parameters of spatial SUR models and estimate the parameters efficiently, an iterative maximum likelihood method, which takes full advantage of the stationary characteristic of maximum likelihood estimation, has been developed. The robust parameters of models can help draw a proper inference for biomass consumption. Then the spatial-temporal patterns of biomass consumption in the US at the state level are investigated using the spatial SUR models with the estimation method developed and data covering the period of 2000-2012. Results show that there are spatial dependences among biomass consumption. The presence of spatial dependence in biomass consumption has informative implications for making sustainable biomass polices. It suggests new efforts to adding a cross-state dimension to state-level energy policy and coordinating some elements of energy policy across states are still needed. In addition, results consistent with classic economic theory further proves the correctness of applying the spatial SUR models to investigate the spatial-temporal patterns of biomass consumption. (C) 2016 Elsevier Ltd. All rights reserved.",
    "year": 2016,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "f46c31dfd67c256b280b1789fa29b1ae",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:23:27.269604"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究生物质能源消费的时空模式及其政策影响，使用了空间回归模型进行数据分析，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究生物质能源消费的时空模式及其政策影响，使用了空间回归模型进行数据分析，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:08:20.240023"
}