{
  "paper": {
    "id": 257,
    "title": "Predictive analytics in customer behavior: Anticipating trends and preferences",
    "abstract": "In order to effectively manage their customers, businesses need to thoroughly analyze the costs and advantages associated with various alternative expenditures and investments and determine the most effective way to allocate resources to marketing and sales activities over time. Those in charge of making decisions will reap the benefits of decision support models that estimate the value of the customer portfolio and tie expenses to customers' purchasing behavior. In the current work, various machine learning algorithms such as Decision Tree (DT), Random Forest (RT), Logistic Regression (LR), Support Vector Machines (SVM), and gradient boosting are used to predict customer behavior. The evaluation criteria considered in the work include precision, recall, F1-Score, and ROC-AUC. The accuracy values obtained for DT, RT, LR, SVM, and gradient boosting are 0.787, 0.806, 0.826, 0.826, and 0.823, respectively. The results emphasize RT and LR's good performance, while the values of 0.620, 1, 0.766, and 0.878 for the precision, recall, F1-score, and ROC-AUC score outperform the rest. The novelty of this work lies in employing a comprehensive set of machine learning algorithms to predict customer behavior, with a particular emphasis on the superior performance of RF and LR models, as demonstrated by their high precision, recall, F1-score, and ROC-AUC values.",
    "year": 2024,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "380eaa0094a62f0db08a130ecffdabe5",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T00:41:04.753454"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究使用机器学习算法预测客户行为，目的是优化企业的营销和销售资源分配，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究使用机器学习算法预测客户行为，目的是优化企业的营销和销售资源分配，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:32:17.783880"
}