{
  "paper": {
    "id": 2489,
    "title": "Improving Optimal Terminal Value Replicating Portfolios",
    "abstract": "Currently, several large life insurance companies apply the replicating portfolio technique for valuation and risk management of their liabilities. In [7], the two most common approaches, cash-flow matching and terminal value matching, have been investigated from a theoretical perspective and it has been shown that optimal terminal value replicating portfolios are not suitable to replicate liability cash-flows by construction. Thus, their usage for asset liability management is rather restricted, especially for out-of-sample cash profiles of liabilities. In this paper, we therefore enhance the terminal value approach by an additional linear regression of the corresponding optimal dynamic numeraire strategy to overcome this drawback. We show that terminal value matching together with an approximated dynamic strategy has in-sample and out-of-sample performance very close to the optimal cash-flow matching portfolio and, due to computational advantages, can thus be used as an alternative for cash-flow matching, especially in risk and asset liability management.",
    "year": 2015,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "73bcd435528f196d3f3121f83784e4b3",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:07:03.128256"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk",
      "Portfolio Management"
    ],
    "justification": "The paper focuses on improving the terminal value replicating portfolio technique, which is used for valuation and risk management of liabilities by life insurance companies. This directly relates to financial risk management. Additionally, the discussion on optimal dynamic numeraire strategy and asset liability management pertains to portfolio management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\", \"Portfolio Management\"],\n  \"justification\": \"The paper focuses on improving the terminal value replicating portfolio technique, which is used for valuation and risk management of liabilities by life insurance companies. This directly relates to financial risk management. Additionally, the discussion on optimal dynamic numeraire strategy and asset liability management pertains to portfolio management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:14:39.235429"
}