{
  "paper": {
    "id": 2339,
    "title": "Comprehensive review of different artificial intelligence-based methods for credit risk assessment in data science",
    "abstract": "Credit risk is the critical problem faced by banking and financial sectors when the borrower fails to complete their commitments to pay back. The factors that could increase credit risk are non-performing assets and frauds which are improved by continuous monitoring of payments and other assessment patterns. In past years, few statistical and manual auditing methods were investigated which were not much suitable for tremendous amount of data. Thus, the growth of Artificial Intelligence (AI) with efficient access to big data is focused. However, the effective Deep Learning (DL) and Machine Learning (ML) techniques are introduced to improve the performance and issues in banking and finance sectors by concentrating the business process and customer interaction. In this review, it mainly focusses on the different learning methods-based research articles available in recent years. This review also considers 93 recent research articles that were available in the last 5 years related to the topic of credit risk with different learning methods to tackle traditional challenges. Thus, these advances can make the banking process as smart and fast while preserving themselves from credit defaulters.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "f28e020ad8298467891a32ca4cb3b48c",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "neural network",
      "representation learning",
      "classification",
      "regression",
      "support vector machine",
      "SVM",
      "decision tree",
      "clustering",
      "feature learning",
      "feature representation",
      "backpropagation",
      "BP",
      "rectified linear unit",
      "ReLU",
      "sigmoid",
      "tanh",
      "hidden layer",
      "convolutional neural network",
      "CNN",
      "recurrent neural network",
      "long short-term memory",
      "LSTM",
      "autoencoder",
      "denoising autoencoder",
      "deep belief network",
      "DBM",
      "restricted Boltzmann machine",
      "dropout regularization",
      "unsupervised pre-train"
    ],
    "stage1_timestamp": "2025-05-15T02:14:19.622378"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要讨论了使用人工智能方法（如机器学习和深度学习）进行信用风险评估，这是金融风险管理中的一个重要方面。论文明确提到信用风险是银行和金融部门面临的关键问题，并探讨了如何通过AI技术来改进信用风险评估和管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"该论文主要讨论了使用人工智能方法（如机器学习和深度学习）进行信用风险评估，这是金融风险管理中的一个重要方面。论文明确提到信用风险是银行和金融部门面临的关键问题，并探讨了如何通过AI技术来改进信用风险评估和管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:42:57.089306"
}