{
  "paper": {
    "id": 208,
    "title": "Comparison of machine learning models to provide preliminary forecasts of real estate prices",
    "abstract": "Real estate is one of the most critical investments in the household portfolio, and represents the greatest proportion of wealth of the private households in highly developed countries. This research provides a succinct review of machine learning techniques for predicting house prices. Data on dwelling transaction prices in Taipei City were collected from the real price registration system of the Ministry of the Interior, Taiwan. Four well-known artificial intelligence techniques-Artificial Neural Networks (ANNs), Support Vector Machine, Classification and Regression Tree, and Linear Regression- were used to develop both baseline and ensemble models. A hybrid model was also built and its predictive performance compared with those of the individual models in both baseline and ensemble schemes. The comprehensive comparison indicated that the particle swarm optimization (PSO)-Bagging-ANNs hybrid model outperforms the other models that are proposed herein as well as others that can be found in the literature. The provision of multiple prediction models allows users to determine the most suitable one, based on their background, needs, and comprehension of machine learning, for predicting house prices.",
    "year": 2022,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "74191aed87d436f7a4ec0cf484cb19bc",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "regression",
      "support vector machine",
      "SVM",
      "decision tree",
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T00:40:34.125783"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究机器学习模型在房地产价格预测中的应用，虽然房地产是家庭财富的重要组成部分，但论文并未涉及衍生品定价、金融风险管理或投资组合管理等特定金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究机器学习模型在房地产价格预测中的应用，虽然房地产是家庭财富的重要组成部分，但论文并未涉及衍生品定价、金融风险管理或投资组合管理等特定金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:32:48.660103"
}