{
  "paper": {
    "id": 1217,
    "title": "FORECASTING THE RISK OF MONEY LAUNDERING THROUGH FINANCIAL INTERMEDIARIES",
    "abstract": "The increase in international trade, the active development of integration and convergence processes in the global financial market, the rapid implementation of digital technologies in various spheres of life, as well as the growth of cross-border organized crime have led to increased shadow economic activity and improved forms and methods of money laundering. Under these conditions, it is essential to assess the risk of money laundering adequately through financial institutions and determine its dynamics in the future. The primary purpose of the study is to build a predictive neural network model to define the dynamics of the risk of using banking institutions to legalize criminal funds. The methodological tools of the study were methods of exponential smoothing (using exponential trend, linear Holt model and decaying trend), artificial neural network model (multilayer perceptron MLP-architecture using BFGS algorithm, radial basis function of RBF-architecture usage). Assessment and forecasting of money laundering risk through financial institutions is based on 13 relevant indicators, the source of which is internal financial statements. The object of research is the chosen 20 Ukrainian banks. Investigation of the forecast model in the paper is carried out in the following logical sequence: the forecast values of relevant factors influencing the risk of using financial institution in shadow operations are determined; training of neural networks according to the formed sample of indicators; forecasting the risk of using financial intermediaries of Ukraine for the legalization of criminal proceeds for the period 2020-2025 based on constructed neural networks. The calculations showed that by 2025 only 40% of the analyzed banks in Ukraine would be able to reduce their participation in the legalization of illegally obtained funds. The quality of the constructed forecasts is high, as the efficiency coefficient for most constructed models ranges from 0.9 to 1.0. The results of the study can be useful for the management of financial institutions to take a set of preventive measures in the system of internal financial monitoring, as well as scientists who deal with this issue.",
    "year": 2020,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "883e07bd7ce701dc1ec9e6b9d9fc7f2a",
    "relevant_keywords": [
      "machine learning",
      "neural network",
      "deep learning",
      "backpropagation",
      "BP",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T02:00:30.476269"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是构建预测神经网络模型来评估和预测通过金融机构洗钱的风险，这直接涉及金融风险管理中的操作风险识别和控制。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是构建预测神经网络模型来评估和预测通过金融机构洗钱的风险，这直接涉及金融风险管理中的操作风险识别和控制。\"\n}\n```"
  },
  "timestamp": "2025-05-20T14:20:20.161724"
}