{
  "paper": {
    "id": 466,
    "title": "Using partial least squares and support vector machines for bankruptcy prediction",
    "abstract": "The evaluation of corporate financial distress has attracted significant global attention as a result of the increasing number of worldwide corporate failures. There is an immediate and compelling need for more effective financial distress prediction models. This paper presents a novel method to predict bankruptcy. The proposed method combines the partial least squares (PLS) based feature selection with support vector machine (SVM) for information fusion. PLS can successfully identify the complex nonlinearity and correlations among the financial indicators. The experimental results demonstrate its superior predictive ability. On the one hand, the proposed model can select the most relevant financial indicators to predict bankruptcy and at the same time identify the role of each variable in the prediction process. On the other hand, the proposed model's high levels of prediction accuracy can translate into benefits to financial organizations through such activities as credit approval, and loan portfolio and security management. (C) 2011 Elsevier Ltd. All rights reserved.",
    "year": 2011,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "8da6e078ea3791f8ae114b1fed33c877",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM",
      "feature learning"
    ],
    "stage1_timestamp": "2025-05-15T00:43:47.361836"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用PLS和SVM进行破产预测，这直接关系到金融机构对信用风险的评估和管理，属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是使用PLS和SVM进行破产预测，这直接关系到金融机构对信用风险的评估和管理，属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:30:36.457994"
}