{
  "paper": {
    "id": 1489,
    "title": "Financial credit-risk evaluation with neural and neurofuzzy systems",
    "abstract": "Credit-risk evaluation decisions are important for the financial institutions involved due to the high level of risk associated with wrong decisions. The process of making credit-risk evaluation decision is complex and unstructured. Neural networks are known to perform reasonably well compared to alternate methods for this problem. However, a drawback of using neural networks for credit-risk evaluation decision is that once a decision is made, it is extremely difficult to explain the rationale behind that decision, Researchers have developed methods using neural network to extract rules, which are then used to explain the reasoning behind a given neural network output. These rules do not capture the learned knowledge well enough. Neurofuzzy systems have been recently developed utilizing the desirable properties of both fuzzy systems as well as neural networks. These neurofuzzy systems can be used to develop fuzzy rules naturally. In this study, we analyze the beneficial aspects of using both neurofuzzy systems as well as neural networks for credit-risk evaluation decisions. (C) 1999 Elsevier Science B.V. All rights reserved.",
    "year": 1999,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "44cd29c2b25d0b2b480cadf9a06cfeae",
    "relevant_keywords": [
      "machine learning",
      "classification",
      "neural network",
      "deep learning",
      "representation learning",
      "backpropagation",
      "BP",
      "sigmoid",
      "tanh",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T02:03:39.791969"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on credit-risk evaluation, which is a critical aspect of financial risk management, using neural networks and neurofuzzy systems to improve decision-making in this area.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on credit-risk evaluation, which is a critical aspect of financial risk management, using neural networks and neurofuzzy systems to improve decision-making in this area.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:48:42.833875"
}