{
  "paper": {
    "id": 45,
    "title": "Integration of investor behavioral perspective and climate change in reinforcement learning for portfolio optimization",
    "abstract": "Addressing environmental impact is increasingly imperative for individual investors and large financial institutions, making it a key objective of socially responsible investing. However, there is a noticeable gap in research on integrating sustainability and low-carbon considerations into machine learning-based portfolio optimization. To meet this challenge, this study introduces a Portfolio Emissions Sentiment Attention Aware Reinforcement Learning (PESAARL) model based on the Proximal Policy Optimization (PPO) algorithm to optimize a portfolio of Dow Jones Industrial Average (DJIA) stocks. PESAARL uniquely integrates environmental impact considerations, specifically carbon footprint using the firm level scope 1 and scope 2 emissions data, alongside firm-level investor sentiment and attention, into the investment decision-making process. Through multiple experiments, PESAARL demonstrates significant advantages, in terms of financial and environmental performance, over the benchmarks.",
    "year": 2025,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "0156581dd7ef397e874e290e6e65a0e3",
    "relevant_keywords": [
      "machine learning",
      "reinforcement learning",
      "neural network",
      "deep learning",
      "attention mechanism"
    ],
    "stage1_timestamp": "2025-05-15T00:38:56.897835"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "The paper focuses on optimizing a portfolio of DJIA stocks by integrating environmental impact considerations and investor sentiment into the decision-making process using reinforcement learning, which is a core aspect of portfolio management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Portfolio Management\"],\n  \"justification\": \"The paper focuses on optimizing a portfolio of DJIA stocks by integrating environmental impact considerations and investor sentiment into the decision-making process using reinforcement learning, which is a core aspect of portfolio management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:34:01.710905"
}