{
  "paper": {
    "id": 457,
    "title": "Enhancing credit risk prediction with hybrid deep learning and sand cat swarm feature selection",
    "abstract": "Credit risk prediction method acts as a vital financial tool for measuring the default probability of credit applicants. For financial institutions, proper credit risk management becomes mandatory to avoid significant losses incurred by borrowers' default. Thus, statistics are an increasingly vital technique that can analyse and measure credit risk. Generally, manual auditing and statistical methods measure credit risk. Current developments in financial artificial intelligence (AI) evolved from machine learning (ML)-driven credit risk methods that obtained great interest from academia and industry. The most significant step in the process of developing a credit risk assessment method is feature selection, which chooses a subset of appropriate features for enhancing the performance of an ML technique. With this motivation, this study concentrates on the design of sand cat swarm optimization-based feature selection with hybrid deep learning (SCSOFS-HDL) model for credit risk assessment. The presented SCSOFS-HDL technique presents a new SCSOFS technique for the optimal selection of feature subsets from the credit risk data. In addition, the deep LSTM Supervised Autoencoder Neural Network (DLSTM-SANN) model is presented for classification purposes. To enhance the performance of the DLSTM-SANN technique, the political optimizer (PO) methodology is utilized for the hyperparameter tuning process. The experimental validation of the SCSOFS-HDL technique is tested on credit risk datasets and the results highlighted the better performance of the SCSOFS-HDL algorithm with maximum accuracy of 96.49% and 96.12% on German Credit and Australian Credit datasets, respectively.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "496e1c1123871e71a6fd2f5307d5fb1d",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "neural network",
      "deep learning",
      "long short-term memory",
      "LSTM",
      "autoencoder"
    ],
    "stage1_timestamp": "2025-05-15T01:50:52.704313"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on enhancing credit risk prediction using hybrid deep learning and feature selection techniques, which is a core aspect of financial risk management, specifically in assessing and mitigating credit risk.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on enhancing credit risk prediction using hybrid deep learning and feature selection techniques, which is a core aspect of financial risk management, specifically in assessing and mitigating credit risk.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:58:00.293216"
}