{
  "paper": {
    "id": 2032,
    "title": "Fine-Grained Financial News Sentiment Analysis",
    "abstract": "The 24-hour news cycle and barrage of online media is a constant drum beat. The flow of positive and negative news is always in flux, influencing our current perspective and reassessing our future outlook. Nowhere is this more true than in the capital markets where assets are priced and risk assessed based on future expectations. While many factors influence a trader's decision to buy or sell an asset it can be argued that the sentiment from the 24-hour news cycle greatly impacts their outlook on the future value of an asset. In this paper we propose new methods to predict the positive or negative sentiment of financial news. Our analysis has found that contemporary document level sentiment analysis methods break down at fine-grained levels. Fine-grained analysis methods are vitally important as the velocity and impact of small texts, such as tweets and news flashes, increase their influence over the decision process. Using Natural Language Processing methods we extract syntactic sentence patterns from financial news headlines. From these patterns we conduct experiments using both lexicon and machine learning sentiment analysis approaches to predict sentiment. We find that our sentiment prediction methods are able to consistently out perform lexicon methods. Our robust techniques give the financial practitioner a method to fold a fine-grained news sentiment factor into their pricing or risk prediction models.",
    "year": 2017,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "eb054851a9d5d6e6cf470cf6cbb26c9a",
    "relevant_keywords": [
      "machine learning",
      "classification",
      "feature representation",
      "neural network",
      "deep learning",
      "representation learning",
      "recurrent neural network",
      "long short-term memory",
      "LSTM"
    ],
    "stage1_timestamp": "2025-05-15T02:10:25.741636"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是金融新闻情感分析，旨在帮助金融从业者将细粒度的新闻情感因素纳入其定价或风险预测模型。虽然论文提到了定价模型，但主要应用场景更侧重于风险预测，因此属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是金融新闻情感分析，旨在帮助金融从业者将细粒度的新闻情感因素纳入其定价或风险预测模型。虽然论文提到了定价模型，但主要应用场景更侧重于风险预测，因此属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:44:47.512430"
}