{
  "paper": {
    "id": 263,
    "title": "Multiclass credit cardholders' behaviors classification methods",
    "abstract": "In credit card portfolio management a major challenge is to classify and predict credit cardholders' behaviors in a reliable precision because cardholders' behaviors are rather dynamic in nature. Multiclass classification refers to classify data objects into more than two classes. Many real-life applications require multiclass classification. The purpose of this paper is to compare three multiclass classification approaches: decision tree, Multiple Criteria Mathematical Programming (MCMP), and Hierarchical Method for Support Vector Machines (SVM). While MCMP considers all classes at once, SVM was initially designed for binary classification. It is still an ongoing research issue to extend SVM from two-class classification to multiclass classification and many proposed approaches use hierarchical method. In this paper, we focus on one common hierarchical method - one-against-all classification. We compare the performance of See5, MCMP and SVM one-against-all approach using a real-life credit card dataset. Results show that MCMP achieves better overall accuracies than See5 and one-against-all SVM.",
    "year": 2006,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "95ccd42151f60a3402ada037815b11de",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T00:41:04.770064"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要研究信用卡持卡人行为的分类和预测，这是信用风险管理的重要组成部分，属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文主要研究信用卡持卡人行为的分类和预测，这是信用风险管理的重要组成部分，属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T14:22:34.804258"
}