{
  "paper": {
    "id": 518,
    "title": "Can deep learning predict risky retail investors? A case study in financial risk behavior forecasting",
    "abstract": "The paper examines the potential of deep learning to support decisions in financial risk management. We develop a deep learning model for predicting whether individual spread traders secure profits from future trades. This task embodies typical modeling challenges faced in risk and behavior forecasting. Conventional machine learning requires data that is representative of the feature-target relationship and relies on the often costly development, maintenance, and revision of handcrafted features. Consequently, modeling highly variable, heterogeneous patterns such as trader behavior is challenging. Deep learning promises a remedy. Learning hierarchical distributed representations of the data in an automatic manner (e.g. risk taking behavior), it uncovers generative features that determine the target (e.g., trader's profitability), avoids manual feature engineering, and is more robust toward change (e.g. dynamic market conditions). The results of employing a deep network for operational risk forecasting confirm the feature learning capability of deep learning, provide guidance on designing a suitable network architecture and demonstrate the superiority of deep learning over machine learning and rule-based benchmarks. (C) 2019 Elsevier B.V. All rights reserved.",
    "year": 2020,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "437ac087052f69f82b8c1d90b2d85958",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "feature learning",
      "feature representation",
      "neural network",
      "representation learning"
    ],
    "stage1_timestamp": "2025-05-15T01:52:12.197137"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用深度学习模型预测个体交易者的盈利情况，这直接应用于金融风险管理中的操作风险预测和行为分析。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是使用深度学习模型预测个体交易者的盈利情况，这直接应用于金融风险管理中的操作风险预测和行为分析。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:57:07.609301"
}