{
  "paper": {
    "id": 1376,
    "title": "Do cryptocurrency investors in the UK need more protection?",
    "abstract": "PurposeThe existing literature offers various perspectives on integrating cryptocurrencies into investment portfolios; yet, there is a gap in understanding the behaviours, attitudes and cross-investment links of individual investors. This study, grounded in the modern portfolio theory and the random walk theory, aims to add empirical insights that are specific to the UK context. It explores four hypotheses related to the influence of socio-demographics, digital adoption, cross-investment behaviours and financial attitudes on cryptocurrency owners.Design/methodology/approachThis study uses a logistic regression model with secondary data from the Financial Lives Survey 2020 to assess the factors impacting cryptocurrency ownership. A total of 29 variables are used, categorized into four groups aligned with the hypotheses. Additionally, hierarchical clustering analysis was conducted to further explore the cross-investment links.FindingsThe study reveals a significant lack of diversification among UK cryptocurrency investors, a pronounced inclination towards high-risk investments such as peer-to-peer lending and crowdfunding, and parallels with gambling behaviours, including financial dissatisfaction and a propensity for risk-taking. It highlights the influence of demographic traits, risk tolerance, technological literacy and emotional attitudes on cryptocurrency investment decisions.Originality/valueThis study provides valuable insights into cryptocurrency regulation and retail investor protection, underscoring the necessity for tailored financial education and a holistic regulatory approach for investment products with comparable risk levels, with the aim of minimizing regulatory arbitrage. It significantly enhances our understanding of the unique dynamics of cryptocurrency investments within the evolving financial landscape.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "f91796c1e5df2cf1cac5e0e1431ed134",
    "relevant_keywords": [
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T02:02:22.702210"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文基于现代投资组合理论和随机游走理论，研究了加密货币投资者的行为和投资组合多样化问题，这属于投资组合管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文基于现代投资组合理论和随机游走理论，研究了加密货币投资者的行为和投资组合多样化问题，这属于投资组合管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:49:26.268828"
}