{
  "paper": {
    "id": 946,
    "title": "Forecasting of financial data: a novel fuzzy logic neural network based on error-correction concept and statistics",
    "abstract": "First, this paper investigates the effect of good and bad news on volatility in the BUX return time series using asymmetric ARCH models. Then, the accuracy of forecasting models based on statistical (stochastic), machine learning methods, and soft/granular RBF network is investigated. To forecast the high-frequency financial data, we apply statistical ARMA and asymmetric GARCH-class models. A novel RBF network architecture is proposed based on incorporation of an error-correction mechanism, which improves forecasting ability of feed-forward neural networks. These proposed modelling approaches and SVM models are applied to predict the high-frequency time series of the BUX stock index. We found that it is possible to enhance forecast accuracy and achieve significant risk reduction in managerial decision making by applying intelligent forecasting models based on latest information technologies. On the other hand, we showed that statistical GARCH-class models can identify the presence of leverage effects, and react to the good and bad news.",
    "year": 2018,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "5b81143d7923b66e58f38454e3a263fa",
    "relevant_keywords": [
      "machine learning",
      "support vector machine",
      "SVM",
      "neural network",
      "deep learning",
      "representation learning",
      "backpropagation",
      "BP",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T01:56:49.686436"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要研究金融数据预测，特别是通过改进的神经网络和统计模型来预测股票指数的高频时间序列，并提到可以显著降低管理决策中的风险。这属于金融风险管理的范畴，因为它涉及预测市场波动和风险。论文未提及衍生品定价或投资组合管理的具体应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文主要研究金融数据预测，特别是通过改进的神经网络和统计模型来预测股票指数的高频时间序列，并提到可以显著降低管理决策中的风险。这属于金融风险管理的范畴，因为它涉及预测市场波动和风险。论文未提及衍生品定价或投资组合管理的具体应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T14:23:36.402816"
}