{
  "paper": {
    "id": 3727,
    "title": "Why do consumers resist digital innovations? An innovation resistance theory perspective",
    "abstract": "PurposeDespite the efforts of governments and firms, consumer resistance toward digital innovations in the retail finance space continues to manifest rather visibly. Yet, the causes of consumer resistance toward innovations such as online procurement of financial products continue to remain under-explored. The present study attempts to address this gap by examining barriers that may constitute Indian consumers' resistance to buying financial products marketed digitally, using insurance as an exemplar. Precisely, the study measures five classic innovation resistance theory (IRT) barriers constituting consumers' resistance toward procuring digitally marketed insurance and examines the influence of consumers' demographic characteristics, measured through age and gender.Design/methodology/approachThe conceptual model, resting on the theoretical proposition of IRT, was tested using data collected from 420 smartphone users. Given that, the data did not satisfy the multivariate assumptions of normality, homoscedasticity and linearity, artificial neural network approach was used for analysis. The analysis served as the basis for determining the relative importance of the five barriers in influencing consumer resistance.FindingsThe results indicated that the image barrier was the most influential barrier impacting consumer resistance, followed by usage, tradition, risk and value barriers. Moreover, as revealed by the values of correlations, the direction of influence was positive. Notably, the relationship of all barriers except tradition with consumer resistance was found to be nonlinear.Originality/valueThe study makes a novel contribution in two ways - one by extending IRT to a new area, i.e., resistance to buying financial products online, thereby further enhancing its applicability, and the other by exploring consumer resistance to e-procurement of life and nonlife insurance, which to the best of the authors' knowledge, has not been examined so far despite the established exigency.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "64e35fb20c4d6758afac578080ff7847",
    "relevant_keywords": [
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T02:29:27.988612"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究消费者对数字化金融产品（如保险）的接受障碍，属于消费者行为研究领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融技术应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究消费者对数字化金融产品（如保险）的接受障碍，属于消费者行为研究领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融技术应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:35:32.192704"
}