{
  "paper": {
    "id": 118,
    "title": "Revolutionising Financial Portfolio Management: The Non-Stationary Transformer's Fusion of Macroeconomic Indicators and Sentiment Analysis in a Deep Reinforcement Learning Framework",
    "abstract": "In the evolving landscape of portfolio management (PM), the fusion of advanced machine learning techniques with traditional financial methodologies has opened new avenues for innovation. Our study introduces a cutting-edge model combining deep reinforcement learning (DRL) with a non-stationary transformer architecture. This model is designed to decode complex patterns in financial time-series data, enhancing portfolio management strategies with deeper insights and robustness. It effectively tackles the challenges of data heterogeneity and market uncertainty, key obstacles in PM. Our approach integrates key macroeconomic indicators and targeted news sentiment analysis into its framework, capturing a comprehensive picture of market dynamics. This amalgamation of varied data types addresses the multifaceted nature of financial markets, enhancing the model's ability to navigate the complexities of asset management. Rigorous testing demonstrates the model's efficacy, highlighting the benefits of blending diverse data sources and sophisticated algorithmic approaches in mastering the nuances of PM.",
    "year": 2024,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "d96d354e461c52ec1e442aa0b94fc56e",
    "relevant_keywords": [
      "machine learning",
      "reinforcement learning",
      "deep learning",
      "neural network",
      "representation learning",
      "attention mechanism"
    ],
    "stage1_timestamp": "2025-05-15T00:39:32.576955"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是结合深度强化学习和非平稳变换器架构来优化投资组合管理策略，通过整合宏观经济指标和新闻情绪分析来应对市场不确定性，这明确属于投资组合管理领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是结合深度强化学习和非平稳变换器架构来优化投资组合管理策略，通过整合宏观经济指标和新闻情绪分析来应对市场不确定性，这明确属于投资组合管理领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:33:25.920647"
}