{
  "paper": {
    "id": 1256,
    "title": "Hubris or talent? Estimating the role of overconfidence in Chinese households' investment decisions",
    "abstract": "We document the extent to which overconfidence in one's financial literacy (FL overconfidence) plays a role in households' reported financial risk aversion and their actual investment behavior, using data from the China Household Finance Survey. We measure FL overconfidence by estimating the gap between people's self-reported financial literacy and their objectively measured financial knowledge. Our results indicate that FL overconfidence is negatively associated with self-reported financial risk aversion. Additionally, FL overconfidence is positively associated with the likelihood of having a brokerage account, holding risky financial instruments (other than just stock), and a proportion of assets allocated towards risky assets. We then use machine learning methods to predict which factors are most important in determining households' risky investment decisions. We find that overconfidence plays a significant predictive role. Our work signals that households' risky investments may be driven by biased optimism about their own financial know-how rather than their actual knowledge. We conclude that financial literacy programs should not only teach financial concepts but also make program participants aware of their own biases.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "7f83e80a980d23b5f9b9eac52774c953",
    "relevant_keywords": [
      "machine learning"
    ],
    "stage1_timestamp": "2025-05-15T02:00:30.657429"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究家庭投资决策中的过度自信现象及其对风险资产配置的影响，虽然涉及投资行为，但并未直接涉及衍生品定价、金融风险管理或投资组合管理的核心技术或应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究家庭投资决策中的过度自信现象及其对风险资产配置的影响，虽然涉及投资行为，但并未直接涉及衍生品定价、金融风险管理或投资组合管理的核心技术或应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:50:33.773546"
}