{
  "paper": {
    "id": 912,
    "title": "Supply chain risk management of badminton supplies company using decision tree model assisted by fuzzy comprehensive evaluation",
    "abstract": "Supply chain risk management is crucial for the management of sports goods companies, which can help enterprises better complete the transparent and efficient management of the whole process from production to sales. However, there are inevitably some potential risks. Thereby, to study the supply chain risk management of badminton supplies companies in the general environment, the supply chain risk evaluation index system of badminton supplies companies is established in this study by studying the connotation of supply chain risk management and combining the steps of fuzzy comprehensive evaluation (FCE) method. Then, according to these evaluation indexes, the modelling process of the classification and regression tree (CART) algorithm in the corporate overall supply chain risk decision tree is proposed. Moreover, the corporate overall supply chain risk decision tree is established. Moreover, the financial data of 10 A-share listed companies of badminton and other sports goods listed on the Shanghai Stock Exchange in 2020 are selected as the sample dataset for model training and testing. The potential risks of badminton enterprises are predicted. The results show that the scale of badminton enterprises has been increasing gradually since 2018, but the return on total assets has steadily decreased with the increase of years. It shows that the badminton supplies enterprise's input and output assets are unbalanced, and the overall asset operation effect is relatively poor. However, the growth rate of total assets shows a significant upward trend from 2018 to 2020, rising from 4% to 12.69%. It indicates that the corporate investment and domestic and foreign investment expansion in recent years are high-speed. The FCE method is employed to obtain the maximum eigenvalue lambda max$$ {\\lambda}_{\\mathrm{max}} $$ of the enterprise, which is 5.4698. Then, the C.I value is 0.1205, the R.I value is 1.12, and the consistency ratio value is 0.0958 < 0.1, indicating that the judgement matrix is acceptable. It suggests that under the influence of the macro environment and economic situation, the sales situation of the badminton supplies company is subtly affected by the macro environment, and there is a great business risk.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "9aa29f02687636006356341915604925",
    "relevant_keywords": [
      "decision tree",
      "classification",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:56:17.621693"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究供应链风险管理在羽毛球用品公司的应用，使用了决策树模型和模糊综合评价方法。虽然涉及风险管理，但其应用领域是供应链管理而非金融风险管理，且未提及衍生品定价或投资组合管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究供应链风险管理在羽毛球用品公司的应用，使用了决策树模型和模糊综合评价方法。虽然涉及风险管理，但其应用领域是供应链管理而非金融风险管理，且未提及衍生品定价或投资组合管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:53:52.876065"
}