{
  "paper": {
    "id": 7045,
    "title": "Adverse Selection in Community Based Health Insurance among InformalWorkers in Bangladesh: An EQ-5D Assessment",
    "abstract": "Community-based Health Insurance (CBHI) schemes are recommended for providing financial risk protection to low-income informal workers in Bangladesh. We assessed the problem of adverse selection in a pilot CBHI scheme in this context. In total, 1292 (646 insured and 646 uninsured) respondents were surveyed using the Bengali version of the EuroQuol-5 dimensions (EQ-5D) questionnaire for assessing their health status. The EQ-5D scores were estimated using available regional tariffs. Multiple logistic regression was applied for predicting the association between health status and CBHI scheme enrolment. A higher number of insured reported problems in mobility (7.3%; p = 0.002); self-care (7.1%; p = 0.000) and pain and discomfort (7.7%; p = 0.005) than uninsured. The average EQ-5D score was significantly lower among the insured (0.704) compared to the uninsured (0.749). The regression analysis showed that those who had a problem in mobility (m 1.25-2.17); self-care (OR = 2.29; 95% CI: 1.62-3.25) and pain and discomfort (OR = 1.43; 95% CI: 1.13-1.81) were more likely to join the scheme. Individuals with higher EQ-5D scores (OR = 0.46; 95% CI: 0.31-0.69) were less likely to enroll in the scheme. Given that adverse selection was evident in the pilot CBHI scheme, there should be consideration of this problem when planning scale-up of these kind of schemes.",
    "year": 2018,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "78dd8313002c4da5cf130f76b56f8ab7",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T03:04:23.031067"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究社区健康保险中的逆向选择问题，虽然涉及风险评估，但其核心应用领域是健康保险而非金融风险管理、衍生品定价或投资组合管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究社区健康保险中的逆向选择问题，虽然涉及风险评估，但其核心应用领域是健康保险而非金融风险管理、衍生品定价或投资组合管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:27:05.885200"
}