{
  "paper": {
    "id": 223,
    "title": "A Classification Based Framework for Credit Risk Assessment in the Moroccan Financial Market",
    "abstract": "The increased openness of Moroccan economy, the particularities of Moroccan Financial Market and the consequences of 2007 credit crisis in term of regulators requirements make credit risk assessment more important and complex then ever. In this paper we introduced a novel classification approach based on decision trees to assess credit risk in Moroccan financial market. First we collected data for the listed and unlisted bond issuers in Moroccan financial market from 2007 to 2014. The analysis of different credit risk assessment models and the application of Altman Z-score have shown the limits of each model for assessing Moroccan bond issuers' credit risk. This led us to develop a classification based framework for credit risk assessment to classify Moroccan Bond issuers according to their financial statements. The classification based framework allows us for classification of Moroccan issuers in predefined classes with a high accuracy. Furthermore, it reveals an explanation of the factors driving the classification of each issuer.",
    "year": 2016,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "9cd790cf03004a91a37aaad3407e3aad",
    "relevant_keywords": [
      "classification",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T01:48:30.660814"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on developing a classification-based framework for credit risk assessment in the Moroccan financial market, which is a core aspect of financial risk management. The study specifically addresses the evaluation of credit risk for bond issuers, a key concern in risk management practices.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on developing a classification-based framework for credit risk assessment in the Moroccan financial market, which is a core aspect of financial risk management. The study specifically addresses the evaluation of credit risk for bond issuers, a key concern in risk management practices.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:59:55.177608"
}