{
  "paper": {
    "id": 2322,
    "title": "STATISTICAL MODELS FOR MONITORING THE LIKELIHOOD OF CREDIT PORTFOLIO IMPAIRMENT",
    "abstract": "Academic literature and the studies of international financial institutions are the field of a wide debate on the best suited financial indicators and econometric models for predicting, in real time, a wide series of adverse events (credit institutions' rating downgrade, capital adequacy, banking or currency crises). Our empirical approach consists in combining PCA, as a factor analysis technique, with binary logistic regression, in order to forecast the likelihood of a credit portfolio impairment for the whole Romanian banking system. We distinguished several types of financial indicators, related to macroeconomic climate and bank specific data, that are likely to contribute to the determination of the probability of credit portfolio quality impairment. We have applied PCA and identified three principal components. The significance of each component and its predictive power was then tested in a binary logistic model.",
    "year": 2009,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "c41b934805f685c38f578f3a5c984f5f",
    "relevant_keywords": [
      "principal components analysis",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:05:39.659813"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on predicting the likelihood of credit portfolio impairment using PCA and binary logistic regression, which is directly related to assessing and managing credit risk in the banking system. This falls under the domain of Financial Risk Management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on predicting the likelihood of credit portfolio impairment using PCA and binary logistic regression, which is directly related to assessing and managing credit risk in the banking system. This falls under the domain of Financial Risk Management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:15:52.091006"
}