{
  "paper": {
    "id": 4092,
    "title": "Identifying the Risk Factors Through the Development of a Predictive Model for Gastric Cancer in South Korea",
    "abstract": "The objective of this study was to identify the main risk factors for gastric cancer in Koreans through the development of a predictive model by multivariate logistic regression analysis that could aid the development of specific guidelines for early detection. We conducted a case control study to identify the risk factors for gastric cancer. The cohorts comprised 183 patients with gastric cancer and 199 adults without gastric cancer as controls. Risk factors were identified, and a predictive model was established by multivariate logistic regression analysis. Major risk factors included in the final predictive model were being older, having a family history of gastric cancer, a family history of gastric ulcer, a personal history of gastric ulcer, a poor perceived health status, a low perceived financial status, being exposed to jobs considered to cause stomach cancer, drinking tap water, and eating irregularly and rapidly. The accuracy of the final predictive model was confirmed by its high degrees of sensitivity and specificity. The predictive model developed in this study can be used for classifying high-risk groups and for guiding early-detection screening for gastric cancer.",
    "year": 2009,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "749b055a4f65b59467ffff1ac3c9ffb3",
    "relevant_keywords": [
      "classification",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:33:03.466608"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究胃癌的风险因素预测模型，属于医学和公共卫生领域，与金融研究领域无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究胃癌的风险因素预测模型，属于医学和公共卫生领域，与金融研究领域无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:34:17.856807"
}