{
  "paper": {
    "id": 223,
    "title": "Option pricing with genetic algorithms: A second report",
    "abstract": "The cross-fertilization between artificial intelligence and computational finance has resulted in some of the most active research areas in financial engineering. One direction is the application of machine learning techniques to pricing financial products, which is certainly one of the most complex issues in finance. In the literature, when the interest rate, the mean-rate of return and the volatility of the underlying asset follow general stochastic processes, the analytical selection is usually not available. Over the last two years, artificial neural nets have been applied to solve option pricing numerically. However, so far, there is no applications based on evolutionary computation in this area. In this paper, we shall illustrate how genetic algorithms (GAs), as an alternative to neural nets, can be potentially helpful in dealing with option pricing. In particular, we test the performance of basic genetic algorithms by using it to the determination of prices of European call options, whose exact solution is known from Black-Scholes option pricing theory. The solutions found by basic genetic algorithms are compared with the exact solution, and the performance of GAs is evaluated accordingly.",
    "year": 1997,
    "source": "WOS",
    "area": "derivatives_pricing",
    "method": "machine learning",
    "cache_key": "43ace7d4a45932a6701c7a6f1808b03b",
    "relevant_keywords": [
      "machine learning",
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T01:29:44.185137"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Derivatives Pricing"
    ],
    "justification": "该论文的核心内容是应用遗传算法（GAs）来解决期权定价问题，特别是欧式看涨期权的定价。论文明确提到将遗传算法作为神经网络之外的另一种方法，用于处理期权定价问题，并与Black-Scholes模型的精确解进行了比较。因此，该论文的主要技术应用属于衍生品定价领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"衍生品定价\"],\n  \"justification\": \"该论文的核心内容是应用遗传算法（GAs）来解决期权定价问题，特别是欧式看涨期权的定价。论文明确提到将遗传算法作为神经网络之外的另一种方法，用于处理期权定价问题，并与Black-Scholes模型的精确解进行了比较。因此，该论文的主要技术应用属于衍生品定价领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:06:03.365586"
}