{
  "paper": {
    "id": 980,
    "title": "Risk committee and stock price crash risk in the Malaysian financial sector: the moderating role of institutional ownership",
    "abstract": "Purpose The authors empirically investigate the impact of the existence of a stand-alone risk committee (RC) and its characteristics on the likelihood of stock price crash risk in listed financial firms on the Bursa Malaysia. The authors also test whether the effect of RC on crash risk is attenuating or amplifying by the level of institutional ownership. Design/methodology/approach The authors use a principal components analysis (PCA) to aggregate and derive a factor score for risk committee characteristics (i.e. independence, qualification, and size) as a proxy for the effectiveness of RC. The study also employs two distinct stock price crash risk measurements to corroborate the findings and partition institutional ownership into dedicated and transient to examine the potential impact of institutional shareholding on RC-stock price crash risk association. Findings Regression analysis reveals that only RC qualification has a significant negative impact on stock price crash risk. However, when RC characteristics are aggregated into one composite factor, the authors find that firms with effective RCs exhibit lower risk of stock price crash. The authors also find that firms with high level of institutional shareholdings and effective RCs are less likely to experience crash risk likelihood. The additional analyses indicate that the complementary moderating effect of institutional ownership on RC-crash risk nexus is likely to be driven by dedicated institutional ownership. The results are robust across two measures of stock price crash risk and regression specifications for a longer run window. Originality/value The study, to the best of the researchers' knowledge, is the first to provide evidence in an emerging market financial sector companies' perspective suggesting that effective RCs are individually and aggregately associated with lower stock price crash risk, which is further strengthened by dedicated institutional investors. These findings are unique and contribute to a small but growing body of literature documenting the need for effective RCs and specific institutional investors and their consequences of improvements in stock price crash risk environment. Results of our research in this area provide important insights to financial and capital market participants, investors, regulators, and policymakers in Malaysia.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "835d36813afc103c517f756189220816",
    "relevant_keywords": [
      "principal components analysis"
    ],
    "stage1_timestamp": "2025-05-15T01:57:29.863088"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要研究风险委员会（RC）及其特征对股票价格暴跌风险的影响，并探讨了机构所有权在这一关系中的调节作用。研究重点在于如何通过有效的风险委员会和机构投资者的参与来降低股票价格暴跌风险，这属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文主要研究风险委员会（RC）及其特征对股票价格暴跌风险的影响，并探讨了机构所有权在这一关系中的调节作用。研究重点在于如何通过有效的风险委员会和机构投资者的参与来降低股票价格暴跌风险，这属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:53:04.028129"
}