{
  "paper": {
    "id": 3398,
    "title": "Clustering financial time series: New insights from an extended hidden Markov model",
    "abstract": "In recent years, large amounts of financial data have become available for analysis. We propose exploring returns from 21 European stock markets by model-based clustering of regime switching models. These econometric models identify clusters of time series with similar dynamic patterns and moreover allow relaxing assumptions of existing approaches, such as the assumption of conditional Gaussian returns. The proposed model handles simultaneously the heterogeneity across stock markets and over time, i.e., time-constant and time-varying discrete latent variables capture unobserved heterogeneity between and within stock markets, respectively. The results show a clear distinction between two groups of stock markets, each one characterized by different regime switching dynamics that correspond to different expected return-risk patterns. We identify three regimes: the so-called bull and bear regimes, as well as a stable regime with returns close to 0, which turns out to be the most frequently occurring regime. This is consistent with stylized facts in financial econometrics. (C) 2014 Elsevier B.V. All rights reserved.",
    "year": 2015,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "777b7e8306749c41b0b426df5615db12",
    "relevant_keywords": [
      "unsupervised learning",
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T02:25:40.221386"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk",
      "Portfolio Management"
    ],
    "justification": "该论文通过聚类分析欧洲股票市场的回报率，识别不同的市场状态（牛市、熊市和稳定状态），这些分析可以用于金融风险管理中的市场风险识别和投资组合管理中的资产配置决策。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\", \"投资组合管理\"],\n  \"justification\": \"该论文通过聚类分析欧洲股票市场的回报率，识别不同的市场状态（牛市、熊市和稳定状态），这些分析可以用于金融风险管理中的市场风险识别和投资组合管理中的资产配置决策。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:36:49.972893"
}