{
  "paper": {
    "id": 226,
    "title": "Explainable deep learning model for stock price forecasting using textual analysis",
    "abstract": "Stock price forecasting is a challenging task because financial time series are primarily nonlinear, noisy, and disordered systems that are complicated to forecast. Deep learning models show promise in this domain along with natural language processing, to extract relevant features from text data and map them to numerical representations. This study aims to forecast stock prices using text analysis and deep learning approaches and explain the models using explainable AI. We construct a World Halal Tourism Composite Sentiment Index (WHTCSI) using text analysis to forecast halal tourism stock price. The results suggest that Convolutional Neural Networks (CNN) outperform all other models. The results are robust when considering country-level data. In addition, model explanations show that the index contributes 35.55% to the forecasting model, indicating irrational investment activity and herding behavior in the halal tourism industry. The study's findings have significant implications for investors, analysts, and portfolio managers in making investment decisions.",
    "year": 2024,
    "source": "WOS",
    "area": "portfolio",
    "method": "deep learning",
    "cache_key": "09fcbb1bb195c3b8e2d403f8511bd577",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "neural network",
      "convolutional neural network",
      "CNN",
      "representation learning"
    ],
    "stage1_timestamp": "2025-05-15T00:33:39.480541"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是使用深度学习和文本分析来预测股票价格，并解释模型以帮助投资者、分析师和投资组合经理做出投资决策。这直接关联到投资组合管理领域，因为股票价格预测是构建和管理投资组合的关键组成部分。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是使用深度学习和文本分析来预测股票价格，并解释模型以帮助投资者、分析师和投资组合经理做出投资决策。这直接关联到投资组合管理领域，因为股票价格预测是构建和管理投资组合的关键组成部分。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:35:29.856463"
}