{
  "paper": {
    "id": 2754,
    "title": "Investigation of Factors Influencing Risk Tolerance among Investors using Ordinal Logistic Regression: A case from Nepal.",
    "abstract": "The paper investigates the factors that affect the risk tolerance of the general investors in Nepalese stock market. Using data of 99 investors, study applies ordinal logistic regression to evaluate the impact of investor's education level, gender, financial literacy, years in trading, prior history of loss and history of margin lending on risk tolerance capacity of the investor. The paper finds that with prior loss, chances of high-risk investor moving to moderate risk is 4.48 log odds while that of moderate risk investor moving to low risk is 1.33 log odds. Meanwhile financial literacy increases the risk level across risk spectrum by log odds of 1.59. On the other hand keeping other things constant with availability of margin lending, there is 48% probability investor falls into moderate risk category. The study however didn't find any influence of gender, years in trading and education on risk tolerance. The research finds that financial literacy is an important driver in risk appetite of investors than their education level. Further it shows that past experience of the investor very much influences their level of riskiness. Finally paper finds margin lending having more influence on those investors that falls under moderate risk level. The study thus provides guidelines for policy maker in setting the margin rate, and also helps portfolio manager to assess the risk appetite of the potential investor and finally provides empirical evidence of financial literacy in stabilizing risk tolerance of investors.",
    "year": 2020,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "71a8b6c70856c14d21afa182e885b721",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:18:37.214454"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文研究了影响投资者风险容忍度的因素，并提到研究结果有助于投资组合经理评估潜在投资者的风险偏好，这直接关联到投资组合管理中的客户风险分析和资产配置策略。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文研究了影响投资者风险容忍度的因素，并提到研究结果有助于投资组合经理评估潜在投资者的风险偏好，这直接关联到投资组合管理中的客户风险分析和资产配置策略。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:40:10.681335"
}