{
  "paper": {
    "id": 1078,
    "title": "Towards a comprehensible and accurate credit management model: Application of four computational intelligence methodologies",
    "abstract": "The study presents methods for classification of applicants into different categories of credit risk using four different computational intelligence techniques. The selected methodologies involved in the rule-based categorization task are (1) feedforward neural networks trained with second order methods (2) inductive machine learning, (3) hierarchical decision trees produced by grammar-guided genetic programming and (4) fuzzy rule based systems produced by grammar-guided genetic programming. The data used are both numerical and linguistic in nature and they represent a real-world problem, that of deciding whether a loan should be granted or not, in respect to financial details of customers applying for that loan, to a specific private EU bank. We examine the proposed classification models with a sample of enterprises that applied for a loan, each of which is described by financial decision variables (ratios), and classified to one of the four predetermined classes. Attention is given to the comprehensibility and the ease of use for the acquired decision models. Results show that the application of the proposed methods can make the classification task easier and-in some cases-may minimize significantly the amount of required credit data. We consider that these methodologies may also give the chance for the extraction of a comprehensible credit management model or even the incorporation of a related decision support system in banking.",
    "year": 2006,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "25385548d90534ecc33774797e01835b",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "decision tree",
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T01:58:43.361966"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on classifying applicants into different credit risk categories using computational intelligence techniques, which is directly related to assessing and managing credit risk in financial institutions. This falls under the domain of Financial Risk Management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on classifying applicants into different credit risk categories using computational intelligence techniques, which is directly related to assessing and managing credit risk in financial institutions. This falls under the domain of Financial Risk Management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:52:18.979280"
}