{
  "paper": {
    "id": 2232,
    "title": "The possibilities of using AutoML in bankruptcy prediction: Case of Slovakia",
    "abstract": "Using machine learning (ML) and artificial intelligence to make predictions to increase efficiency will drive the upcoming fifth industrial revolution. This study investigates the application of automated machine learning (AutoML) in the prediction of company bankruptcies, with a focus on two key novelties: (1) a comprehensive comparison of five state-of-the-art AutoML tools (AutoGluon, AutoKeras, H2O-AutoML, MLJar, and TPOT) against traditional statistical methods and ensemble ML techniques based on predictive performance and development time, and (2) an in-depth impact analysis of three distinct data resampling approaches (without resampling, random oversampling and SMOTE) on model performance and development time. Using financial data from 2019 to 2021, this study demonstrates that AutoML tools, particularly H2O-AutoML and AutoGluon, outperform traditional and ensemble ML methods (achieving AUC values of 0.913 and 0.894 respectively, compared to 0.880 for XGBoost) and significantly reduce model-development time, often completing tasks in one-third to half the time required by conventional approaches. Furthermore, the findings highlight the robustness of H2O-AutoML and AutoGluon in handling imbalanced datasets- a critical challenge in bankruptcy prediction. Therefore, selected AutoML methods can already help to democratise access to advanced risk management models for smaller companies and institutions to leverage high-performing predictive tools with minimal expert intervention.",
    "year": 2025,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "ee4bcc97fb3e0689fc2516e80be32b15",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "neural network",
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T02:12:50.997907"
  },
  "domain_result": {
    "success": false,
    "error": "",
    "application_domains": [
      "None"
    ],
    "justification": "API调用失败: ",
    "raw_response": null
  },
  "timestamp": "2025-05-20T15:43:40.995971"
}