{
  "paper": {
    "id": 3602,
    "title": "Time-to-profit scorecards for revolving credit",
    "abstract": "This paper defines and models time-to-profit for the first time for credit acceptance decisions within the context of revolving credit. This requires the definition of a time-related event: A customer is profitable when monthly cumulative return is at least one (i.e. cumulative profits cover the outstanding balance). Time-to-profit scorecards were produced for a data set of revolving credit from a Colombian lending institution which included socio-demographic and first purchase individual characteristics. Results show that it is possible to obtain good classification accuracy and improve portfolio returns which are continuous by definition through the use of survival models for binary events (i.e. either being profitable or not). It is also shown how predicting time-to-profit can be used for investment planning purposes of credit programmes. It is possible to identify the earliest point in time in which a customer is profitable and hence, generates internal (organic) funds for a credit programme to continue growing and become sustainable. For survival models the effect of segmentation on loan duration was explored. Results were similar in terms of classification accuracy and identifying organic growth opportunities. In particular, loan duration and credit limit usage have a significant economic impact on time-to-profit. This paper confirms that high risk credit programmes can be profitable at different points in time depending on loan duration. Furthermore, existing customers may provide internal funds for the credit programme to continue growing. (C) 2015 Elsevier B.V. and Association of European Operational Research Societies (EURO) within the International Federation of Operational Research Societies (IFORS). All rights reserved.",
    "year": 2016,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "bf4ba77636c1c124cdd2c8e6bdc5863d",
    "relevant_keywords": [
      "classification"
    ],
    "stage1_timestamp": "2025-05-15T01:19:00.639843"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk",
      "Portfolio Management"
    ],
    "justification": "该论文主要研究如何通过生存模型预测客户盈利时间，以优化信用接受决策和提高投资组合回报。这涉及到信用风险的管理（金融风险管理）以及如何通过预测盈利时间来规划信用项目的投资（投资组合管理）。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\", \"投资组合管理\"],\n  \"justification\": \"该论文主要研究如何通过生存模型预测客户盈利时间，以优化信用接受决策和提高投资组合回报。这涉及到信用风险的管理（金融风险管理）以及如何通过预测盈利时间来规划信用项目的投资（投资组合管理）。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:09:17.168043"
}