{
  "paper": {
    "id": 2762,
    "title": "Big Data-Driven Tax Risk Analysis and Decision-Making Model Using K-Medoids Clustering for Enterprise Management",
    "abstract": "The business management of enterprises is gradually limited, and it is gradually unable to deal with many problems in financial management, which makes enterprises unable to avoid tax risks well. In order to improve the tax risk system and improve the tax risk prevention and control of enterprises, this paper will be based on the big data model using the K-medoids clustering algorithm (KMCA), linear regression algorithm (LRA), and chameleon algorithm (CLA) to analyze and design a tax risk analysis and decision-making model. We conducted a comprehensive analysis of corporate tax risk behaviors, hoping to improve the company's tax risk prevention and control. This improved the corporate tax credit rating, and allowed companies to avoid tax more reasonably and reduced underpayment, overpayment, and nonpayment of taxes. In the big data model testing stage, the KMCA, LRA, and CLA are used for comparison. The results showed that the KMCA is the optimal algorithm. After the system passed the test, five companies used the KMCA to test their tax risks, which had a great effect on improving the companies' performance and reducing the tax-related risk of the companies. In order to understand the adaptability of the system, employees and leaders of five companies evaluated the KMCA, and the results showed that the five companies generally recognized the tax control device relatively high. (4) The experimental results show that the tax risk of five companies is reduced after using the model evaluation method, which shows that the business management system based on the KMCA under the big data model has a great effect on improving the company's performance.",
    "year": 2025,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "05c348690397313b0bd1f51f171ac821",
    "relevant_keywords": [
      "machine learning",
      "unsupervised learning",
      "clustering",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:18:37.250607"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究企业税务风险分析与决策模型，虽然涉及风险管理，但其核心应用领域是企业税务管理而非金融风险管理。论文未提及衍生品定价或投资组合管理相关内容。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究企业税务风险分析与决策模型，虽然涉及风险管理，但其核心应用领域是企业税务管理而非金融风险管理。论文未提及衍生品定价或投资组合管理相关内容。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:40:10.281522"
}