{
  "paper": {
    "id": 210,
    "title": "Tradinnova-LCS: Dynamic stock portfolio decision-making assistance model with genetic based machine learning",
    "abstract": "This paper describes a decision system based on rules for the management of a stock portfolio using a mechanism of dynamic learning to select the stocks to be incorporated. This system simulates the intelligent behavior of an investor, carrying out the buying and selling of stocks, such that during each day the best stocks will be selected to be incorporated in the portfolio by reinforcement learning with genetic programming. The system has been tested in 3 time periods (1 year, 3 years and 5 years), simulating the purchase/sale of stocks in the Spanish continuous market and the results have been compared with the revaluations obtained by the best investment funds operating in Spain.",
    "year": 2010,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "3222ff65548c0bc55c99b0b2df31e78e",
    "relevant_keywords": [
      "machine learning",
      "reinforcement learning",
      "genetic programming"
    ],
    "stage1_timestamp": "2025-05-15T00:40:34.140841"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "The paper focuses on developing a decision system for stock portfolio management using genetic programming and reinforcement learning, which directly aligns with the domain of Portfolio Management. The system's purpose is to assist in selecting and managing stocks, simulating investor behavior, and comparing results with investment funds, all of which are core activities in portfolio management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Portfolio Management\"],\n  \"justification\": \"The paper focuses on developing a decision system for stock portfolio management using genetic programming and reinforcement learning, which directly aligns with the domain of Portfolio Management. The system's purpose is to assist in selecting and managing stocks, simulating investor behavior, and comparing results with investment funds, all of which are core activities in portfolio management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:32:48.139352"
}