{
  "paper": {
    "id": 2308,
    "title": "Predictors of Anxiety in Middle-Aged and Older European Adults: A Machine Learning Comparative Study",
    "abstract": "Anxiety in older adults is a prevalent yet under-recognized condition associated with significant societal and individual burdens. This study used a machine learning approach to compare the relative importance of 57 risk and protective factors for anxiety symptoms in a population-representative sample of middle-aged and older European adults (N = 65,684; ages 45-103 years; 55.7% women; 15 countries represented). The results revealed loneliness and self-rated poor health as primary risk factors (Nagelkerke R2 = 0.272), with additional predictive contributions from country of residence, functional limitations, financial distress, and family care burden. Notably, follow-up analysis showed that none of the 16 social network variables were associated with loneliness; rather, cohabitating with a partner/spouse was most strongly associated with reduced loneliness. Further research is needed to elucidate directional associations between loneliness and anxiety (both general and sub-types). These findings underscore the imperative of addressing loneliness for mitigating anxiety and related mental health conditions among aging populations.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "2e47113c780f7632c99cc5681d2132a2",
    "relevant_keywords": [
      "machine learning",
      "classification",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:13:31.907511"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是使用机器学习方法预测中老年欧洲人的焦虑症状，其核心技术和研究成果集中在心理健康领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是使用机器学习方法预测中老年欧洲人的焦虑症状，其核心技术和研究成果集中在心理健康领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:43:19.043670"
}