{
  "paper": {
    "id": 275,
    "title": "A robust multicriteria clustering methodology for portfolio decision analysis",
    "abstract": "We consider a portfolio decision problem in which a subset of projects is selected to form a portfolio by dealing with uncertain multiple criteria evaluations, decision makers' preferences and real-world constraints. Over the last years, many methods have been developed with the aim of maximizing the sum of multicriteria scores of projects selected for the final portfolio. In this paper, unlike the existing literature, we propose a new robust multicriteria clustering methodology that enables to group the best ranked projects into a new kind of cluster (so-called optimal portfolio) that complies with the given constraints. With this aim, a new Integer Programming (IP) model as an extension of the K-medoids clustering technique is combined with the PROMETHEE method. Specifically, we first apply PROMETHEE for multicriteria evaluation of the individual projects and then the two main outputs of PROMETHEE, preference matrix and net flows, are used in the IP model to generate clusters of projects with the given resource constraints. Herein, to alleviate the problem without the influence of all K clusters on the final results, we focus on generating two clusters, with the selected projects in the best one forming the portfolio. In developing this model, we also introduce portfolio quality constraints to ensure the proper distribution of goodevaluations among all considered criteria. We then enhance this combined model by embedding it into SMAA framework to consider the inherent uncertainties. As a large number of potentially optimal portfolios are obtained through the SMAA simulation, both project and portfolio-level robustness indices are computed in order to help decision makers to identify the most robust and stable portfolio. Our methodology is validated using the data from a bridge maintenance program.",
    "year": 2022,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "927a5f71e80902133a4551daa0b87715",
    "relevant_keywords": [
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T00:41:04.822162"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "The paper focuses on developing a robust multicriteria clustering methodology for selecting a subset of projects to form an optimal portfolio, which directly aligns with the objectives of portfolio management in financial research. The methodology involves multicriteria evaluation, decision makers' preferences, and resource constraints, all of which are central to portfolio management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Portfolio Management\"],\n  \"justification\": \"The paper focuses on developing a robust multicriteria clustering methodology for selecting a subset of projects to form an optimal portfolio, which directly aligns with the objectives of portfolio management in financial research. The methodology involves multicriteria evaluation, decision makers' preferences, and resource constraints, all of which are central to portfolio management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:32:13.877228"
}