{
  "paper": {
    "id": 3112,
    "title": "Effect of online quotation platform on container shipping orders",
    "abstract": "In the digital era, major shipping lines are developing instant quote and online booking platforms. In one of the first attempts to investigate the post-event effects of this trend, we evaluate how a shipping line's online quote platform impacts its shipper portfolio and the ordered container volume. In order to control for unobserved, time-varying effects that could be correlated with the platform's implementation, we apply the regression discontinuity design (RDD) method to the import trade data from 2016 to 2019 of a top shipping line that released its platform in August 2018. We also adopt global polynomial regression and local liner regression so as to control for the effects of different polynomial time trends. We find the container volume assigned to the shipping line declined slightly after the online platform was launched. The container orders of small shippers increase by 3.97 TEU on average after online platform adoption. The volume of assigned containers from other shippersdeclines. These findings hold fruitful implications for shipping lines. A significant increase in the number of small shippers and their container volumes demonstrate administrative cost saving and risk mitigation for a shipping line. However, it also leads to possible loss of large customers.",
    "year": 2024,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "3ba32fd78a1427d447761fdbef4ebe7d",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:13:45.198369"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究在线报价平台对集装箱航运订单的影响，涉及航运业务和客户行为分析，并未提及衍生品定价、金融风险管理或投资组合管理等金融领域的具体应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究在线报价平台对集装箱航运订单的影响，涉及航运业务和客户行为分析，并未提及衍生品定价、金融风险管理或投资组合管理等金融领域的具体应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:11:28.828307"
}