{
  "paper": {
    "id": 1035,
    "title": "Robust basis of interval multiobjective linear and quadratic programming",
    "abstract": "In this paper we deal with multiobjective linear and quadratic programming problem with uncertain information. So far in the field of statistical analysis and data mining, e.g., mean-variance portfolio problem, support vector machine and their varieties, we have encountered various kinds of quadratic and linear programming problems with multiple criteria. Moreover coefficients in such problems have uncertainty that is expressed by interval, probabilistic distribution or possibilistic (fuzzy) distribution. In this paper, we define a robust basis for all possible perturbation of coefficients within intervals in objective functions and constraints that is regarded as secure and conservative solution under uncertainty. According to the conventional multiobjective programming literature, it is required to solve test subproblem for each basis. Therefore, in case of our interval problem excessive computational demand is estimated. In this paper investigating the properties of robust basis by means of combination of interval extreme points we obtained the result that the robust basis can be examined by working with only a finite subset of possible perturbations of the coefficients.",
    "year": 2007,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "55dcd917dbb1262791ec6308d4dc02fc",
    "relevant_keywords": [
      "support vector machine",
      "SVM"
    ],
    "stage1_timestamp": "2025-05-15T00:50:40.844412"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文讨论了多目标线性和二次规划问题在不确定信息下的鲁棒基础，并提到了均值-方差投资组合问题作为应用实例之一。这表明其核心技术可以应用于投资组合管理领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文讨论了多目标线性和二次规划问题在不确定信息下的鲁棒基础，并提到了均值-方差投资组合问题作为应用实例之一。这表明其核心技术可以应用于投资组合管理领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:25:16.337165"
}