{
  "paper": {
    "id": 751,
    "title": "Efficient Simulation of Financial Stress Testing Scenarios with Suppes-Bayes Causal Networks",
    "abstract": "The most recent financial upheavals have cast doubt on the adequacy of some of the conventional quantitative risk management strategies, such as VaR (Value at Risk), in many common situations. Consequently, there has been an increasing need for verisimilar financial stress testings, namely simulating and analyzing financial portfolios in extreme, albeit rare scenarios. Unlike conventional risk management which exploits statistical correlations among financial instruments, here we focus our analysis on the notion of probabilistic causation, which is embodied by Suppes-Bayes Causal Networks (SBCNs), SBCNs are probabilistic graphical models that have many attractive features in terms of more accurate causal analysis for generating financial stress scenarios. In this paper, we present a novel approach for conducting stress testing of financial portfolios based on SBCNs in combination with classical machine learning classification tools. The resulting method is shown to be capable of correctly discovering the causal relationships among financial factors that affect the portfolios and thus, simulating stress testing scenarios with a higher accuracy and lower computational complexity than conventional Monte Carlo Simulations. (C) 2017 The Authors. Published by Elsevier B.V. Peer-review under responsibility of the scientific committee of the International Conference on Computational Science",
    "year": 2017,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "7551c1fcc06e6ad0265ce7e1a3f2c440",
    "relevant_keywords": [
      "machine learning",
      "classification"
    ],
    "stage1_timestamp": "2025-05-15T01:54:34.125349"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk",
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是使用Suppes-Bayes Causal Networks (SBCNs) 结合机器学习分类工具进行金融压力测试，旨在模拟和分析极端情景下的金融投资组合表现。这直接涉及金融风险管理中的压力测试和投资组合管理中的情景分析。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\", \"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是使用Suppes-Bayes Causal Networks (SBCNs) 结合机器学习分类工具进行金融压力测试，旨在模拟和分析极端情景下的金融投资组合表现。这直接涉及金融风险管理中的压力测试和投资组合管理中的情景分析。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:55:23.876188"
}