{
  "paper": {
    "id": 141,
    "title": "A MODEL BASED ON FACTOR ANALYSIS AND SUPPORT VECTOR MACHINE FOR CREDIT RISK IDENTIFICATION IN SMALL-AND-MEDIUM ENTERPRISES",
    "abstract": "Credit Risk Identification in small-and-medium enterrprises(SMEs) is a real problem which is necessary to be solved in Financial sector. Focusing on 32 small-and-medium enterprises which had bank loan, dimension of six indicators used to judge whether enterprises had credit risk was reduced to simplify model by adopting the factor analysis method. Then small sample data was trained and simulated in examples to get the model that could identify whether there was credit risk in enterprises by adopting Support Vector Machine(SVM) method. At last, the Comparison between SVM method and BP neural network method indicated that SVM method had higher reliability in modeling, and this method was used in Credit Risk Identification in SMEs to identify quickly Whether there was credit risk in enterprise, what is more, to lower loan default rate. Meanwhile, it could help SMEs to identify risk quickly, to improve the ability of risk management and to solve the problem of Credit Risk Identification in SMEs creatively.",
    "year": 2009,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "ece23f5199b82030853ef1e68b5539f7",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM",
      "neural network",
      "backpropagation",
      "BP"
    ],
    "stage1_timestamp": "2025-05-15T01:47:14.115538"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用支持向量机（SVM）和因子分析来识别中小企业的信用风险，这直接涉及金融风险管理中的信用风险识别和降低贷款违约率的问题。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"该论文的核心技术是使用支持向量机（SVM）和因子分析来识别中小企业的信用风险，这直接涉及金融风险管理中的信用风险识别和降低贷款违约率的问题。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:00:45.053745"
}