{
  "paper": {
    "id": 2052,
    "title": "Assessing and Predicting Green Credit Risk in the Paper Industry",
    "abstract": "The paper industry is closely related to forestry resources, which constitute an essential part of achieving sustainable development. Green credit can provide financial support to assist the paper industry in achieving carbon neutrality. To develop a method for performing green credit risk assessments in the paper industry, first, an initial index system was established on the basis of two dimensions: financial risk and socio-environmental risk. Then, the KMV model was applied to measure credit risk. The combined results of this model, along with the environmental penalties of an enterprise, formed the basis for the classification of green credit risk. Third, the Gini index was used to filter out, one by one, the indexes with the least influence among the factors, and then random forest iterations were performed until the prediction accuracy reached the optimum, thus establishing a green credit risk prediction model for the paper industry. The results show that the accuracy of the sample classification reached 93.75%, and the accuracy of the sample classification for high-risk enterprises reached 100%. The established index system offers good guidance for the assessment of green credit risk in the paper industry, in which the interest coverage ratio, current ratio, asset-liability ratio, and green emissions are the main factors affecting green credit risk.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "0de3471aa0bdebc31ec760c0d6978f70",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T02:10:25.829605"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用KMV模型和随机森林算法来评估和预测绿色信贷风险，这直接涉及信用风险的测量和管理，属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是使用KMV模型和随机森林算法来评估和预测绿色信贷风险，这直接涉及信用风险的测量和管理，属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:44:27.906117"
}