{
  "paper": {
    "id": 2112,
    "title": "A reinforcement learning approach for selecting infill drilling locations considering long-term production planning in mining complexes with supply uncertainty",
    "abstract": "Simultaneous stochastic optimisation frameworks provide a method for optimising long-term production schedules in mining complexes that aim to maximise net present value and manage risk related to supply uncertainty. The uncertainty and local variability related to the quality and quantity of material in the mineral deposits are modelled with a set of stochastic orebody simulations, an input into the simultaneous stochastic optimisation framework. Infill drilling provides opportunities to collect additional information associated with the mineral deposits, which can inform future production scheduling decisions. A framework is developed for optimising infill drilling locations with a criterion that seeks areas that directly affect long-term planning decisions and requires the use of geostatistical simulations. Actor-critic reinforcement learning is applied to identify infill drilling locations in a copper mining complex using this criterion. The case study demonstrates that adapting production scheduling decisions given additional information has the potential to improve the associated production and financial forecasts and identifies a stable area for infill drilling.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "e05f3bffc0e869b736520ed7e2b56156",
    "relevant_keywords": [
      "reinforcement learning",
      "actor-critic"
    ],
    "stage1_timestamp": "2025-05-15T02:10:59.123865"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是在采矿复合体中优化填充钻孔位置的方法，使用强化学习来改进长期生产计划和财务预测。虽然涉及财务预测，但其核心应用领域是采矿工程和生产优化，而非上述特定的金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是在采矿复合体中优化填充钻孔位置的方法，使用强化学习来改进长期生产计划和财务预测。虽然涉及财务预测，但其核心应用领域是采矿工程和生产优化，而非上述特定的金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:44:06.451550"
}