{
  "paper": {
    "id": 4223,
    "title": "Toward Self-Driven Autonomous Material and Device Acceleration Platforms (AMADAP) for Emerging Photovoltaics Technologies",
    "abstract": "In the ever-increasing renewable-energy demand scenario, developing new photovoltaic technologies is important, even in the presence of established terawatt-scale silicon technology. Emerging photovoltaic technologies play a crucial role in diversifying material flows while expanding the photovoltaic product portfolio, thus enhancing security and competitiveness within the solar industry. They also serve as a valuable backup for silicon photovoltaic, providing resilience to the overall energy infrastructure. However, the development of functional solar materials poses intricate multiobjective optimization challenges in a large multidimensional composition and parameter space, in some cases with millions of potential candidates to be explored. Solving it necessitates reproducible, user-independent laboratory work and intelligent preselection of innovative experimental methods. Materials acceleration platforms (MAPs) seamlessly integrate robotic materials synthesis and characterization with AI-driven data analysis and experimental design, positioning them as enabling technologies for the discovery and exploration of new materials. They are proposed to revolutionize materials development away from the Edisonian trial-and-error approaches to ultrashort cycles of experiments with exceptional precision, generating a reliable and highly qualitative data situation that allows training machine learning algorithms with predictive power. MAPs are designed to assist the researcher in multidimensional aspects of materials discovery, such as material synthesis, precursor preparation, sample processing and characterization, and data analysis, and are drawing escalating attention in the field of energy materials. Device acceleration platforms (DAPs), however, are designed to optimize functional films and layer stacks. Unlike MAPs, which focus on material discovery, a central aspect of DAPs is the identification and refinement of ideal processing conditions for a predetermined set of materials. Such platforms prove especially invaluable when dealing with disordered semiconductors, which depend heavily on the processing parameters that ultimately define the functional properties and functionality of thin film layers. By facilitating the fine-tuning of processing conditions, DAPs contribute significantly to the advancement and optimization of disordered semiconductor devices, such as emerging photovoltaics. In this Account, we review the recent advancements made by our group in automated and autonomous laboratories for advanced material discovery and device optimization with a strong focus on emerging photovoltaics, such as solution-processing perovskite solar cells and organic photovoltaics. We first introduce two MAPs and two DAPs developed in-house: a microwave-assisted high-throughput synthesis platform for the discovery of organic interface materials, a multipurpose robot-based pipetting platform for the synthesis of new semiconductors and the characterization of thin film semiconductor composites, the SPINBOT system, which is a spin-coating DAP with the potential to optimize complex device architectures, and finally, AMANDA, a fully integrated and autonomously operating DAP. Notably, we underscore the utilization of a robot-based high-throughput experimentation technique to address the common optimization challenges encountered in extensive multidimensional composition and parameter spaces pertaining to organic and perovskite photovoltaics materials. Finally, we briefly propose a holistic concept and technology, a self-driven autonomous material and device acceleration platform (AMADAP) laboratory, for autonomous functional solar materials discovery and development. We hope to discover how AMADAP can be further strengthened and universalized with advancing development of hardware and software infrastructures in the future.",
    "year": 2024,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "f576319cad6d70117a49592293da4036",
    "relevant_keywords": [
      "machine learning",
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T01:24:51.502636"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要讨论的是光伏技术中的材料加速平台和设备加速平台，以及它们在太阳能材料发现和设备优化中的应用。虽然提到了机器学习和深度学习，但这些技术的应用主要集中在材料科学和能源领域，而非金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要讨论的是光伏技术中的材料加速平台和设备加速平台，以及它们在太阳能材料发现和设备优化中的应用。虽然提到了机器学习和深度学习，但这些技术的应用主要集中在材料科学和能源领域，而非金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:07:58.211524"
}