{
  "paper": {
    "id": 152,
    "title": "Evaluation of clustering algorithms for financial risk analysis using MCDM methods",
    "abstract": "The evaluation of clustering algorithms is intrinsically difficult because of the lack of objective measures. Since the evaluation of clustering algorithms normally involves multiple criteria, it can be modeled as a multiple criteria decision making (MCDM) problem. This paper presents an MCDM-based approach to rank a selection of popular clustering algorithms in the domain of financial risk analysis. An experimental study is designed to validate the proposed approach using three MCDM methods, six clustering algorithms, and eleven cluster validity indices over three real-life credit risk and bankruptcy risk data sets. The results demonstrate the effectiveness of MCDM methods in evaluating clustering algorithms and indicate that the repeated-bisection method leads to good 2-way clustering solutions on the selected financial risk data sets. (C) 2014 Elsevier Inc. All rights reserved.",
    "year": 2014,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "9073f1aa39d2095b59e0b65a84822399",
    "relevant_keywords": [
      "unsupervised learning",
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T01:47:14.176708"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on evaluating clustering algorithms for financial risk analysis, specifically using credit risk and bankruptcy risk datasets. This directly aligns with the domain of Financial Risk Management, as it aims to improve risk assessment methodologies.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on evaluating clustering algorithms for financial risk analysis, specifically using credit risk and bankruptcy risk datasets. This directly aligns with the domain of Financial Risk Management, as it aims to improve risk assessment methodologies.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:00:26.027778"
}