{
  "paper": {
    "id": 7216,
    "title": "Disparities in mortgage lending, bank performance, economic influence, and regulatory oversight",
    "abstract": "This study investigates factors affecting changes in the disparity of home mortgage denial rates between white and minority loan applicants in the U.S. during the period 1991-1997. We develop a two-stage least-squares regression model that incorporates applicant-level characteristics, neighborhood characteristics, regional economic data, and bank-specific data as explanatory variables. Some have argued that mortgage lenders were under increasing pressure from industry regulators to extend additional credit to minorities and low-income groups during the period under study. The model includes each institution's periodic CRA rating as a proxy for regulatory influence. An alternative explanation is that market forces, such as improvements in economic conditions and in bank financial condition and performance, affected default loss estimates and credit standards in a way that disproportionally benefited minority and low-income applicants. The empirical findings are consistent with the latter hypothesis. We conclude that policy makers should consider the impact of market factors when assessing the allocation of mortgage credit in a particular demographic market. The findings also underscore the importance of controlling for lender assessments of credit risk when evaluating compliance with CRA and fair lending statutes.",
    "year": 2001,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "d0a9574563ceacda9752548f25b80b6f",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T03:06:35.240910"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究抵押贷款拒绝率的差异及其影响因素，涉及监管政策、市场力量和经济条件等，但并未直接涉及衍生品定价、金融风险管理或投资组合管理等特定金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究抵押贷款拒绝率的差异及其影响因素，涉及监管政策、市场力量和经济条件等，但并未直接涉及衍生品定价、金融风险管理或投资组合管理等特定金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:26:39.804925"
}