{
  "paper": {
    "id": 714,
    "title": "Automated building classification framework using convolutional neural network",
    "abstract": "Despite extensive study, performing Rapid visual screening is still a challenging task for many countries. The challenges include the lack of trained engineers, limited resources, and a large building inventory to detect. One of the most important aspect in rapid visual screening is to establish the building classification based on the guidelines' specific criteria. This study proposes a general framework based on Convolutional Neural Network to perform automated building classification for the rapid visual screening procedure. The method classifies buildings based on the Federal Emergency Management Agency (FEMA)-154 guidelines and uses transfer learning techniques from a pre-trained network. The Indonesian building portfolio is used as a case study and a dataset of building images generated through web-scraping on Google Search (TM) engines and Google StreetView (TM) website is used for the method validation. Results show that the proposed framework has promising potential to automate the building classification based on FEMA-154 guidelines.",
    "year": 2022,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "ee790b9fcffc56ea7540238aa6b7300b",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "neural network",
      "deep learning",
      "convolutional neural network",
      "CNN",
      "transfer learning"
    ],
    "stage1_timestamp": "2025-05-15T00:47:18.543797"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究基于卷积神经网络的自动化建筑分类框架，用于快速视觉筛查程序，与衍生品定价、金融风险管理或投资组合管理等金融领域无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究基于卷积神经网络的自动化建筑分类框架，用于快速视觉筛查程序，与衍生品定价、金融风险管理或投资组合管理等金融领域无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:28:24.961771"
}