{
  "paper": {
    "id": 2372,
    "title": "Deep Learning and Machine Learning Insights Into the Global Economic Drivers of the Bitcoin Price",
    "abstract": "This study examines the connection between Bitcoin and global factors, including the VIX, the oil price, the US dollar index, the gold price, and interest rates estimated using the Federal funds rate and treasury securities rate, for forecasting analysis. Deep learning methodologies, including LSTM, GRU, CNN, and TFT, with machine learning algorithms such as XGBoost, LightGBM, and SVR, were employed to identify the optimal prediction model for the Bitcoin price. The findings indicate that the TFT model is the most successful predictive approach, with the gold price identified as the most relevant component in determining the Bitcoin price. After the gold indicator, the US dollar index was a substantial factor in the explanation of the Bitcoin price. The TFT model also included regulatory decisions and global events. It was estimated that the Bitcoin price was significantly influenced by the COVID-19 pandemic. After that, global climate events and China mining ban strongly affected the Bitcoin price. These findings indicate that regulatory decisions and global events determine the Bitcoin price in addition to macroeconomic factors. The VAR analysis was employed as a robustness check. The results indicate that gold and oil prices have a strong negative influence on Bitcoin, particularly in the long term. The paper has significant policy implications for investors, portfolio managers, and scholars.",
    "year": 2025,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "9b9a5fa35384b890bebf9ae8a307a63e",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "support vector machine",
      "SVM",
      "neural network",
      "convolutional neural network",
      "CNN",
      "recurrent neural network",
      "long short-term memory",
      "LSTM"
    ],
    "stage1_timestamp": "2025-05-15T01:06:10.773931"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文主要研究比特币价格预测及其与全球宏观经济因素的关系，并提到研究结果对投资者和投资组合管理者有重要政策意义。这表明其核心技术（深度学习和机器学习模型）主要用于投资组合管理领域，帮助投资者和组合管理者更好地理解和预测比特币价格变动，从而优化投资决策。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文主要研究比特币价格预测及其与全球宏观经济因素的关系，并提到研究结果对投资者和投资组合管理者有重要政策意义。这表明其核心技术（深度学习和机器学习模型）主要用于投资组合管理领域，帮助投资者和组合管理者更好地理解和预测比特币价格变动，从而优化投资决策。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:15:27.568457"
}