{
  "paper": {
    "id": 5245,
    "title": "Linkages between Brexit and European Equity Markets Evidence from Quantile Regression Approach",
    "abstract": "The aim of this paper is to give a comprehensive description of the risk dependence and interdependence between selected European stock markets and Brexit equity in the period spanning from January, 7, 2000 to February, 3, 2017. We have studied behavior of extreme quantiles using quantile regression approch. This approch is robut because it is based on the use of various measures of central tendency and dispersion statistics for a detailed analysis of the relationship between variables. We have found evidence of significant interdependence/independence between financial markets and Brexit. The analysis of upper and lower quantiles allows to observe that the interdependence is positive asymmentric and higher for bear markets compared to bear or normal markets conditions.",
    "year": 2017,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "207538af4324f3cc6ae56fdd66429e10",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:45:47.439537"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on analyzing the risk dependence and interdependence between European stock markets and Brexit equity, particularly using quantile regression to study extreme quantiles and market conditions. This is directly related to understanding and managing financial risks, especially in the context of market volatility and interdependence.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on analyzing the risk dependence and interdependence between European stock markets and Brexit equity, particularly using quantile regression to study extreme quantiles and market conditions. This is directly related to understanding and managing financial risks, especially in the context of market volatility and interdependence.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:31:06.487788"
}