{
  "paper": {
    "id": 75,
    "title": "Parametric and non-parametric combination model to enhance overall performance on default prediction",
    "abstract": "The probability of default (PD) is the key element in the New Basel Capital Accord and the most essential factor to financial institutions' risk management. To obtain good PD estimation, practitioners and academics have put forward numerous default prediction models. However, how to use multiple models to enhance overall performance on default prediction remains untouched. In this paper, a parametric and non-parametric combination model is proposed. Firstly, binary logistic regression model (BLRM), support vector machine (SVM), and decision tree (DT) are used respectively to establish models with relatively stable and high performance. Secondly, in order to make further improvement to the overall performance, a combination model using the method of multiple discriminant analysis (MDA) is constructed. In this way, the coverage rate of the combination model is greatly improved, and the risk of miscarriage is effectively reduced. Lastly, the results of the combination model are analyzed by using the K-means clustering, and the clustering distribution is consistent with a normal distribution. The results show that the combination model based on parametric and non-parametric can effectively enhance the overall performance on default prediction.",
    "year": 2014,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "287b8644eef740c85018c1529f7e65ef",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM",
      "decision tree",
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T01:46:39.525086"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on enhancing the prediction of probability of default (PD), which is a critical component in financial risk management, particularly under the New Basel Capital Accord framework. The proposed combination model aims to improve default prediction performance, directly addressing risk assessment and mitigation for financial institutions.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on enhancing the prediction of probability of default (PD), which is a critical component in financial risk management, particularly under the New Basel Capital Accord framework. The proposed combination model aims to improve default prediction performance, directly addressing risk assessment and mitigation for financial institutions.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:01:10.407251"
}