{
  "paper": {
    "id": 962,
    "title": "Parameterized deep reinforcement learning-enabled maintenance decision-support and life-cycle risk assessment for highway bridge portfolios",
    "abstract": "Deep reinforcement learning (DRL) has emerged to be a promising alternative capable of providing intelligent and proactive sequential decision-support for bridge asset management. However, the state of research in this topic mainly focused on a fixed structural system, whereas the integration of DRL with varying training environments, which may more broadly accommodate the needs of different individual structures is yet to be explored. This study proposes a parameterized DRL framework to deliver a unified policy to meet the decision needs of different individual highway bridge structures within a bridge portfolio. Moreover, a time-and policy dependent risk quantification approach is also proposed. A case-study highway bridge portfolio is considered to evaluate and demonstrate the merit of the proposed methodology. From the results, the parameterized DRL policy is found to offer superior sequential maintenance decisions that can better help the bridge structures adapt to long-term deterioration, while minimizing the cumulative socioeconomic costs.",
    "year": 2022,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "4502ab97e5bd10d31901a6ab9e4ef7dc",
    "relevant_keywords": [
      "machine learning",
      "reinforcement learning",
      "deep learning",
      "neural network",
      "representation learning"
    ],
    "stage1_timestamp": "2025-05-15T00:50:08.728445"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是使用深度强化学习进行高速公路桥梁维护决策支持和生命周期风险评估，其核心应用领域是基础设施资产管理，而非金融领域。虽然提到了‘portfolio’一词，但指的是桥梁组合而非金融投资组合，且未涉及衍生品定价、金融风险管理或投资组合管理的相关内容。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是使用深度强化学习进行高速公路桥梁维护决策支持和生命周期风险评估，其核心应用领域是基础设施资产管理，而非金融领域。虽然提到了‘portfolio’一词，但指的是桥梁组合而非金融投资组合，且未涉及衍生品定价、金融风险管理或投资组合管理的相关内容。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:25:50.637267"
}