{
  "paper": {
    "id": 2072,
    "title": "Gasoline demand and car choice: estimating gasoline demand using household information",
    "abstract": "In recent years, calls for carbon taxes as a policy tool to combat global warming have kept a discussion of the price and income elasticities of gasoline demand alive. To date, gasoline demand elasticity estimates are almost exclusively based on aggregate data that are subject to aggregation problems and make distributional concerns impossible to address. By using household-level data from the Panel Study of Income Dynamics (PSID) and imputed fuel efficiency measures and gasoline prices, I estimate household demand for gasoline and the corresponding price and income demand elasticities. An attempt is made to include data on the car stock in the estimation since car-portfolio and gasoline demand decisions are closely related. Empirical results from a selection corrected gasoline demand regression suggest low short-run price and income elasticities and clear differences in gasoline demand across the population. These results suggest that a gasoline tax is not likely to result in large decreases in gasoline consumption while potentially imposing hardship on identifiable segments of the population. (C) 2000 Elsevier Science B.V. All rights reserved. JEL classification: H2; Q41.",
    "year": 2000,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "ce050317c664f85a911d575822325537",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:02:32.901548"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究家庭汽油需求的价格和收入弹性，使用回归分析来估计这些弹性，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究家庭汽油需求的价格和收入弹性，使用回归分析来估计这些弹性，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:17:21.502396"
}