{
  "paper": {
    "id": 3581,
    "title": "Adaptive consumer credit classification",
    "abstract": "Credit scoring methods for predicting creditworthiness have proven very effective in consumer finance. In light of the present financial crisis, such methods will become even more important. One of the outstanding issues in credit risk classification is population drift. This term refers to changes occurring in the population due to unexpected changes in economic conditions and other factors. In this paper, we propose a novel methodology for the classification of credit applications that has the potential to adapt to population drift as it occurs. This provides the opportunity to update the credit risk classifier as new labelled data arrives. Assorted experimental results suggest that the proposed method has the potential to yield significant performance improvement over standard approaches, without sacrificing the classifier's descriptive capabilities. Journal of the Operational Research Society (2012) 63, 1645-1654. doi:10.1057/jors.2012.15 Published online 29 February 2012",
    "year": 2012,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "b2ad4bf72fad8d44d7ab6cef7ff0c612",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification"
    ],
    "stage1_timestamp": "2025-05-15T02:27:54.035056"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on developing an adaptive methodology for credit scoring to predict creditworthiness and manage credit risk, which is a key aspect of financial risk management in consumer finance.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on developing an adaptive methodology for credit scoring to predict creditworthiness and manage credit risk, which is a key aspect of financial risk management in consumer finance.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:35:59.553415"
}