{
  "paper": {
    "id": 2221,
    "title": "Credit Risk Models in the Mexican Context Using Machine Learning",
    "abstract": "The Default Rate is related to the period of the economic cycle in which they are observed, during expansion periods of the economy the default rate tends to be lower. But in contraction periods, the default rate tends to increase and this could be a risk for the stability of a country's economy. Therefore, it is important to monitor the perspective of the economy in case it is expected to decrease or have abrupt movements. This work aims to identify the economic variables that determine the default rate of the Mexican Financial System and to find a machine learning model that forecasts the default rate. For this, we aggregate a dataset based on three official Mexican sources that compile data from 2013 to 2022, including the COVID-19 pandemic time frame. Then, we propose the analysis using two machine learning models. After the analysis, the results confirm that the artificial neural networks model shows better predictive power for the default rate values. We also implement an easy to use web application to estimate the default rate based on three simple variables. We anticipate this work might help on estimating the default rate and might impact on the strategic policies in the Mexican economy.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "ab6e8a2ac4b938d09f363922d779f25e",
    "relevant_keywords": [
      "machine learning",
      "neural network",
      "classification",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:12:50.959776"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on predicting the default rate in the Mexican Financial System using machine learning models, which is directly related to assessing and managing credit risk, a key aspect of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on predicting the default rate in the Mexican Financial System using machine learning models, which is directly related to assessing and managing credit risk, a key aspect of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T14:23:37.155097"
}