{
  "paper": {
    "id": 6322,
    "title": "Relevance of the Gaussian classification on the Detection of DDoS Attacks",
    "abstract": "Distributed denial of service (DDoS) attacks have undergone a worrying evolution in recent years. The simplicity of the concept of these attacks, their effectiveness, and the multitude of sources of motivation make this type of attack one of the most used in the world. These attacks generate significant financial losses through service interruption or indirectly, through the damage to the target's image. Because of this shift, many organizations are ill-equipped to handle this current type of attack. Although common out-of-the-box technologies can detect a breach, they are unable to mitigate this new level of risk. In order to keep pace with DDoS hackers, a more humane and proactive approach is also needed. The aim of this study is to show the efficiency conditions of the Gaussian distribution and to propose an approach that shows the relevance of the Gaussian model in a binary classification. The results show that the best performances are obtained when the rate of the small class is between 0.02% and 0.05% compared to the whole data.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "0e5171e6ebfdd5a7c94d1b1d93db9c8c",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification"
    ],
    "stage1_timestamp": "2025-05-15T02:57:07.668733"
  },
  "domain_result": {
    "success": false,
    "error": "Client error '429 Too Many Requests' for url 'https://api.deepseek.com/v1/chat/completions'\nFor more information check: https://developer.mozilla.org/en-US/docs/Web/HTTP/Status/429",
    "application_domains": [
      "None"
    ],
    "justification": "API调用失败: Client error '429 Too Many Requests' for url 'https://api.deepseek.com/v1/chat/completions'\nFor more information check: https://developer.mozilla.org/en-US/docs/Web/HTTP/Status/429",
    "raw_response": null
  },
  "timestamp": "2025-05-20T15:27:55.101383"
}