{
  "paper": {
    "id": 2454,
    "title": "FINANCIAL DISTRESS CRITERIA DEFINED BY MODEL BASED CLUSTERING",
    "abstract": "One of the important steps in financial distress analyses is to correctly and reasonably mark a company whether is, or it is not in financial distress risk. There are many definitions used in the past. Most of them are based on time static point of view and thus use only one year data. In this paper, we continue with our previous work that examined possibilities of the companies clustering in order to identify homogeneous clusters regarding to their financial distress by using micropanel data. Financial distress can be described as a situation when a company cannot pay or has a difficulty to pay off its financial obligations. In our analysis we consider three criteria to define this situation: the equity, the earnings after taxes and the current ratio value. These financial indicators data were collected over a few consecutive years and thus create a longitudinal data set. We compare a model based partitioning and k-means partitioning to cluster the time trajectories of these three criteria. We use packages mixAK and kml of the statistical system R.",
    "year": 2017,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "c50c32b5969063928d3265d236b59b35",
    "relevant_keywords": [
      "unsupervised learning",
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T02:15:27.093651"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on identifying financial distress in companies using clustering techniques, which is a key aspect of financial risk management, specifically in assessing credit risk and potential defaults.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on identifying financial distress in companies using clustering techniques, which is a key aspect of financial risk management, specifically in assessing credit risk and potential defaults.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:42:26.914860"
}