{
  "paper": {
    "id": 2628,
    "title": "Systemic risk and financial system network using financial risk meter: the case of Vietnam",
    "abstract": "In the financial market, systemic risk is defined as the possibility that an event at the company level could trigger severe instability or collapse of an entire industry or the whole economy. Thus, under-standing systemic risk is crucial for the financial institutions, large corporations, investors and regulators. This article investigates systemic risk and spillover effect using the new Financial Risk Meter (FRM) index, which is obtained from running quantile linear regression and Least Absolute Shrinkage and Selection Operator (LASSO) method. The FRM index is obtained to identify the highly risky periods, the contributors to systemic risk and the potential activators of spillover effect. Moreover, interconnection between firms can be visualized as a network. We use a data set consisting of daily stock returns from 35 financial institutions and real estate firms in Vietnam, combined with 4 macroeconomic variables over the period from November 2011 to December 2020. The findings indicate that over the considered period, some detected highly risky periods are 2012, 2018 and 2020, probably due to the non-performing loan crisis in Vietnam, US-China trade war and global COVID-19 outbreak. Some active activators of risk spillover effect are also identified.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "575372cd45fd68d0e31c24cd22e994fc",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:17:32.131198"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on systemic risk and spillover effects in the financial market, using the Financial Risk Meter (FRM) index derived from quantile linear regression and LASSO method. This is directly related to identifying and managing financial risks, which falls under the domain of Financial Risk Management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on systemic risk and spillover effects in the financial market, using the Financial Risk Meter (FRM) index derived from quantile linear regression and LASSO method. This is directly related to identifying and managing financial risks, which falls under the domain of Financial Risk Management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:41:06.470253"
}