{
  "paper": {
    "id": 5982,
    "title": "A three-level optimization methodology for the partitioning of shale gas wellpad groups",
    "abstract": "Shale gas exploitation incurs considerable financial risk due to the high uncertainty of gas production; reducing the full life-cycle costs would play an important role in achieving expected economic benefits. In this paper, a three-level optimization methodology is proposed to optimally partition shale gas wellpad groups with the objective of minimizing the construction costs of the gas-gathering system. The first-level model is built to determine the annual optimal infield battery sites and the subordinated relationship among wellpads and infield batteries, aiming to minimize the construction costs of the gas gathering system for each development year. The second-level model is proposed to determine the global optimal infield battery sites for the entire field life by using the hierarchical clustering method to divide all annual optimal infield battery sites into several limited clusters. The third-level model is established to determine a globally optimal subordinated relationship among wellpads and infield battery sites, with the objective of minimizing the total distances from the wellpads to the global optimal infield battery sites. The unconventional features, i.e., continuous tie-in, production decline and shutdown or abandonment of shale gas wellpads during field development, have been considered and integrated into the three-level methodology. The hybrid genetic algorithm and particle swarm optimization algorithm (HGAPSO) is used to solve the first- and third-level models, whereas the single-linkage clustering algorithm is adopted to solve the second-level model. Finally, a practical application of the methodology is performed to validate its effectiveness in partitioning wellpad groups in a real shale gas field in Sichuan Province, China. The achievements provide an effective method for partitioning shale gas wellpads in either the conceptual design or the following realistic development phases. (C) 2016 Elsevier B.V. All rights reserved.",
    "year": 2016,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "54cb0a87fc920e408a6b09be12f72caf",
    "relevant_keywords": [
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T02:53:33.399260"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是页岩气井组的分区优化方法，旨在最小化集气系统的建设成本。虽然提到了金融风险，但核心技术和应用场景集中在工程优化和成本控制，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是页岩气井组的分区优化方法，旨在最小化集气系统的建设成本。虽然提到了金融风险，但核心技术和应用场景集中在工程优化和成本控制，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:28:56.348560"
}