{
  "paper": {
    "id": 1653,
    "title": "Assessing network risk with FRM: links with pricing kernel volatility and application to cryptocurrencies",
    "abstract": "The Financial Risk Meter (FRM) employs Quantile-LASSO regression to identify systemic financial risk and dependencies among tail events across financial assets. This paper establishes, both theoretically and empirically, a meaningful economic relationship between the FRM index, derived from the penalization parameter in quantile LASSO regression, and the volatility of assets' pricing kernels, the attainable maximal Sharpe ratio, and market volatility. Despite the rapid growth of the crypto market and its increasing integration with traditional financial markets, there remains a dearth of risk measures in this space. $ FRM@Crypto $ FRM@Crypto exhibits robust predictive capabilities in anticipating future market risk, potentially filling a critical void in this market.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "0049fe41385c048ea19cf0097bdf99b8",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:05:42.620405"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on the Financial Risk Meter (FRM) to assess systemic financial risk and dependencies among tail events, particularly in the context of cryptocurrencies. It discusses the predictive capabilities of FRM in anticipating future market risk, which is a core aspect of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on the Financial Risk Meter (FRM) to assess systemic financial risk and dependencies among tail events, particularly in the context of cryptocurrencies. It discusses the predictive capabilities of FRM in anticipating future market risk, which is a core aspect of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:47:18.479245"
}