{
  "paper": {
    "id": 3921,
    "title": "Index-based insurance and hydroclimatic risk management in agriculture: A systematic review of index selection and yield-index modelling methods",
    "abstract": "In this study we systematically reviewed the available literature on weather index insurance design between 2001 and 2020. In recent years, there has been a marked increase in ex-ante studies of index-based insurance as a financial risk management tool for agricultural risks. New and improved indices have emerged, and new methods for quantifying the yield-index relationship have been explored to minimise basis risk in contract design. Our review indicated that rainfall-followed by temperature-based indices were most prevalent, while indices based on droughts and floods, vegetation, soil moisture, humidity, and sunshine hours were underrepresented despite their demonstrated potentials. Ordinary least square-based correlation and linear regression methods dominated yield-index modelling, while methods addressing extremes such as quantile regression and copulas have increased prominence in developed countries recently. We highlighted several new research trends to guide future research studies, in particular, the use of remote sensing data and hydrological and crop modelling to address data scarcity, geographical basis risk, and climate change.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "84010f6adafd7a2e1b1a4a13067fd2f4",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:31:28.341324"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文系统地回顾了天气指数保险设计的相关文献，重点讨论了如何通过改进指数和建模方法来最小化合同设计中的基础风险。这直接涉及金融风险管理中的风险转移和风险对冲策略，特别是在农业领域的应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文系统地回顾了天气指数保险设计的相关文献，重点讨论了如何通过改进指数和建模方法来最小化合同设计中的基础风险。这直接涉及金融风险管理中的风险转移和风险对冲策略，特别是在农业领域的应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:34:44.632122"
}