{
  "paper": {
    "id": 1244,
    "title": "Factors Contributing to SARS-CoV-2 Vaccine Hesitancy of Hispanic Population in Rio Grande Valley",
    "abstract": "Hispanic communities have been disproportionately affected by economic disparities. These inequalities have put Hispanics at an increased risk for preventable health conditions. In addition, the CDC reports Hispanics to have 1.5 x COVID-19 infection rates and low vaccination rates. This study aims to identify the driving factors for COVID-19 vaccine hesitancy of Hispanic survey participants in the Rio Grande Valley. Our analysis used machine learning methods to identify significant associations between medical, economic, and social factors impacting the uptake and willingness to receive the COVID-19 vaccine. A combination of three classification methods (i.e., logistic regression, decision trees, and support vector machines) was used to classify observations based on the value of the targeted responses received and extract a robust subset of factors. Our analysis revealed different medical, economic, and social associations that correlate to other target population groups (i.e., males and females). According to the analysis performed on males, the Matthews correlation coefficient (MCC) value was 0.972. An MCC score of 0.805 was achieved by analyzing females, while the analysis of males and females achieved 0.797. Specifically, several medical, economic factors, and sociodemographic characteristics are more prevalent in vaccine-hesitant groups, such as asthma, hypertension, mental health problems, financial strain due to COVID-19, gender, lack of health insurance plans, and limited test availability.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "9afa19e3eb161f77aee994dbba2da6d1",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "regression",
      "support vector machine",
      "SVM",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T02:00:30.585202"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是COVID-19疫苗犹豫的影响因素，应用机器学习方法分析医疗、经济和社会因素，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是COVID-19疫苗犹豫的影响因素，应用机器学习方法分析医疗、经济和社会因素，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:50:53.134723"
}