{
  "paper": {
    "id": 847,
    "title": "Credit Scoring Through Data Mining Approach : A Case Study of Mortgage Loan In Indonesia",
    "abstract": "Non-performing loans has been one of the biggest problems in the banking sector. One alternative to minimize credit risk is to improve the evaluation of the applicant's credibility. Credit scoring is an evaluation of the feasibility of credit requests. For financial institution, poor credit may lead to an increase in non-preforming loans that may reduce bank productivity even in the event of financial crises and financial institutions bankruptcy Previously, credit scoring is based on the conventional statistics such as logistic regression and discriminant analysis. those techniques produce a good accuracy, some of the assumptions aren't accomplished by the data. Along the development of information technology, more advance approach named data mining has been developed. Therefore, this study used the Data Mining approach to solve NPL percentage problems in Indonesian bank, specifically in its mortgage loan. The classifiers used are decision tree C4.5 and random forest. Classifier with the best accuracy is random forest with Adaboost with 72.95%, on the other hand the worst accuracy performed by C4.5 with 68,7%. The best sensitivity performed by random forest complemented by Ada-boost with 0,730. It is considered as the best model in terms of prevent the type II error which could impact to the increase of non-performing loan in a bank. By the end of the research, it can be concluded that all types of random forest model out-perform the C4.5 decision tree.",
    "year": 2019,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "81cfba8cace5ae304745de8dabe71f4c",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T01:55:41.657431"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要研究使用数据挖掘技术（如决策树和随机森林）进行信用评分，以减少不良贷款（NPL）的风险。这直接涉及信用风险管理，属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文主要研究使用数据挖掘技术（如决策树和随机森林）进行信用评分，以减少不良贷款（NPL）的风险。这直接涉及信用风险管理，属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:54:16.223280"
}