{
  "paper": {
    "id": 4112,
    "title": "Dynamic Capabilities and Institutional Complexity: Exploring the Impact of Innovation and Financial Support Policies on the Circular Economy",
    "abstract": "The adoption of the circular economy (CE) requires new strategies and policies to help firms in their transition. Despite this need, research on how to articulate policies for the transition towards a CE is still in its early stages, and the findings are inconclusive and even discrepant, especially concerning the necessary financial support or policies to foster systemic circular innovation in firms. The aim of this research is to analyze the effect of institutional pressures in these two areas on the adoption of CE in firms. To do this, from a theoretical perspective, we combine institutional theory, particularly institutional complexity, with the dynamic capabilities approach. From a methodological point of view, along with classical econometric methods, artificial neural networks and regression trees are applied to analyze data from European firms. The results show, first, that policies to foster innovation and financial support help in the adoption of CE in firms, but its effect follows an inverted U shape. This indicates that the institutional pressures embodied in these policies reach a threshold and that beyond that point, an increase in institutional pressures deteriorates the development of CE in firms. Second, the results show that within the portfolio of institutional pressures considered, there is a positive effect of a greater diversity of policies on CE development in firms. Lastly, the results demonstrate that innovation policies, when combined with financial policies produce synergistic effects on the adoption of CE in firms, greater than those observed when financial support policies are employed in isolation.",
    "year": 2024,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "4745ea8113752eb1226ba9d1d4ac0e2a",
    "relevant_keywords": [
      "neural network",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T01:23:58.059717"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究循环经济（CE）的采用，以及创新和金融支持政策对企业的影响。虽然使用了神经网络和决策树等机器学习方法，但这些技术并未应用于衍生品定价、金融风险管理或投资组合管理等金融领域。论文的核心研究目标是政策效果和企业行为，而非金融市场的特定问题。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究循环经济（CE）的采用，以及创新和金融支持政策对企业的影响。虽然使用了神经网络和决策树等机器学习方法，但这些技术并未应用于衍生品定价、金融风险管理或投资组合管理等金融领域。论文的核心研究目标是政策效果和企业行为，而非金融市场的特定问题。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:08:00.501871"
}