{
  "paper": {
    "id": 3308,
    "title": "The Fraud Auditing: Empirical Study concerning the Identification of the Financial Dimensions of Fraud",
    "abstract": "The last two decades, marked by financial instability, economic crises, the bankruptcy of worldwide renowned companies, stock exchange speculations, financial scandals and lack of trust in capital markets, have lead to an economic downfall and have brought back into light the analysis of the responsible factors. Of these, financial fraud is a significant element regarded as a disastrous phenomenon difficult to pin under safe touchlines. Therefore, the identification of the determining factors of fraud is nowadays an important desideratum at an international level, for the prevention and elimination of these events, beyond the psychological approaches. This study aims to identify the main financial components of fraud in order to obtain score classification functions, as well as to determine the probability of occurrence of the risk of fraud, starting from a series of consecrated economical-financial indicators, by using advanced statistical methods of data analysis. The research objectives and the validation of the work hypotheses have been achieved based on the study of 65 frauded and unfrauded companies, quoted on the main financial markets in the world. In order to obtain the research results, the data have been processed with SPSS 19.0.",
    "year": 2011,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "a242d15e5be7e7e8d2742f90de1f7fb0",
    "relevant_keywords": [
      "classification",
      "principal components analysis"
    ],
    "stage1_timestamp": "2025-05-15T02:24:39.756418"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究财务欺诈的识别和分类，并未涉及衍生品定价、金融风险管理或投资组合管理等特定金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究财务欺诈的识别和分类，并未涉及衍生品定价、金融风险管理或投资组合管理等特定金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:37:18.292051"
}