{
  "paper": {
    "id": 14,
    "title": "One Parameter Selection Method of the BP Neural Network on Real Options Pricing",
    "abstract": "Based on the theory of BP neural network, the evaluation prediction model of real options pricing was established. Some quantized and non-quantized factors were all considered into the model such as evaluation value uncertainty, investment cost, investment opportunity duration, share degree, environment risk and so on. With one given example, the input parameters of the model were optimized by means of genetic algorithm and the detailed input parameters optimization process was also pointed out by dint of one calculation flow chart. The results show that the method not only guarantees the precision of calculation, but also reduces the number of input variables in the prediction model. At the same time, it can avoid that the calculation does not converge because of lots of input parameters to the prediction model. In addition, this can also reduce the subjectivity of the Black-Scholes model and make the evaluation of real options pricing more accurate. As a result, one good prediction effect has been obtained again.",
    "year": 2014,
    "source": "WOS",
    "area": "derivatives_pricing",
    "method": "machine learning",
    "cache_key": "a7ca335125c44f6a61d56723c2ec6007",
    "relevant_keywords": [
      "neural network",
      "backpropagation",
      "BP"
    ],
    "stage1_timestamp": "2025-05-15T01:27:29.469943"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Derivatives Pricing"
    ],
    "justification": "该论文的核心技术是使用BP神经网络建立实物期权定价的评估预测模型，并优化输入参数以提高计算精度。实物期权定价属于衍生品定价的范畴，论文明确提到该方法可以减少Black-Scholes模型的主观性，使实物期权定价评估更准确。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"衍生品定价\"],\n  \"justification\": \"该论文的核心技术是使用BP神经网络建立实物期权定价的评估预测模型，并优化输入参数以提高计算精度。实物期权定价属于衍生品定价的范畴，论文明确提到该方法可以减少Black-Scholes模型的主观性，使实物期权定价评估更准确。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:07:31.370728"
}