{
  "paper": {
    "id": 871,
    "title": "A R-GCN-Based Correlation Characteristics Extraction Method for Power Grid Infrastructure Planning and Analysis",
    "abstract": "For a large number of grid infrastructure projects, various interrelationships may have an impact on portfolio optimization to a certain extent. At present, there are few qualitative analyses considering linkages among massive power grid infrastructure projects. In order to overcome the limitations of the existing studies, this paper proposes a method for extracting the correlation characteristics of massive power grid infrastructure projects based on relational graph convolutional neural network (R-GCN). The correlation characteristics of power grid infrastructure projects with different voltage levels, engineering attributes and project properties are comprehensively considered. R-GCN generalizes the traditional graph convolutional neural network and can process multi-relational data, building an encoder and identifying multiple relations between entities in the project library by accessing different layers to solve corresponding modeling problems, so as to accurately identify the linkages among a large number of power grid infrastructure projects, and further improve the rationality of portfolio optimization.",
    "year": 2022,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "779f2259f5aebcaa8dec7ff4854aa307",
    "relevant_keywords": [
      "machine learning",
      "neural network",
      "deep learning",
      "representation learning",
      "convolutional neural network",
      "CNN",
      "encoder-decoder",
      "autoencoder"
    ],
    "stage1_timestamp": "2025-05-15T00:49:03.165747"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文提出了一种基于R-GCN的方法来提取电网基础设施项目的相关性特征，目的是优化项目组合的合理性。虽然研究背景是电网基础设施，但其核心技术（R-GCN）的应用场景是项目组合优化，这与金融领域的投资组合管理在方法论上高度相似。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文提出了一种基于R-GCN的方法来提取电网基础设施项目的相关性特征，目的是优化项目组合的合理性。虽然研究背景是电网基础设施，但其核心技术（R-GCN）的应用场景是项目组合优化，这与金融领域的投资组合管理在方法论上高度相似。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:26:48.615644"
}