{
  "paper": {
    "id": 3739,
    "title": "Effects of the Covid-19 Pandemic on saving and credit cooperatives: a case study",
    "abstract": "The objective of this study is to explore the effects of the Covid-19 pandemic on the portfolio of a saving and credit cooperative in Portoviejo, Ecuador, and to identify factors associated with the probability of reporting slowness. The literature addressing the effects of the pandemic on financial institutions has focused primarily on the rapid digitization of the industry and, geographically, in developed countries. To date, little literature has reported on the effect of the pandemic on saving and credit cooperatives in developing countries. A case study was designed with mixed-methods, combining regulatory content and cooperatives reports with a sample database of credit transactions between January 2019 and December 2021, and the data were analyzed using hypothesis testing and regression analysis. The variables that were best associated with the likelihood of a borrower reporting late payments are the amount of the credit, the time the credit was extended whether before or after the onset of the pandemic, and the sex of the borrowing member. The results can inform new experimental studies that will provide a deeper understanding of what works and what does not work for credit cooperatives during periods of crisis.",
    "year": 2022,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "9afc515cb935acade48c7c05ca933aac",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:20:03.659560"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究新冠疫情对储蓄和信贷合作社的影响，特别是借款人的还款延迟概率，并未涉及衍生品定价、金融风险管理或投资组合管理等特定金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究新冠疫情对储蓄和信贷合作社的影响，特别是借款人的还款延迟概率，并未涉及衍生品定价、金融风险管理或投资组合管理等特定金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:08:51.562280"
}