{
  "paper": {
    "id": 2272,
    "title": "Design of an IoT-based Flood Early Detection System using Machine Learning",
    "abstract": "Floods are a complex phenomenon that is difficult to predict because of their non-linear and dynamic nature. Gauging stations that transmit measured data to the server are often placed in very harsh and far environments that make the risk of missing data so high. The purpose of this study is to develop a real-time reliable flood monitoring and detection system using deep learning. This paper proposed an Internet of Things (IoT) approach for utilizing LoRaWAN as a reliable, low power, wide area communication technology by considering the effect of radius and transmission rate on packet loss. Besides, we evaluate an artificial neural network (ANN), Long Short-Term Memory (LSTM), and Gated Recurrent Unit (GRU) neural network models for flood forecasting. The data from 2013 to 2019 were collected from four gauging stations at Brandywine-Christina watershed, Pennsylvania. Our results show that the deep learning models are more accurate than the physical and statistical models. These results can help to provide and implement flood detection systems that would be able to predict floods at rescue time and reduce financial, human, and infrastructural damage.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "d6a15078f21fd5ee1bfbebd892aae222",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "neural network",
      "long short-term memory",
      "LSTM"
    ],
    "stage1_timestamp": "2025-05-15T02:13:31.759058"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是基于物联网和机器学习的洪水早期检测系统，其应用场景是自然灾害预测和减灾，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是基于物联网和机器学习的洪水早期检测系统，其应用场景是自然灾害预测和减灾，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:43:21.175360"
}