{
  "paper": {
    "id": 1607,
    "title": "Prediction Model of International Trade Risk Based on Stochastic Time-Series Neural Network",
    "abstract": "With the extreme deterioration of domestic and foreign trade environment, international competition is becoming increasingly fierce. At the same time, many enterprises have loopholes in industrial structure and finance, resulting in many risks in their international trade. Therefore, we must take corresponding measures to effectively manage and avoid risks and realize the healthy and sustainable development of foreign trade enterprises and enterprise economy. This paper designs and proposes a risk prediction model combining ARIMA and BP neural network. The model can get good prediction in different time series and effectively avoid the risk. The model proposed in this paper optimizes the structure of the design model with the support of ARIMA algorithm and BP neural network algorithm and has good accuracy and error control for different time series. The purpose of establishing time series prediction model is to improve the prediction accuracy of the model, and it is also an effective way to enhance the practicability of the prediction model. Applying intersequence analysis method to financial risk prediction can greatly improve efficiency and save cost and has broad application prospects.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "233b4c823af196410fc63582cafb59d3",
    "relevant_keywords": [
      "neural network",
      "deep learning",
      "backpropagation",
      "BP",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T02:05:08.278317"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文提出了一种结合ARIMA和BP神经网络的风险预测模型，旨在管理和避免国际贸易中的风险，这属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文提出了一种结合ARIMA和BP神经网络的风险预测模型，旨在管理和避免国际贸易中的风险，这属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:47:55.151202"
}