{
  "paper": {
    "id": 3983,
    "title": "Dynamic risk spillovers from oil to stock markets: Fresh evidence from GARCH copula quantile regression-based CoVaR model",
    "abstract": "This study proposes a GARCH copula quantile regression model to capture the downside and upside tail dependence between oil price change and stock market returns at different risk levels. In the model, ten copulas are provided to measure the nonlinearity of the tail dependence with the marginal distribution built on the GARCH family models. Using daily price data of stock markets in ten important countries and Brent oil market, we estimate the downward and upward risk spillovers from oil to stock markets. The empirical results suggest strong evidence of risk spillover effects from oil to stock markets. Furthermore, downside and upside risk spillovers from oil to the Italian and German stock markets, and the Brazilian and Russian stock markets are the largest for developed countries and emerging market countries, respectively. The US and Mexican stock markets display the smallest downside and upside risk spillovers for two types of countries. We also find evidence that the downside risk spillovers are larger than upside risk spillovers, a finding which is consistent with the flight-to-quality phenomenon. Finally, the dynamic risk spillover effects show heterogeneity over time and are compar-atively different for each country. Our results provide significant implications for portfolio managers and in-ternational regulators who want to optimize their investment portfolios and maintain stock market stability.",
    "year": 2022,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "bd1864ce801e71d86dc4d488ff9fd718",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:22:39.425529"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk",
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是GARCH copula quantile回归模型，用于捕捉油价变化与股票市场回报之间的尾部依赖关系，并估计风险溢出效应。这直接应用于金融风险管理领域，特别是市场风险的测量和管理。此外，论文提到研究结果对投资组合管理者优化投资组合有重要意义，因此也涉及投资组合管理领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\", \"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是GARCH copula quantile回归模型，用于捕捉油价变化与股票市场回报之间的尾部依赖关系，并估计风险溢出效应。这直接应用于金融风险管理领域，特别是市场风险的测量和管理。此外，论文提到研究结果对投资组合管理者优化投资组合有重要意义，因此也涉及投资组合管理领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:08:23.455343"
}