{
  "paper": {
    "id": 9,
    "title": "Application of Machine Learning in Enterprise Financial Risk Assessment: A Study About China's A-Share Listed Manufacturing Companies",
    "abstract": "Based on the financial data of domestic A-share listed firms from 2000 to 2022, this paper aims to explore the effectiveness of machine learning in identifying the financial risk of Chinese A-share listed manufacturing firms. To this end, a variety of machine learning models, including logistic regression, decision tree, random forest, XGBoost, SVM, and LSTM, are used to assess the financial risk of enterprises, and the key attributes of enterprise financial risk are extracted through the interpretability exploration and importance coefficient measurement. From this paper, the following conclusions are drawn: (i) XGBoost model performs the best on all attributes, showing its strong ability in dealing with complex financial datasets, and LSTM, which adds time-series factors, performs poorly, which is speculated that it may be related to the incompatibility of the characteristics of the financial data, the reliance on the time-series features, and the need for financial fine features. (ii) Audit opinion, Net Profit and ROA are key influencing factors.",
    "year": 2025,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "1e561e4c762012c487fe1757d1978085",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "regression",
      "support vector machine",
      "SVM",
      "decision tree",
      "neural network",
      "deep learning",
      "long short-term memory",
      "LSTM"
    ],
    "stage1_timestamp": "2025-05-15T01:45:16.456234"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心研究内容是使用机器学习模型评估企业财务风险，特别是针对中国A股上市制造企业的财务风险识别，这直接属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"该论文的核心研究内容是使用机器学习模型评估企业财务风险，特别是针对中国A股上市制造企业的财务风险识别，这直接属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:01:35.988450"
}