{
  "paper": {
    "id": 5468,
    "title": "Unveiling the Hidden Burden: Exploring the Psychological Impact of Gynecological Cancers and Predictive Modeling of Depression in Southwest China",
    "abstract": "Objective. To explore the psychological impact of gynecological cancers on middle-aged women in Southwest China and identify the risk factors for moderate to severe depressive symptoms. Methods. This cross-sectional study included 500 patients from Southwest China, divided into two groups: depression (n = 220) and no depression (n = 280). Data on demographics, clinical characteristics, and socioeconomic factors were collected. We developed a logistic regression model to predict depressive symptoms and assessed its accuracy using the area under the receiver operating characteristic curve (AUC). Results. The study cohort consisted of 500 middle-aged and young female cancer patients with a median age of 44 years. Significant predictors of depressive symptoms included younger age, higher economic stress levels, and out-of-pocket medical expenses. A comparative analysis showed that 220 patients exhibited depression symptoms, with these patients being generally younger (median age 41 years) compared to those without depression (median age 47 years, p<0.001). Economic stress was consistently higher in the depression group across all cancer types. Patients with ovarian cancer had a reduced risk of depression compared to those with cervical cancer. The predictive model demonstrated high accuracy in identifying depression risk, with an AUC of 0.888. Internal validation yielded an average AUC of 0.885, and external validation produced an AUC of 0.872, underscoring the model's robustness and reliability. These findings emphasize the complex interplay of demographic, socioeconomic, and clinical factors in the psychological well-being of gynecological cancer patients, highlighting the need for tailored psychological and financial support interventions. Conclusion. Gynecological cancer patients in Southwest China experience significant psychological challenges, particularly younger women and those facing economic stress. Our predictive model can aid in early identification of those at risk for depression, emphasizing the importance of holistic care. Interventions should focus on both psychological and financial support to improve patient outcomes.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "00ac6d933d0f68b3950eb67dc519a9db",
    "relevant_keywords": [
      "classification",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:48:23.562780"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是妇科癌症患者的心理影响和抑郁症状的预测模型，其核心技术和研究成果应用于医疗健康领域，与金融研究领域无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是妇科癌症患者的心理影响和抑郁症状的预测模型，其核心技术和研究成果应用于医疗健康领域，与金融研究领域无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:30:04.253826"
}