{
  "paper": {
    "id": 2163,
    "title": "What Bayesian quantiles can tell about volatility transmission between the major agricultural futures?",
    "abstract": "This paper investigates an idiosyncratic volatility spillover effect between the four agricultural futures - corn, wheat, soybean, and rise. In order to avoid biased measurements of the volatilities, we use the Markov switching generalized autoregressive conditional heteroskedasticity (MS-GARCH) model. The created volatilities are imbedded in the Bayesian quantile regression framework which can produce accurate quantile estimates. We report that soybean and wheat receive relatively high levels of volatility shocks from the other markets, and that excludes soybean and wheat as primary investment assets in a portfolio. On the other hand, rice receives the lowest amount of volatility shocks from all other agricultural futures. The reason could be the policy of rice price stability that is conducted by countries in the Asia and Pacific region. This result favours rice futures, from the four commodities, as the primary asset in a portfolio. All other futures are suitable to be an auxiliary asset in a portfolio with rice, because rice receives the weakest volatility shocks spillover effect from the other three markets.",
    "year": 2020,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "bcea3d8c77cc78edd950fba0cac3e693",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:03:36.679394"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文研究了农业期货之间的波动性溢出效应，并基于这些效应提出了投资组合构建的建议，明确指出某些期货适合作为主要或辅助资产。这直接关联到投资组合管理的核心问题，即资产选择和风险分散。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文研究了农业期货之间的波动性溢出效应，并基于这些效应提出了投资组合构建的建议，明确指出某些期货适合作为主要或辅助资产。这直接关联到投资组合管理的核心问题，即资产选择和风险分散。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:16:46.647887"
}