{
  "paper": {
    "id": 2908,
    "title": "A hybrid volatility forecasting framework integrating GARCH, artificial neural network, technical analysis and principal components analysis",
    "abstract": "Measurement, prediction, and modeling of currency price volatility constitutes an important area of research at both the national and corporate level. Countries attempt to understand currency volatility to set national economic policies and firms to best manage exchange rate risk and leverage assets. A relatively new technological invention that the corporate treasurer has to turn to as part of the overall financial strategy is cryptocurrency. One estimate values the total market capitalization of cryptocurrencies at $557 billion USD at the beginning of 2018. While the overall size of the market for cryptocurrency is significant, our understanding of the behavior of this instrument is only beginning. In this article, we propose a hybrid Artificial Neural Network-Generalized AutoRegressive Conditional Heteroskedasticity (ANN-GARCH) model with preprocessing to forecast the price volatility of bitcoin, the most traded and largest by market capitalization of the cryptocurrencies. (C) 2018 Elsevier Ltd. All rights reserved.",
    "year": 2018,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "030c1faf0edf2198f8740f34475c15f2",
    "relevant_keywords": [
      "machine learning",
      "neural network",
      "deep learning",
      "principal components analysis"
    ],
    "stage1_timestamp": "2025-05-15T02:20:16.989704"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用混合ANN-GARCH模型预测比特币的价格波动性，这直接关联到金融风险管理中的汇率风险和市场波动性管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是使用混合ANN-GARCH模型预测比特币的价格波动性，这直接关联到金融风险管理中的汇率风险和市场波动性管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:39:20.564203"
}