{
  "paper": {
    "id": 2865,
    "title": "A Cluster Analysis on the Default Determinants in the European Banking Sector",
    "abstract": "The aim of this paper is to identify the relationship between banks' probability of default and their risk taking incentives. Exploring a large set of bank level financial data from 203 European banks during 2005-2013 we apply the cluster analysis. The results indicate a number of two very different groups inside the dataset within each year, either using the hierarchical trees or the k-means clustering algorithms. Also, the composition of the clusters remains unchanged during crisis years compared with the pre-crisis for the vast majority of the instances. Finally, when mapping the clusters to the distance to default computed through the z-score variable, we show that banks with large size and high liquidity risk enhance their default risk.",
    "year": 2015,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "aa418f7216c84b8f5a76f0849b7414ad",
    "relevant_keywords": [
      "unsupervised learning",
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T02:20:16.795653"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on identifying the relationship between banks' probability of default and their risk-taking incentives using cluster analysis. This directly pertains to assessing and managing default risk, which is a key aspect of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on identifying the relationship between banks' probability of default and their risk-taking incentives using cluster analysis. This directly pertains to assessing and managing default risk, which is a key aspect of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:39:44.194707"
}