{
  "paper": {
    "id": 180,
    "title": "A Comprehensive Analysis of Hypertension Disease Risk-Factors, Diagnostics, and Detections Using Deep Learning-Based Approaches",
    "abstract": "High blood pressure, often known as hypertension, is a common and possibly fatal disorder that affects a large section of the world's population. For complications to be avoided and the risk of cardiovascular diseases to be decreased, early detection and control of hypertension are essential. By examining numerous physiological and clinical data, deep learning models have shown the potential in assisting in the identification of hypertension. The aim of the paper is to explore the application of deep learning-based approaches to building an automated system for hypertension detection. A diverse dataset comprising blood pressure measurements, demographic information, medical history, and lifestyle factors is utilized. Different deep learning models, including Gated Recurrent Unit, Embedded GRU, Bidirectional GRU, Long Short-Term Memory, and their different versions are employed to build predictive models for hypertension detection along with stroke and heart-disease prediction. Pre-processing is done on the applied dataset, which has many different features for predicting hypertension, dealing with missing values, normalizing features, and dealing with class imbalance. Techniques for feature selection are used to determine which variables are most useful for predicting hypertension. The outcomes show that hypertension can be accurately detected using models that have been implemented. The best performance is shown by bidirectional GRU, which detects hypertension with an accuracy of 99.68% and an F1-score, precision, and recall of 0.99. While Embedded GRU produced the greatest results, such as 98.10% to predict heart disease, Bidirectional LSTM also yields the finest outcomes for stroke prediction with an accuracy of 98.85%. The used models perform better than conventional diagnostic methods and display encouraging outcomes. By integrating these models into healthcare systems, it may be likely to classify people at high risk for developing hypertension early and to support prompt therapies, which will improve patient outcomes and lower the financial burden on the healthcare system.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "deep learning",
    "cache_key": "b972d31361e9318f3575835090c336ff",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "classification",
      "neural network",
      "long short-term memory",
      "LSTM",
      "recurrent neural network"
    ],
    "stage1_timestamp": "2025-05-15T01:35:04.401186"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究使用深度学习模型进行高血压疾病的检测和预测，属于医疗健康领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究使用深度学习模型进行高血压疾病的检测和预测，属于医疗健康领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:04:05.382837"
}