{
  "paper": {
    "id": 2223,
    "title": "Study on investments of resources from Defined Benefit Plans",
    "abstract": "The objective of this study was verifying the risk propensity in the investment of Defined Benefit (BD) plans by comparing the legal classification of the sponsor. For this, 134 BD plans and their respective sponsors were analyzed from 2013 to 2019, using a multinomial logistic regression model, using the statistical programs R, RStudio and StataBE version 17. Resource allocation (dependent variable) was debt in 7 decision categories (D1 to D7), according to the composition of the plans' portfolios, and the plans were divided into two groups: G0 plans in which the sponsor is not a publicly traded company; and G1 plans in which the sponsor is a publicly traded company. After analyzing the results, it was possible to verify that there are differences in the decision category choices between the G0 and G1 groups. The G1 group tends to have a slightly more aggressive allocation strategy than G0, but the plans of both groups mostly opt for portfolio diversification, especially in the D4 and D5 compositions. Despite these results, there is no statistical evidence to accept the hypothesis that the plans in which the sponsor is a publicly traded company adopt investment strategies with a greater propensity to risk.",
    "year": 2024,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "62b434a7b10d7ebe5e3a94f99b6588fe",
    "relevant_keywords": [
      "classification",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:04:27.471845"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文研究了Defined Benefit Plans的资源投资策略，特别是投资组合的多样化选择，这直接涉及投资组合管理的核心内容。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文研究了Defined Benefit Plans的资源投资策略，特别是投资组合的多样化选择，这直接涉及投资组合管理的核心内容。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:16:40.955595"
}