{
  "paper": {
    "id": 239,
    "title": "The exploration of internet finance by using neural network",
    "abstract": "In order to find out the risks of Internet finance as much as possible, and to ensure the rapid and healthy development of Internet finance, random forest (RF), a common classification algorithm in machine learning, was applied to analyze the risk factors of Internet finance. Additionally, the results of traditional statistical methods were compared with those of RF and back propagation (BP) neural network methods and their performance was evaluated. Finally, some suggestions were given for these risk factors, especially for the problems with high risk. The results showed that the RF algorithm model had the best classification effect and could accurately analyze the risks of Internet finance in terms of market, law, credit, personal information, and professional knowledge. It was found that credit and personal information risk were the most important factors in the future development of Internet finance when BP neural network was used to evaluate these risks. To a certain extent, they would also hinder the use and development of Internet finance. At the same time, it proved that BP neural network had a good prediction effect. To sum up, using the RF algorithm and BP neural network method in machine learning to explore the problems of Internet finance is of great significance for risk prediction for other financial institutions. (C) 2019 Elsevier B.V. All rights reserved.",
    "year": 2020,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "7e5c757a33ca41dd0496e949e5c65ae5",
    "relevant_keywords": [
      "machine learning",
      "classification",
      "neural network",
      "deep learning",
      "backpropagation",
      "BP"
    ],
    "stage1_timestamp": "2025-05-15T01:48:30.748667"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要探讨了使用随机森林和BP神经网络来分析互联网金融的风险因素，包括市场、法律、信用、个人信息等风险，并提出了风险预测的建议。这些内容明确指向金融风险管理的领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文主要探讨了使用随机森林和BP神经网络来分析互联网金融的风险因素，包括市场、法律、信用、个人信息等风险，并提出了风险预测的建议。这些内容明确指向金融风险管理的领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:59:52.865290"
}