{
  "paper": {
    "id": 377,
    "title": "Integrating multi-stage stochastic programming and machine learning for the evaluation of policies in the electricity portfolio problem",
    "abstract": "Multi-stage stochastic programming can support large consumers in developing electricity portfolios that balance the expected total cost and the risk level. Nevertheless, the adoption of multi-stage stochastic programming in real-world problems is often made difficult by the high computational burden required. In this paper, we present an innovative approach, called General Policy Function Approximation, that provides good solutions to the electricity portfolio problem in a limited computational time, owing to the integration of multi-stage stochastic programming and machine learning. Our approach improves the Policy Function Approximation (PFA) approach proposed by Defourny et al. [(2012). Multi-stage stochastic programming: A scenario tree-based approach to planning under uncertainty. Decision Theory Models for Applications in Artificial Intelligence (L. E. Sucar, E. Morales, F. Eduardo & J. Hoey eds). vol. 6. Hershey: IGI Global, pp. 97-144], by developing a single policy function generated from a larger amount of data. Owing to a realistic computational campaign, we show that our approach outperforms PFA both in terms of quality of the policy obtained, and in terms of time required.",
    "year": 2017,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "2927b9e35e36460ed6b8c0d44ef4a64c",
    "relevant_keywords": [
      "machine learning"
    ],
    "stage1_timestamp": "2025-05-15T00:42:32.580178"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是结合多阶段随机规划和机器学习来解决电力组合问题，旨在平衡预期总成本和风险水平。这属于投资组合管理的范畴，因为它涉及资产（电力）的组合优化和风险管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是结合多阶段随机规划和机器学习来解决电力组合问题，旨在平衡预期总成本和风险水平。这属于投资组合管理的范畴，因为它涉及资产（电力）的组合优化和风险管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:31:16.008923"
}