{
  "paper": {
    "id": 719,
    "title": "Two-Stage Classification Method for Individual Workout Status Prediction with Machine Learning Approach",
    "abstract": "The default risk, one of the main risk factors for bonds, should be measured and reflected in the bond yield. Particularly, in the case of financial companies that treat bonds as a major product, failure to properly identify and filter customers' workout status adversely affects returns. This study proposes a two-stage classification algorithm for workout prediction based on the history data of individual customers such as transaction details of financial companies secured after loans, which is collected over 10 years. The first stage is to rank variables that are closely related to the workout application based on feature selection. In the second step, the first to nth cumulative variables input to each machine learning method generate n candidate classifiers, respectively. Among the total candidates, the model with the highest classification accuracy was selected as the optimal one, which is the Gradient Boost combined with F-score-based feature selection.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "bf9736bc784a69c154455d5800c33a4b",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "feature learning",
      "feature representation"
    ],
    "stage1_timestamp": "2025-05-15T01:54:33.992266"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on predicting workout status to mitigate default risk in bond investments, which is a key aspect of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on predicting workout status to mitigate default risk in bond investments, which is a key aspect of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:55:27.969602"
}