{
  "paper": {
    "id": 2355,
    "title": "A Dynamic Analysis of Stock Markets through Multivariate Latent Markov Models",
    "abstract": "A correct classification of financial products represents the essential and required step for achieving optimal investment decisions. The first goal in portfolio analysis should be the allocation of each asset into a class which groups investment opportunities characterized by a homogenous risk-return profile. Furthermore, the second goal should be the assessment of the stability of the classes composition. In this paper we address both objectives by means of the latent Markov models, which allow us to investigate the dynamic pattern of financial time series through an innovative framework. First, we propose to exploit the potential of latent Markov models in order to achieve latent classes able to group stocks with a similar risk return profiles. Second, we interpret the transition probabilities estimated within latent Markov models as the probabilities of switching between the well-known states of financial markets: the upward trend, the downward trend and the lateral phases. Our results allow us both to discriminate the stock's performance following a powerful classification approach and to assess the stock's dynamics by predicting which state is going to experience next.",
    "year": 2011,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "688d8536c95cb5e167173e49a45afea4",
    "relevant_keywords": [
      "classification",
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T02:14:19.677728"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文主要讨论了利用潜在马尔可夫模型对股票进行分类和动态分析，以优化投资决策和评估资产类别的稳定性，这直接关联到投资组合管理的核心问题。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文主要讨论了利用潜在马尔可夫模型对股票进行分类和动态分析，以优化投资决策和评估资产类别的稳定性，这直接关联到投资组合管理的核心问题。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:42:55.802095"
}