{
  "paper": {
    "id": 2357,
    "title": "Do global geopolitical risks affect connectedness of global stock market contagion network? Evidence from quantile-on-quantile regression",
    "abstract": "Based on the Vector Autoregressive Model (VAR), this paper constructs a contagion complex network of global stock market returns, and uses the Quantile-on-Quantile Regression (QQR) to explore the impact of global geopolitical risks on the connectedness of global stock markets. By applying the risk contagion analysis framework, we depict risk contagion and correlation between financial markets in different countries. We also identify the risk contagion characteristics of international financial markets. This paper innovatively introduces the quantile-on-quantile regression method to the study of geopolitical risk. Through the quantile-on-quantile approach, we find that there is an asymmetric relationship between geopolitical risk and the global stock market correlation network. Our conclusions provide some suggestions for policy makers and relevant investors on how to deal with the current high global geopolitical risks. They also provide ideas on how to effectively hedge such risks during asset allocation and policy formulation.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "edd7485afb9f90e09586e8314f3e5944",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:14:19.679757"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk",
      "Portfolio Management"
    ],
    "justification": "该论文研究了全球地缘政治风险对股票市场传染网络的影响，并提供了风险对冲的建议，这直接涉及金融风险管理。同时，论文还讨论了资产配置中的风险对冲策略，这与投资组合管理相关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\", \"投资组合管理\"],\n  \"justification\": \"该论文研究了全球地缘政治风险对股票市场传染网络的影响，并提供了风险对冲的建议，这直接涉及金融风险管理。同时，论文还讨论了资产配置中的风险对冲策略，这与投资组合管理相关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:42:55.727890"
}