{
  "paper": {
    "id": 1420,
    "title": "Towards firm-specific technology opportunities: A rule-based machine learning approach to technology portfolio analysis",
    "abstract": "Despite the substantial contributions of many studies on firm-specific technology opportunity analysis (TOA), there is a lack of understanding of the technology portfolios of organizations and actors of technology innovation activities. The study proposes a new firm-specific TOA approach using graph representation, rule-based machine learning, and index analysis. First, organizations' technology portfolios are characterized by multiple graphs consisting of technological components based on their own patent information. Second, given an organization of interest for a TOA, its core technology, which is represented as links between technological components, is defined and significant association rules are identified through our rule-based machine learning pipeline. Third, new-to-firm technology opportunities are identified from a set of association rules and evaluated using quantitative metrics. Finally, we examine the evaluation metrics on which each organization focuses by tracking the patenting activities of the organizations after the analysis period. Consequently, we can enhance the understanding of organizational technology portfolios and provide firm-specific technology opportunities. Our empirical results for multiple organizations showed that the proposed approach is effective and valuable as a decision-supporting tool for TOA in practice.",
    "year": 2023,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "7b126bb9eb8f9b2ae049e95229c70d55",
    "relevant_keywords": [
      "machine learning",
      "rule-based machine learning",
      "feature representation",
      "representation learning"
    ],
    "stage1_timestamp": "2025-05-15T00:55:28.520095"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究企业特定的技术机会分析（TOA），涉及技术组合分析和机器学习方法，但并未提及或应用于衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究企业特定的技术机会分析（TOA），涉及技术组合分析和机器学习方法，但并未提及或应用于衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:21:08.437968"
}