{
  "paper": {
    "id": 1243,
    "title": "A NEURAL NETWORK MODEL FOR CREDIT RISK EVALUATION",
    "abstract": "Credit scoring is one of the key analytical techniques in credit risk evaluation which has been an active research area in financial risk management. This paper presents a credit risk evaluation system that uses a neural network model based on the back propagation learning algorithm. We train and implement the neural network to decide whether to approve or reject a credit application, using seven learning schemes and real world credit applications from the Australian credit approval datasets. A comparison of the system performance under the different learning schemes is provided, furthermore, we compare the performance of two neural networks, with one and two hidden layers following the ideal learning scheme. Experimental results suggest that neural networks can be effectively used in automatic processing of credit applications.",
    "year": 2009,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "68be6aff2340e7f329a0a6ab1bfcfdd8",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "neural network",
      "backpropagation",
      "BP",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T02:00:30.583702"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on using a neural network model for credit risk evaluation, which is a key aspect of financial risk management, specifically in assessing the risk of credit applications.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on using a neural network model for credit risk evaluation, which is a key aspect of financial risk management, specifically in assessing the risk of credit applications.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:50:53.215922"
}