{
  "paper": {
    "id": 11,
    "title": "New Paradigm for Economic and Financial Research With Generative AI: Impact and Perspective",
    "abstract": "In the past few years, we have witnessed the rapid development and exponential growth of generative artificial intelligence (GAI) technologies including large language models (LLMs)-enabled ChatGPT and peripheral innovations. These technologies are designed to be humanlike intelligence and intuitive by providing direct access to systems using application programming interfaces (APIs). The GAI applications can fundamentally change economic and financial activities, through revolutionizing the ways that humans interact with machines and giving rise to new modes of production and behavior patterns. It is imperative to develop a new research paradigm that is more suitable than the currently dominating conventional research paradigms. This article presents the new paradigm for economic and financial research with GAI, covering the research objectives, scientific data, and models, and explores the underlying impact and perspective that bring to this field. We elaborate on the potential five scenarios including portfolio management, economic and financial prediction, extreme scenario analysis, policy analysis, and financial fraud detection. The new research paradigm with GAI proposed in this article can provide significant insights for a comprehensive understanding of innovation and transformation in this domain.",
    "year": 2024,
    "source": "WOS",
    "area": "portfolio",
    "method": "LLMs",
    "cache_key": "1df6f93b7af06db3f3b835a3e4c9001a",
    "relevant_keywords": [
      "Large Language Model",
      "LLM",
      "ChatGPT",
      "GPT-4",
      "LLaMA"
    ],
    "stage1_timestamp": "2025-05-15T00:38:16.173291"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文明确提到了投资组合管理作为生成式人工智能在金融研究中的潜在应用场景之一，但并未提及衍生品定价或金融风险管理的具体应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文明确提到了投资组合管理作为生成式人工智能在金融研究中的潜在应用场景之一，但并未提及衍生品定价或金融风险管理的具体应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:34:30.854973"
}