{
  "paper": {
    "id": 5231,
    "title": "Implement Credit Card Fraudulent Detection System Using Observation Probabilistic In Hidden Markov Model",
    "abstract": "The internet becomes most popular mode of payment for online transaction. Banking system provides e-cash, e-commerce and e-services by using online transaction. Credit card is one of the best ways for online transaction. In case of risk of fraud transaction using credit card has also been increasing. Credit card fraud detection is one of the ethical issues in the credit card companies, mortgage companies, banks and financial institutes. Many technics for credit card fraudulent detection but hidden markov model (HMM) is one of the best engineering practices tool for credit card fraud system. Hidden markov model generate, observation symbols for online transaction. Observation probabilistic in an HMM based system is initially studies spending profile of the cardholder and checking an incoming transaction, against spending behavior of the cardholder. we can show clustering model is used to classify the legal and fraudulent transaction using data conglomeration of regions of parameter, we has shown the Hidden Markov Model for fraud detection in Credit card Applications. We presented experimental result to show the effectiveness of our approach.",
    "year": 2012,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "461d30e2a2e9e7deb74ab84f75be3aff",
    "relevant_keywords": [
      "machine learning",
      "unsupervised learning",
      "classification",
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T02:45:47.379456"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用隐马尔可夫模型（HMM）进行信用卡欺诈检测，这属于金融风险管理中的操作风险控制范畴。论文明确讨论了如何通过分析持卡人的消费行为来识别欺诈交易，这是风险管理的重要应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是使用隐马尔可夫模型（HMM）进行信用卡欺诈检测，这属于金融风险管理中的操作风险控制范畴。论文明确讨论了如何通过分析持卡人的消费行为来识别欺诈交易，这是风险管理的重要应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:31:06.827885"
}