{
  "paper": {
    "id": 2279,
    "title": "Three-stage research framework to assess and predict the financial risk of SMEs based on hybrid method",
    "abstract": "Enterprise financial risk research mostly focuses on prediction precision, but neglects the assessment, which is unfavorable. Since assessment is an important and necessary step before prediction, its accuracy could affect the effectiveness of prediction. Therefore, we designed a new three-stage decision support research framework to discuss enterprise financial risk assessment and prediction. First, considering various factors affecting enterprise financial risk, we devised an indicator screening method based on financial risk identification ability to establish the indicator system. Second, the combined weighting method is introduced to assess financial risk. Then game theory is applied to find the optimal allocation coefficient for single methods to improve the accuracy of assessment. Third, owing to highly nonlinear risk factors, the single algorithm could not get satisfactory results; the light gradient boosting machine (LightGBM) ensemble model is applied to conduct real-value prediction rather than classification. Meanwhile, OPTUNA optimization is introduced for improving LightGBM to establish OPT-LightGBM ensemble model. The empirical results based on small and medium-sized enterprises (SMEs) in China show that our method can assess enterprise financial risk more accurately than the common method based on whether the enterprise stock is marked as special treatment (ST). Further, compared with the existing prediction models, OPT-LightGBM can improve the efficiency without losing the prediction performance, and has the best overall performance.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "bff6f5f983ac2527a9b6e1e1382b4dd7",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "regression",
      "feature learning",
      "feature representation"
    ],
    "stage1_timestamp": "2025-05-15T02:13:31.778413"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是设计了一个三阶段的研究框架，用于评估和预测中小企业的财务风险。这直接涉及到金融风险管理领域，特别是企业财务风险的识别、评估和预测。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"该论文的核心技术是设计了一个三阶段的研究框架，用于评估和预测中小企业的财务风险。这直接涉及到金融风险管理领域，特别是企业财务风险的识别、评估和预测。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:43:20.688126"
}