{
  "paper": {
    "id": 4878,
    "title": "Citibank models credit risk on hybrid mortgage loans in Taiwan",
    "abstract": "A new type of hybrid loan in Taiwan consists of a traditional residential mortgage with an attached line of credit. Motivated by declines in Taiwanese property values and unexpected credit losses on all types of loans secured by residential real estate, we developed new statistical models for analyzing the credit risk on traditional mortgages, the hybrid loans, and pure equity lines of credit. Nonstationary Markovian models represent probabilities of transition among different financial states for the three credit instruments. We used logistic and regression models to estimate the losses on defaulted loans and the utilization of credit lines. We calibrated the models with account-level data and integrated them into comprehensive forecasting models that revealed differences in risk profiles among the three types of credit and among different segments of each portfolio.",
    "year": 2005,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "5644457fa8344c2a6484cf0a041a50c2",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:42:04.847980"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on developing statistical models to analyze credit risk for different types of loans, including traditional mortgages and hybrid loans, which is a core aspect of financial risk management. The use of nonstationary Markovian models and logistic regression to estimate losses and credit line utilization further supports its application in risk assessment and management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on developing statistical models to analyze credit risk for different types of loans, including traditional mortgages and hybrid loans, which is a core aspect of financial risk management. The use of nonstationary Markovian models and logistic regression to estimate losses and credit line utilization further supports its application in risk assessment and management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:31:55.332778"
}