{
  "paper": {
    "id": 4855,
    "title": "Inference for Extremal Conditional Quantile Models, with an Application to Market and Birthweight Risks",
    "abstract": "Quantile regression (QR) is an increasingly important empirical tool in economics and other sciences for analysing the impact a set of regressors has on the conditional distribution of an outcome. Extremal QR, or QR applied to the tails, is of interest in many economic and financial applications, such as conditional value at risk, production efficiency, and adjustment bands in (S,s) models. This paper provides feasible inference tools for extremal conditional quantile models that rely on extreme value approximations to the distribution of self-normalized QR statistics. The methods are simple to implement and can be of independent interest even in the univariate (non-regression) case. We illustrate the results with two empirical examples analysing extreme fluctuations of a stock return and extremely low percentiles of live infant birthweight in the range between 250 and 1500 g.",
    "year": 2011,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "77e12a62a491e437295285a005cfc7ad",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:41:32.844080"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper discusses extremal quantile regression applied to the tails, which is relevant for conditional value at risk, a key concept in financial risk management. The empirical example analyzing extreme fluctuations of a stock return further supports its application in this domain.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper discusses extremal quantile regression applied to the tails, which is relevant for conditional value at risk, a key concept in financial risk management. The empirical example analyzing extreme fluctuations of a stock return further supports its application in this domain.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:31:55.521584"
}