{
  "paper": {
    "id": 7791,
    "title": "Out-of-pocket expenditures associated with double disease burden in Pakistan: a quantile regression analysis",
    "abstract": "BackgroundPakistan is currently experiencing a double burden of disease. Families with members having both communicable and noncommunicable diseases are at a greater risk of impoverishment due to enormous out-of-pocket payments. This study examines the percentile distribution of the determinants of the out-of-pocket expenditure on the double disease burden.MethodThe study extracted a sample of 6,775 households with at least one member experiencing both communicable and noncommunicable diseases from the Household Integrated Economic Survey 2018-19. The dataset is cross-sectional and nationally representative. Quantile regression was used to analyze the association of various socioeconomic factors with the OOP expenditure associated with double disease burden.ResultsOverall, 28.5% of households had double disease in 2018-19. The households with uneducated heads, male heads, outpatient healthcare, patients availing public sector healthcare services, and rural and older members showed a significant association with the prevalence of double disease. The out-of-pocket expenditure was higher for depression, liver and kidney disease, hepatitis, and pneumonia in the upper percentiles. The quantile regression results showed that an increased number of communicable and noncommunicable diseases was associated with higher monthly OOP expenditure in the lower percentiles (10th percentile, coefficient 312, 95% CI: 92-532), and OOP expenditure was less pronounced among the higher percentiles (75th percentile, coefficient 155, 95% CI: 30-270). The households with older members were associated with higher OOP expenditure at higher tails (50th and 75th percentiles) compared to lower (10th and 25th percentiles). Family size was associated with higher OOPE at lower percentiles than higher ones.ConclusionThe coexistence of communicable and noncommunicable diseases is associated with excessive private healthcare costs in Pakistan. The results call for addressing the variations in financial costs associated with double diseases.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "35f7448f8dbfbb5a4d0ab8b9520e5c82",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T03:12:11.634041"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究巴基斯坦家庭因双重疾病负担而产生的自付医疗支出，使用了分位数回归分析社会经济因素与支出的关系。研究内容属于公共卫生和健康经济学领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究巴基斯坦家庭因双重疾病负担而产生的自付医疗支出，使用了分位数回归分析社会经济因素与支出的关系。研究内容属于公共卫生和健康经济学领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:25:55.700856"
}