{
  "paper": {
    "id": 1857,
    "title": "Predicting Movies User Ratings with Imdb Attributes",
    "abstract": "In the era of Web 2.0, consumers share their ratings or comments easily with other people after watching a movie. User rating simplified the procedure which consumers express their opinions about a product, and is a great indicator to predict the box office [1-4]. This study develops user rating prediction models which used classification technique (linear combination, multiple linear regression, neural networks) to develop. Total research dataset included 32968 movies, 31506 movies were training data, and others were testing data. Three of research findings are worth summarizing: first, the prediction absolute error of three models is below 0.82, it represents the user ratings are well-predicted by the models; second, the forecast of neural networks prediction model is more accurate than others; third, some predictors profoundly affect user rating, such as writers, actors and directors. Therefore, investors and movie production companies could invest an optimal portfolio to increase ROI.",
    "year": 2014,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "ab864326e9c515a7e59211fd20e0f37c",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "regression",
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T01:00:27.334832"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究使用机器学习模型预测电影用户评分，虽然提到投资者和电影制作公司可以优化投资组合以提高投资回报率，但这只是论文的一个潜在应用建议，并非论文的核心研究方向。论文的核心技术并未直接应用于衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究使用机器学习模型预测电影用户评分，虽然提到投资者和电影制作公司可以优化投资组合以提高投资回报率，但这只是论文的一个潜在应用建议，并非论文的核心研究方向。论文的核心技术并未直接应用于衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:18:40.234715"
}