{
  "paper": {
    "id": 3033,
    "title": "Investigating tail-risk dependence in the cryptocurrency markets: A LASSO quantile regression approach",
    "abstract": "We construct the complete network of tail risk spillovers among major cryptocurrencies using the Least Absolute Shrinkage and Selection Operator (LASSO) quantile regression. We capture important features of the network, including major risk-driving and major risk-receiving currencies, and the evolution of the tail dependence among the currencies over time. Importantly, we reveal a striking finding that the right tail dependence among the cryptocurrencies is significantly stronger than the left tail counterpart. This unique characteristic may have contributed to the rise in popularity of cryptocurrencies over the last few years. Our portfolio analysis reveals that diversification in cryptocurrency investment can be accomplished simply by employing the naive equal-weighted scheme even when transaction costs are taken into account.",
    "year": 2020,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "72c7cb77094904f6029ed42f221aa975",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:12:43.135792"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk",
      "Portfolio Management"
    ],
    "justification": "The paper focuses on analyzing tail risk spillovers among cryptocurrencies using LASSO quantile regression, which is directly related to financial risk management. Additionally, the paper discusses portfolio analysis and diversification strategies in cryptocurrency investment, which falls under portfolio management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\", \"Portfolio Management\"],\n  \"justification\": \"The paper focuses on analyzing tail risk spillovers among cryptocurrencies using LASSO quantile regression, which is directly related to financial risk management. Additionally, the paper discusses portfolio analysis and diversification strategies in cryptocurrency investment, which falls under portfolio management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:11:34.072910"
}