{
  "paper": {
    "id": 973,
    "title": "OPTIMIZING TRADING STRATEGIES IN QUANTITATIVE MARKETS USING MULTI-AGENT REINFORCEMENT LEARNING",
    "abstract": "Quantitative markets are characterized by swift dynamics and abundant uncertainties, making the pursuit of profit-driven stock trading actions inherently challenging. Within this context, Reinforcement Learning (RL) - which operates on a reward-centric mechanism for optimal control has surfaced as a potentially effective solution to the intricate financial decision-making conundrums presented. This paper delves into the fusion of two established financial trading strategies, namely the constant proportion portfolio insurance (CPPI) and the time-invariant portfolio protection (TIPP), with the multi-agent deep deterministic policy gradient (MADDPG) framework. As a result, we introduce two novel multi-agent RL (MARL) methods: CPPI-MADDPG and TIPP-MADDPG, tailored for probing strategic trading within quantitative markets. To validate these innovations, we implemented them on a diverse selection of 100 real-market shares. Our empirical findings reveal that the CPPI-MADDPG and TIPP-MADDPG strategies consistently outpace their traditional counterparts, affirming their efficacy in the realm of quantitative trading.",
    "year": 2024,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "9e34603408d18e4a53b5ba4dcdd50a2e",
    "relevant_keywords": [
      "machine learning",
      "reinforcement learning",
      "deep learning",
      "neural network",
      "representation learning"
    ],
    "stage1_timestamp": "2025-05-15T00:50:08.780226"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是将多智能体强化学习应用于定量市场中的交易策略优化，特别是结合了CPPI和TIPP这两种投资组合保护策略，旨在改进投资组合的表现。因此，其主要应用领域是投资组合管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是将多智能体强化学习应用于定量市场中的交易策略优化，特别是结合了CPPI和TIPP这两种投资组合保护策略，旨在改进投资组合的表现。因此，其主要应用领域是投资组合管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:25:47.735579"
}