{
  "paper": {
    "id": 2614,
    "title": "Effective Key Parameter Determination for an Automatic Approach to Land Cover Classification Based on Multispectral Remote Sensing Imagery",
    "abstract": "The classification of land cover based on satellite data is important for many areas of scientific research. Unfortunately, some traditional land cover classification methods (e. g. known as supervised classification) are very labor-intensive and subjective because of the required human involvement. Jiang et al. proposed a simple but robust method for land cover classification using a prior classification map and a current multispectral remote sensing image. This new method has proven to be a suitable classification method; however, its drawback is that it is a semi-automatic method because the key parameters cannot be selected automatically. In this study, we propose an approach in which the two key parameters are chosen automatically. The proposed method consists primarily of the following three interdependent parts: the selection procedure for the pure-pixel training-sample dataset, the method to determine the key parameters, and the optimal combination model. In this study, the proposed approach employs both overall accuracy and their Kappa Coefficients (KC), and Time-Consumings (TC, unit: second) in order to select the two key parameters automatically instead of using a test-decision, which avoids subjective bias. A case study of Weichang District of Hebei Province, China, using Landsat-5/TM data of 2010 with 30 m spatial resolution and prior classification map of 2005 recognised as relatively precise data, was conducted to test the performance of this method. The experimental results show that the methodology determining the key parameters uses the portfolio optimisation model and increases the degree of automation of Jiang et al.'s classification method, which may have a wide scope of scientific application.",
    "year": 2013,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "77c832a78ea3375f5ce955eb79abf448",
    "relevant_keywords": [
      "classification",
      "supervised learning"
    ],
    "stage1_timestamp": "2025-05-15T01:08:41.925641"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究基于多光谱遥感影像的土地覆盖分类方法，其核心技术涉及自动选择关键参数和优化模型，但并未提及任何与金融领域相关的应用或研究目标。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究基于多光谱遥感影像的土地覆盖分类方法，其核心技术涉及自动选择关键参数和优化模型，但并未提及任何与金融领域相关的应用或研究目标。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:13:41.489361"
}