{
  "paper": {
    "id": 2938,
    "title": "A mathematical programming approach to optimise insurance premium pricing within a data mining framework",
    "abstract": "In this paper we provide evidence of the benefits of an approach which combines data mining and mathematical programming to determining the premium to charge automobile insurance policy holders in order to arrive at an optimal portfolio. An non-linear integer programming formulation is proposed to determine optimal premiums based on the insurer's need to find a balance between profitability and market share. The non-linear integer programming approach to solving this problem is used within a data mining framework which consists of three components: classifying policy holders into homogenous risk groups and predicting the claim cost of each group using k-means clustering; determining the price sensitivity (propensity to pay) of each group using neural networks; and combining the results of the first two components to determine the optimal premium to charge. We have earlier presented the results of the first two components. In this paper we present the results of the third component. Using our approach, we have been able to increase revenue without affecting termination rates and market share.",
    "year": 2002,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "d097d6f4425485b34600192907cc2eef",
    "relevant_keywords": [
      "machine learning",
      "unsupervised learning",
      "classification",
      "clustering",
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T01:11:48.494765"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是保险保费定价的优化问题，虽然涉及金融领域，但其核心技术应用并不属于衍生品定价、金融风险管理或投资组合管理中的任何一个。论文的重点在于通过数据挖掘和数学编程优化保费定价策略，以提高收入而不影响市场占有率，这与上述三个金融研究领域的核心问题不直接相关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是保险保费定价的优化问题，虽然涉及金融领域，但其核心技术应用并不属于衍生品定价、金融风险管理或投资组合管理中的任何一个。论文的重点在于通过数据挖掘和数学编程优化保费定价策略，以提高收入而不影响市场占有率，这与上述三个金融研究领域的核心问题不直接相关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:12:01.857590"
}