{
  "paper": {
    "id": 8411,
    "title": "Brazilian airport economics from a geographical perspective",
    "abstract": "This paper discusses the revenue and expenditure functions of a sample of Brazil's airports administered by Infraero, the Brazilian State enterprise responsible for administering the country's major airports. It aims to identify what volume of movement at the airports associates with positive net earnings, i.e. the break-even point between revenue and expenditure, in view of aspects of airport movement and geographical factors. It examines airports serving regular airlines and with movement of up to 8 million passengers in 2010. Revenues and expenditures are explained by total passengers embarked and disembarked at each airport and by the potential of the airport's 'anchor city'. Multiple regression analysis achieved a high level of explanation for the dependent variables studied, i.e., revenues and expenditures. The model explains 81% and 91% of the variations in revenues and expenditures, respectively. The analysis shows that, considering the ranking of cities, Brazilian airports with less than 2 million passengers tend to operate at a financial loss, those with between 2 and 3 million passengers are at the transition stage between positive and negative earnings, while airports with more than 3 million passengers tend to make gains. However, the simulation modelling shows that the break-even point between expenditure and revenue functions can vary considerably when different 'city potentials' are considered. In this respect, the modelling offers investors a tool for analyzing passenger demand risk in the light of expectations for Brazilian cities' potential. (C) 2013 Elsevier Ltd. All rights reserved.",
    "year": 2014,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "81658bf9eeda4e6bc534b5afebce2b8f",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T03:18:19.701958"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究巴西机场的经济效益和收支平衡点，虽然使用了回归分析，但其核心应用领域是交通经济学和地理经济学，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究巴西机场的经济效益和收支平衡点，虽然使用了回归分析，但其核心应用领域是交通经济学和地理经济学，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:25:37.092132"
}