{
  "paper": {
    "id": 237,
    "title": "Behavioural perspectives in forex portfolio value analysis",
    "abstract": "This paper combines Cumulative Prospect Theory (CPT) and the Grey Clustering Algorithm (GCA) to guide the optimization of forex portfolio selection. The United States Dollar (USD) against a universe of 84 other currencies was used for portfolio value analysis using the Differential Evolution Algorithm. A total of six portfolios were constructed of which two were based on the CPT and the remaining on the GCA. The optimisation results of all constructed portfolios show that the GC-based portfolios outperformed the CPT-based portfolios. Specifically, GC Portfolio 4, comprising assets with higher CPT values in GC 1, emerged as the best-performing portfolio with a Sharpe ratio of 0.8497, significantly surpassing the highest Sharpe ratio among CPT-based portfolios (0.0206 for CPT Portfolio 2), further reinforcing the superiority of GCA in portfolio optimisation. The inclusion of the behavioural proxy in portfolio construction has a significant impact on adding value to investors' portfolios. Future research could explore refining asset selection by integrating machine learning techniques such as K-means clustering or reinforcement learning to enhance portfolio robustness.",
    "year": 2025,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "090e026211ef45e7cc679f61290ff706",
    "relevant_keywords": [
      "machine learning",
      "reinforcement learning",
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T00:40:34.226967"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是结合Cumulative Prospect Theory (CPT)和Grey Clustering Algorithm (GCA)来优化外汇投资组合的选择，并通过构建和比较不同投资组合的表现来验证方法的有效性。这直接属于投资组合管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是结合Cumulative Prospect Theory (CPT)和Grey Clustering Algorithm (GCA)来优化外汇投资组合的选择，并通过构建和比较不同投资组合的表现来验证方法的有效性。这直接属于投资组合管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:32:41.871867"
}