{
  "paper": {
    "id": 2703,
    "title": "Default probabilities in a corporate bank portfolio: A logistic model approach",
    "abstract": "Analysis and management of credit risk has taken on an increased importance in recent years. New regulations force banks and other financial institutions to make a credible effort to chart and manage the risk associated with their client portfolio. Increased competition in the financial market has also improved the motivation of monitoring the risk/reward relationship on various clients. Modern risk measures such as Credit Risk Capital (CRC) and Risk Adjusted Return On Capital (RAROC) are now well established among banks. One problem in such risk frameworks is to find the expected loss (EL) of the bank portfolio. The EL is based on assumptions regarding the estimated default frequency (EDF) for each client or group of clients. Benchmark models for CRC calculations treat EDFs as exogenous and do not devote much attention to how they can be obtained. This article presents a method of estimating such rates for a retail bank portfolio. The analysis is based on a logistic regression model where financial variables as well as other firm characteristics affect the default probability. (C) 2001 Elsevier Science B.V. All rights reserved.",
    "year": 2001,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "ca7c60b703c3e895a30fd9bb9028e5a8",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:18:06.269279"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on estimating default probabilities in a corporate bank portfolio using a logistic regression model, which is directly related to credit risk analysis and management, a key aspect of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on estimating default probabilities in a corporate bank portfolio using a logistic regression model, which is directly related to credit risk analysis and management, a key aspect of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:40:37.958790"
}