{
  "paper": {
    "id": 527,
    "title": "Classification of Credit Applicants Using SVM Variants Coupled with Filter-Based Feature Selection",
    "abstract": "For financial institutions and in particular banks, Credit risk management is one of the most crucial issues in financial decision making. Accurate credit scoring models are extremely important for financial agencies to classify a new applicant, in order to decide whether to approve or reject its credit application. This paper presents a credit scoring model based on SVM variants (C-SVM, v-SVM) combined with two filter feature selection methods, to enhance the preprocessing task and models performances. In this study, a public credit dataset namely Australian has been used to test our experiments. Experimental results indicate that our methods are efficient in credit risk analysis. They make the assessment faster and increase the accuracy of the classification.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "8995a85c9f99cccbb519d8d00faa89f3",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM",
      "feature learning"
    ],
    "stage1_timestamp": "2025-05-15T01:52:12.223637"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on developing a credit scoring model using SVM variants to classify credit applicants, which is a key aspect of credit risk management in financial institutions. This directly pertains to the domain of Financial Risk Management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on developing a credit scoring model using SVM variants to classify credit applicants, which is a key aspect of credit risk management in financial institutions. This directly pertains to the domain of Financial Risk Management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:57:06.427295"
}