{
  "paper": {
    "id": 1877,
    "title": "Predicting stock price movement using a DBN-RNN",
    "abstract": "This paper proposes a deep learning-based model to predict stock price movements. The proposed model is composed of a deep belief network (DBN) to learn the latent feature representation from stock prices, and a long short-term memory (LSTM) network to exploit long-range relations within the trading history. The prediction target of the model is the stock close price direction on the next day. To predict the trend of one stock, the feature of recent trading information is generated from the raw intra-day data through a pre-trained DBN. Then the extracted features are fed into an LSTM classifier to produce the prediction result for the next day. The proposed model was tested on 36 companies in the Shanghai Stock Exchange (SSE) and the Shenzhen Stock Exchange (SZSE), which were selected based on their weights in Chinese A-shares. The experiments cover a span of 12 years, from 2005 to 2016, and the results show that the proposed model offers notable improvements in predicting performance comparing with other learning models. It is also observed that some companies are more predictable than others, which implies that the proposed model can be used for financial portfolio construction.",
    "year": 2021,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "498504a2e84837c28ae4cf1daa924c3a",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "deep learning",
      "classification",
      "feature representation",
      "neural network",
      "representation learning",
      "hidden layer",
      "recurrent neural network",
      "long short-term memory",
      "LSTM",
      "deep belief network",
      "unsupervised pre-train"
    ],
    "stage1_timestamp": "2025-05-15T01:00:27.424815"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是使用深度学习模型预测股票价格走势，并明确指出该模型可以用于金融投资组合的构建，这属于投资组合管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是使用深度学习模型预测股票价格走势，并明确指出该模型可以用于金融投资组合的构建，这属于投资组合管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:18:19.499732"
}