{
  "paper": {
    "id": 1365,
    "title": "A Kepler Optimization Algorithm-Based Convolutional Neural Network Model for Risk Management of Internet Enterprises",
    "abstract": "Internet enterprises, as the representative enterprises of technology-based enterprises, contribute more and more to the growth of the world economy. To ensure the sustainable development of enterprises, it is necessary to predict the risks in the operation of Internet enterprises. An accurate risk prediction model can not only safeguard the interests of enterprises but also provide certain references for investors. Therefore, this study designed a Convolutional Neural Network (CNN) model based on the Kepler optimization algorithm (KOA) for risk prediction of Internet enterprises, aiming to maximize the accuracy of the prediction model, and to help Internet enterprises carry out risk management. Firstly, we select the indicators related to the financial risk of Internet enterprises, and predict the risk based on the traditional statistical analysis of Logistic regression model. On this basis, KOA was improved based on evolutionary strategies and fish foraging strategies, and the improved algorithm was applied to optimize CNN. Based on improved KOA and CNN algorithms, an IKOA-CNN risk prediction model is proposed. Finally, by comparing traditional statistical analysis-based models and other learning-based models, the results show that the IKOA-CNN algorithm proposed in this study has the highest prediction accuracy.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "877e70402134ef86a54a3d184912cfe6",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "neural network",
      "deep learning",
      "convolutional neural network",
      "CNN"
    ],
    "stage1_timestamp": "2025-05-15T02:02:22.627713"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用改进的Kepler优化算法和卷积神经网络（CNN）来预测互联网企业的财务风险，旨在帮助企业进行风险管理。这直接属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是使用改进的Kepler优化算法和卷积神经网络（CNN）来预测互联网企业的财务风险，旨在帮助企业进行风险管理。这直接属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:49:27.170284"
}