{
  "paper": {
    "id": 2006,
    "title": "Data Cleaning for Personal Credit Scoring by Utilizing Social Media Data: An Empirical Study",
    "abstract": "With the accumulation of data on personal behavior and the development of machine learning models and algorithms, it is becoming possible to use social media data for personal credit scoring. In this article, we use the systematic sampling method to obtain Douban's social media data. Because there are many abnormal users in these data, they are real but false data for personal credit evaluation. In order to better carry out personal credit scoring, we propose three criteria, power exponents of time interval distribution of individual user $\\gamma _i$gamma i, user activity $A_i$Ai, and the ratio of out-degree and in-degree $R_i$Ri of user $i$i, which are used to systematically clean the data. And then, we used the logistic regression method to score the individual credits of users before and after data cleaning, and found that the rank order of personal credit scoring has changed significantly. This change is largely attributed to the changes of network structure after data cleaning. We believe that our work is very important to use the social media data to establish a credible personal credit evaluation system to reduce the credit risk of the current Internet financial industry.",
    "year": 2020,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "07d7e20698b68ab30830556c4808e0c4",
    "relevant_keywords": [
      "machine learning",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:09:48.446575"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是利用社交媒体数据进行个人信用评分，目的是减少互联网金融行业的信用风险，这属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是利用社交媒体数据进行个人信用评分，目的是减少互联网金融行业的信用风险，这属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:44:49.455002"
}