{
  "paper": {
    "id": 1071,
    "title": "Evolutionary Extreme Learning Machine with novel activation function for credit scoring",
    "abstract": "The term credit scoring is extensively used in credit industries for decision making and measuring the risk associated with an applicant. It uses applicants' historical data for credit risk evaluation by applying machine learning or statistical techniques. Credit risk evaluation has become progressively important field in financial risk management for credit industries. In this study, Extreme Learning Machine (ELM) is utilized as a classification tool for credit risk evaluation model. ELM requires more number of hidden neurons and random determination of the input weights and hidden biases. Moreover, ELM performance depends on activation function, weights and biases assigned to hidden neurons. An appropriate approach for selection of activation function, weights and biases may improve the performance of ELM. Hence, we have proposed a novel activation function and an evolutionary approach to get optimized weights and biases by utilizing Bat optimization algorithm. Further, the simulations are performed on four bench-marked credit scoring datasets with various activation functions. Simulation results demonstrate that proposed Evolutionary ELM (EELM) is more suitable for credit risk evaluation.",
    "year": 2020,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "d1f969073913addd2d858df219d210f7",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "neural network",
      "hidden layer",
      "sigmoid",
      "tanh"
    ],
    "stage1_timestamp": "2025-05-15T01:58:43.350851"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on credit scoring and credit risk evaluation, which are key components of financial risk management in the credit industry. The proposed Evolutionary Extreme Learning Machine (EELM) is specifically designed to improve the accuracy of credit risk assessment, a critical aspect of managing financial risk.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on credit scoring and credit risk evaluation, which are key components of financial risk management in the credit industry. The proposed Evolutionary Extreme Learning Machine (EELM) is specifically designed to improve the accuracy of credit risk assessment, a critical aspect of managing financial risk.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:52:19.538421"
}