{
  "paper": {
    "id": 928,
    "title": "End-to-end deep learning with neuromorphic photonics",
    "abstract": "Neuromorphic computing has emerged as a highly-promising compute alternative, migrating from von-Neuman architectures towards mimicking the human brain for sustaining computational power increases within a reduced power consumption envelope. Electronic neuromorphic chips like IBM's TrueNorth, Intel's Loihi and Mythic's AI platform reveal a tremendous performance improvement in terms of computational speed and density; at the same time, neuromorphic photonic layouts are constantly gaining ground in exploiting their large component portfolio for enabling GHz-bandwidth and low-energy neurons. Progressing in tight synergy with appropriate training techniques, this evolution has already started to translate into performance improvements in end-to-end applications, highlighting the practical perspectives of the new neural network hardware when effectively synergized with new training frameworks. Herein, we present a complete portfolio of neuromorphic photonic subsystems and architectures, highlighting their utilization in practical application scenario for time series classification and fiber transmission links. Our work extends along feed-forward and recurrent photonic NN models, demonstrating experimental results together with the required training methods for bridging the gap between software-deployed NNs and the photonic hardware. We report on the experimentally validated performance of a 10GHz photonic time series classification engine, presenting also preliminary results on how photonic neurons can replace DSP modules in end-to-end fiber transmission schemes. The perspectives of these layouts to yield energy and area efficiency benefits are discussed through a detailed energy and area breakdown of neuromorphic photonic technologies, highlighting a promising roadmap when plasmo-photonic hardware is adopted.",
    "year": 2021,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "d964bd73f3de10162db0c908ef7c794a",
    "relevant_keywords": [
      "machine learning",
      "classification",
      "neural network",
      "deep learning",
      "representation learning",
      "backpropagation",
      "BP",
      "hidden layer",
      "recurrent neural network",
      "long short-term memory",
      "LSTM"
    ],
    "stage1_timestamp": "2025-05-15T00:49:36.380477"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究神经形态光子学在时间序列分类和光纤传输链路中的应用，并未明确指出其在衍生品定价、金融风险管理或投资组合管理等金融领域的应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究神经形态光子学在时间序列分类和光纤传输链路中的应用，并未明确指出其在衍生品定价、金融风险管理或投资组合管理等金融领域的应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:25:57.090078"
}