{
  "paper": {
    "id": 3110,
    "title": "Sensitivity of US sectoral returns to energy commodities under different investment horizons and market conditions",
    "abstract": "This study investigates relationships between US equity sector returns and energy commodity- crude oil, natural gas, gasoline, and gas oil-prices over short-run and long-run investment horizons. We decompose 22 years of daily raw return series on sampled US sectors and energy commodities into short-run and long-run components using variational mode decomposition (VMD). We employ quantile regression to observe US sector return behaviours under differing market conditions. Our results identify important differences in these behaviours by energy commodity, timeframe, and market condition. This includes, on average, differences in the sign and magnitude of quantile regression coefficients on energy commodities by investment horizon. While remaining susceptible to energy market changes in the short run, US sectors are recipients of greater volatility spillovers over the long run. Our results suggest a greater potential to achieve diversification benefits in the short run, and greater homogeneity in the effect of energy commodity on US sector returns across all quantiles in the long run. Our results have implications for investors, portfolio managers, and policy makers.",
    "year": 2022,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "a9703a9598f4957aacb40a35ba450067",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:13:45.191379"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文研究了美国股票部门回报与能源商品价格之间的关系，并探讨了不同投资期限和市场条件下的多样化投资潜力。这些研究结果对投资者和投资组合经理具有直接的应用价值，旨在优化投资组合配置和风险管理策略。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文研究了美国股票部门回报与能源商品价格之间的关系，并探讨了不同投资期限和市场条件下的多样化投资潜力。这些研究结果对投资者和投资组合经理具有直接的应用价值，旨在优化投资组合配置和风险管理策略。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:11:28.973740"
}