{
  "paper": {
    "id": 2362,
    "title": "COMPUTATION INTELLIGENCE BASED DAILY ALGORITHMIC STRATEGIES FOR TRADING IN THE FOREIGN EXCHANGE MARKET",
    "abstract": "Successful trading in financial markets is not possible without a support system that manages the preparation of the data, prediction system, and risk management and evaluates the trading efficiency. Selected orthogonal data was used to predict exchange rates by applying recurrent neural network ( RNN) software based on the open source framework Keras and the graphical processing unit (GPU) NVIDIA GTX1070 to accelerate RNN learning. The newly developed software on the GPU predicted ten high-low distributions in approximately 90 minutes. This paper compares different daily algorithmic trading strategies based on four methods of portfolio creation: split equally, optimisation, orthogonality, and maximal expectations. Each investigated portfolio has opportunities and limitations dependent on market state and behaviour of investors, and the efficiencies of the trading support systems for investors in foreign exchange market were tested in a demo FOREX market in real time and compared with similar results obtained for risk-free rates.",
    "year": 2018,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "153296b48a1f9321c5b5376dbbd446b3",
    "relevant_keywords": [
      "machine learning",
      "neural network",
      "deep learning",
      "recurrent neural network",
      "RNN"
    ],
    "stage1_timestamp": "2025-05-15T02:14:19.689233"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文主要讨论了基于计算智能的日常算法交易策略，特别是通过四种投资组合创建方法（均分、优化、正交性和最大期望）来比较不同的交易策略。这些内容直接涉及投资组合管理的核心问题，即如何构建和优化投资组合以实现交易目标。虽然论文也提到了风险管理和预测系统，但这些内容更多是作为交易支持系统的一部分，而非论文的主要研究方向。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文主要讨论了基于计算智能的日常算法交易策略，特别是通过四种投资组合创建方法（均分、优化、正交性和最大期望）来比较不同的交易策略。这些内容直接涉及投资组合管理的核心问题，即如何构建和优化投资组合以实现交易目标。虽然论文也提到了风险管理和预测系统，但这些内容更多是作为交易支持系统的一部分，而非论文的主要研究方向。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:42:55.324038"
}