{
  "paper": {
    "id": 2601,
    "title": "Establishment of a Mathematical Model for Enterprise Credit Risk Recognition and Rating Based on Hybrid Learning Algorithms",
    "abstract": "With the increasing trend of economic globalization, the market competition among enterprises is becoming increasingly fierce. The fierce market competition makes enterprises face increasing financial risks. Financial risk not only damages the interests of investors and creditors, but also threatens macroeconomic stability. In this paper, the theory and method of comprehensive evaluation of mixed learning algorithm are used to evaluate the enterprise credit. Principal component analysis method is used to determine the weight of each index, then the comprehensive evaluation value of each sample enterprise is calculated by the efficiency coefficient method. Finally, the quantitative judgment standard of each credit rating is determined by the ordered clustering method. The internal credit rating model of commercial banks is constructed to improve the credit risk management level in the credit approval process. Finally, a mathematical model is given and discussed with examples to show that the results are quantitative, scientific and objective.",
    "year": 2019,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "11b0fc3acc166fa61b0feecbf0aecb4d",
    "relevant_keywords": [
      "principal components analysis",
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T02:17:01.799005"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是建立企业信用风险识别和评级的数学模型，旨在提高商业银行在信贷审批过程中的信用风险管理水平。这直接涉及金融风险管理领域，特别是信用风险管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"该论文的核心技术是建立企业信用风险识别和评级的数学模型，旨在提高商业银行在信贷审批过程中的信用风险管理水平。这直接涉及金融风险管理领域，特别是信用风险管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:41:07.627704"
}