{
  "paper": {
    "id": 1297,
    "title": "A comparison of linear and nonlinear statistical techniques in performance attribution",
    "abstract": "Performance attribution is usually conducted under the linear framework of multifactor models, Although commonly used by practitioners in finance, linear multifactor models are known to be less than satisfactory in many situations, After a brief survey of nonlinear methods, nonlinear statistical techniques are applied to performance attribution of a portfolio constructed from a fixed universe of stocks using factors derived from some commonly used cross sectional linear multifactor models, By rebalancing this portfolio monthly, the cumulative returns for procedures based on standard linear multifactor model and three nonlinear techniques-model selection, additive models, and neural networks-are calculated and compared, It is found that the first two nonlinear techniques, especially in combination, outperform the standard linear model. The results in the neural-network case are inconclusive because of the great variety of possible models. Although these methods are more complicated and may require some tuning, toolboxes are developed and suggestions on calibration are proposed. This paper demonstrates the usefulness of modern nonlinear statistical techniques in performance attribution.",
    "year": 2001,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "ce14d77f607023a60d37761198d4555c",
    "relevant_keywords": [
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T00:54:24.610985"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文主要研究非线性统计技术在绩效归因中的应用，特别是针对投资组合的构建和再平衡，这直接属于投资组合管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文主要研究非线性统计技术在绩效归因中的应用，特别是针对投资组合的构建和再平衡，这直接属于投资组合管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:22:06.383692"
}