{
  "paper": {
    "id": 1384,
    "title": "A New Time-Aware LSTM based Framework for Multi-label Classification on Healthcare Data",
    "abstract": "Medical prevention is a very important aspect of healthcare informatics research through the prediction of medical events (e.g., disease diagnosis). In this work, we propose a deep learning approach to perform multi-label prediction on acts of medical care and treatments. The proposed approach utilizes a time-aware long short-term memory network and extends it with additional information from a fuzzy clustering of the same portfolio. The former mechanism (time-aware) is used to handle the temporal irregularity between the elements of a medical trajectory whereas the latter mechanism (fuzzy clustering) assists in modeling the heterogeneity among patients and treatments. Using a large portfolio of reimbursed medical records (over 16 million consumed acts of medical care) by a healthcare insurance in France, we show that our approach outperforms traditional and deep learning methods in medical multi-label prediction. Our work has implications for supporting medical prevention and more broadly improving the quality of healthcare services and insurance.",
    "year": 2023,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "f87fabc97ea9474faf220381da879040",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "classification",
      "clustering",
      "neural network",
      "long short-term memory",
      "LSTM"
    ],
    "stage1_timestamp": "2025-05-15T00:54:56.552130"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是医疗保健信息学中的多标签分类问题，特别是利用深度学习技术对医疗记录进行预测。虽然提到了'portfolio'一词，但这里的'portfolio'指的是医疗行为的集合，而非金融投资组合。论文的核心技术和应用场景均与金融领域无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是医疗保健信息学中的多标签分类问题，特别是利用深度学习技术对医疗记录进行预测。虽然提到了'portfolio'一词，但这里的'portfolio'指的是医疗行为的集合，而非金融投资组合。论文的核心技术和应用场景均与金融领域无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:21:33.318759"
}