{
  "paper": {
    "id": 421,
    "title": "Deep learning-based risk management of financial market in smart grid",
    "abstract": "Smart grid control systems (SGCSs) become more vulnerable to cyber-attacks because of the combination of the Internet of Things and communication systems. Conventional intrusion detection systems (IDSs) that have been essentially improved in order to secure information technology systems. Since SGCS datasets are asymmetric, the majority of IDSs suffer from poor precision and significant false-positive rates. A deep learning (DL) layout for constructing novel symmetric presentations of the asymmetric datasets is proposed in the present study. It is incorporated into a model created particularly for detecting attacks using DL in a SGCS environment. Deep Neural Networks and Decision Tree classifiers are utilized in the suggested attack detection model. By performing 10-fold cross-validation using 2 actual SGCS datasets, this suggested model has been assessed for its efficiency. According to the outcomes, the suggested approach is more effective than traditional schemes such as Random Forest, Support Vector Machine.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "deep learning",
    "cache_key": "d4a447620771168229ab4abcd923b68e",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM",
      "decision tree",
      "neural network",
      "deep learning",
      "representation learning"
    ],
    "stage1_timestamp": "2025-05-15T01:38:17.303270"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究智能电网控制系统中的网络安全问题，提出了一种基于深度学习的入侵检测模型。虽然标题提到了'financial market'，但论文内容并未涉及任何具体的金融应用场景或金融风险管理技术。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究智能电网控制系统中的网络安全问题，提出了一种基于深度学习的入侵检测模型。虽然标题提到了'financial market'，但论文内容并未涉及任何具体的金融应用场景或金融风险管理技术。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:03:38.271172"
}