{
  "paper": {
    "id": 1918,
    "title": "Crude oil price shocks, volatility spillovers, and global systemic financial risk transmission mechanisms: Evidence from the stock and foreign exchange markets",
    "abstract": "Crude oil, as one of the most important international bulk commodities, has both financial and geopolitical attributes. As such, its price fluctuations are bound to have profound impacts on the international financial markets. We decomposed crude oil price shocks into supply, demand and risk shocks using a structural vector autoregressive (SVAR) model. We then established a network of volatility spillovers and selected four typical time periods to examine the spillover effects between the three price shocks, the global stock market, and the foreign exchange market. Based on this data, we constructed the DCC-GARCH and asymmetric BEKK-GARCH models to study the dy-namic interconnections between markets, risk spillover effects, and cross-impact relationships. Finally, we established an early warning model for the risk of oil price fluctuations using the machine learning method of the long short-term memory (LSTM).Based on the empirical research, this paper draws the following conclusions: (a) the risk spillovers of crude oil price shocks exhibit typical time-variant characteristics in different periods, with demand shocks having the strongest spillover effects, while the effects of supply shocks are the weakest; (b) in the vast majority of cases, crude oil-importing countries are the recipients of these risks; and (c) due to the close linkage between global stock markets and foreign exchange markets, the possibility of oil price shocks exacer-bating the spread of global systemic financial risks is greatly enhanced. The findings provide policymakers and investors with a reference for the regulation of market operations, as well as risk prevention and avoidance.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "b1c70e7aab476ab8f5e2f697d1fad4ac",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "long short-term memory",
      "LSTM"
    ],
    "stage1_timestamp": "2025-05-15T02:09:14.293504"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要研究原油价格波动对全球金融市场的影响，包括风险溢出效应和系统性金融风险的传播机制，并建立了基于LSTM的预警模型，这些都属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文主要研究原油价格波动对全球金融市场的影响，包括风险溢出效应和系统性金融风险的传播机制，并建立了基于LSTM的预警模型，这些都属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:45:12.562885"
}