{
  "paper": {
    "id": 1493,
    "title": "Predicting stock market crashes in MENA regions: study based on the irrationality of investor behavior and the NARX model",
    "abstract": "PurposeThis study aims to predict stock market crises in the Middle East North Africa (MENA) regions by leveraging the nonlinear autoregressive neural network with exogenous inputs (NARX) model with two measures of investor sentiment: the ARMS indicator and Google Trends' search volume of positive and negative words.Design/methodology/approachEmploying a novel approach, this study utilizes the NARX model with ten neurons in the hidden layer and the Levenberg-Marquardt training algorithm. It evaluates model performance through learning, validation and test errors, as well as correlation analysis between predicted and actual crises.FindingsThe NARX model, incorporating investor sentiment, has proven to be a reliable tool for forecasting crises, helping market participants understand data complexity and avoid crisis consequences. The divergence in how investors interpret market news, with some focusing solely on negative developments and others valuing positive outcomes, highlights the predictive nature of the optimistic and pessimistic sentiments captured by the model.Research limitations/implicationsThis study advocates for integrating behavioral approaches into stock market crisis prediction, highlighting the significance of investor sentiment and deep learning. It advances crisis mechanism understanding and opens avenues in behavioral finance. Integration of these findings into finance and economics education could enhance students' risk understanding and mitigation strategies.Practical implicationsThe adoption of NARX models, incorporating investor sentiment, empowers market participants to proactively manage crises, adjust strategies, enhance asset protection and make informed decisions. These models enable them to minimize losses, maximize returns and diversify portfolios effectively in response to market fluctuations. These insights also guide policymakers such as governments, regulatory institutions and financial organizations in formulating crisis prevention and mitigation policies, bolstering economic and financial stability.Social implicationsThis research reduces economic uncertainty, safeguards individuals' savings and investments and promotes a stable financial climate.Originality/valueThis study is one of the first attempts to demonstrate the detection and prediction of stock market crises, specifically in the MENA stock market, using the NARX model. It offers a robust forecasting model using machine learning and investor sentiment, providing decision-making support for investment strategies and policy development aimed at enhancing financial and economic stability.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "2a004a93349378a5a742c57aa8822748",
    "relevant_keywords": [
      "machine learning",
      "neural network",
      "deep learning",
      "hidden layer",
      "recurrent neural network",
      "NARX"
    ],
    "stage1_timestamp": "2025-05-15T02:03:39.803582"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用NARX模型预测股票市场危机，这属于金融风险管理的范畴，因为它旨在帮助市场参与者和管理者识别和应对潜在的金融风险。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是使用NARX模型预测股票市场危机，这属于金融风险管理的范畴，因为它旨在帮助市场参与者和管理者识别和应对潜在的金融风险。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:48:42.437426"
}