{
  "paper": {
    "id": 8979,
    "title": "A Novel Response Priority Framework for an Urban Coastal Catchment Using Global Weather Forecasts-Based Improved Flood Risk Estimates",
    "abstract": "A novel flood risk forecasting-based response priority framework is proposed in this study, which will facilitate efficient decision-making ahead of an extreme precipitation event. This study is demonstrated over a highly flood-prone and geomorphologically diverse coastal catchment in Mumbai city, the financial capital of India, and is subjected to high spatiotemporal variability of precipitation. A regional precipitation forecast model is developed, where a quantile regression (QR)-based statistical approach is applied to the global weather forecasts for improvement in finer resolution extreme precipitation estimates. A QR is performed between the observed synoptic-scale predictors obtained from ERA-Interim Reanalysis data set and the observed subdaily precipitation within the study area. Subsequently, a set of reliably well-simulated forecasted predictors obtained from the ensemble members of the Global Ensemble Forecast System are used in the established relationship to obtain extreme precipitation forecasts for higher quantile levels. The forecasted precipitation data serves as an essential input to a comprehensive hydrodynamic flood modeling framework. The flood inundation maps corresponding to different quantiles of forecasted precipitation are quantified to identify the flood hotspots. The set of flood inundations maps developed for different quantiles are utilized to demarcate the areas based on critical response time, that is, the time required by each cell within the study area to be inundated to a certain threshold depth, and the response priority levels for each cell are determined. This information is combined with socioeconomic vulnerability (SEV), a critical component of flood risk, to derive conjugated SEV-based response priority maps.Plain Language Summary A novel flood risk forecasting system to prioritize the areas under flood risk has been developed which can enable the civic bodies to prioritize their flood management strategies before flooding events. The global weather models, based on mathematical equations which are run to generate weather forecasts, are unable to predict extreme precipitation events accurately at a local scale. Therefore, in this study, other meteorological variables that are satisfactorily simulated by these models are utilized to develop a statistical relationship with the observed precipitation at a finer scale, and this relationship is utilized for improved precipitation forecasts over Mumbai, a coastal city in India. These precipitation forecasts are provided as input to a flood modeling framework to derive flood maps based on inundation depth. These maps are used to identify the areas based on the time required to be flooded to a certain threshold depth and this information along with the socioeconomic condition of the population residing in the catchment is utilized to prioritize the locations for effective action by the governing bodies, before an extreme precipitation event. The proposed framework will be effective in better flood management, particularly in densely populated urban regions.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "9cddc21b908410e6e8e74a99ff03680a",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T03:24:26.290321"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究洪水风险预测和响应优先级框架，涉及气象预报、水文建模和社会经济脆弱性分析，并未提及或应用于衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究洪水风险预测和响应优先级框架，涉及气象预报、水文建模和社会经济脆弱性分析，并未提及或应用于衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:25:13.181530"
}