{
  "paper": {
    "id": 511,
    "title": "Prediction of the Risk of Adverse Clinical Outcomes with Machine Learning Techniques in Patients with Noncommunicable Diseases",
    "abstract": "Decision-making in chronic diseases guided by clinical decision support systems that use models including multiple variables based on artificial intelligence requires scientific validation in different populations to optimize the use of limited human, financial, and clinical resources in healthcare systems worldwide. This cohort study evaluated three machine learning algorithms-XGBoost, Elastic Net logistic regression, and an Artificial Neural Network-to develop a prediction model for three outcomes: mortality, hospitalization, and emergency department visits. The objective was to build a clinical decision support system for patients with noncommunicable diseases treated at the Alma Mater Hospital complex in Medell & iacute;n, Colombia. We collected 4845 electronic medical record entries from 5000 patients included in the study. The median age was 71.83 years, with 63.8% women and 29.7% receiving home care. The most prevalent medical conditions were diabetes (52.9%), hypertension (67.2%), dyslipidemia (57.3%), and COPD (19.4%). For mortality prediction, the Elastic Net logistic regression model achieved an AUCROC of 0.883 (95% CI: 0.848-0.917), the XGBoost model reached an AUCROC of 0.896 (95% CI: 0.865-0.927), and the Neural Network achieved 0.886 (95% CI: 0.853-0.916). For hospitalization, the Elastic Net model had an AUCROC of 0.952 (95% CI: 0.937-0.965), the XGBoost model achieved 0.963 (95% CI: 0.952-0.974), and the Neural Network scored 0.932 (95% CI: 0.915-0.948). For emergency department visits, the AUCROC values were 0.980 (95% CI: 0.971-0.987) for Elastic Net, 0.977 (95% CI: 0.967-0.986) for XGBoost, and 0.976 (95% CI: 0.968-0.982) for the neural network. A dashboard was developed to interact with an ensemble risk categorization segmenting patient risk in the cohort to aid in clinical decision-making. A clinical decision support system based on artificial intelligence using electronic medical records possibly can help segmenting the risk in populations with Noncommunicable Diseases for effective decision-making.",
    "year": 2025,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "c080a63645fd9be84337a40654554bd2",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "regression",
      "neural network",
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T01:51:31.371446"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究使用机器学习技术预测非传染性疾病患者的不良临床结果，其应用场景为医疗健康领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究使用机器学习技术预测非传染性疾病患者的不良临床结果，其应用场景为医疗健康领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:57:34.767780"
}