{
  "paper": {
    "id": 4645,
    "title": "Perceived Racial Discrimination and Depressed Mood in Perinatal Women: An Extension of the Domain Specific Stress Index",
    "abstract": "Purpose: The negative impact of stress on the mental health of perinatal women is well-established. Prior research using data from the Pregnancy Risk Assessment Monitoring System (PRAMS) confirms three distinct stress domains: financial, relationship, and trauma. In 2013, an item assessing perceived racial discrimination was added to the Iowa PRAMS. Using the first phase of available data, we examine whether perceived racial discrimination represents an independent stress domain and assess its association with postpartum depressed mood. Methods: A principal component analysis of the Iowa PRAMS data (2013-2015: N = 2,805) evaluated stress and perceived racial discrimination. Logistic regression examined the effect of racial discrimination on postpartum depressed mood. Results: In Iowa, 4.4% of respondents perceived racial discrimination, with higher rates among non-Hispanic Black women and Hispanic women. The principal component analysis identified five stress domains: financial, relational, traumatic, emotional, and displacement. Perceived racial discrimination did not load onto any of these domains, suggesting that it represents an independent stress component. Logistic regression indicated that those who experienced perceived racial discrimination were twice as likely to have experienced depressed mood. Conclusions: Racism, in the form of perceived racial discrimination among pregnant women, is a unique domain of stress that is significantly associated with an increased risk for depressed postpartum mood. Decreasing discrimination's effects on perinatal mental health could begin with ensuring respectful and compassionate health care during pregnancy and the postpartum period. (C) 2021 Jacobs Institute of Women's Health. Published by Elsevier Inc.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "598e278df4dbdb8837e706fae2cf027d",
    "relevant_keywords": [
      "principal components analysis"
    ],
    "stage1_timestamp": "2025-05-15T02:39:27.006311"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究围产期妇女感知的种族歧视与抑郁情绪之间的关系，属于心理学和公共卫生领域，与金融研究领域无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究围产期妇女感知的种族歧视与抑郁情绪之间的关系，属于心理学和公共卫生领域，与金融研究领域无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:32:21.466818"
}