{
  "paper": {
    "id": 147,
    "title": "Research on Financial Risk Prediction Method of Listed Companies Based on GA-RBF Neural Network",
    "abstract": "Research on the problem shows that it is difficult to form a normalized risk forecast for listed companies, which makes it difficult for company management to keep up with risk changes. The radial basis neural network model is used to construct listed companies' financial risk prediction models. At the same time, according to the shortcomings of the difficulty in determining the parameters of the radial basis neural network model, the genetic algorithm is used to improve it, and the parameter determination steps are optimized to enhance the overall performance of the model. The results of the study show that the prediction error of the GA-RBF (Genetic Algorithm-radial basis function) neural network model designed in the study has increased overall, and finally dropped to 10-2. At the same time, only one sample of the intercepted prediction samples is in the abnormal state of prediction, and the prediction effect is significantly stronger than in Traditional forecasting models. It can be seen that the GA-RBF neural network model designed by the research can achieve more accurate and stable forecasting effects in practical applications and lay the foundation for the normalized forecasting of listed companies.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "99ba0292780f2a9e5b1be31d14027cf7",
    "relevant_keywords": [
      "machine learning",
      "neural network",
      "deep learning",
      "representation learning",
      "backpropagation",
      "BP",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T01:47:14.136498"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on developing a GA-RBF neural network model for predicting financial risks of listed companies, which directly addresses the problem of financial risk forecasting and management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on developing a GA-RBF neural network model for predicting financial risks of listed companies, which directly addresses the problem of financial risk forecasting and management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:00:44.226170"
}