{
  "paper": {
    "id": 198,
    "title": "An empirical application of a hybrid ANFIS model to predict household over-indebtedness",
    "abstract": "The increase in debt levels of families in different parts of the world has drawn the attention of organizations dedicated to the prevention of financial risk and has highlighted the need to develop early detection methods for over-indebtedness. In this paper, we propose a hybrid model of the adaptive neural fuzzy inference system (ANFIS) and Probit model for the prediction of household over-indebtedness. The proposed model is compared with Probit, artificial neural networks (ANN), classification and regression trees (CART), random forest (RF) and support vector machine (SVM) models. The most relevant parameters for the performance of each model are optimized, and we address data balance problems through the synthetic minority over-sampling technique (SMOTE). We use data obtained from the Financial Household Survey of the Central Bank of Chile. The results show that the proposed model performs significantly better than the reference models in terms of the correct classification of indebted individuals. Consequently, this model provides an innovative understanding of household over-indebtedness, which can be useful for different governmental entities focused on preventing excessive indebtedness and maintaining financial stability.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "ee65f9c9d3ae4e1e603d53923e3a089b",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM",
      "decision tree",
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T01:47:53.050164"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用混合ANFIS模型预测家庭过度负债，这直接关联到金融风险管理中的信用风险监测和预防。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是使用混合ANFIS模型预测家庭过度负债，这直接关联到金融风险管理中的信用风险监测和预防。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:00:19.631211"
}