{
  "paper": {
    "id": 7029,
    "title": "Exploring the usefulness of a simple linear regression model for understanding price movements of selected recycled materials in the UK",
    "abstract": "The price volatility of recycled materials exposes many different organisations to financial and regulatory risk. These risks can be partially mitigated by improved understanding of price volatility using econometric models, although these have tended to be sophisticated autoregressive models, beyond the analytical capability or cost structure of the average market participant. In this context, this study explores the use of a simple linear regression model to understand the behaviour of prices for recycled plastic, recovered paper and glass, based on the price of their primary inputs, with a specific focus on the UK market. The results of the simple regression model are compared with a wavelet analysis to determine what information is lost in the trade off with simplicity. Both models found significant relationships between the price of crude oil/ethylene/naphtha and recycled plastics and it appears that there is no loss in model performance by using oil as the explanatory variable, rather than direct inputs (ethylene/naphtha). However, few correlations were found for recovered paper and glass. Initial findings from the wavelet analysis suggest that since 2004 the oil price has become more closely linked to the price of recycled plastics. It must be noted that this study is exploratory and particular dynamics of UK markets for recycled materials may affect price development in a way that would not be repeated on international markets. (C) 2011 Elsevier B.V. All rights reserved.",
    "year": 2012,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "4ffdb67cea2f8740e63ecc774590dfb5",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T03:04:23.002085"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要探讨了使用简单线性回归模型和小波分析来理解回收材料价格波动的行为，并未明确指出其在衍生品定价、金融风险管理或投资组合管理等特定金融领域的应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要探讨了使用简单线性回归模型和小波分析来理解回收材料价格波动的行为，并未明确指出其在衍生品定价、金融风险管理或投资组合管理等特定金融领域的应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:27:06.054183"
}