{
  "paper": {
    "id": 8436,
    "title": "Variations in Cost and Readmissions of Patients in the Bundled Payment for Care Improvement Bundle for Hip and Femur Fractures",
    "abstract": "Introduction: The Bundled Payment for Care Improvement (BPCI) for hip and femur fractures is an effort to increase care quality and coordination at a lower cost. The bundle includes all patients undergoing an operative fixation of a hip or femur fracture (diagnosis-related group codes 480-482). This study aims to investigate variance in the hospital cost and readmission rates for patients within the bundle. Materials and Methods: The study is a retrospective analysis of patients >= 65 years old billed for a diagnosis-related groups 480-482 in 2016 in the National Readmission Database. Cost of admission and length of stay were compared between patients who were or were not readmitted. Regression analysis was used to determine the effects of the primary procedure code and anatomical location of the femur fracture on costs, length of stay, and readmission rates. Results: Patients that were readmitted within 90 days of surgery had an increased cost on initial admission ($18,427 vs $16,844, P < .0001), and an increased length of stay (6.24 vs 5.42, P < .0001). When stratified by procedure, patients varied in readmission rates (20.7% vs 19.6% vs 21.8%), initial cost, and length of stay (LOS). Stratification by anatomical location also led to variation in readmission rates (20.7% vs 18.3% vs 20.6%), initial cost, and LOS. Conclusion: The hip and femur fractures bundle includes a great number of procedures with variance in cost, readmission, and length of stay. This amount of variation may make standardization difficult and may put the hospital at potential financial risk.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "e87f7c888ffac01c2d503d16b4591a23",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T03:18:51.616949"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究医疗成本与再入院率的变化，属于医疗健康管理领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究医疗成本与再入院率的变化，属于医疗健康管理领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:25:36.938281"
}