{
  "paper": {
    "id": 3872,
    "title": "Exposure from cooking with biofuels: pollution monitoring and analysis for rural Tamil Nadu, India",
    "abstract": "In this paper, statistical analysis to examine the links between pollution and the types of kitchen and fuels is carried out for rural houses by first monitoring the indoor air quality (IAQ) followed by regression analysis of 418 households in Tamil Nadu, India. Exposures to the chief cook (females, who are mainly involved in the cooking during monitoring) are measured with personal monitors. The result shows that the values of respirable particles (PM10) ranged from 500-2000 mug/m(3) during a two-hour cooking period from burning biofuels. The range depends on the type of kitchen and fuel use. Stationary monitors, placed two metres away from the stove, also recorded similar concentrations. Thus, the individuals who stay inside the houses using biofuels also face high concentrations even if they are not cooking. They could be senior citizens, children or adult males. Thus, there are two major findings from this analysis. Improved house designs that pay attention to kitchen location and put up partitions should also be considered in the intervention portfolio. Secondly, the exposure is not limited to the cooks alone. The rest of the family in the vicinity is also exposed through a passive cooking effect. (C) 2001 Elsevier Science Ltd. All rights reserved.",
    "year": 2001,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "e3ee6e569ae02ffc60b4a7ff86ed4dd4",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:21:41.381360"
  },
  "domain_result": {
    "success": false,
    "error": "Client error '429 Too Many Requests' for url 'https://api.deepseek.com/v1/chat/completions'\nFor more information check: https://developer.mozilla.org/en-US/docs/Web/HTTP/Status/429",
    "application_domains": [
      "None"
    ],
    "justification": "API调用失败: Client error '429 Too Many Requests' for url 'https://api.deepseek.com/v1/chat/completions'\nFor more information check: https://developer.mozilla.org/en-US/docs/Web/HTTP/Status/429",
    "raw_response": null
  },
  "timestamp": "2025-05-20T16:08:45.394494"
}