{
  "paper": {
    "id": 1795,
    "title": "Service Provider Portfolio Selection across the Project Life Cycle Considering Synergy Effect",
    "abstract": "During the project life cycle, selecting the appropriate service provider portfolio (SPP) is essential to guaranteeing the successful implementation of manufacturing tasks. However, the existence of the synergy effect among service providers poses a challenge for decision makers in selecting the most suitable SPP. To effectively address this challenge, this study constructs a novel service provider portfolio selection (SPPS) model across the project life cycle, considering the synergy effect. The model is based on the integration of a radial basis function neural network (RBFNN), the technique for order preference by similarity to ideal solution (TOPSIS), and the entropy method (EM). First, the evaluation criteria for service provider selection are defined, followed by the identification of alternative service providers and feasible SPPs based on project life cycle division. Subsequently, a quantitative analysis of the synergy effect among service providers within the same stage, as well as between different stages, throughout the project life cycle, is carried out. This analysis helps to determine the input variables and expected output variables that will be utilized in the model. Additionally, the feasibility and applicability of the proposed model are illustrated through an example. Finally, a comparison between the proposed hybrid model and the BPNN is conducted to validate the model's accuracy and efficiency. This study contributes to making sound decisions in the SPPS process from a project life cycle perspective.",
    "year": 2023,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "1e93f3229b57e85fe0c3a64e40718940",
    "relevant_keywords": [
      "neural network",
      "backpropagation",
      "BP"
    ],
    "stage1_timestamp": "2025-05-15T00:59:53.130898"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是在项目生命周期中选择合适的服务提供商组合，考虑协同效应，其应用场景是制造业项目的服务提供商选择，而非金融领域的衍生品定价、金融风险管理或投资组合管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是在项目生命周期中选择合适的服务提供商组合，考虑协同效应，其应用场景是制造业项目的服务提供商选择，而非金融领域的衍生品定价、金融风险管理或投资组合管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:18:48.091284"
}