{
  "paper": {
    "id": 81,
    "title": "A comparison of wavelet networks and genetic programming in the context of temperature derivatives",
    "abstract": "The purpose of this study is to develop a model that describes the dynamics of the daily average temperature accurately in the context of weather derivatives pricing. More precisely, we compare two state-of-the-art machine learning algorithms, namely wavelet networks and genetic programming, with the classic linear approaches that are used widely in the pricing of temperature derivatives in the financial weather market, as well as with various machine learning benchmark models such as neural networks, radial basis functions and support vector regression. The accuracy of the valuation process depends on the accuracy of the temperature forecasts. Our proposed models are evaluated and compared, both in-sample and out-of-sample, in various locations where weather derivatives are traded. Furthermore, we expand our analysis by examining the stability of the forecasting models relative to the forecasting horizon. Our findings suggest that the proposed nonlinear methods outperform the alternative linear models significantly, with wavelet networks ranking first, and that they can be used for accurate weather derivative pricing in the weather market. (C) 2016 The Authors. Published by Elsevier B.V. on behalf of International Institute of Forecasters.",
    "year": 2017,
    "source": "WOS",
    "area": "derivatives_pricing",
    "method": "machine learning",
    "cache_key": "6d9968b8dfeb08b0203df383070875f8",
    "relevant_keywords": [
      "machine learning",
      "regression",
      "support vector machine",
      "SVM",
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T01:28:03.940880"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Derivatives Pricing"
    ],
    "justification": "该论文的核心研究内容是开发模型以准确描述日平均温度动态，目的是用于天气衍生品的定价。论文比较了多种机器学习算法在温度衍生品定价中的表现，并明确指出这些模型可以用于准确的天气衍生品定价。因此，该论文的主要技术应用属于衍生品定价领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"衍生品定价\"],\n  \"justification\": \"该论文的核心研究内容是开发模型以准确描述日平均温度动态，目的是用于天气衍生品的定价。论文比较了多种机器学习算法在温度衍生品定价中的表现，并明确指出这些模型可以用于准确的天气衍生品定价。因此，该论文的主要技术应用属于衍生品定价领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:07:01.892276"
}