{
  "paper": {
    "id": 2286,
    "title": "Semiparametric estimation of expected shortfall and its application in finance",
    "abstract": "Measuring risk effectively is crucial for managing risk in financial markets. The expected shortfall has become an increasingly popular metric for risk in recent years. How to estimate it is important in statistics and financial econometrics. Based on the single index quantile regression, we introduce a new semiparametric approach, namely, weighted single index quantile regression. We assess the performance of the proposed expected shortfall estimator with backtesting. Our simulation results indicate that the estimator has a good finite sample performance and often outperforms existing methods. By applying the new method to both a market index and individual stocks, we show that it not only exhibits the best performance but also reveals an insight about the effect of the COVID pandemic, that is, the pandemic increases the market risk.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "fe5e1175ff6346d43a6d0224c4ce7c78",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:13:31.817112"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on the estimation of expected shortfall, a key metric in financial risk management, and demonstrates its application in assessing market risk, particularly during the COVID pandemic. This directly aligns with the domain of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on the estimation of expected shortfall, a key metric in financial risk management, and demonstrates its application in assessing market risk, particularly during the COVID pandemic. This directly aligns with the domain of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:43:20.334151"
}