{
  "paper": {
    "id": 454,
    "title": "Loan Default Forecasting Using Machine Learning Algorithm in Indonesian Regional Bank",
    "abstract": "In an effort to address the issues of growing credit risk, this research analyzes the application of machine learning algorithms for loan default prediction in regional banks in Indonesia. This study evaluates the efficacy of four primary algorithms - Decision Tree, Random Forest, Gradient Boosting, and Naive Bayes - by analyzing a two-year historical loan dataset. In-depth study indicated that Naive Bayes is the best algorithm, attaining 99.96% accuracy, 98.45% precision, and 99.63% recall, with a perfect Area Under the Curve (AUC) score of 1,000. These results represent the improved capability of Naive Bayes in identifying probable defaults with high precision and accuracy, greatly minimizing the probability of false positives. The findings recommend the application of Naive Bayes as a significant method in local bank credit risk management, providing an effective solution for early default identification and increased financial stability. This study adds to existing literature by presenting actual proof of the efficacy of machine learning technology in predicting credit risk. The suggestions offered can aid regional banks in enhancing their risk management approaches.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "ca9d91e86c41adb53b06fbe39ebafa43",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "decision tree",
      "random forest",
      "gradient boosting",
      "naive bayes"
    ],
    "stage1_timestamp": "2025-05-15T01:50:52.693610"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on using machine learning algorithms for loan default prediction, which is a key aspect of credit risk management, a subfield of financial risk management. The study's primary goal is to enhance risk management approaches in regional banks by improving early default identification, directly addressing financial risk concerns.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on using machine learning algorithms for loan default prediction, which is a key aspect of credit risk management, a subfield of financial risk management. The study's primary goal is to enhance risk management approaches in regional banks by improving early default identification, directly addressing financial risk concerns.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:58:00.739543"
}