{
  "paper": {
    "id": 2276,
    "title": "Revisiting Determinants of Investor Sentiment in the FX Option Market by Machine Learning Approaches",
    "abstract": "While FX option transactions are known to reflect risk perceptions of market participants, the over-the-counter nature of the FX option market has limited data availability on counterpart) , information, posing challenges to analyzing what factors could affect investor sentiment and how they may differ across investor types. With novel, granular FX option data based on the reporting from trade repositories and financial institutions in Japan, this paper employs machine learning approaches (Random Forest and XGBoost) to exploring the determinants of investor sentiment for USD/JPY by a different investor category, measured by the positioning of long call and short put (bullish for USD/JPY) minus long put and short call (bearish for USD/JPY). The analysis shows that the uncertainty over the US trade policy is one of the most important variables for the sentiment of non-financial corporates, while the US yield curve appears to affect the sentiment of both non-financial corporates and institutional investors. The results imply that the recent increase in hedging behavior for a sharp fall of the dollar against the yen could be attributable to the US-China trade tensions and an inversion of the US yield curve which suggests a slowdown of global economy.",
    "year": 2020,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "563508850e79764f671e59849aeab7ec",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "decision tree",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:13:31.769837"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究投资者情绪的决定因素，使用机器学习方法分析外汇期权市场的数据，但并未直接涉及衍生品定价、金融风险管理或投资组合管理的核心技术或应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究投资者情绪的决定因素，使用机器学习方法分析外汇期权市场的数据，但并未直接涉及衍生品定价、金融风险管理或投资组合管理的核心技术或应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:43:20.897033"
}