{
  "paper": {
    "id": 1507,
    "title": "Assessment of Machine Learning Performance for Decision Support in Venture Capital Investments",
    "abstract": "The venture capital (VC) industry offers opportunities for investment in early-stage companies where uncertainty is very high. Unfortunately, the tools investors currently have available are not robust enough to reduce risk and help them managing uncertainty better. Machine learning data-driven approaches can bridge this gap, as they already do in the hedge fund industry. These approaches are now possible because data from thousands of companies over the world is available through platforms such as Crunchbase. Previous academic efforts have focused only on predicting two classes of exits, i.e., being acquired by other company or offering shares to the public, using only one or a few subsets of explanatory variables. These events are typically related to high returns, but also higher risk, making hard for a venture fund to get repeatable and sustainable returns. On the contrary, we will try to predict more possible outcomes including a subsequent funding round or the closure of the company using a large set of signals. In this way, our approach would provide VC investors with more information to set up a portfolio with lower risk that may eventually achieve higher returns than those based on finding unicorns (i.e., companies with a valuation higher than one billion dollars). We will analyze the performance of several machine learning methods in a dataset of over 120,000 early-stage companies in a realistic setting that tries to predict their progress in a 3-year time window. Results show that machine learning can support venture investors in their decision-making processes to find opportunities and better assessing the risk of potential investments.",
    "year": 2019,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "ddb9bc1d688e17ffe7dcc7e6d1310f0a",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T00:56:39.013283"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文主要研究如何利用机器学习方法帮助风险投资（VC）投资者进行决策支持，包括预测多种可能的投资结果（如后续融资轮次或公司关闭），以构建风险较低的投资组合。这直接涉及投资组合管理的核心内容，即通过多样化投资来降低风险并提高回报。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文主要研究如何利用机器学习方法帮助风险投资（VC）投资者进行决策支持，包括预测多种可能的投资结果（如后续融资轮次或公司关闭），以构建风险较低的投资组合。这直接涉及投资组合管理的核心内容，即通过多样化投资来降低风险并提高回报。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:20:38.614616"
}