{
  "paper": {
    "id": 83,
    "title": "Fuzzy Support Vector Machine for bankruptcy prediction",
    "abstract": "Bankruptcy prediction has been a topic of active research for business and corporate organizations since past few decades. The problem has been tackled using various models viz., Statistical, Market Based and Computational Intelligence in the past. Among Computational Intelligence models, Artificial Neural Network has become dominant modeling paradigm. In this Paper, we use a novel Soft Computing tool viz., Fuzzy Support Vector Machine (FSVM) to solve bankruptcy prediction problem. Support Vector Machine is a powerful statistical classification technique based on the idea of Structural Risk Minimization. Fuzzy Sets are capable of handling uncertainty and impreciseness in corporate data. Thus, using the advantage of Machine Learning and Fuzzy Sets prediction accuracy of whole model is enhanced. FSVM is implemented for analyzing predictors as financial ratios. A method of adapting it to default probability estimation is proposed. The test dataset comprises of 50 largest bankrupt organizations with capitalization of no less than $ 1 billion that filed for protection against creditors under Chapter 11 of United States Bankruptcy Code in 2001-2002 after stock marked crash of 2000. Experimental results on FSVM illustrate that it is better capable of extracting useful information from corporate data. This is followed by a comparative study of FSVM with other approaches. FSVM is effective in finding optimal feature subset and parameters. This is evident from the results thus improving prediction of bankruptcy. The choice of feature subset has positive influence on appropriate kernel parameters and vice versa which demonstrate its appreciable generalization performance than traditional bankruptcy prediction methods. Choosing appropriate value of parameter plays an important role on the performance of FSVM model. The effect of variability in prediction performance of FSVM with respect to various values of different parameters of SVM is also investigated. Finally, a comparative study of clustering power of FSVM is made with PNN on ripley and bankruptcy datasets. The results show that FSVM has superior clustering power than PNN. (C) 2010 Elsevier B.V. All rights reserved.",
    "year": 2011,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "49b0fb28dacaa92595ea7d3d9b1fcaa1",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM",
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T01:46:39.570947"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用模糊支持向量机（FSVM）进行破产预测，这直接关系到信用风险评估，属于金融风险管理的范畴。论文明确提到使用财务比率作为预测因子，并提出了一种适应违约概率估计的方法，这些都是金融风险管理中的典型应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是使用模糊支持向量机（FSVM）进行破产预测，这直接关系到信用风险评估，属于金融风险管理的范畴。论文明确提到使用财务比率作为预测因子，并提出了一种适应违约概率估计的方法，这些都是金融风险管理中的典型应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:01:09.424080"
}