{
  "paper": {
    "id": 2265,
    "title": "Time-Weighted Nonnegative Adaptive Bridge Regression for Financial Index Tracking",
    "abstract": "Stocks have long been a major focus for study and investment, representing a significant portion of the investment market. The stock index is a crucial concern for investors. With advancements in financial technology and more thorough investment research, investors have become increasingly cautious, often constructing optimal investment portfolios. Recently, portfolio strategy research has frequently incorporated statistical models, with stock indices compiled using various methods playing a vital role. Index tracking methods are employed to create investment portfolios that match the performance of target market indices, aiming to achieve returns similar to those indices. The selection of individual stocks is critical in building an effective investment portfolio. Investors typically select multiple high-quality stocks to form an index-tracking investment portfolio. This article introduces a new exponential tracking method-nonnegative time-weighted adaptive bridge regression-that combines nonnegative variable selection and bridge estimation techniques. The paper details the estimation consistency, variable selection consistency, and asymptotic properties of the model. Meanwhile, the model is solved using the local group coordinate descent method. The tracking error measurement demonstrates that the model's fit surpasses that of the nonnegative variable selection method.",
    "year": 2024,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "4f697a23f4038090eb2ffaa4008552e0",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:05:04.487889"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "The paper focuses on developing a new method for index tracking, which is a key aspect of portfolio management. It discusses constructing investment portfolios to match the performance of target market indices, a core activity in portfolio management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Portfolio Management\"],\n  \"justification\": \"The paper focuses on developing a new method for index tracking, which is a key aspect of portfolio management. It discusses constructing investment portfolios to match the performance of target market indices, a core activity in portfolio management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:15:58.089412"
}