{
  "paper": {
    "id": 435,
    "title": "Credit risk evaluation with least square support vector machine",
    "abstract": "Credit risk evaluation has been the major focus of financial and banking industry due to recent financial crises and regulatory concern of Basel II. Recent studies have revealed that emerging artificial intelligent techniques are advantageous to statistical models for credit risk evaluation. In this study, we discuss the use of least square support vector machine (LSSVM) technique to design a credit risk evaluation system to discriminate good creditors from bad ones. Relative to the Vapnik's support vector machine, the LSSVM can transform a quadratic programming problem into a linear programming problem thus reducing the computational complexity. For illustration, a published credit dataset for consumer credit is used to validate the effectiveness of the LSSVM.",
    "year": 2006,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "b936b4203746d814e9ed3c8b4d8f34df",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM"
    ],
    "stage1_timestamp": "2025-05-15T01:50:52.634814"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on using least square support vector machine (LSSVM) for credit risk evaluation, which is a key aspect of financial risk management, particularly in assessing the likelihood of default by creditors.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on using least square support vector machine (LSSVM) for credit risk evaluation, which is a key aspect of financial risk management, particularly in assessing the likelihood of default by creditors.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:58:03.172281"
}