{
  "paper": {
    "id": 311,
    "title": "Potential formation mechanism and prediction of crude oil price based on underdetermined independent component analysis",
    "abstract": "In most crude oil price prediction, a few of them explored the potential formation mechanism of oil price. This study proposes a novel multi-scale integrated (MSI) learning paradigm to mine the potential formation mechanism of the crude oil price and predict the crude oil price. Firstly, we propose a novel underdetermined independent component analysis (UICA) model based on extreme-point symmetric mode decomposition (ESMD) and independent component analysis (ICA) to study the potential formation mechanism of crude oil price. Based on the representative independent components (ICs), we found and analyzed some factors affecting the crude oil price from high frequency to low frequency, as well as the potential formation mechanism of crude oil price, such as geopolitical implications, natural disasters, historical pricing data and copper futures price. Moreover, the ICs are predicted and generated the final forecasting result of crude oil price via radial basis function neural network (RBFNN). The experimental results based on the West Texas Intermediate (WTI) crude oil price, confirm that the proposed MSI model is superior to the existing prediction models in terms of statistical and error performance criteria and Diebold-Mariano (DM) test with the optimal Dstat=99.0220, MAE=0.0050, RMSE=0.0537, MAPE=0.0116, ESD=0.0007, R2=0.9960.",
    "year": 2024,
    "source": "WOS",
    "area": "derivatives_pricing",
    "method": "machine learning",
    "cache_key": "fe97723edd08e62fbda9173cd8df16f8",
    "relevant_keywords": [
      "machine learning",
      "unsupervised learning",
      "neural network",
      "feature representation",
      "representation learning"
    ],
    "stage1_timestamp": "2025-05-15T01:30:46.303502"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究原油价格的潜在形成机制和预测方法，虽然涉及金融数据，但并未明确指出其在衍生品定价、金融风险管理或投资组合管理等特定金融领域的应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究原油价格的潜在形成机制和预测方法，虽然涉及金融数据，但并未明确指出其在衍生品定价、金融风险管理或投资组合管理等特定金融领域的应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:05:36.902744"
}