{
  "paper": {
    "id": 4171,
    "title": "Understanding the economic determinants of the severity of operational losses: A regularized generalized Pareto regression approach",
    "abstract": "We investigate a novel database of 10,217 extreme operational losses from the Italian bank UniCredit. Our goal is to shed light on the dependence between the severity distribution of these losses and a set of macroeconomic, financial, and firm-specific factors. To do so, we use generalized Pareto regression techniques, where both the scale and shape parameters are assumed to be functions of these explanatory variables. We perform the selection of the relevant covariates with a state-of-the-art penalized-likelihood estimation procedure relying on L-1-penalty terms. A simulation study indicates that this approach efficiently selects covariates of interest and tackles spurious regression issues encountered when dealing with integrated time series. Lastly, we illustrate the impact of different economic scenarios on the requested capital for operational risk. Our results have important implications in terms of risk management and regulatory policy.",
    "year": 2018,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "e8b5fc2594f9121fa063671790003bb7",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:34:13.337233"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on analyzing the severity distribution of operational losses in a banking context, using advanced regression techniques to understand the impact of various economic factors. This directly relates to the assessment and management of operational risk, which is a key component of financial risk management. The study's implications for regulatory policy and capital requirements further underscore its relevance to this field.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on analyzing the severity distribution of operational losses in a banking context, using advanced regression techniques to understand the impact of various economic factors. This directly relates to the assessment and management of operational risk, which is a key component of financial risk management. The study's implications for regulatory policy and capital requirements further underscore its relevance to this field.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:33:53.233867"
}