{
  "paper": {
    "id": 2634,
    "title": "Cryptocurrency Price Prediction by Using Hybrid Machine Learning and Beetle Antennae Search Approach",
    "abstract": "Cryptocurrencies are defined as digital mediums of exchange, that use strong cryptography for securing the transactions and verifying the ownership of the coins. Blockchain operates in the background to guarantee the security, transparency and traceability of the transactions. Consequently, cryptocurrencies became more and more popular and established their considerable presence in financial sector. However, one of the major drawbacks in the cryptocurrency market is the unreliability and unpredictability of their values, that poses a major risk for any kind of investment. Predicting the price of cryptocurrencies is therefore a hot research domain today. This paper proposes a novel method to predict the prices, that is based on a hybrid machine learning and swarm intelligence approach. The results of the conducted experiments suggest that the proposed model obtains higher accuracy than other recent similar approaches, and that it can be successfully applied for this important task.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "6abf1698c1fc5e397575a89bebed9130",
    "relevant_keywords": [
      "machine learning",
      "regression",
      "neural network",
      "deep learning",
      "representation learning",
      "backpropagation",
      "BP",
      "hidden layer",
      "recurrent neural network",
      "long short-term memory",
      "LSTM"
    ],
    "stage1_timestamp": "2025-05-15T02:17:32.153394"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究加密货币价格预测，虽然与金融领域相关，但并未明确指出其核心技术应用于衍生品定价、金融风险管理或投资组合管理等特定金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究加密货币价格预测，虽然与金融领域相关，但并未明确指出其核心技术应用于衍生品定价、金融风险管理或投资组合管理等特定金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:41:06.000523"
}