{
  "paper": {
    "id": 3723,
    "title": "A new two-stage hybrid approach of credit risk in banking industry",
    "abstract": "The rationale under the analyses is to propose a new approach by three kinds of two-stage hybrid models of logistic regression-ANN, to explore if the two-stage hybrid model outperformed the traditional ones, and to construct a financial distress warning system for banking industry in Taiwan. The differences from the literatures are that this Study adopts the optimal cutoff point approach proposed by Hosmer and Lemeshow [Hosmer, D. W.. & Lemeshow, S. L. (2000). Applied logistic regression (2nd ed.). New York: A Wiley-Interscience], to determine the cutoff point for financial distress. Additionally, cross-validation [Efron, B., & Tibsilirani, R.J. (1993). Ail introduction to the bootstrap. New York: Chapman and Hall: Stone, M. (1974). Cross-validation choice and assessment of statistical predictions. Journal of Royal Statistical Society. Series B, 36, 111-147] is used to evaluate the prediction power of the constructed models. The results find the factors of observable loans to total loans, allowance for doubtful accounts recovery rate, and interest-sensitive assets to liabilities ratio are significantly related to the financial distress of banks in Taiwan. In the prediction of financially distressed, two-stage hybrid model giving the best performance of 80.0% using cross-validation approach and demonstrates stronger prediction power than conventional logistic regression, logarithm logistic regression, and ANN approaches. It demonstrates that the two-stage hybrid model outperforms the conventional method, providing an alternative in handling credit risk modeling which have assessment implications for analysts, practitioners, and regulators. (C) 2008 Elsevier Ltd. All rights reserved.",
    "year": 2009,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "236638309d7fd5d6779afa5fe507dc52",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "regression",
      "neural network",
      "backpropagation",
      "BP"
    ],
    "stage1_timestamp": "2025-05-15T02:29:27.958306"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on developing a two-stage hybrid model for credit risk assessment in the banking industry, specifically aiming to predict financial distress. This directly pertains to the management of credit risk, which is a key component of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on developing a two-stage hybrid model for credit risk assessment in the banking industry, specifically aiming to predict financial distress. This directly pertains to the management of credit risk, which is a key component of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:35:32.320143"
}