{
  "paper": {
    "id": 2998,
    "title": "On the comparative performance of socially responsible and Islamic mutual funds",
    "abstract": "This is the first study to provide comprehensive analyses of the relative performance of both socially responsible investment (SRI) and Islamic mutual funds. The analysis proceeds in two stages. In the first, the performance of the two categories of funds is measured using partial frontier methods. In the second stage, we use quantile regression techniques. By combining two variants of the Free Disposal Hull (FDH) methods (order-m and order-alpha) in the first stage of analysis and quantile regression in the second stage, we provide detailed analyses of the impact of different covariates across methods and across different quantiles. In spite of the differences in the screening criteria and portfolio management of both types of funds, variation in the performance is only found for some of the quantiles of the conditional distribution of mutual fund performance. We established that for the most inefficient funds the superior performance of SRI funds is significant. In contrast, for the best mutual funds this evidence vanished and even Islamic funds perform better than SRI. These results show the benefits of performing the analysis using quantile regression. (C) 2013 Elsevier B.V. All rights reserved.",
    "year": 2014,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "5a3b7189952224dd965622256f6ae7f5",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:12:42.996197"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文主要研究社会责任投资(SRI)和伊斯兰共同基金的相对表现，涉及基金绩效评估和投资组合管理策略的比较，属于投资组合管理领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文主要研究社会责任投资(SRI)和伊斯兰共同基金的相对表现，涉及基金绩效评估和投资组合管理策略的比较，属于投资组合管理领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:11:56.767448"
}