{
  "paper": {
    "id": 6398,
    "title": "Innovation, financial risk and natural resources for sustainable development: Fresh evidence from BRICS economies",
    "abstract": "The nexus between sustainable development, total natural resource rents (TNRR), technological innovation (ATI) and financial risk index (FRI) has been studied in this research. The objective of this study is to investigate this impact on the BRICS economies while employing the panel data from 1990 to 2020. The study utilized slope heterogeneity, cross-sectional dependency and cross-sectional augmented Im, Pesaran and Shin unit root tests to suggest an accurate method of regression. The study added its findings by utilizing a method of moment quantile regression, and found that TNRR and FRI are negatively related to the sustainable development. At the same time, its impact decreases with the increase in each quarter-based quantiles. Whereas, ATI is positively associated with sustainable development, the results also revealed that its impact decreases with the increase in each quarter-based quantile. Furthermore, the simple quantile regression and Dumitrescu-Hurlin Panel Causality Test were used as a robust method. Where, the simple quantile regression revealed that TNRR and FRI negatively affect sustainable development in BRICS countries while ATI has positive impact on sustainable development. According to this study, the BRICS economies will benefit from less TNRR dependence in two ways: first, as fossil fuel prices decline, money can be redirected to more environmentally friendly activities like renewable energy production, green technological advancement, and renewable energy research and development. Second, when fossil fuel use declines, especially in the industrial sector, growing use of renewable energy sources may lead to lower overall natural resource rents. Third, the BRICS nations' development process will be greatly accelerated and strengthened as a result of the greatest impact of the decrease in FRI.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "3439750dbf3b9fcaf2f9459d359821ae",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:57:38.792630"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究可持续发展与自然资源租金、技术创新及金融风险指数之间的关系，虽然涉及金融风险指数，但其核心研究并不专注于金融风险管理、衍生品定价或投资组合管理等特定金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究可持续发展与自然资源租金、技术创新及金融风险指数之间的关系，虽然涉及金融风险指数，但其核心研究并不专注于金融风险管理、衍生品定价或投资组合管理等特定金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:27:54.368045"
}