{
  "paper": {
    "id": 3078,
    "title": "Carbon trading price forecasting based on parameter optimization VMD and deep network CNN-LSTM model",
    "abstract": "To meet carbon peak and neutrality targets, accurate carbon trading price forecasting is very important for enterprises making emission reduction decisions. By fusing convolutional neural network (CNN) and long short-term memory network (LSTM), the CNN-LSTM model is constructed. After variational mode decomposition (VMD), several intrinsic mode functions (IMFs) components are obtained and input into the CNN-LSTM model, thus constructing the combined sooty tern optimization algorithm (STOA)-VMD-CNN-LSTM forecasting model. To test this model, the carbon trading prices of the carbon emission trading markets of Hubei, Guangdong and Shenzhen were forecast. The prediction performance of the STOA-VMD-CNN-LSTM model is compared with ARIMA, BP, CNN and LSTM benchmark models and models combining different decomposition technologies. The international carbon trading price (EUR and CER) is used for prediction. Compared with other methods, the developed model makes fewer errors and achieves superior performance. Several important implications are provided for investors and risk managers involved in carbon financial products.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "060003df3870d395869cd04d3c1bb3c1",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "neural network",
      "convolutional neural network",
      "CNN",
      "long short-term memory",
      "LSTM",
      "backpropagation",
      "BP"
    ],
    "stage1_timestamp": "2025-05-15T02:22:25.082158"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用深度学习模型预测碳交易价格，这有助于企业和投资者管理碳金融产品的价格波动风险，属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是使用深度学习模型预测碳交易价格，这有助于企业和投资者管理碳金融产品的价格波动风险，属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:38:30.963723"
}