{
  "paper": {
    "id": 3770,
    "title": "A credit scoring model for SMEs using AHP and TOPSIS",
    "abstract": "Small and Medium Enterprises (SMEs) have played a significant role in the development of any economy. However, easy access to finance from financial institutions is a prime challenge for them. Similarly, financial institutions also face difficulties while selecting the potential SMEs for granting credit. The SMEs are often seen as unorganized in terms of financial data as compared to large corporate sectors. The credit risk assessment based on unorganized financial data is a challenge for financial institutions. Most of the existing models used regression to predict the possibility of default of SMEs. However, the regression model may not perform well with limited data points and missing data. The problem can be solved by using a multi criteria decision-making (MCDM) model. Credit scoring, especially addressing the SMEs, has been infrequently reported in the archived literature. To fill the gaps of literature, the present study proposes a credit scoring model applying the hybrid analytic hierarchy process-technique for order of preference by similarity to ideal solution (AHP-TOPSIS) technique. The study has been carried out in three stages. In the first stage, credit rating criteria and sub-criteria have been identified from the literature review and taking opinions from experts. In the second stage, weights of criteria and sub-criteria have been calculated using AHP. Finally, in the third stage, weights calculated by AHP have been used in TOPSIS to determine the credit score. The effectiveness of the proposed model has been illustrated through a case study. Further, the results of the proposed model are compared with the commercially available ratings. The proposed model may be a low-cost alternative for financial institutions for credit scoring of SMEs. Further, the model has the advantage of customization as per the needs of the financial institutions. The suggested model can help the managers to identify the potential SMEs for granting credit.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "97e8817bc673e7bb8bf80274d1311a41",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:29:59.119671"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文提出了一种用于中小企业信用评分的模型，主要目的是评估信用风险，这属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文提出了一种用于中小企业信用评分的模型，主要目的是评估信用风险，这属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:35:09.534340"
}