{
  "paper": {
    "id": 2110,
    "title": "Risk and risk management in the credit card industry",
    "abstract": "Using account-level credit card data from six major commercial banks from January 2009 to December 2013, we apply machine-learning techniques to combined consumer tradeline, credit bureau, and macroeconomic variables to predict delinquency. In addition to providing accurate measures of loss probabilities and credit risk, our models can also be used to analyze and compare risk management practices and the drivers of delinquency across banks. We find substantial heterogeneity in risk factors, sensitivities, and predictability of delinquency across banks, implying that no single model applies to all six institutions. We measure the efficacy of a bank's risk management process by the percentage of delinquent accounts that a bank manages effectively, and find that efficacy also varies widely across institutions. These results suggest the need for a more customized approached to the supervision and regulation of financial institutions, in which capital ratios, loss reserves, and other parameters are specified individually for each institution according to its credit risk model exposures and forecasts. (C) 2016 The Authors. Published by Elsevier B.V.",
    "year": 2016,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "5f71ae49084abea7034f83909cfcf897",
    "relevant_keywords": [
      "machine learning",
      "classification",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:10:59.115334"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要应用机器学习技术预测信用卡违约，分析不同银行的风险管理实践和违约驱动因素，这直接属于金融风险管理的范畴。论文未涉及衍生品定价或投资组合管理的内容。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"该论文主要应用机器学习技术预测信用卡违约，分析不同银行的风险管理实践和违约驱动因素，这直接属于金融风险管理的范畴。论文未涉及衍生品定价或投资组合管理的内容。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:44:06.515221"
}