{
  "paper": {
    "id": 184,
    "title": "A New Method Of Credit Risk Assessment Of Commercial Banks",
    "abstract": "Credit risk management has been one of the most serious problems for banks and other financial institutions. With the continuous improvement of the economic system reform of our country, the establishment of market mechanism and perfect, the rapid development of capital markets and the banking sector, the existing credit evaluation system and method have been unable to keep up with the needs of the reform and development of economy in our country. In this paper, a model based on fuzzy integral support vector machine (SVM) is established, which takes into account the importance of the output of the sub support vector machine (SVM). Then the The empirical is analysis is carried out, and the results show that the method has higher classification accuracy, and verifies the feasibility and effectiveness of the method, and provides a theoretical basis for the bank to establish more reliable evaluation system.",
    "year": 2016,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "6173459b1bb897548215647c6dacfd40",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM"
    ],
    "stage1_timestamp": "2025-05-15T01:47:52.998416"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on developing a model for credit risk assessment in commercial banks, which is a key aspect of financial risk management. The proposed method aims to improve the reliability of credit evaluation systems, directly addressing risk management challenges faced by financial institutions.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on developing a model for credit risk assessment in commercial banks, which is a key aspect of financial risk management. The proposed method aims to improve the reliability of credit evaluation systems, directly addressing risk management challenges faced by financial institutions.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:00:21.575830"
}