{
  "paper": {
    "id": 489,
    "title": "RETRACTED: Research on Agricultural Economic Early Warning Based on Genetic Algorithm and SVM (Retracted Article)",
    "abstract": "Agriculture is unique in that the industry is subject to a certain level of uncertainty due to seasonal and other factors, and its risk level is significantly higher than that of other industries. Therefore, it is necessary to establish an appropriate financial early warning model to predict, analyze, and control its financial risks. The article uses a genetic algorithm and support vector machine-based economic forecasting model for agribusinesses to adapt its own pollutant weights in a practical application environment to improve the forecasting accuracy. This model first uses a genetic algorithm to train a feature weight vector of current data so that the weights are adapted to the current prediction problem and then uses this feature weight vector to apply to SVM model training. It is found that 62.79% of the listed agricultural companies are in warning status, and their development is not optimistic. The article provides new ideas for the subsequent research on financial warning methods and also expands the boundaries of theoretical research for the research system of financial warning problems and enriches the experience and evidence of practical research.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "c4b8fa8165f3cd74dcbba58bea588a8f",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "support vector machine",
      "SVM",
      "classification",
      "feature learning",
      "feature representation"
    ],
    "stage1_timestamp": "2025-05-15T01:51:31.288966"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要研究基于遗传算法和支持向量机的农业经济预警模型，旨在预测、分析和控制农业企业的财务风险，这属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文主要研究基于遗传算法和支持向量机的农业经济预警模型，旨在预测、分析和控制农业企业的财务风险，这属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:57:37.639698"
}