{
  "paper": {
    "id": 5869,
    "title": "Multinomial Ordinal Response Models",
    "abstract": "For managing of credit risk in banks, it is fundamental to decide to which customer a loan or service will be offered and to which one it will not. The banks use many methods modeling and forecasting risk - application scorecards, probability of default etc. Inside these methods mainly binary models and logistic regression as technique are applied. The article intends to shortly illustrate and describe extension of these models on situations where response (dependent) variable has more than two categories. The binary models (or dichotomous, i.e. models in which dependent variable has just two categories) are not the only ones, it is possible to use models in which dependent variable has more than two categories - multinomial models. There are two main groups of such models: with ordered (ordinal) categories and non-ordered (nominal) categories of the dependent variable. The article describes representatives from both groups, but focus on ordinal models, which are likely to be used in the financial institutions than nominal ones. For both groups practical examples are calculated and their results are discussed.",
    "year": 2013,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "06cfa626442acd931fbbf5a015a4202d",
    "relevant_keywords": [
      "classification",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:52:31.366245"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on extending binary models to multinomial ordinal response models for credit risk assessment in banks, which is a core aspect of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on extending binary models to multinomial ordinal response models for credit risk assessment in banks, which is a core aspect of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:28:57.601269"
}