{
  "paper": {
    "id": 45,
    "title": "A survey on deep learning for financial risk prediction",
    "abstract": "The rapid development of financial technology not only provides a lot of convenience to people's production and life, but also brings a lot of risks to financial security. To prevent financial risks, a better way is to build an accurate warning model before the financial risk occurs, not to find a solution after the outbreak of the risk. In the past decade, deep learning has made amazing achievements in the fields, such as image recognition, natural language processing. Therefore, some researchers try to apply deep learning methods to financial risk prediction and most of the results are satisfactory. The main work of this paper is to review the predecessors' work of deep learning for financial risk prediction according to three prominent characteristics of financial data: heterogeneity, multi-source, and imbalance. We first briefly introduced some classical deep learning models as the model basis of financial risk prediction. Then we analyzed the reasons for these characteristics of financial data. Meanwhile, we studied the differences of commonly used deep learning models according to different data characteristics. Finally, we pointed out some open issues with research significance in this field and suggested the future implementations that might be feasible.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "deep learning",
    "cache_key": "57b3f567c06bffb0b9f3e4c129414e2b",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "neural network",
      "representation learning",
      "backpropagation",
      "BP",
      "hidden layer",
      "convolutional neural network",
      "CNN",
      "recurrent neural network",
      "long short-term memory",
      "LSTM",
      "autoencoder",
      "dropout regularization"
    ],
    "stage1_timestamp": "2025-05-15T01:33:11.353139"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要讨论了深度学习在金融风险预测中的应用，特别是针对金融数据的异质性、多源性和不平衡性进行建模，这直接属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文主要讨论了深度学习在金融风险预测中的应用，特别是针对金融数据的异质性、多源性和不平衡性进行建模，这直接属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:04:47.358826"
}