{
  "paper": {
    "id": 1509,
    "title": "The use of multi-criteria decision-making methods in project portfolio selection: a literature review and future research directions",
    "abstract": "In most project portfolio selection (PPS) situations, the presence of multiple attributes and decision-maker preference is inevitable. As Multi-criteria Decision Analysis (MCDA) methods provide a framework well-suited to deal with these challenges in PPS problems, the use of MCDA methods in real-life PPS problems has increased in recent years. This paper provides a comprehensive literature review of the use of different MCDA methods and their individual or combined utilization with other modeling techniques to support PPS problems. First, we summarize how MCDA methods are used in different modeling approaches. Second, we examine the mathematical models that are generally used to combine MCDA with mathematical programming techniques to solve PPS problems with resource constraints. Third, we present the drawbacks of combined utilization and discuss recent advances. Finally, we visualize the summary of the reviewed papers as a decision tree to assist researchers and practitioners in the use of MCDA methods in a specific PPS context and propose some future research directions.",
    "year": 2024,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "44b9d1c4b566ef21491e7030f0659ae3",
    "relevant_keywords": [
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T00:56:39.026315"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要关注多准则决策分析（MCDA）方法在项目组合选择（PPS）中的应用，虽然涉及组合选择的概念，但其核心应用场景是项目管理而非金融投资组合管理。论文未提及衍生品定价或金融风险管理的相关内容。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要关注多准则决策分析（MCDA）方法在项目组合选择（PPS）中的应用，虽然涉及组合选择的概念，但其核心应用场景是项目管理而非金融投资组合管理。论文未提及衍生品定价或金融风险管理的相关内容。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:20:38.190609"
}