{
  "paper": {
    "id": 5406,
    "title": "Expected Shortfall Reliability-Added Value of Traditional Statistics and Advanced Artificial Intelligence for Market Risk Measurement Purposes",
    "abstract": "The Fundamental Review of the Trading Book is a market risk measurement and management regulation recently issued by the Basel Committee. This reform, often referred to as Basel IV, intends to strengthen the financial system. The newest capital standard relies on the use of the Expected Shortfall. This risk measure requires to get sufficient information in the tails to ensure its reliability, as this one has to be alimented by a sufficient quantity of relevant data (above the 97.5 percentile in the case of the regulation or interest). In this paper, after discussing the relevant features of Expected Shortfall for risk measurement purposes, we present and compare several methods allowing to ensure the reliability of the risk measure by generating information in the tails. We discuss these approaches with respect to their relevance considering the underlying situation when it comes to available data, allowing practitioners to select the most appropriate approach. We apply traditional statistical methodologies, for instance distribution fitting, kernel density estimation, Gaussian mixtures and conditional fitting by Expectation-Maximisation as well as AI related strategies, for instance a Synthetic Minority Over-sampling Technique implemented in a regression environment and Generative Adversarial Nets.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "f279a4450cdb342481a1b3258d6710cd",
    "relevant_keywords": [
      "machine learning",
      "regression",
      "neural network",
      "deep learning",
      "Generative Adversarial Nets"
    ],
    "stage1_timestamp": "2025-05-15T02:47:14.098029"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要讨论了Expected Shortfall（预期短缺）在市场风险测量中的应用，并比较了多种方法来确保风险测量的可靠性。这直接涉及金融风险管理领域，特别是市场风险的测量和管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文主要讨论了Expected Shortfall（预期短缺）在市场风险测量中的应用，并比较了多种方法来确保风险测量的可靠性。这直接涉及金融风险管理领域，特别是市场风险的测量和管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:30:31.938887"
}