{
  "paper": {
    "id": 6843,
    "title": "Credit scoring for microfinance: is it worth it?",
    "abstract": "Due to growing competition, over-indebtedness, and economic crises, microfinance institutions have to pursue their social and financial objectives in an increasingly constrained environment. Developing powerful risk management tools becomes more than ever crucial to survive. Therefore this paper analyzes whether microfinance institutions can benefit from credit scoring, which has been successfully adopted in retail banking. An extensive literature overview is provided, indicating a lack of quantitative evidence, in particular for markets in Eastern Europe-Central Asia and the Middle East-Northern Africa. Two logistic regression-based scoring models are developed using data from a BosniaHerzegovinian microlender. The models are assessed in terms of stability, readability, and discriminatory power, indicating that credit scoring is not yet able to fully replace the human-intensive microfinance credit process. However, it is recommendable to introduce credit scoring as a refinement tool in the lending process, in order to combine both statistical and human best practices. Moreover, a microlender staff can learn from credit scoring models to validate or contrast practical intuition. Copyright (c) 2011 John Wiley & Sons, Ltd.",
    "year": 2012,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "7462a31bed755bda8e9416fc2764b098",
    "relevant_keywords": [
      "classification",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T03:02:07.504970"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on developing credit scoring models for microfinance institutions to manage credit risk, which is a key aspect of financial risk management. The study uses logistic regression-based models to assess creditworthiness, aiming to enhance the lending process and mitigate default risks.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on developing credit scoring models for microfinance institutions to manage credit risk, which is a key aspect of financial risk management. The study uses logistic regression-based models to assess creditworthiness, aiming to enhance the lending process and mitigate default risks.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:27:07.826831"
}