{
  "paper": {
    "id": 1505,
    "title": "Leveraging Multi-source Data for Local Government Financing Vehicles Debt Risk Assessment Via Random Forests",
    "abstract": "Local government financing vehicles (LGFVs), in China, are pivotal indirect financing channels for urban development projects. However, the significant debt accumulated by these vehicles presents considerable long-term risks, including challenges to fiscal sustainability, threats to financial system stability, and disruptions to regional economic development. Timely monitoring of LGFV debt risks is essential for enabling effective interventions. This study develops a robust risk evaluation system for LGFVs by leveraging multi-source data and employing the Random Forest (RF) machine learning algorithm. We collected and analyzed a sample of 1584 Chinese LGFVs from a major state-owned bank. Through an examination of the mechanisms underlying LGFV debt risk and a review of relevant literature, we identified seven primary categories and 20 key risk indicators to construct our risk indicator system. After comparing several machine learning algorithms, we selected the RF algorithm to build the LGFV debt risk prediction model due to its superior performance. Our findings emphasize the External Guarantee Ratio, GDP growth rate, and proportion of the tertiary industry as critical risk indicators. The model evaluation demonstrates high accuracy, underscoring its significant potential for practical application. This study contributes to the management of local government debt risks and introduces a novel methodology with potential applicability in other areas of risk management.",
    "year": 2025,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "0b0199aadd56437ba75e3f250c6221bf",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "decision tree",
      "Random Forest"
    ],
    "stage1_timestamp": "2025-05-15T02:03:39.844708"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用随机森林算法构建地方政府融资平台债务风险评估模型，旨在监控和管理债务风险，这直接属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是使用随机森林算法构建地方政府融资平台债务风险评估模型，旨在监控和管理债务风险，这直接属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:48:41.312680"
}