{
  "paper": {
    "id": 754,
    "title": "Application of Big Data Unbalanced Classification Algorithm in Credit Risk Analysis of Insurance Companies",
    "abstract": "The 2008 global financial crisis triggered by subprime mortgage crisis in the United States and the ongoing European debt crisis have urged governments and academics to pay high attention to financial industry risk supervision. The financial industry has actively implemented comprehensive risk management. As an important component of the financial industry, the insurance industry implements comprehensive risk management to control the risks of insurance companies. Propose an integrated learning model based on imbalanced dataset resampling and apply it to UCI dataset (University of California Irvine). First, resampling technology is used to preprocess the unbalanced dataset to obtain a relatively balanced training set. Then, use the classic backpropagation neural network, classic k-nearest neighbor, and classic Naive Bayes three algorithms as the base classifier and use the Bagging strategy to get the ensemble learning model. In order to verify its effectiveness, F-measure and G-mean methods are used to measure the performance of the classifier. The subject mainly focuses on the classification of relevance vector machine (RVM) in two types of large-scale datasets, imbalanced and balanced, and proposes solutions for these two types of data. This explains the effectiveness of the disequilibrium classification algorithm used in the risk analysis of insurance companies.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "3671d2fc601ee56d30d9d6766f72eff7",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "neural network",
      "backpropagation",
      "BP",
      "support vector machine",
      "SVM"
    ],
    "stage1_timestamp": "2025-05-15T01:54:34.143556"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要研究不平衡分类算法在保险公司信用风险分析中的应用，这属于金融风险管理的范畴。论文明确提到金融行业风险监管和保险公司风险控制，并应用机器学习模型进行信用风险分析。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文主要研究不平衡分类算法在保险公司信用风险分析中的应用，这属于金融风险管理的范畴。论文明确提到金融行业风险监管和保险公司风险控制，并应用机器学习模型进行信用风险分析。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:55:23.439139"
}