{
  "paper": {
    "id": 9034,
    "title": "Recession, recovery and suicide in mental health patients in England: time trend analysis",
    "abstract": "Background The 2008 economic recession was associated with an increase in suicide internationally. Studies have focused on the impact in the general population with little consideration of the effect on people with a mental illness. Aims To investigate suicide trends related to the recession in mental health patients in England. Method Using regression models, we studied suicide trends in mental health patients in England before, during and after the recession and examined the demographic and clinical characteristics of the patients. We used data from the National Confidential Inquiry into Suicide and Safety in Mental Health, a national data-set of all suicide deaths in the UK that includes detailed clinical information on those seen by services in the last 12 months before death. Results Between 2000 and 2016, there were 21 224 suicide deaths by patients aged 16 or over. For male patients, following a steady fall of 0.5% per quarter before the recession (quarterly percent change (QPC) 2000-2009 -0.46%, 95% CI -0.66 to -0.27), suicide rates showed an upward trend during the recession (QPC 2009-2011 2.37%, 95% CI -0.22 to 5.04). Recession-related rises in suicide were found in men aged 45-54 years, those who were unemployed or had a diagnosis of substance dependence/misuse. Between 2012 and 2016 there was a decrease in suicide in male patients despite an increasing number of patients treated. No significant recession-related trends were found in women. Conclusions Recession-associated increases in suicide were seen in male mental health patients as well as the male general population, with those in mid-life at particular risk. Support and targeted interventions for patients with financial difficulties may help reduce the risk at times of economic hardship. Factors such as drug and alcohol misuse also need to be considered. Recent decreases in suicide may be related to an improved economic context or better mental healthcare. Declaration of interest N.K. is supported by Greater Manchester Mental Health NHS Foundation Trust. L.A. chairs the National Suicide Prevention Strategy Advisory Group at the Department of Health (of which N.K. is also a member) and is a non-executive Director for the Care Quality Commission. N.K. chairs the National Institute for Health and Care Excellence (NICE) depression in adults guideline and was a topic expert member for the NICE suicide prevention guideline.",
    "year": 2019,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "cc9b29d9a7f73dab62171ec203f3c18d",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T03:24:54.900768"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究经济衰退对心理健康患者自杀率的影响，虽然涉及经济因素，但其核心技术（回归模型）并未应用于衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究经济衰退对心理健康患者自杀率的影响，虽然涉及经济因素，但其核心技术（回归模型）并未应用于衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:25:12.854769"
}