{
  "paper": {
    "id": 2247,
    "title": "Classification Algorithms in Financial Application: Credit Risk Analysis on Legal Entities",
    "abstract": "This research aims at analyzing bank credit of legal entity (in non-default, default and temporarily default), for the purpose of assisting the decision made by the analyst of this area. For that, we used Artificial Neural Networks (ANNs), more specifically, the Multilayer Perceptron (MLP) and the Radial Basis Functions (RBF) and, also, the statistical model of Logistic Regression (LR). For the implementation of the ANNs and LR, the softwares MATLAB and SPSS were used, respectively. For the simulations developed 5,432 data with 15 attributes were collected by the experts of the institution bank (called XYZ). The results show that the default clients are easily identifiable, but for the non-delinquent clients and for the temporarily defaulters, the techniques had greater difficulty in the discrimination, suggesting that they are no so discriminants. This work presents new insights towards research over Credit Risk Assessment showing a different possibility of client classification and codification, allowing different types of studies to take place.",
    "year": 2019,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "71a3f146fdc753427dd69e9d79bb7ace",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "neural network",
      "backpropagation",
      "BP",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T02:12:51.056197"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on analyzing bank credit risk for legal entities using machine learning techniques, which is a core aspect of financial risk management, specifically credit risk assessment.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on analyzing bank credit risk for legal entities using machine learning techniques, which is a core aspect of financial risk management, specifically credit risk assessment.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:43:40.084916"
}