{
  "paper": {
    "id": 1984,
    "title": "Quantitative investment model based on data mining",
    "abstract": "Quantitative investment is the process of establishing mathematical models using statistics, information technology, and mathematics to quantify and implement risks, returns, and traditional investment concepts. However, due to the backwardness of computing tools in the past, quantitative investment has not received much recognition. With the improvement of computer science and quantitative analysis theory, traditional fundamental analysis and the use of sampling statistical technology to build advanced mathematical models for investment analysis have failed to meet the requirements of investors. Therefore, the Quantitative investment strategies based on data mining technology are receiving more and more attention. In this paper, we uses MATLAB software to capture big data from financial and economic websites, and then uses neural network training models to predict the trend of stock changes, and finally establishes a suitable quantitative stock selection model. The simulation results show that only by using quantitative stock selection strategies to curb risks and selecting a suitable investment portfolio can achieve the ideal goals in the stock market.",
    "year": 2020,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "388d00b5bb55209d8980a408fbd71b8a",
    "relevant_keywords": [
      "neural network",
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T01:01:41.667902"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文主要讨论了使用数据挖掘技术和神经网络模型来预测股票变化趋势，并建立定量选股模型以实现理想投资目标。这直接涉及投资组合的构建和管理，属于投资组合管理领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文主要讨论了使用数据挖掘技术和神经网络模型来预测股票变化趋势，并建立定量选股模型以实现理想投资目标。这直接涉及投资组合的构建和管理，属于投资组合管理领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:17:48.762230"
}