{
  "paper": {
    "id": 3397,
    "title": "Changes in sustainable growth dynamics: The case of China and Russia gas industries",
    "abstract": "In this research, the authors try to find solutions for Russian and Chinese gas companies' sustainable growth. With the help of Lasso regression, linear regression and forecasting model, the authors define financial and nonfinancial indicators influence the Chinese and Russian gas companies' sustainable growth rate. Results indicate that the most influential nonfinancial factors for the Russian gas companies' sustainable growth rate are Energy Return on Investment and Return on Labor indicators while financial factors are the cost of the company, net working capital return on fixed assets, and debt-equity ratio. The situation is not the same for Chinese gas companies where the most significant non-financial factors are energy savings, return on ecological protection expenses and financial are a cost of the company, net profit growth, current ratio and earnings before interests and taxis. All three suggested scenarios for the Russian gas industry are quite positive with the most probable scenario having a 5-10% sustainable growth rate growth until 2030. There is a risk of descent in the level of the Chinese gas companies' sustainable rate if they would concern only financial questions. In another case, if China's gas companies choose the way to focus on energy efficiency, energy savings and environmental protection, the high level of the sustainable growth rate growth until 2030 would be observed as predicted by research calculations.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "97362aad0fc52bfcc50f8840c1f62738",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:25:40.219506"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究中国和俄罗斯天然气公司的可持续增长动态，使用了回归和预测模型来分析财务和非财务指标的影响。虽然涉及财务指标，但研究重点是企业可持续增长策略，并未直接涉及衍生品定价、金融风险管理或投资组合管理等金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究中国和俄罗斯天然气公司的可持续增长动态，使用了回归和预测模型来分析财务和非财务指标的影响。虽然涉及财务指标，但研究重点是企业可持续增长策略，并未直接涉及衍生品定价、金融风险管理或投资组合管理等金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:36:50.041339"
}