{
  "paper": {
    "id": 463,
    "title": "Intelligent System to Detect Malicious URLs Using Machine-Learning Algorithms",
    "abstract": "Digital technology has made significant advancements in recent years, particularly on the Internet. Since most of our activities are now conducted online, this development is of particular significance. The continuous evolution of cyber threats has led to a heightened risk of cyberattacks, driven by the inventive tactics employed by malicious actors. Among these threats, one of the most perilous is the malicious URL, meticulously crafted to illicitly obtain information from unsuspecting novice end users. Such attacks compromise user systems and incur annual financial losses in the billions of dollars. Consequently, there is a growing imperative to fortify website defenses. The principal objective of this study is to develop a machine-learning model capable of discerning between malicious and legitimate URLs based on carefully selected parameters for each category. This research employs a variety of machine learning techniques, including decision tree (DT), logistic regression (LR), multi-layer perceptron (MLP), and naive Bayes (NB), while exploring different hyperparameter configurations to classify URLs as safe or malicious. Upon analyzing the experimental results, it is evident that the 'tanh' activation function of MLP in conjunction with the 'adam' solver achieves the highest accuracy rate of 80.01%. This underscores the effectiveness of our approach in enhancing cybersecurity measures against malicious URLs.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "5a94d550d36268240817a9d70c1b90ac",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "decision tree",
      "neural network",
      "tanh"
    ],
    "stage1_timestamp": "2025-05-15T01:51:31.169680"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究使用机器学习算法检测恶意URL，以提高网络安全，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究使用机器学习算法检测恶意URL，以提高网络安全，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:57:40.831487"
}