{
  "paper": {
    "id": 7819,
    "title": "Is avoidable diabetes-related hospitalization in older patients with type 2 diabetes mellitus associated with increased health expenditure?: A nationwide retrospective cohort study in South Korea",
    "abstract": "Objective: With South Korea's population aging rapidly, the number of patients with type 2 diabetes mellitus (T2DM) is expected to rise, leading to worsened health outcomes and potentially straining healthcare financing. This study aimed to investigate how avoidable diabetes-related hospitalizations affect short- and long-term health expenditures. Methods: Data from the National Health Insurance Service-Senior cohort from 2008 to 2019 in South Korea. A total of 27,081 participants aged 60 years and older who were diagnosed with T2DM were included in the study. The independent variable in this study was avoidable diabetes-related hospitalization according to the ICD-10 criteria E11. The outcome measures included one- and five-year health expenditures. Regression analysis was performed using the generalized estimating equation (GEE) with a gamma distribution and log-link function. Inverse Probability of Treatment Weighting (IPTW) analysis was conducted to enhance the robustness of the results. Results: Out of the 27,081 participants, 685 patients (2.5 %) experienced avoidable diabetes-related hospitalizations. GEE analysis with IPTW weights revealed that participants who experienced avoidable hospitalizations had a higher risk of increased health expenditures (one-year: relative risk (RR) 1.83, 95 % CI 1.76-1.91; fiveyear: RR 1.63, 95 % CI 1.57-1.69). Consistent patterns were observed even without weighting (one-year: RR 1.85, 95 % CI 1.68-2.04; five-year: RR 1.60, 95 % CI 1.47-1.74). Conclusions: Our findings highlight the importance of continuous health management to prevent avoidable hospitalization, thereby promoting health and ensuring the financial stability of older patients with T2DM within the healthcare insurance system.",
    "year": 2025,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "c1fcc02ed606e1216ff27a8ac5ccd467",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T03:12:36.397419"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是糖尿病相关可避免住院对健康支出的影响，属于医疗健康经济学领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是糖尿病相关可避免住院对健康支出的影响，属于医疗健康经济学领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:25:55.479825"
}