{
  "paper": {
    "id": 3457,
    "title": "Knowledge Management for Risk Hedging by Construction Material Suppliers",
    "abstract": "The cost of construction materials has significantly increased in recent years, and construction material suppliers have started to utilize investment derivatives to mitigate risks. While much knowledge has been established on the predictions of using derivatives for risk-hedging, little is known about the evaluation of the risk mitigation by analyzing financial status of construction material suppliers. This paper presents a knowledge-sharing model to determine whether risk mitigation based on the use of derivatives would be beneficial to the companies. This model is developed by first establishing a comprehensive database comprising 560 financial reports on business capacity of construction material suppliers, followed by combining the technique for order preference by similarity to ideal solution (TOPSIS) and k-nearest neighbor (KNN) pattern classification. The benefits of the research described include a knowledge-sharing mechanism in regard to the behaviors of related construction material suppliers with the goal of mitigating their collective risks through the use of derivatives. DOI: 10.1061/(ASCE)ME.1943-5479.0000111. (C) 2012 American Society of Civil Engineers.",
    "year": 2012,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "07a95ad8abedfaeb7e5ce5d1cba82d51",
    "relevant_keywords": [
      "classification",
      "k-nearest neighbor",
      "KNN"
    ],
    "stage1_timestamp": "2025-05-15T02:26:09.250573"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要研究如何通过知识共享模型评估衍生品在建筑材料供应商风险对冲中的效果，其核心应用是金融风险管理，特别是通过衍生品进行风险对冲。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文主要研究如何通过知识共享模型评估衍生品在建筑材料供应商风险对冲中的效果，其核心应用是金融风险管理，特别是通过衍生品进行风险对冲。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:36:26.202977"
}