{
  "paper": {
    "id": 343,
    "title": "Backtesting comparison of machine learning methods on Warsaw Stock Exchange",
    "abstract": "Financial decision supporting is a very important and complex problem. The aim of this paper is the development of the Supervised Learning method based on machine learning algorithms. Contemporary machine learning methods, are often used. Many research works and practical implementation focus on supporting decisions on stock markets. However, most of them are related to developed markets in the USA, West Europe or Asian stock markets. There is a lack of research related to the comparison of algorithms on the backtesting simulator and the Warsaw Stock Exchange (WSE). The best results were achieved by the Logistic Regression, this may be due to insufficient data suitable for more complex algorithms. Using a simulator to test stock market algorithms, has many advantages, we operate in an environment that is closer to the real one, we can estimate how much the model earned, how many trades it would execute and what the risk is. In future research, it is worth checking selected algorithms on a larger data set. (C) 2021 The Authors. Published by Elsevier B.V.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "7f39c3db8f9891c2dc29c61a25ff0058",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "regression",
      "Logistic Regression"
    ],
    "stage1_timestamp": "2025-05-15T01:49:41.060123"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究机器学习方法在华沙证券交易所的回测比较，虽然涉及金融决策支持，但并未明确指出其核心技术应用于衍生品定价、金融风险管理或投资组合管理等特定金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究机器学习方法在华沙证券交易所的回测比较，虽然涉及金融决策支持，但并未明确指出其核心技术应用于衍生品定价、金融风险管理或投资组合管理等特定金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:59:01.806851"
}