{
  "paper": {
    "id": 147,
    "title": "Stock-Index Tracking Optimization Using Auto-Encoders",
    "abstract": "Deep learning algorithms' powerful capabilities for extracting useful latent information give them the potential to outperform traditional financial models in solving problems of the stock market which is a complex system. In this paper, we explore the use of advanced deep learning algorithms for stock-index tracking. We partially replicate the CSI 300 Index by optimizing with respect to the difference between the returns of the tracking portfolio and the target index. We extract the complex non-linear relationship between index constituents and select a subset of constituents to construct a dynamic tracking portfolio by six well-known auto-encoders (single-hidden-layer undercomplete, sparse, contractive, stacked, denoising, and variational auto-encoders) that have been widely used in contexts other than stock-index tracking. Empirical results show that the auto-encoder-based strategies perform better than conventional ones when the tracking portfolio is constructed with a small number of stocks. Furthermore, strategies based on auto-encoders capable of learning high-capacity encodings of the input, such as sparse and denoising auto-encoders, have even better tracking performance. Our findings offer evidence that deep learning algorithms with explicitly designed hierarchical architectures are suitable for index tracking problems.",
    "year": 2020,
    "source": "WOS",
    "area": "portfolio",
    "method": "deep learning",
    "cache_key": "e906a3776d4ff41f73fcab9fb060b3a0",
    "relevant_keywords": [
      "machine learning",
      "unsupervised learning",
      "deep learning",
      "representation learning",
      "neural network",
      "autoencoder",
      "denoising autoencoder",
      "feature learning",
      "feature representation"
    ],
    "stage1_timestamp": "2025-05-15T00:32:31.609098"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是使用自编码器优化股票指数跟踪，通过选择指数成分股构建动态跟踪投资组合，这直接属于投资组合管理的范畴。论文的研究目标和实验设计都集中在如何优化投资组合以更好地跟踪目标指数，而不是衍生品定价或金融风险管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是使用自编码器优化股票指数跟踪，通过选择指数成分股构建动态跟踪投资组合，这直接属于投资组合管理的范畴。论文的研究目标和实验设计都集中在如何优化投资组合以更好地跟踪目标指数，而不是衍生品定价或金融风险管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:35:33.466761"
}