{
  "paper": {
    "id": 510,
    "title": "Heteroscedastic ensemble deep random vector functional link neural network with multiple output layers for High Frequency Volatility Forecasting and Risk Assessment",
    "abstract": "Accurate volatility forecasting is crucial for the efficient management of financial systems. However, the dynamic nature and significant variability in financial time series data pose substantial challenges to achieving these forecasts. The paper introduces a novel Heteroscedastic ensemble deep random vector functional link (HedRVFL) network with multiple output layers for high frequency volatility forecasting and risk assessment. The hidden layers of the model are hierarchical and stacked for deep representation learning to extract complex patterns within the data. The neuron pruning strategy is utilized to eliminate noisy information from random features, thereby improving the network's performance. The forecast is generated by combining the outputs of each layer through an ensemble method. A comparative analysis was conducted against several existing forecasting methods, utilizing error metrics and statistical tests on sixteen high frequency cryptocurrency time-series datasets, demonstrating that the proposed model outperforms others in terms of forecasting accuracy and risk assessment.",
    "year": 2025,
    "source": "WOS",
    "area": "financial_risk",
    "method": "deep learning",
    "cache_key": "7af5d0b92c75d99b218fc7c07c9d1333",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "neural network",
      "deep learning",
      "representation learning",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T01:38:59.329347"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on high frequency volatility forecasting and risk assessment, which are key components of financial risk management. The proposed model aims to improve forecasting accuracy and risk assessment, directly addressing challenges in managing financial risks.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on high frequency volatility forecasting and risk assessment, which are key components of financial risk management. The proposed model aims to improve forecasting accuracy and risk assessment, directly addressing challenges in managing financial risks.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:02:50.873866"
}