{
  "paper": {
    "id": 1620,
    "title": "Risk Mitigation in Agriculture in Support of COVID-19 Crisis Management",
    "abstract": "The main focus of this article is the problem of exacerbating agricultural risks in the context of the COVID-19 crisis, which started against the background of the novel coronavirus (COVID-19) pandemic. The motivation for conducting the research presented in this article was the desire to increase the resilience of agricultural companies to economic crises. This paper is aimed at studying the Russian experience of changing the production and financial risks of agricultural companies during the COVID-19 crisis, substantiating the important role of innovations in reducing these risks, and determining the prospects for risk management in agriculture based on innovations to increase its crisis resilience. Using the structural equation modelling (SEM) method, we modelled the contribution of innovations to the risk management of agriculture during the COVID-19 crisis. The advantages of the SEM method, compared to other conventional methods (e.g., independent correlation analysis or independent regression analysis), include the increased depth of analysis, its systemic character, and the consideration of multilateral connections between the indicators. Using the case-study method, a smart vertical farm framework is being developed, the risks of which are resistant to crises through the use of datasets and machine learning. The originality of this article lies in rethinking the risks of agriculture from the standpoint of smart technologies as a new risk factor and a way to increase resilience to crises. The theoretical significance of the results obtained is that they make it possible to systematically study the changes in the risks of agriculture in the context of the COVID-19 crisis, while outlining the prospects for increasing resilience to crises based on optimising the use of smart technologies. The practical significance of the article is related to the fact that the authors' conclusions and applied recommendations on the use of datasets and machine learning by agricultural companies can improve the efficiency of agricultural risk management and ensure successful COVID-19 crisis management by agricultural companies.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "c5861419513576023218f6dd9a19aefc",
    "relevant_keywords": [
      "machine learning",
      "datasets"
    ],
    "stage1_timestamp": "2025-05-15T02:05:42.481536"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究农业风险管理，特别是通过智能技术和机器学习提高农业公司在COVID-19危机中的韧性。虽然提到了风险管理和机器学习，但其应用场景是农业领域，而非金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究农业风险管理，特别是通过智能技术和机器学习提高农业公司在COVID-19危机中的韧性。虽然提到了风险管理和机器学习，但其应用场景是农业领域，而非金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:47:20.984069"
}