{
  "paper": {
    "id": 72,
    "title": "Deep Learning Approach for Prognoses of Long-Term Options Behavior",
    "abstract": "Since the inception of asset pricing models, starting as far back as beginning of XX century, and moreover after the fundamental work of Black and Scholes (1973), there has been considerable interest in analytical research of stock exchange equities behavior. Still up to nowadays it remains a critical task for participants engaged in the field of financial mathematics. The reason of such an undying interest is that to adequately assess investments risks the stock exchange actors (brokers, investors, traders, et. al) need still more and more accurate prediction results obtained as fast as possible. It is a matter of fact proven by numerous researchers that assets derivatives behave differently being observed in small, medium, and long-term frames. Algorithms for predicting the dynamics of stock options and other assets derivatives for both small times (where one plays on market fluctuations), and medium ones (where trade is stressed at the beginning and closing moments) are well developed, and trading robots are actively used for these purposes. Analysis of the dynamics of assets for very long time-frames (of order of several months and years) is still beyond the scope of analysts as it is expensively prohibited, although this issue is extremely important for hedging the investments portfolios. The present paper focuses on construction of an effective and resourceintensive model for predicting the behavior of financial instruments, trends and price movements based upon the principles of deep learning. The forecasts obtained by the model showed an almost acceptable compliance with the true prices of the S&P500.",
    "year": 2019,
    "source": "WOS",
    "area": "derivatives_pricing",
    "method": "deep learning",
    "cache_key": "7fe62ce9b25284d5797754fb16534f2a",
    "relevant_keywords": [
      "deep learning",
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T01:26:55.009015"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Derivatives Pricing",
      "Financial Risk"
    ],
    "justification": "该论文主要研究使用深度学习模型预测长期股票期权的行为，这直接涉及衍生品定价。同时，论文提到这种预测对于投资组合的对冲非常重要，因此也涉及金融风险管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"衍生品定价\", \"金融风险管理\"],\n  \"justification\": \"该论文主要研究使用深度学习模型预测长期股票期权的行为，这直接涉及衍生品定价。同时，论文提到这种预测对于投资组合的对冲非常重要，因此也涉及金融风险管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:07:34.547125"
}