{
  "paper": {
    "id": 2748,
    "title": "Who gets the money? A qualitative analysis of fintech lending and credit scoring through the adoption of AI and alternative data",
    "abstract": "Credit scoring plays an important role in determining the accessibility of credit in the financial sector. This in turn has a significant impact on how economic opportunities are distributed. Our study examines the use of AI and alternative data in fintech lending through the lens of Information Asymmetry Theory. By employing a qualitative research design using the Gioia method, we extract, analyze, and synthesize insights from a diverse group of 26 experts in fintech lending, artificial intelligence, machine learning, data science, and academia. Our results reveal several important findings: the enhancement of predictive proficiency and risk management, the decrease in default rates, the extension of credit access by including previously 'unbanked populations ', the introduction of real-time creditworthiness assessment and new business models for entrepreneurs, the enhancement of credit market efficiencies and positive effects on the stability of financial markets. In addition, our study highlights the necessity for rigorous and critical ethical considerations of important challenges such as the question of consent, algorithmic transparency, data quality, data misuse, representativeness, traceability, responsibility, bias and discrimination. The reasonable goal of a more fair, resilient, sustainable and accessible credit system will require a joint effort to balance leveraging technological innovations with respecting peoples ' right to privacy.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "8ae5b907fa9b474303f754123d7628b1",
    "relevant_keywords": [
      "machine learning",
      "neural network",
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T02:18:37.205886"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要研究AI和替代数据在金融科技贷款中的应用，特别是信用评分和风险管理的改进，这属于金融风险管理的范畴。论文未提及衍生品定价或投资组合管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文主要研究AI和替代数据在金融科技贷款中的应用，特别是信用评分和风险管理的改进，这属于金融风险管理的范畴。论文未提及衍生品定价或投资组合管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:40:11.096838"
}