{
  "paper": {
    "id": 3467,
    "title": "Visual Capital: Evaluating building-level visual landscape quality at scale",
    "abstract": "Evaluating visual landscape quality provides valuable information for urban development and spatial planning. In practice however, obtaining high resolution view-metrics and outcome data with sufficient geographic coverage has remained challenging. To overcome this limitation, we construct a scalable measure of visual landscape quality by first defining building-level view-metrics derived from a large-scale 3D representation of Switzerland's building stock. Leveraging the principle of income-sorting, we estimate visual preferences by calibrating the building level view-metrics with commune-level incomes (CLI). The learned model captures common intuition on visual preferences, i.e. attributing positive weight to lake-views, and identifies contextdependent relationships between view metrics. To contextualize the derived quantitative measure, we refer to the preference for a building's portfolio of viewpoints as a building's visual capital (VC). By assessing the supply of VC across Switzerland's entire building stock, we uncover an association between VC and the urban and natural form, where urban density and landscape topology explain the strength of view-driven-income sorting across agglomerations. We demonstrate that spatial clustering of VC varies across cities and frequently crosses administrative boundaries. Finally, we release a privacy protected version of VC at www.visualcapital.xyz, which we expect to promote future interdisciplinary studies focused on correlates of visual landscape quality (whether financial, social, environmental or physiological).",
    "year": 2023,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "2d4ff40ac9b90f034cd13884a10f2882",
    "relevant_keywords": [
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T01:17:25.497423"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究视觉景观质量的评估及其与城市发展和空间规划的关系，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究视觉景观质量的评估及其与城市发展和空间规划的关系，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:09:42.060324"
}