{
  "paper": {
    "id": 1346,
    "title": "Insights from a Patent Portfolio Analysis on Sensor Technologies for Measuring Fruit Properties",
    "abstract": "A patent portfolio focusing on sensors for the measurement of fruit properties was generated and analyzed with the aim of contributing to a better understanding of the trends in the development and application of sensors intended for measuring fruit properties and their changes. A patent portfolio of 189 patents, utility models and patent applications was formed. Three groups of patents were identified: (i) sensor-based measurement of individual parameters, (ii) multisensor solutions for the simultaneous monitoring of multiple relevant aspects and (iii) solutions integrating sensor-derived data with artificial intelligence tools and techniques. The analysis of the patent portfolio pointed out the main driving forces of technology strengthening in the field of fruit property measurement. The development of sensing technologies enables the real-time, rapid and cost-effective determination of ever-increasing and more sophisticated sets of fruit properties and environmental conditions. Solutions integrating different sensing technologies into multisensor systems for monitoring fruit quality, ripening or freshness as holistic concepts opens avenues for the introduction of a new approach to fresh produce management. Increasing numbers of solutions introducing the application of artificial intelligence tools such as computer vision, machine learning and deep learning into the fresh produce supply chain contribute to the possibilities of substituting human decision-making at points of relevance for fresh produce management with optimal evidence-based solutions.",
    "year": 2024,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "358a205d295111b592a38f00e821852e",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "computer vision",
      "classification",
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T00:54:56.348157"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究传感器技术在测量水果特性方面的应用，包括使用人工智能工具如计算机视觉、机器学习和深度学习来监测水果质量和新鲜度。这些技术与金融领域的衍生品定价、金融风险管理或投资组合管理无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究传感器技术在测量水果特性方面的应用，包括使用人工智能工具如计算机视觉、机器学习和深度学习来监测水果质量和新鲜度。这些技术与金融领域的衍生品定价、金融风险管理或投资组合管理无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:21:39.615115"
}