{
  "paper": {
    "id": 997,
    "title": "Aggregating exponential gradient expert advice for online portfolio selection under transaction costs",
    "abstract": "As an application of machine learning techniques in the field of portfolio management, online portfolio selection (OLPS) aims at optimising the allocation of wealth in an uncertain environment. When making investment decisions, the transaction cost is such an important factor that investor should not ignore. Thus, this paper extends an existing online portfolio selection strategy Continuous Aggregating Exponential Gradient (CAEG) (Yang et al., 2022) in the presence of transaction costs. The proportional transaction costs model is constructed when the transaction costs are incorporated into the decision-making process, and we call this new strategy CAEG(C) . Theoretical guarantee proves that the mean of the logarithmic cumulative wealth of CAEG(C) has an asymptotic upper bound with that of its benchmark. The numerical examples demonstrate the impact of transaction costs on the proposed CAEG(C) strategy on the one hand, and on the other hand, verify that CAEG(C) outperforms other related OLPS strategies and is comparable to its benchmark strategy.",
    "year": 2023,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "9c67c64369eb524db1db89bc4ae15009",
    "relevant_keywords": [
      "machine learning"
    ],
    "stage1_timestamp": "2025-05-15T00:50:40.739388"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "The paper focuses on online portfolio selection (OLPS) and optimizes wealth allocation under transaction costs, which is a core aspect of portfolio management. The proposed strategy CAEG(C) is specifically designed for this financial application.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Portfolio Management\"],\n  \"justification\": \"The paper focuses on online portfolio selection (OLPS) and optimizes wealth allocation under transaction costs, which is a core aspect of portfolio management. The proposed strategy CAEG(C) is specifically designed for this financial application.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:25:23.724106"
}