{
  "paper": {
    "id": 2931,
    "title": "THE RELEVANCE OF COMPANY EVALUATION METHODS IN CONDITIONS OF ECONOMIC INSTABILITY. EMPIRICAL STUDY ON THE COMPANIES QUOTED IN THE BUCHAREST STOCK EXCHANGE",
    "abstract": "In the context of the economic-financial instability that characterizes the current business environment, knowing the value dimension of companies is an essential requirement for a correct support of strategic decisions. The objectivity of the value obtained depends on the relevance of the evaluation methods, determined by the ability to failthfully notice the influence of all the factors that characterize the economic environment. This study aims at establishing a hierarchy of the three major evaluation approaches (patrimonial, comparative, and based on the present value of the flows), according the mentioned criterium. Starting from a sample of 40 companies quoted in the Bucharest Stock Exchange, we have determined the ability of each method to provide a faithful and credible value, through the indication of potential risks. This study has allowed the identification of the profile of the insolvency risk according to the three suggested evaluation methods, obtaining the classification functions of the companies into risk groups, as well as the probabilities to determine insolvency. The results were obtained using the factorial analysis of multiple correspondencies, the discriminant analysis, and the logistic regression analysis, and the data were processed using the SPSS 19.0 statistic software.",
    "year": 2011,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "f1fd203e3d0b359506d874be548f33ef",
    "relevant_keywords": [
      "classification",
      "regression",
      "principal components analysis"
    ],
    "stage1_timestamp": "2025-05-15T02:20:48.180504"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要研究公司评估方法在经济不稳定条件下的相关性，并识别了破产风险的特征，这属于金融风险管理的范畴。论文使用了多种统计方法来分类公司风险并计算破产概率，这些都是金融风险管理中的典型应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文主要研究公司评估方法在经济不稳定条件下的相关性，并识别了破产风险的特征，这属于金融风险管理的范畴。论文使用了多种统计方法来分类公司风险并计算破产概率，这些都是金融风险管理中的典型应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:39:19.471316"
}