{
  "paper": {
    "id": 3813,
    "title": "Data-driven decision support system for building stocks energy retrofit policy",
    "abstract": "In most European countries, residential assets account for as much as 85% of the building stock floor area and are, on average, very outdated and energy inefficient. Moreover, the European Commission published the EU Green Deal invigorating higher retrofit of private and public buildings. Nowadays, public authorities collect extensive datasets to analyze the existing building stock; however, the complex and diverse scenario makes the definition of retrofit policies cumbersome. The biggest hurdle is often linked to the high cost of acquiring information. The presented research tries to overcome these issues by introducing a decision support system for retrofit policymaking from low-cost data-driven approaches. The method is based on: i) clustering techniques to divide building assets into groups with similar characteristics and energy consumption, and ii) Montecarlo simulation to compute each cluster's energy savings based on different retrofit scenarios. The proposed method has been successfully applied to an extensive portfolio of residential assets in Lombardy Region in Italy, called the CENED database, with over one million assets. As a result, the introduced method defines the optimum retrofit scenario with a low cost of information (e.g., without expensive surveys to gather data on existing assets' characteristics and performance indicators) and determines the number of assets to be retrofitted along with the expected energy savings. This data-driven approach can be easily updated given new renovations and status changes in the built environment, making it useable for the long term or in different regions. To summarize, data-driven solutions are now required to accomplish the European Union's decarbonization ambitions, and the proposed method helps decision-makers choose better energy retrofit policies for the built environment.",
    "year": 2022,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "75a933d1290f713ca23e5f2dd8b85a9c",
    "relevant_keywords": [
      "clustering",
      "unsupervised learning"
    ],
    "stage1_timestamp": "2025-05-15T01:21:08.218840"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是建筑能源改造政策的决策支持系统，涉及聚类技术和蒙特卡洛模拟，但其应用场景是建筑能源效率提升和改造政策制定，与衍生品定价、金融风险管理或投资组合管理无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是建筑能源改造政策的决策支持系统，涉及聚类技术和蒙特卡洛模拟，但其应用场景是建筑能源效率提升和改造政策制定，与衍生品定价、金融风险管理或投资组合管理无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:08:47.769253"
}