{
  "paper": {
    "id": 2439,
    "title": "Study on early warnings of strategic risk during the process of firms' sustainable innovation based on an optimized genetic BP neural networks model: Evidence from Chinese manufacturing firms",
    "abstract": "Strategic risk is an inevitable question of reality, which leads to a significant impact that negatively affects firms' overall development, even threatening their survival. Most of extant studies on early warning models merely take the financial factors into account, whereas strategic risk pertaining to firms involves a diverse group of non-financial factors. In addition, the growing attention attached to the sustainable development of ecological and social environment has raised specific concerns to manufacturing firms, which need especially manage the risks generated from the process of sustainable innovation. However, scholars have paid far less attention to early warning models that comprehensively address the above problems. It is crucial to facilitate manufacturing firms to timely detect strategic risk during the process of sustainable innovation, whereas the existing early warning models are not reliable enough to warn the potential risks. Therefore, this study sets out to introduce the sustainable risk into the early warning indicators system of strategic risk. Then, Chinese manufacturing firms are applied to construct an early warning model which based on the back-propagation (BP) neural network optimized by genetic algorithm (GA). The results provide evidence that the proposed model shows a better fitting effect, higher prediction precision and higher convergence speed when compared with conventional models. In addition, the weights of the early warning model obtained from the training are substituted into the forward propagation formula, which enables to determine the relative importance of risk factors. It is of great significance for the firms to prioritize risk management actions. Furthermore, the new model enables manufacturing firms to warn the strategic risk during the process of sustainable innovation while striking a balance among economic, environmental, and social performances.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "0afa519ba58d9126be8a62bf4fba6807",
    "relevant_keywords": [
      "neural network",
      "backpropagation",
      "BP"
    ],
    "stage1_timestamp": "2025-05-15T02:15:27.025567"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究企业可持续创新过程中的战略风险预警模型，虽然涉及风险管理和神经网络技术，但其应用场景是企业战略风险而非金融领域的风险管理、衍生品定价或投资组合管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究企业可持续创新过程中的战略风险预警模型，虽然涉及风险管理和神经网络技术，但其应用场景是企业战略风险而非金融领域的风险管理、衍生品定价或投资组合管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:42:28.055705"
}