{
  "paper": {
    "id": 6899,
    "title": "COMPARISON OF CREDIT SCORING MODELS ON PROBABILITY OF DEFAULT ESTIMATION FOR US BANKS",
    "abstract": "This paper is devoted to the estimation of the probability of default (PD) as a crucial parameter in risk management, requests for loans, rating estimation, pricing of credit derivatives and many others key financial fields. Particularly, in this paper we will estimate the PD of US banks by means of the statistical models, generally known as credit scoring models. First, in theoretical part, we will briefly introduce the two main categories of credit scoring models, which will be afterwards used in application part - linear discriminant analysis and regression models (logit and probit), including testing the statistical significance of estimated parameters. In the main part of the paper we will work with the sample of almost three hundred US commercial banks which will be separated into two groups (non-default and default) on the basis of historical information. Subsequently, we will stepwise apply the mentioned above scoring models on this sample to derive several models for estimation of PD. Further we will apply these models to the control sample to determine the most appropriate model.",
    "year": 2013,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "448b46a01a89606af6e3535ddc456d69",
    "relevant_keywords": [
      "classification",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T03:02:41.309657"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on estimating the probability of default (PD) for US banks using credit scoring models, which is a key component in financial risk management. The study aims to improve risk assessment and management practices, particularly in the context of loan requests and rating estimations, which are central to risk management in financial institutions.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on estimating the probability of default (PD) for US banks using credit scoring models, which is a key component in financial risk management. The study aims to improve risk assessment and management practices, particularly in the context of loan requests and rating estimations, which are central to risk management in financial institutions.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:27:07.048913"
}