{
  "paper": {
    "id": 1024,
    "title": "Financial portfolio optimization with online deep reinforcement learning and restricted stacked autoencoder-DeepBreath",
    "abstract": "The process of continuously reallocating funds into financial assets, aiming to increase the expected return of investment and minimizing the risk, is known as portfolio management. In this paper, a portfolio management framework is developed based on a deep reinforcement learning framework called DeepBreath. The DeepBreath methodology combines a restricted stacked autoencoder and a convolutional neural network (CNN) into an integrated framework. The restricted stacked autoencoder is employed in order to conduct dimensionality reduction and features selection, thus ensuring that only the most informative abstract features are retained. The CNN is used to learn and enforce the investment policy which consists of reallocating the various assets in order to increase the expected return on investment. The framework consists of both offline and online learning strategies: the former is required to train the CNN while the latter handles concept drifts i.e. a change in the data distribution resulting from unforeseen circumstances. These are based on passive concept drift detection and online stochastic batching. Settlement risk may occur as a result of a delay in between the acquisition of an asset and its payment failing to deliver the terms of a contract. In order to tackle this challenging issue, a blockchain is employed. Finally, the performance of the DeepBreath framework is tested with four test sets over three distinct investment periods. The results show that the return of investment achieved by our approach outperforms current expert investment strategies while minimizing the market risk. Crown Copyright (C) 2020 Published by Elsevier Ltd.",
    "year": 2020,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "3050f7ca02d63b5d25cff2bb345b576b",
    "relevant_keywords": [
      "machine learning",
      "reinforcement learning",
      "deep learning",
      "neural network",
      "convolutional neural network",
      "CNN",
      "autoencoder",
      "representation learning",
      "feature learning",
      "feature representation"
    ],
    "stage1_timestamp": "2025-05-15T01:58:08.451691"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是开发一个基于深度强化学习的框架（DeepBreath），用于金融资产的动态再分配，旨在增加预期回报并最小化风险，这直接属于投资组合管理的范畴。论文明确提到了投资组合管理的目标和方法，并通过实验验证了其框架在投资回报和风险管理方面的表现。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是开发一个基于深度强化学习的框架（DeepBreath），用于金融资产的动态再分配，旨在增加预期回报并最小化风险，这直接属于投资组合管理的范畴。论文明确提到了投资组合管理的目标和方法，并通过实验验证了其框架在投资回报和风险管理方面的表现。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:52:41.710555"
}