{
  "paper": {
    "id": 7817,
    "title": "Modeling the intra-urban nocturnal summertime air temperature fields at a daily basis in a city with complex topography",
    "abstract": "Detailed knowledge about the intra-urban air temperature variability within a city is crucial for the implementation of adaptation strategies to counteract the negative effects of urban heat stress. Various methods to model urban-rural temperature differences exist, but they often only cover certain periods (heatwave, hot day) or meteorological conditions (sunny and calm) due to computational limitations or limited data availability. Here, we present a land use regression approach to model nocturnal air temperature fields for every single night of the summers 2018 to 2020 in a city with complex terrain (Bern, Switzerland). Furthermore, we investigate the applicability of different model structures and straight-forward computable GIS variables to model cold air drainage, which exerts an important influence on the local-scale climate of cities with complex terrain. The geostatistical models are calibrated with in-situ data of a dense low cost air temperature measurement network and high resolution spatiotemporal (land use and meteorology) data, which are all publicly available. The resulting land use regression models are capable to model and map intra-urban air temperature differences with a good model performance (R2: 0.65-0.71; RMSE: 0.69-0.76 K). Evaluations with data from additional measurement stations and periods (summer 2021) show that the models are able to estimate different meteorological and spatial conditions, but that the representation of small-scale topographic features remains difficult. However, the comparatively low computational and financial effort needed to calculate nocturnal air temperature fields at daily basis enable new applications for cities with restricted resources for various areas of interest, such as urban planning (e.g. effect of heat mitigation policies) or heat risk management (e.g. analyze small-scale urban heat vulnerability).",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "1be844f0188feac8bcf1e413824e7a60",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T03:12:36.390921"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究城市夜间气温场的建模及其在城市规划和热风险管理中的应用，并未涉及任何金融领域的技术或应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究城市夜间气温场的建模及其在城市规划和热风险管理中的应用，并未涉及任何金融领域的技术或应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:25:55.531613"
}