{
  "paper": {
    "id": 565,
    "title": "Development of an intelligent information system for financial analysis depend on supervised machine learning algorithms",
    "abstract": "The development of Management Information Systems (MIS) is impossible without the use of machine learning (ML). It's a type of Artificial Intelligence (AI) that makes predictions using statistical models. When it comes to financial analysis, there are numerous risk-related concerns to contend with today (FI). In the financial sector, machine learning algorithms are used to detect fraud, automate trading, and provide financial advice to investors. To better serve its customers, the financial sector can now save borrower data according to specific criteria thanks to MIS. In fact, there is a large amount of data about debtors, making load management a difficult task. ML can examine millions of data sets in a short period of time without being explicitly programmed to improve the results. This type of algorithm can aid financial institutions in making grant selections for their clients. For the objective of classifying FI in terms of fraud or not, the Intelligent Information System for Financial Institutions (IISFI) relying on Supervised ML (SML) Algorithms has been created in this work. Bayesian Belief Network, Neural Network, Decision trees, Naive Bayes, and Nearest Neighbor has been compared for the purpose of classifying FI risks using the performance measures asfalse positive rate, true positive rate, true negative rate, false negative rate, accuracy, F-Measure, Mean Absolute Error (MAE), Mean Squared Error (MSE), Root Mean Square Error (RMSE), Med AE, Receiver Operating Characteristic (ROC) area,Precision Recall Characteristic (PRC) area, and measures of PC.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "d3d39959333bf3b9ae116b42deeb63dc",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "decision tree",
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T01:52:49.379211"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要讨论了使用监督机器学习算法（如贝叶斯信念网络、神经网络、决策树等）来分类金融风险，特别是欺诈检测，这属于金融风险管理的范畴。论文中提到的应用场景和性能指标均围绕风险分类展开，并未涉及衍生品定价或投资组合管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文主要讨论了使用监督机器学习算法（如贝叶斯信念网络、神经网络、决策树等）来分类金融风险，特别是欺诈检测，这属于金融风险管理的范畴。论文中提到的应用场景和性能指标均围绕风险分类展开，并未涉及衍生品定价或投资组合管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:56:43.053999"
}