{
  "paper": {
    "id": 1358,
    "title": "A survey of deep learning applications in cryptocurrency",
    "abstract": "This study aims to comprehensively review a recently emerging multidisciplinary area related to the application of deep learning methods in cryptocurrency research. We first review popular deep learning models employed in multiple financial application scenarios, including convolutional neural networks, recurrent neural networks, deep belief networks, and deep reinforcement learning. We also give an overview of cryptocurrencies by outlining the cryptocurrency history and discussing primary representative currencies. Based on the reviewed deep learning methods and cryptocurrencies, we conduct a literature review on deep learning methods in cryptocurrency research across various modeling tasks, including price prediction, portfolio construction, bubble analysis, abnormal trading, trading regulations and initial coin offering in cryptocurrency. Moreover, we discuss and evaluate the reviewed studies from perspectives of modeling approaches, empirical data, experiment results and specific innovations. Finally, we conclude this literature review by informing future research directions and foci for deep learning in cryptocurrency.",
    "year": 2024,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "40bb740be8129c4a32d62a19f46d14dd",
    "relevant_keywords": [
      "machine learning",
      "reinforcement learning",
      "deep learning",
      "neural network",
      "representation learning",
      "convolutional neural network",
      "CNN",
      "recurrent neural network",
      "long short-term memory",
      "LSTM",
      "deep belief network",
      "DBM"
    ],
    "stage1_timestamp": "2025-05-15T00:54:56.411535"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文明确提到了在加密货币研究中使用深度学习方法进行投资组合构建（portfolio construction），这属于投资组合管理的范畴。虽然论文还涉及价格预测等其他任务，但投资组合管理是其主要应用领域之一。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文明确提到了在加密货币研究中使用深度学习方法进行投资组合构建（portfolio construction），这属于投资组合管理的范畴。虽然论文还涉及价格预测等其他任务，但投资组合管理是其主要应用领域之一。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:21:37.240718"
}