{
  "paper": {
    "id": 601,
    "title": "How cheap talk in climate disclosures relates to climate initiatives, corporate emissions, and reputation risk",
    "abstract": "Navigating the complex landscape of corporate climate disclosures and their real impacts is crucial for managing climate-related financial risks. However, current disclosures oftentimes suffer from imprecision, inaccuracy, and greenwashing. We introduce ClimateBert CTI , a deep learning algorithm, to identify climaterelated cheap talk in MSCI World index firms' annual reports. We find that only targeted climate engagement is associated with less cheap talk. Voluntary climate disclosures are associated with more cheap talk. Moreover, cheap talk correlates with increased negative news coverage and higher emissions growth. Hence, cheap talk helps assess climate initiatives' effectiveness and anticipate reputation and transition risk exposure.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "deep learning",
    "cache_key": "04c055b08ca75d6dd4278363a0b543c0",
    "relevant_keywords": [
      "deep learning",
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T01:40:14.298434"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on identifying climate-related cheap talk in corporate disclosures to assess climate initiatives' effectiveness and anticipate reputation and transition risk exposure, which are key aspects of financial risk management related to climate change.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on identifying climate-related cheap talk in corporate disclosures to assess climate initiatives' effectiveness and anticipate reputation and transition risk exposure, which are key aspects of financial risk management related to climate change.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:02:47.791709"
}