{
  "paper": {
    "id": 2594,
    "title": "A novel hybrid model for portfolio selection",
    "abstract": "As we know, the performance of the mean-variance approach depends on the accurate forecast of the return rate. However, the conventional method (e.g. arithmetic mean or regression-based method) usually cannot obtain a satisfied solution especially under the small sample situation. In this paper, the proposed method which incorporates the grey and possibilistic regression models formulates the novel portfolio selection model. In order to solve the multi-objective quadric programming problem, multi-objective evolution algorithms (MOEA) is employed. A numerical example is also illustrated to show the procedures of the proposed method. On the basis of the numerical results, we can conclude that the proposed method can provide the more flexible and accurate results. (c) 2004 Elsevier Inc. All rights reserved.",
    "year": 2005,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "3bffe47da4d4db2423e8b3ecb6895038",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:08:41.825678"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "The paper focuses on developing a novel hybrid model for portfolio selection, which is a core aspect of portfolio management. It discusses the improvement of the mean-variance approach and employs multi-objective evolution algorithms to solve the portfolio selection problem, clearly indicating its application in this specific financial domain.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Portfolio Management\"],\n  \"justification\": \"The paper focuses on developing a novel hybrid model for portfolio selection, which is a core aspect of portfolio management. It discusses the improvement of the mean-variance approach and employs multi-objective evolution algorithms to solve the portfolio selection problem, clearly indicating its application in this specific financial domain.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:13:42.654722"
}