{
  "paper": {
    "id": 1535,
    "title": "Customized Module Portfolio Planning Based on Real-time Data",
    "abstract": "Module portfolio planning plays a key role in the strategy of modularization for the complex products and systems (CoPS). Current practices focus on capturing the customer requirements from the 'Voice of the Customer'. However, some information asymmetry will be caused by the customers' unawareness of the underlying coupling and interrelationships among various functional modules for CoPS. In contrast, real-time data, especially the system operating & environmental (SOE) data, will provide a brand new perspective for requirements elicitation, analysis and specification. In this paper, a SOE data based approach is proposed to plan the customized module portfolio for CoPS. Firstly, the k-means algorithm is applied for clustering analysis to obtain the module specifications consisting of a series of module instances with different parameter values. Then, a random forests based model is trained to select the customized module instances which constitute the module portfolio. Finally, the Large Tonnage Crawler Crane is chosen as a real example to expound the application of the proposed approach.",
    "year": 2015,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "740cf1a679d549891776f9603d1dd368",
    "relevant_keywords": [
      "machine learning",
      "unsupervised learning",
      "clustering",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T00:56:39.135260"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究基于实时数据的定制化模块组合规划，应用于复杂产品和系统（CoPS）的模块化策略，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究基于实时数据的定制化模块组合规划，应用于复杂产品和系统（CoPS）的模块化策略，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:20:34.490866"
}