{
  "paper": {
    "id": 3738,
    "title": "Forecasting new and renewable energy supply through a bottom-up approach: The case of South Korea",
    "abstract": "This paper introduces the forecasting model for a new and renewable energy supply utilized in the Fourth Basic Plan for New and Renewable Energy of South Korea in 2014 and presents the estimated results. The Korean government formulated a plan for raising the new and renewable energy deployment rate to 11% by 2035, and this paper presents the development of the corresponding plan. The proposed model essentially uses a bottom up method to reflect the characteristics of each renewable source. In addition, a competitive diffusion model, a logistic growth model, a linear regression model, and data from government planning and companies' planned projects are used. The forecasts are classified and presented by renewable source and output type (i.e., electricity, heat, and transportation fuels). The results show that Korean new and renewable energy production will reach about 37 million tonnes of oil equivalent by 2035. In addition, the renewable electricity sector has become mainstream since the 2012 implementation of Renewable Portfolio Standard policy, and is expected to account for 60% of total new and renewable energy supply in 2035. Furthermore, wind, solar photovoltaic, and bioenergy are projected to replace current waste-oriented sources.",
    "year": 2017,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "0a1ab6719a9fe7a1689771a59f0b9f98",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:20:03.647456"
  },
  "domain_result": {
    "success": false,
    "error": "Client error '429 Too Many Requests' for url 'https://api.deepseek.com/v1/chat/completions'\nFor more information check: https://developer.mozilla.org/en-US/docs/Web/HTTP/Status/429",
    "application_domains": [
      "None"
    ],
    "justification": "API调用失败: Client error '429 Too Many Requests' for url 'https://api.deepseek.com/v1/chat/completions'\nFor more information check: https://developer.mozilla.org/en-US/docs/Web/HTTP/Status/429",
    "raw_response": null
  },
  "timestamp": "2025-05-20T16:08:51.723616"
}