{
  "paper": {
    "id": 360,
    "title": "Exploration of the investment patterns of potential retail banking customers using two-stage cluster analysis",
    "abstract": "Identifying investment patterns as part of customer segmentation is one of the most important tasks in retail banking. Clustering customers effectively is an important element of improving marketing policy and strategic planning. There are several methods for identifying similar groups of customers and describing their characteristics to offer them appropriate products. However, using machine learning methods is rare, and the application is limited for certain types of data. The aim of this study is to investigate the benefits of using a two-stage clustering method using neural-network-based Kohonen self-organizing maps followed by hierarchical clustering for identifying the investment patterns of potential retail banking customers. The unique benefit of this method is the ability to use both categorical and numerical variables at the same time. This research examined 1,542 responses received for an online investment survey, focusing on the questions that are related to the respondents' investment preferences and their current financial assets. The research utilizes descriptive statistics and multiple correspondence analysis (MCA) to understand the variables and Kohonen self-organizing maps (SOMs), in combination with hierarchical clustering, to identify customer groups and describe the characteristics of these clusters. The analysis was able to identify clusters of potential customers with similar preferences and gained insights into their investment patterns related to their investment portfolio and investment behavior, including their savings profile, attitude to risk-taking, and preferences for investment advice. These findings were supported by additional insights through the application of multiple correspondence analysis (MCA) describing patterns of financial instruments and portfolios. The main contribution of the research is the combined application of the machine learning methods Kohonen SOM, hierarchical clustering, and MCA for investment pattern analysis in the retail banking business.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "fa2d10eb67ca317d352bdbae459f46b3",
    "relevant_keywords": [
      "machine learning",
      "unsupervised learning",
      "clustering",
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T01:49:41.115969"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是使用两阶段聚类方法（基于神经网络的Kohonen自组织映射和层次聚类）来分析潜在零售银行客户的投资模式，包括他们的投资组合和投资行为。这直接关联到投资组合管理领域，因为研究目标是识别客户的投资偏好和资产配置，以提供更合适的金融产品建议。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是使用两阶段聚类方法（基于神经网络的Kohonen自组织映射和层次聚类）来分析潜在零售银行客户的投资模式，包括他们的投资组合和投资行为。这直接关联到投资组合管理领域，因为研究目标是识别客户的投资偏好和资产配置，以提供更合适的金融产品建议。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:58:31.205914"
}