{
  "paper": {
    "id": 575,
    "title": "A Portfolio of Machine Learning-based GNSS LOS/NLOS Classification in Urban Environments",
    "abstract": "GNSS signal quality is severely degraded in challenging urban environments due to NLOS receptions and multi-path interference. With the rapid development of urbanisation, the emergence of new construction materials as well as the complex architectures of modern buildings, the physic-based GNSS signal propagation channel modeling has encountered the bottleneck especially for the local effects. That's why the data-driven approach is promising to mitigate GNSS NLOS in a robust way. This paper first analyzes the main limitations of the current existing AI-based GNSS LOS/NLOS classifiers. Accordingly, enriched features are proposed and selected by correlation and predictive power analysis associated with physical interpretations. Finally, eight Machine Learning-based LOS/NLOS classification models are trained and evaluated using the proposed feature on a huge real dataset of around 8 hours collected by a vehicle in different urban environments. The performances show that the Gradient Boosting model has the most balanced performance in terms of prediction accuracy (81.63%) and the prediction time, which is promising for real time implementation.",
    "year": 2023,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "3b0c915160e99755416e7cec762f107f",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "feature learning",
      "feature representation"
    ],
    "stage1_timestamp": "2025-05-15T00:45:01.336308"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究基于机器学习的GNSS信号分类技术，用于改善城市环境中的信号接收质量，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究基于机器学习的GNSS信号分类技术，用于改善城市环境中的信号接收质量，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:29:33.552223"
}