{
  "paper": {
    "id": 4404,
    "title": "Impact of ESG score on financial performance of Indian firms: static and dynamic panel regression analyses",
    "abstract": "The study attempts to empirically investigate the impact of ESG score on the financial variables that may affect the performance of firms in the Indian context; SEBI's recent mandate on ESG reporting by the listed entities being the point of departure for the present discourse. A representative sample of 48 Indian firms having ESG scores under BSE-100 index is used in the analysis. The study period comprises the years 2011-2019. Static and dynamic panel regression analyses are conducted. The financial performance variables incorporated in this paper include ROA, ROE, firm size, market capitalization, PBDIT, Tobin's Q and share price. It is demonstrated that ESG score influences these variables, however with time lags. The distinctive contribution of the current endeavour lies in establishing a long-term positive association between ESG disclosure and annual average share price for the listed firms in a developing economy like India. The results are implicative of the fact that ESG score is an emerging indicator for conceiving future financial performance and risk mitigation strategies, and therefore, of considerable importance from policy perspective.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "bce9c897972bce09d06a157a6ba944b6",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:36:38.547890"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究ESG评分对印度公司财务绩效的影响，虽然涉及财务绩效和风险缓解策略，但并未明确指出其核心技术应用于衍生品定价、金融风险管理或投资组合管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究ESG评分对印度公司财务绩效的影响，虽然涉及财务绩效和风险缓解策略，但并未明确指出其核心技术应用于衍生品定价、金融风险管理或投资组合管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:33:18.843321"
}