{
  "paper": {
    "id": 1578,
    "title": "Design of intelligent financial data management system based on higher-order hybrid clustering algorithm",
    "abstract": "Amid the ever-expanding landscape of financial data, the importance of predicting potential risks through artificial intelligence methodologies has steadily risen. To achieve prudent financial data management, this manuscript delves into the domain of intelligent financial risk forecasting within the scope of system design. It presents a data model based on the variational encoder (VAE) enhanced with an attention mechanism meticulously tailored for forecasting a company's financial peril. The framework called the ATT-VAE embarks on its journey by encoding and enhancing multidimensional data through VAE. It then employs the attention mechanism to enrich the outputs of the VAE network, thereby demonstrating the apex of the model's clustering capabilities. In the experimentation, we implemented the model to a battery of training tests using diverse public datasets with multimodal features like AWA and CUB and verified with the local finance dataset. The results conspicuously highlight the model's commendable performance in comparison to publicly available datasets, surpassing numerous deep clustering networks at this juncture. In the realm of financial data, the ATT-VAE model, as presented within this treatise, achieves a clustering accuracy index exceeding 0.7, a feat demonstrably superior to its counterparts in the realm of deep clustering networks. The method outlined herein provides algorithmic foundations and serves as a pivotal reference for the prospective domain of intelligent financial data governance and scrutiny.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "a39ebd0427d2ec91482e72c52f52dc39",
    "relevant_keywords": [
      "machine learning",
      "unsupervised learning",
      "clustering",
      "neural network",
      "deep learning",
      "representation learning",
      "autoencoder",
      "attention mechanism"
    ],
    "stage1_timestamp": "2025-05-15T02:05:08.139638"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是设计一个基于高阶混合聚类算法的智能金融数据管理系统，用于预测公司的财务风险，这直接属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是设计一个基于高阶混合聚类算法的智能金融数据管理系统，用于预测公司的财务风险，这直接属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:47:58.016307"
}