{
  "paper": {
    "id": 602,
    "title": "Artificial Intelligence in Portfolio Selection Problem: A Review and Future Perspectives",
    "abstract": "Portfolio selection, the process of selecting the optimal combination of securities to achieve investors objectives, is a leading problem in finance. Ever since its inception, the problem has been widely addressed theoretically but its practical applications in portfolio management have seen few changes, with new technologies like Artificial Intelligence (AI) having limited impact in practice. The present study addresses this gap by identifying six main areas of the portfolio selection process and analyzing literature trends and gaps in AI methods within these areas. Additionally, it proposes four primary research avenues where AI can enhance portfolio selection in both theory and practice: i) utilizing alternative datasets and big-data analysis, ii) implementing robust predictive portfolio optimization techniques, iii) applying Reinforcement Learning (RL) methods for dynamic portfolio optimization, and iv) leveraging AI to make portfolio optimization more applicable in real-world scenarios.",
    "year": 2025,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "9a6232ce73bfd3d52af5edf0d7579206",
    "relevant_keywords": [
      "reinforcement learning",
      "deep learning",
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T00:45:39.096595"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "The paper explicitly focuses on the application of Artificial Intelligence (AI) in the portfolio selection problem, which is a core aspect of portfolio management. It discusses various AI methods, including reinforcement learning and deep learning, to enhance portfolio optimization and selection processes, directly aligning with the investment portfolio management domain.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Portfolio Management\"],\n  \"justification\": \"The paper explicitly focuses on the application of Artificial Intelligence (AI) in the portfolio selection problem, which is a core aspect of portfolio management. It discusses various AI methods, including reinforcement learning and deep learning, to enhance portfolio optimization and selection processes, directly aligning with the investment portfolio management domain.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:29:27.618849"
}