{
  "paper": {
    "id": 7435,
    "title": "Predicting Participation in a Post-disaster Mental Health Program",
    "abstract": "Objectives: A retrospective naturalistic evaluation was undertaken to identify if pre- and post-disaster factors may predict the likelihood of those considered  at risk of post-traumatic stress disorder (PTSD) entering a post-disaster clinical treatment program. Methods: The intake data of 881 people referred to the program following the Queensland (Australia) natural disasters of 2010-11 was evaluated. Those referred scored >2 on the Primary Care PTSD scale. Assessment included the disaster exposure experience, demographic and clinical information, and measures of coping and resilience. Descriptive analyses and a Classification Tree Analysis (CTA) were undertaken to ascertain which factors may predict treatment participation. Results: The treatment group (TG) in comparison to the non-treatment group (NTG) were more likely to perceive their life was threatened (85.1% vs 8.1%), less able to cope (67% vs 25.8%) and less resilient (4.2% vs 87.5%). The CTA using all the assessment variables found the Connor- Davidson (2-item scale) (P < 0.001), degree of property damage (P < 0.001), financial losses (P < 0.001), perception their life was threatened (P < 0.001) and insurance claims (P < 0.003) distinguished the TG from the NTG. Conclusions: The study identified factors that distinguished the TG from the NTG and predicted the likelihood of participation in a post-disaster mental health treatment.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "8be42a4c444bf6985c3039d4b0a83d63",
    "relevant_keywords": [
      "classification",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T03:08:37.844760"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是预测参与灾后心理健康治疗项目的因素，涉及的是心理健康和临床治疗领域，并未涉及任何金融研究领域的应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是预测参与灾后心理健康治疗项目的因素，涉及的是心理健康和临床治疗领域，并未涉及任何金融研究领域的应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:26:38.184856"
}