{
  "paper": {
    "id": 236,
    "title": "Study on financial risk prediction of enterprises based on logistic regression",
    "abstract": "Financial risk has a great influence on the development of enterprises, and the prediction of financial risk can help enterprises to treat risks early. In order to realize the prediction of enterprise financial risk, find the risk as early as possible and make a response as soon as possible, according to the principle of predictability and reliability, this study selected 15 financial indicators from aspects of debt repayment level, profit level, operation level, growth level, and cash level, then predicted the risk by the logistic regression model, and analyzed the risk of 36 pairs of enterprises. The results showed that the model designed in this study had an accuracy rate of 91.67%, and the risk of a company was successfully predicted based on the financial situation of the company from 2018 to 2020, which verified the reliability of the method. Thus the model can effectively predict the financial risk of enterprises, and it can be further promoted and applied to ensure the long-term development of enterprises and establish a good market environment.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "ef7d2b3e08083e6bf6384bc1e83828df",
    "relevant_keywords": [
      "supervised learning",
      "classification",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:48:30.737436"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on predicting financial risks of enterprises using logistic regression, which is a core aspect of financial risk management, specifically in the context of credit risk and enterprise financial health assessment.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on predicting financial risks of enterprises using logistic regression, which is a core aspect of financial risk management, specifically in the context of credit risk and enterprise financial health assessment.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:59:53.247311"
}