{
  "paper": {
    "id": 1811,
    "title": "Forecasting for regulatory credit loss derived from the COVID-19 pandemic: A machine learning approach",
    "abstract": "The economic onslaught of the COVID-19 pandemic has compromised the risk management of financial institutions. The consequences related to such an unprecedented situation are difficult to foresee with certainty using traditional methods. The regulatory credit loss attached to defaulted mortgages, so-called expected loss best estimate (ELBE), is forecasted using a machine learning technique. The projection of two ELBEs for 2022 and their comparison are presented. One ac-counts for the outbreak's impact, and the other presumes the nonexistence of the pandemic. Then, it is concluded that the referred crisis surely adversely affects said high-risk portfolios. The proposed method has excellent performance and may serve to estimate future expected and unexpected losses amidst any event of extraordinary magnitude.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "4e5316493e2ff4a11cec2576f5404865",
    "relevant_keywords": [
      "machine learning",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:07:25.788784"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on forecasting regulatory credit loss (ELBE) due to the COVID-19 pandemic using machine learning, which is directly related to assessing and managing financial risks associated with defaulted mortgages. This falls under the domain of Financial Risk Management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on forecasting regulatory credit loss (ELBE) due to the COVID-19 pandemic using machine learning, which is directly related to assessing and managing financial risks associated with defaulted mortgages. This falls under the domain of Financial Risk Management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:45:56.755892"
}