{
  "paper": {
    "id": 3367,
    "title": "Dynamic scheduling of flexible bus services with hybrid requests and fairness: Heuristics-guided multi-agent reinforcement learning with imitation learning",
    "abstract": "Flexible bus is a class of demand-responsive transit that provides door-to-door service. It is gaining popularity now but also encounters many challenges, such as high dynamism, immediacy requirements, and financial sustainability. Scientific literature designs flexible bus services only for reservation demand, overlooking the potential market for immediate demand that can improve ride pooling and financial sustainability. The increasing availability of historical travel demand data provides opportunities for leveraging future demand prediction in optimizing fleet utilization. This study investigates prediction failure risk-aware dynamic scheduling flexible bus services with hybrid requests allowing for both reservation and immediate demand. Equity in request waiting time for immediate demand is emphasized as a key objective. We model this problem as a multi-objective Markov decision process to jointly optimize vehicle routing, timetable, holding control and passenger assignment. To solve this problem, we develop a novel heuristics-guided multi-agent reinforcement learning (MARL) framework entailing three salient features: 1) incorporating the demand forecasting and prediction error correction modules into the MARL framework; 2) combining the benefits of MARL, local search algorithm, and imitation learning (IL) to improve solution quality; 3) incorporating an improved strategy in action selection with time-related information about spatio-temporal relationships between vehicles and passengers to enhance training efficiency. These enhancements are general methodological contributions to the artificial intelligence and operations research communities. Numerical experiments show that our proposed method is comparable to prevailing benchmark methods both with respect to training stability and solution quality. The benefit of demand prediction is significant even when the prediction is imperfect. Our model and algorithm are applied to a real-world case study in Guangzhou, China. Managerial insights are also provided.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "90c32fb171bf46b8fd133587ee50445a",
    "relevant_keywords": [
      "machine learning",
      "reinforcement learning",
      "deep learning",
      "neural network",
      "representation learning",
      "multi-agent reinforcement learning",
      "imitation learning"
    ],
    "stage1_timestamp": "2025-05-15T02:25:40.076467"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是灵活公交服务的动态调度问题，涉及多智能体强化学习和模仿学习等技术，但其应用场景是公共交通优化，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是灵活公交服务的动态调度问题，涉及多智能体强化学习和模仿学习等技术，但其应用场景是公共交通优化，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:36:50.957754"
}