{
  "paper": {
    "id": 3998,
    "title": "Discovery of College Students in Financial Hardship",
    "abstract": "College students with financial difficulties refer to those whose families can hardly afford their high tuition in universities, and should be supported by modern funding system. Indeed, students' economic plight negatively impact their mental health, academic performance, as well as their personal and social life. While funding students in financial hardship is widely accepted, there is limited understanding and research on effectively identification of the qualifying students. Traditional approaches relying on advisers' personal assessments are inefficient, and such subjective judgements may not reflect the truth. To this end, in this paper, we explore the data mining techniques for identifying students who are qualified for financial support. Specifically, we investigate students' complex behaviors on campus from multiple perspectives, and develop a learning framework, named Dis-HARD, by jointly incorporating the heterogeneous features to predict the portfolio of stipends a given student should be awarded. Our framework formalizes the above problem as a multi-label learning problem. Along this line, we first extract discriminative features from three perspectives: (i) smartcard usage behavior, (ii) internet usage behavior and (iii) trajectory on campus. Then, we develop a linear loss function with regularization to solve this multi-label classification problem. In addition, to effectively exploit the students' similarity and label dependency, we incorporate the graph Laplacian and composite l(2,1)-norm into the regularization of our model, and develop a re-weighted algorithm to achieve effective optimization. Finally, experiments on real-world data demonstrate that our method consistently provides better performance compared to the existing state-of-the-art methods.",
    "year": 2015,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "7f3ee1bec4f248d2856d96517f52ab52",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "feature learning",
      "feature representation"
    ],
    "stage1_timestamp": "2025-05-15T01:23:07.254238"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究如何通过数据挖掘技术识别经济困难的大学生，以便为他们提供经济资助。虽然提到了'portfolio of stipends'，但这与金融领域的投资组合管理无关，而是指学生应获得的各种资助组合。论文的核心技术并未应用于衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究如何通过数据挖掘技术识别经济困难的大学生，以便为他们提供经济资助。虽然提到了'portfolio of stipends'，但这与金融领域的投资组合管理无关，而是指学生应获得的各种资助组合。论文的核心技术并未应用于衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:08:22.370909"
}