{
  "paper": {
    "id": 2881,
    "title": "ESTIMATION OF CUSTOMER DEFAULT BASED ON BEHAVIOURAL VARIABLES",
    "abstract": "The paper focuses on the estimation of customer default arnoung the small and medium enterprises (SME). Based on the literature on credit scoring modelswebuild a logistic regression model which is widely used by commercial banks. Our models predicting customers' default on their payables to suppliers are estimated on a sample of a customer portfolio of 905 SME clients. Based on the analysis the non-financial, behavioural variables estimate better customer default than the financial ratios. Our models perform weaker than the usual performance level of scoring models in commercial bank. This result assumes that defaulting on a payable to suppliers is an early signal of possible financial difficulties.",
    "year": 2016,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "9bed23752ba9b74ef0d9c53d4c805ead",
    "relevant_keywords": [
      "classification",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:11:17.477425"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on estimating customer default using logistic regression models, which is a key aspect of credit risk management, a subfield of financial risk management. The study specifically addresses the prediction of defaults among SMEs, which is directly related to assessing and managing financial risks.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on estimating customer default using logistic regression models, which is a key aspect of credit risk management, a subfield of financial risk management. The study specifically addresses the prediction of defaults among SMEs, which is directly related to assessing and managing financial risks.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:12:21.317480"
}