{
  "paper": {
    "id": 826,
    "title": "A hybrid optimized deep learning model via the Golden Jackal Optimizer for accurate stock price forecasting",
    "abstract": "Stock markets have historically been the reference point of the worldwide financial environment throughout the years. Investing in the stock market carries risk; however, it can offer significant short- or long-term returns for the investor. Forecasting stock prices has been a vital topic among professionals and researchers; however, it has always been a difficult task. Machine learning and metaheuristic algorithms over the last years have shown remarkable performance in a variety of sectors, encompassing the financial sector. In this work, we propose an optimized hybrid deep learning model via the Golden Jackal Optimizer (GJO) algorithm for the task of precise stock price prediction. We select the twenty highest stocks in terms of market capitalization from the S&P 500 index as our benchmark dataset. We compare the proposed model with eighteen different neural network models, as well as the PSO-GRU | LSTM and GA-GRU | LSTM models, which refer to optimized deep learning models using the Particle Swarm Optimization (PSO) algorithm and Genetic Algorithms (GA), respectively. The experiments are evaluated based on RMSE, MAE, and MAPE criteria. The results demonstrate that metaheuristicoptimized models outperform standard approaches, with the proposed GJO-GRU | LSTM model enhancing forecasting quality.",
    "year": 2025,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "a7fe1e0b4aafdb8fe3fd577f64d8cc11",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "neural network",
      "long short-term memory",
      "LSTM",
      "representation learning"
    ],
    "stage1_timestamp": "2025-05-15T01:55:41.549149"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究使用优化的深度学习模型进行股票价格预测，虽然与金融市场相关，但并未明确涉及衍生品定价、金融风险管理或投资组合管理等特定领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究使用优化的深度学习模型进行股票价格预测，虽然与金融市场相关，但并未明确涉及衍生品定价、金融风险管理或投资组合管理等特定领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:54:18.553100"
}