{
  "paper": {
    "id": 2328,
    "title": "The Synergistic Effect of Problem-based Learning Combined with the Jigsaw Method in a Pharmacotherapy Course",
    "abstract": "To promote problem-solving ability within a pharmacotherapy course, we developed new problem-based learning (PBL) and information and communication technologies (ICT) support systems, and introduced the Jigsaw Method, an active learning method in which, similar to parts of a jigsaw puzzle, students are dependent on each other to create the full picture, to succeed. We conducted 10 PBL modules (one case per module), each lasting one week. To encourage constructive group work, information sharing, and student understanding in the individual modules, we implemented a Jigsaw Method-based wiki worksheet system in which students were to identify patient problems and check each other's work on an e-portfolio system. After completing this new curriculum, students were able to create comprehensive therapeutic care plans. A significant correlation was observed between the students' care plan evaluation scores and their module test results, suggesting that constructive group work can enhance problem-solving ability in therapeutics. These results clearly indicate the benefit of combining our new PBL-ICT support system with the Jigsaw Method.",
    "year": 2016,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "36e958a1b162b25137c1a659b5137857",
    "relevant_keywords": [
      "active learning"
    ],
    "stage1_timestamp": "2025-05-15T01:05:39.679986"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是教育领域中的问题解决能力培养方法，特别是结合问题导向学习（PBL）和Jigsaw Method在药物治疗课程中的应用，与金融领域无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是教育领域中的问题解决能力培养方法，特别是结合问题导向学习（PBL）和Jigsaw Method在药物治疗课程中的应用，与金融领域无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:15:33.960855"
}