{
  "paper": {
    "id": 694,
    "title": "Value at Risk Measurement Method under Deep Learning in Analysing the Excessive Financialization of Enterprises",
    "abstract": "This study proposes a novel model that integrates the generative adversarial network (GAN) with the value at risk (VaR) measuring method. The objective is to investigate the efficacy of the VaR method in addressing the issue of excessive financialization in enterprises. Firstly, the related concepts and calculation principles of VaR in the financial field are explained, and the autoregressive conditional heteroscedastic (ARCH) familybased VaR calculation method and the basic structure of GAN under the deep learning are introduced. Then, the GAN algorithm is employed to optimize and train the initialization network, transformation network, and structure network of the GAN algorithm. Finally, the optimized GAN is applied to the VaR measurement of 300 stocks in Shanghai and Shenzhen stock market. GAN demonstrates the ability to handle unbalanced data samples, sample minority data, and fit the overall distribution of minority samples. GAN introduces a groundbreaking method for data processing, and its integration with manual efforts yields significant improvements in practical applications. Moreover, GAN demonstrates a positive impact on data set training, offering reliable potential for advancement and serving as a valuable point of reference. In conclusion, the combination of GAN under deep learning with VaR showcases a dependable practicability in assessing the risks associated with excessive financialization.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "deep learning",
    "cache_key": "18121cf984b97174ba1e1bc2713a4e42",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "neural network",
      "generative adversarial network",
      "GAN"
    ],
    "stage1_timestamp": "2025-05-15T01:41:29.831662"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是将生成对抗网络（GAN）与风险价值（VaR）测量方法相结合，用于评估企业过度金融化的风险。VaR是金融风险管理中的关键工具，论文明确提到其应用于沪深股市300只股票的风险测量，这直接属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是将生成对抗网络（GAN）与风险价值（VaR）测量方法相结合，用于评估企业过度金融化的风险。VaR是金融风险管理中的关键工具，论文明确提到其应用于沪深股市300只股票的风险测量，这直接属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:02:27.690848"
}