{
  "paper": {
    "id": 2335,
    "title": "Surveying the prediction of risks in cryptocurrency investments using recurrent neural networks",
    "abstract": "Decentralized cryptocurrencies have received much attention over the last few years. Bitcoin (BTC) has enabled straight online expenditures without the need for centralized financial institutions. Cryptocurrencies are used not only for online payments but are also increasingly used as financial assets. With the rise in the number of cryptocurrencies, including BTC, Ethereum (ETH), and Ripple (XRP), and the millions of daily trades through different exchange services, cryptocurrency trading is prone to challenges similar to those seen in the traditional financial industry, such as price and trend forecasting, volatility forecasting, portfolio building, and fraud detection. This study examines the use of Recurrent neural networks (RNNs) for predicting BTC, ETH, and XRP prices. Accurate price prediction is essential for investors and traders in this volatile market. Machine learning techniques, including RNNs, Long-Short-Term Memory (LSTM), and convolutional neural networks, have been employed to forecast cryptocurrency prices with varying degrees of success. The aim of this study is to evaluate the effectiveness of RNNs in predicting cryptocurrency prices and compare their performance with other established methods. The results indicate that RNNs, particularly LSTMs and Gated Recurrent Units, demonstrate excellent capabilities in accurately predicting currency prices and providing insights to investors and traders in the cryptocurrency market.",
    "year": 2024,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "320627460a638465879bed2b2f6dd13a",
    "relevant_keywords": [
      "machine learning",
      "neural network",
      "deep learning",
      "recurrent neural network",
      "long short-term memory",
      "LSTM",
      "convolutional neural network",
      "CNN"
    ],
    "stage1_timestamp": "2025-05-15T01:05:39.720399"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究使用循环神经网络（RNN）预测加密货币价格，虽然价格预测在金融领域有广泛应用，但论文并未明确指出其核心技术应用于衍生品定价、金融风险管理或投资组合管理等特定金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究使用循环神经网络（RNN）预测加密货币价格，虽然价格预测在金融领域有广泛应用，但论文并未明确指出其核心技术应用于衍生品定价、金融风险管理或投资组合管理等特定金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:15:32.983458"
}