{
  "paper": {
    "id": 5208,
    "title": "The second-order bias of quantile estimators",
    "abstract": "The finite sample theory using higher-order asymptotics provides better approximations of the bias for a class of estimators. Phillips (1991) demonstrated the higher-order asymptotic expansions for LAD estimators. Rilstone et al. (1996) provided the second-order bias results of conditional mean regression estimators. This paper develops new analytical results on the second-order bias of the conditional quantile regression estimators, which enables an improved bias correction and thus to obtain improved quantile estimation. In particular, we show that the second-order bias is larger towards the tails of the conditional density than near the median, and therefore the benefit of the second-order bias correction is greater when we are interested in the deeper tail quantiles, e.g., for the study of income distribution and financial risk management. The Monte Carlo simulation confirms the theory that the bias is larger at the tail quantiles, and the second-order bias correction improves the behavior of the quantile estimators. (C) 2018 Elsevier B.V. All rights reserved.",
    "year": 2018,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "36766ec1a2d2cc3de10545236bcb5c8c",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:45:17.145218"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on improving quantile estimation, particularly in the deeper tail quantiles, which is directly relevant to financial risk management as it can be used to better assess extreme risks (e.g., Value-at-Risk). The abstract explicitly mentions financial risk management as an application area.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on improving quantile estimation, particularly in the deeper tail quantiles, which is directly relevant to financial risk management as it can be used to better assess extreme risks (e.g., Value-at-Risk). The abstract explicitly mentions financial risk management as an application area.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:31:07.139503"
}