{
  "paper": {
    "id": 3443,
    "title": "Using Bayesian Networks for Bankruptcy Prediction: Empirical Evidence from Iranian Companies",
    "abstract": "Financial distress and bankruptcy of companies may cause the resources to be wasted and the investment opportunities to be faded. Bankruptcy prediction by providing necessary warnings can make the companies aware of this problem so they can take appropriate measures with these warnings. The aim of this study is model development for financial distress prediction of listed companies in Tehran stocks exchange (TSE) using Bayesian networks (BNs). The sample consists of 72 bankrupt firms and 72 non bankrupt ones from 1997 to 2007 and bankrupt firms are those firms that subject to Business Law par. 141. In order to develop a bankruptcy prediction model, we consider 20 predictor variables including liquidity ratios, leverage ratios, profitability ratios and other factors like firm's size and auditor's opinion and then we use two methods for choosing variables. The first method is based upon conditional correlation between variables and the second method based upon conditional likelihood. Then three models for predicting financial distress are developed using naive bayes model and regression model and the result of three models are compared. The accuracy in predicting bankruptcy of the first naive bayes model's performance that is based upon conditional correlation is 90% and the accuracy of the second naive bayes model is 93% and finally the accuracy of the logistic regression that was built for comparing to naive bayes models is 90%. Collectively the results show that it is possible to predict financial distress using Bayesian models. Also, because this prediction is based on the information provided in financial statements of companies, it can be an evidence that the financial statements of companies have information content. With respect to the remainder variables in developed models in this research we find firms that have lower profitability and have more long term liabilities and have lower liquidity are more in risk of financial distress. To reduce financial distress risk, firms should use more conservative methods which lead to decrease in debts and reduce their costs. Further analyses show that the discretization into two, three and four states cause the model's performance to increase but increasing states into five states causes the model's performance to decrease.",
    "year": 2009,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "a88292ee62f652ddfae3ba5f580ee37d",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:26:09.184974"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on developing models for predicting financial distress and bankruptcy of companies using Bayesian networks, which is a key aspect of financial risk management. The study aims to provide warnings to companies about potential financial distress, allowing them to take preventive measures, which aligns with the goals of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on developing models for predicting financial distress and bankruptcy of companies using Bayesian networks, which is a key aspect of financial risk management. The study aims to provide warnings to companies about potential financial distress, allowing them to take preventive measures, which aligns with the goals of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:36:26.536741"
}