{
  "paper": {
    "id": 690,
    "title": "Portfolio constructions in cryptocurrency market: A CVaR-based deep reinforcement learning approach",
    "abstract": "Cryptocurrency markets have much larger tail risk than traditional financial markets, and constructing portfolios with such large tail risk assets would be challenging. Therefore, cryptocurrency funds demand new superior risk management models and Conditional Value at Risk (CVaR) is a prevailing risk measure for constructing portfolios in stock markets with large tail risk. Consequently, our paper contributes to the literature by developing a new cryptocurrency portfolio model framework based on the CVaR risk measure and a deep reinforcement learning optimization framework. We use the data from cryptocurrency market starting 2015 to 2021, unfolding that CVaR measure with deep learning outperforms the traditional portfolio construction technique. Compared with traditional economic parameter-based portfolio models, our model free based approach can capture the nonlinear compounding effect of multiple risk shocks by deep reinforcement learning on the risk distribution with economic structural breakdown. It can guide investments in financial markets with high tail risks.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "b26b4685860edb828895192ca7d769c0",
    "relevant_keywords": [
      "reinforcement learning",
      "deep learning",
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T01:53:59.366211"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk",
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是基于CVaR风险度量和深度强化学习优化框架构建加密货币投资组合模型，旨在解决加密货币市场的高尾部风险问题。这直接涉及金融风险管理和投资组合管理两个领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\", \"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是基于CVaR风险度量和深度强化学习优化框架构建加密货币投资组合模型，旨在解决加密货币市场的高尾部风险问题。这直接涉及金融风险管理和投资组合管理两个领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:55:50.330463"
}