{
  "paper": {
    "id": 3830,
    "title": "Every drop matters: combining population-based and satellite data to investigate the link between lifetime rainfall exposure and chronic undernutrition in children under five years in rural Burkina Faso",
    "abstract": "Climate change is projected to induce extreme and irregular rainfall patterns in the West African Sahel region, affecting household food security and income. Children are among the worst affected population groups. Previous studies focusing on rainfall irregularities in specified periods have revealed how child health and nutritional status are impacted, especially in rural settings. However, the aggregated effect of rainfall over a lifetime on chronic child undernutrition remains poorly understood. We conducted a multilevel regression using a 2017 household survey from rural Burkina Faso containing 12 919 under-five-year-old children and their corresponding household rainfall data. The rainfall data originated from the Climate Hazards Infrared Precipitation with Stations monthly dataset with a native resolution of 4.8 km (0.05 degrees). We show that an increase in rainfall below 75 mm monthly average tends to produce poor nutritional outcomes (regression coefficient = -0.11***; 95% CI = -0.13, -0.10; p < 0.001) in rural Burkina Faso children. We found a consistent negative relationship between different sex and household wealth groups, but not age groups. Vulnerable younger children were more affected by the adverse effects of increased rainfall, while older children seemed to handle it better. Our methodological approach tracing the impact of rainfall over children's lifetimes makes a meaningful contribution to the portfolio of tools for studying the complex relationship between climate change and health outcomes. Our work confirms that rainfall is a risk factor for chronic child undernutrition, highlighting the need for adaptation strategies that boost household and community resilience to counteract the harmful impacts of climate change on child nutritional status.",
    "year": 2022,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "5463a41d9cd9e0973568a7c6debc07dc",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:21:08.288839"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究气候变化对儿童营养不良的影响，使用了回归分析来探讨降雨量与儿童营养状况之间的关系。其研究内容与衍生品定价、金融风险管理或投资组合管理等金融领域无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究气候变化对儿童营养不良的影响，使用了回归分析来探讨降雨量与儿童营养状况之间的关系。其研究内容与衍生品定价、金融风险管理或投资组合管理等金融领域无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:08:47.101474"
}