{
  "paper": {
    "id": 702,
    "title": "Optimal attention allocation: picking alpha or betting on beta?",
    "abstract": "We investigate a problem of attention allocation and portfolio selection with information capacity constraint and return predictability in a multi-asset framework. In a two-phase formulation, the optimal attention strategy maximizes the combined expected alpha payoffs and expected beta payoffs of the portfolio. Return predictors taking extreme values incentivize the investor to learn about them and this leads to competition among information sources for attention. Moreover, the investor trades with varying skills including picking alphas and betting on beta, depending on the magnitude of the related predictors. Our multi-period analysis using reinforcement learning demonstrates time-horizon effects on attention and investment strategies.",
    "year": 2024,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "5f88b5dd76ceb47704bce7abb3556137",
    "relevant_keywords": [
      "reinforcement learning",
      "attention mechanism"
    ],
    "stage1_timestamp": "2025-05-15T00:47:18.488089"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "The paper focuses on attention allocation and portfolio selection in a multi-asset framework, which is a core aspect of portfolio management. It discusses optimizing expected alpha and beta payoffs, and uses reinforcement learning for multi-period analysis, all of which are directly related to portfolio management strategies.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Portfolio Management\"],\n  \"justification\": \"The paper focuses on attention allocation and portfolio selection in a multi-asset framework, which is a core aspect of portfolio management. It discusses optimizing expected alpha and beta payoffs, and uses reinforcement learning for multi-period analysis, all of which are directly related to portfolio management strategies.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:28:27.070132"
}