{
  "paper": {
    "id": 502,
    "title": "Value-at-Risk with quantile regression neural network: New evidence from internet finance firms",
    "abstract": "Traditional risk measurements have proven inadequate in capturing tail risk and nonlinear correlation. This study proposes a novel approach to measure financial risk in the Internet finance industry: a new Value-at-Risk (VaR) measurement based on quantile regression neural network (QRNN). Sparrow Search Algorithm (SSA) is utilized to optimize the QRNN model, which improves the model's performance in predicting internet finance risk. By comparing the TGARCH-VaR and QR-VaR approaches, our study demonstrates the effectiveness of the QRNN-VaR approach and its potential to improve the accuracy of risk prediction in the Internet finance industry. This study further examines and compares the risks between the traditional and internet finance industries. It also considers the unique impact of COVID-19 on industry risk based on statistical testing for differences and machine learning models. Our results indicate that the level of risk in the Internet finance industry is higher than in the traditional finance industry. Moreover, COVID-19 has contributed to increased risk within the Internet finance industry. These findings have significant implications for investors and policymakers seeking to better understand and manage risks within the Internet finance industry, particularly in the ongoing COVID-19 pandemic.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "0e90cc261600ffd48363a01fbec47e3c",
    "relevant_keywords": [
      "machine learning",
      "regression",
      "neural network",
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T01:51:31.317689"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on developing a novel Value-at-Risk (VaR) measurement using quantile regression neural network (QRNN) to improve financial risk prediction in the Internet finance industry. The study explicitly addresses risk measurement and management, comparing risks between traditional and internet finance industries, and analyzing the impact of COVID-19 on industry risk. These aspects clearly fall under the domain of Financial Risk Management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on developing a novel Value-at-Risk (VaR) measurement using quantile regression neural network (QRNN) to improve financial risk prediction in the Internet finance industry. The study explicitly addresses risk measurement and management, comparing risks between traditional and internet finance industries, and analyzing the impact of COVID-19 on industry risk. These aspects clearly fall under the domain of Financial Risk Management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:57:36.022469"
}