{
  "paper": {
    "id": 255,
    "title": "Development of Demand Response Energy Management Optimization at Building and District Levels Using Genetic Algorithm and Artificial Neural Network Modelling Power Predictions",
    "abstract": "Demand Response (DR) is a fundamental aspect of the smart grid concept, as it refers to the necessary open and transparent market framework linking energy costs to the actual grid operations. DR allows consumers to directly or indirectly participate in the markets where energy is being exchanged. One of the main challenges for engaging in DR is associated with the initial assessment of the potential rewards and risks under a given pricing scheme. In this paper, a Genetic Algorithm (GA) optimisation model, using Artificial Neural Network (ANN) power predictions for day-ahead energy management at the building and district levels, is proposed. Individual building and building group analysis is conducted to evaluate ANN predictions and GA-generated solutions. ANN-based short term electric power forecasting is exploited in predicting day-ahead demand, and form a baseline scenario. GA optimisation is conducted to provide balanced load shifting and cost-of-energy solutions based on two alternate pricing schemes. Results demonstrate the effectiveness of this approach for assessing DR load shifting options based on a Time of Use pricing scheme. Through the analysis of the results, the practical benefits and limitations of the proposed approach are addressed.",
    "year": 2018,
    "source": "WOS",
    "area": "derivatives_pricing",
    "method": "machine learning",
    "cache_key": "80808b81bbe30ee82b449ae7ef4b7a22",
    "relevant_keywords": [
      "neural network",
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T01:30:19.007891"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是需求响应能源管理的优化，使用遗传算法和人工神经网络进行电力预测和负载转移优化，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是需求响应能源管理的优化，使用遗传算法和人工神经网络进行电力预测和负载转移优化，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:05:42.561664"
}