{
  "paper": {
    "id": 33,
    "title": "Machine Learning for Financial Risk Management: A Survey",
    "abstract": "Financial risk management avoids losses and maximizes profits, and hence is vital to most businesses. As the task relies heavily on information-driven decision making, machine learning is a promising source for new methods and technologies. In recent years, we have seen increasing adoption of machine learning methods for various risk management tasks. Machine-learning researchers, however, often struggle to navigate the vast and complex domain knowledge and the fast-evolving literature. This paper fills this gap, by providing a systematic survey of the rapidly growing literature of machine learning research for financial risk management. The contributions of the paper are four-folds: First, we present a taxonomy of financial-risk-management tasks and connect them with relevant machine learning methods. Secondly, we highlight significant publications in the past decade. Thirdly, we identify major challenges being faced by researchers in this area. And finally, we point out emerging trends and promising research directions.",
    "year": 2020,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "14a17ddd03d217cf36f13b418f100ab4",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "unsupervised learning",
      "reinforcement learning",
      "classification",
      "regression",
      "support vector machine",
      "SVM",
      "decision tree",
      "clustering",
      "principal components analysis",
      "neural network",
      "deep learning",
      "representation learning",
      "backpropagation",
      "BP",
      "rectified linear unit",
      "ReLU",
      "sigmoid",
      "tanh",
      "hidden layer",
      "convolutional neural network",
      "CNN",
      "recurrent neural network",
      "long short-term memory",
      "LSTM",
      "autoencoder",
      "dropout regularization"
    ],
    "stage1_timestamp": "2025-05-15T01:46:03.823485"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper explicitly focuses on the application of machine learning methods in financial risk management, providing a systematic survey of the literature in this specific area. It discusses various risk management tasks and connects them with relevant machine learning techniques, which clearly indicates its primary application domain is financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper explicitly focuses on the application of machine learning methods in financial risk management, providing a systematic survey of the literature in this specific area. It discusses various risk management tasks and connects them with relevant machine learning techniques, which clearly indicates its primary application domain is financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:01:32.354699"
}