{
  "paper": {
    "id": 4328,
    "title": "Upstream, Downstream or Competitor? Detecting Company Relations for Commercial Activities",
    "abstract": "Due to intricate network in industry business and high cost of supervision, financial institutions usually focus on supervising core enterprises in a supply chain instead of all corporations, which indirectly lower the strength and efficiency of financial institutions as a role of capital supervisor and credit-risk transformer. Furthermore, banks require these corporations to provide correct information by themselves, which lacks of the objectivity of the source information and increases the supervision cost for these banks. Thus, we summarize a company relation detection task in hope to exposing more information about companies to investors and banks by learning a system from public available datasets. We regard this task as an classification problem, and our system can predict relations between any two companies by learning on both structured and unstructured data. To the best of our knowledge, it's the first time to implement deep learning technique to this task. A F1 score 0.769 is achieved from our system.",
    "year": 2019,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "c883f2d5869998d5ec010fb6ab6f7592",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "deep learning",
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T02:36:05.170153"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要研究公司关系检测任务，旨在通过公开数据集学习系统，为投资者和银行提供更多公司信息，从而间接帮助银行降低监督成本和提高资本监督效率，这属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文主要研究公司关系检测任务，旨在通过公开数据集学习系统，为投资者和银行提供更多公司信息，从而间接帮助银行降低监督成本和提高资本监督效率，这属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:33:21.321009"
}