{
  "paper": {
    "id": 1792,
    "title": "Enhanced decision support in credit scoring using Bayesian binary quantile regression",
    "abstract": "Fierce competition as well as the recent financial crisis in financial and banking industries made credit scoring gain importance. An accurate estimation of credit risk helps organizations to decide whether or not to grant credit to potential customers. Many classification methods have been suggested to handle this problem in the literature. This paper proposes a model for evaluating credit risk based on binary quantile regression, using Bayesian estimation. This paper points out the distinct advantages of the latter approach: that is (i) the method provides accurate predictions of which customers may default in the future, (ii) the approach provides detailed insight into the effects of the explanatory variables on the probability of default, and (iii) the methodology is ideally suited to build a segmentation scheme of the customers in terms of risk of default and the corresponding uncertainty about the prediction. An often studied dataset from a German bank is used to show the applicability of the method proposed. The results demonstrate that the methodology can be an important tool for credit companies that want to take the credit risk of their customer fully into account.",
    "year": 2013,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "16b5b5ae749b8c144aac98f150c52fda",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:07:25.742095"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on developing a model for credit risk evaluation using Bayesian binary quantile regression, which is directly related to assessing and managing the risk of customer defaults—a core aspect of financial risk management in banking and credit industries.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on developing a model for credit risk evaluation using Bayesian binary quantile regression, which is directly related to assessing and managing the risk of customer defaults—a core aspect of financial risk management in banking and credit industries.\"\n}\n```"
  },
  "timestamp": "2025-05-20T14:24:02.043348"
}