{
  "paper": {
    "id": 5144,
    "title": "Zero-inflated Poisson regression with random effects to evaluate an occupational injury prevention programme",
    "abstract": "This study presents a zero-inflated Poisson regression model with random effects to evaluate a manual handling injury prevention strategy trialled within the cleaning services department of a 600 bed public hospital between 1992 and 1995. The hospital had been experiencing high annual rates of compensable injuries of which over 60 per cent were attributed to manual handling. The strategy employed Workplace Risk Assessment Teams (WRATS) that utilized a workplace risk identification, assessment and control approach to manual handling injury hazard reduction. The WRATS programme was an intervention trial, covering the 1988-1995 financial years. In the course of compiling injury counts, it was found that the data exhibited an excess of zeros, in the context that the majority of cleaners did not suffer any injuries. This phenomenon is typical of data encountered in the occupational health discipline. We propose a zero-inflated random effects Poisson regression model to analyse such longitudinal count data with extra zeros. The WRATS intervention and other concomitant information on individual cleaners are considered as fixed effects in the model. The results provide statistical evidence showing the value of the WRATS programme. In addition, the methods can be applied to assess the effectiveness of intervention trials on populations at high risk of manual handling injury or indeed of injury from other hazards. Copyright (C) 2001 John Wiley & Sons, Ltd.",
    "year": 2001,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "0a07b0b4fefa81f7449d57f0f91159b1",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:44:43.942264"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究零膨胀泊松回归模型在职业伤害预防项目评估中的应用，属于职业健康领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究零膨胀泊松回归模型在职业伤害预防项目评估中的应用，属于职业健康领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:31:08.167967"
}