{
  "paper": {
    "id": 1890,
    "title": "Mining of risk perception dimensions of Chinese tourists' outbound tourism based on word vector method",
    "abstract": "IntroductionSafety is the lifeline of tourism development. The article's goal is to examin how Chinese tourists perceive risk when travelling aboard. MethodsIn order to create the initial corpus, this study first uses outbound tourismas the key word to crawl the question and answer (hereinafter referred to as Q & A) data from 4 Chinese online travel operator platforms, then preprocesses the Q & A data in Python. Secondly, after being extracted, the feature words are converted into the word vector model using the word vector method based on neural network language model. Finally, the word vectors are clustered and classified. ResultsIt is found that there are six dimensions of risk perception of Chinese tourists' outbound tourism, namely traffic risk, planning risk, service risk, communication risk, financial risk and functional risk. DiscussionImportant and practical information for government and tourism enterprises is provided to accurately grasp the risk perception of Chinese tourists' outbound tourism and continuously improve the supply of tourism risk information.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "9b5e415a6cd6a9091e47d4ba97464764",
    "relevant_keywords": [
      "neural network",
      "clustering",
      "feature representation",
      "word vector method"
    ],
    "stage1_timestamp": "2025-05-15T02:08:39.044503"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究中国游客出境旅游的风险感知维度，虽然提到了金融风险作为其中一个维度，但核心技术（如词向量方法和聚类）主要用于旅游风险分析，而非特定的金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究中国游客出境旅游的风险感知维度，虽然提到了金融风险作为其中一个维度，但核心技术（如词向量方法和聚类）主要用于旅游风险分析，而非特定的金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:45:29.912620"
}