{
  "paper": {
    "id": 5520,
    "title": "Prediction of Weather-Related Incidents on the Rail Network: Prototype Data Model for Wind-Related Delays in Great Britain",
    "abstract": "The impacts of extreme weather events on railway operations are complex and in the most severe cases can cause significant disruption to the rail services, leading to delays for passengers and financial penalties to the industry. This paper presents a prototype data model with logistic regression analysis, which enables exploration of the underlying causal factors impacting on weather-related incidents on the rail network. The methodology is demonstrated by using wind-related delay data gathered from the Anglia Route of Great Britain's rail network between financial year 2006-2007 and 2014-2015. The work presented draws on a diverse group of data resources, including climatic, geographical, and vegetation data sets, in order to include a wide range of potential contributing factors in the initial analysis. It investigates ways in which these data may be used to predict when and where wind-related disruptions would be likely to occur, thus enabling us to gain a deeper understanding of the conditions that prevail in sites at risk of disruption events, pointing to possible mitigation in the design of the infrastructure, and their relationship to the local environment.",
    "year": 2018,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "e925b45520a9abe3e636eaab16437e99",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:48:51.279860"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究天气相关事件对铁路网络的影响，并开发了一个数据模型来预测风力相关的延误。虽然使用了回归分析技术，但其应用领域是铁路运营和基础设施管理，而非金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究天气相关事件对铁路网络的影响，并开发了一个数据模型来预测风力相关的延误。虽然使用了回归分析技术，但其应用领域是铁路运营和基础设施管理，而非金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:30:03.376315"
}