{
  "paper": {
    "id": 5582,
    "title": "Propensity to Succeed: Prioritizing Individuals Most Likely to Benefit from Care Coordination",
    "abstract": "The objective was to develop a propensity to succeed (PTS) process for prioritizing outreach to individuals with Medicare Supplement (ie, Medigap) plans who qualified for a high-risk case management (HRCM) program. Demographic, socioeconomic, health status, and local health care supply data from previous HRCM program participants and nonparticipants were obtained from Medigap membership and health care claims data and public data sources. Three logistic regression models were estimated to find members with higher probabilities of engaging in the HRCM program, receiving high quality of care once engaged, and incurring enough monetary savings related to program participation to more than offset program costs. The logistic regression model intercepts and coefficients yielded the information required to build predictive models that were then applied to generate predicted probabilities of program engagement, high quality of care, and cost savings a priori for different members who later qualified for the HRCM program. Predicted probabilities from the engagement and cost models were then standardized and combined to obtain an overall PTS score, which was sorted from highest to lowest and used to prioritize outreach efforts to those newly eligible for the HRCM program. The validity of the predictive models also was estimated. The PTS models for engagement and financial savings were statistically valid. The combined PTS score based on those 2 components helped prioritize outreach to individuals who qualified for the HRCM program. Using PTS models may help increase program engagement and financial success of care coordination programs. (Population Health Management 2015;18:402-411)",
    "year": 2015,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "2d93c5ddef7212020c0c51b8e78baa63",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:49:21.652943"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是医疗保健管理中的优先级排序和成本节约，虽然使用了回归模型，但其应用场景是医疗保健而非金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是医疗保健管理中的优先级排序和成本节约，虽然使用了回归模型，但其应用场景是医疗保健而非金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:30:02.646848"
}