{
  "paper": {
    "id": 1128,
    "title": "Online Mining in Unstructured Financial Information: An Empirical Study in Bulletin News",
    "abstract": "The Internet produces massive financial unstructured textual information every day. How to utilize these unstructured data effectively is a challenging topic. In the background of A share T+0 and stock option promoting in the China security market, we present a model to recognize the risk and investment opportunity according to the massive online financial textual information. Since the key word vector is in extremely high dimension space and critical in influencing the performance of our forecast models, a manifold learning method is firstly applied to reduce its dimension while keeping essential features. By utilizing financial event study, we secondly apply support vector machines to predict the news type and sentiment value. The model can achieve the intelligent and instant match between textual news and the reactions of stock market. Our results provide prompt supports for financial practitioners to make investment decisions no matter they are in long or in short positions in the market.",
    "year": 2015,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "de7c31b2d6537970d13031b9ff68ef8a",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "support vector machine",
      "SVM",
      "manifold learning",
      "feature learning",
      "feature representation"
    ],
    "stage1_timestamp": "2025-05-15T01:59:21.597830"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是利用机器学习方法从非结构化金融文本信息中识别风险和投资机会，为金融从业者提供及时的投资决策支持，这主要应用于投资组合管理领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是利用机器学习方法从非结构化金融文本信息中识别风险和投资机会，为金融从业者提供及时的投资决策支持，这主要应用于投资组合管理领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:51:58.407184"
}