{
  "paper": {
    "id": 1576,
    "title": "Forecasting SMEs' credit risk in supply chain finance with a sampling strategy based on machine learning techniques",
    "abstract": "Exploring the value of multi-source information fusion to predict small and medium-sized enterprises' (SMEs) credit risk in supply chain finance (SCF) is a popular yet challenging task, as two issues of key variable selection and imbalanced class must be addressed simultaneously. To this end, we develop new forecast models adopting an imbalance sampling strategy based on machine learning techniques and apply these new models to predict credit risk of SMEs in China, using financial information, operation information, innovation information, and negative events as predictors. The empirical results show that the financial-based information, such as TOC, NIR, is most useful in predicting SMEs' credit risk in SCF, and multi-source information fusion is meaningful in better predicting the credit risk. In addition, based on the preferred CSL-RF model, which extends cost-sensitive learning to a random forest, we also present the varying mechanisms of key predictors for SMEs' credit risk by using partial dependency analysis. The strategic insights obtained may be helpful for market participants, such as SMEs' managers, investors, and market regulators.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "ff59ef84eb10efaead739882abb5f9b0",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "decision tree",
      "feature learning",
      "feature representation",
      "random forest"
    ],
    "stage1_timestamp": "2025-05-15T02:05:08.127746"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on predicting credit risk for SMEs in supply chain finance using machine learning techniques, which is a core aspect of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on predicting credit risk for SMEs in supply chain finance using machine learning techniques, which is a core aspect of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:47:58.124552"
}