{
  "paper": {
    "id": 770,
    "title": "Classification of properties and their relation to chemical bonding: Essential steps toward the inverse design of functional materials",
    "abstract": "To design advanced functional materials, different concepts are currently pursued, including machine learning and high-throughput calculations. Here, a different approach is presented, which uses the innate structure of the multidimensional property space. Clustering algorithms confirm the intricate structure of property space and re-late the different property classes to different chemical bonding mechanisms. For the inorganic compounds studied here, four different property classes are identified and related to ionic, metallic, covalent, and recently identified metavalent bonding. These different bonding mechanisms can be quantified by two quantum chemical bonding descriptors, the number of electrons transferred and the number of electrons shared between adjacent atoms. Hence, we can link these bonding descriptors to the corresponding property portfolio, turning bonding descrip-tors into property predictors. The close relationship between material properties and quantum chemical bonding descriptors can be used for an inverse material design, identifying particularly promising materials based on a set of target functionalities.",
    "year": 2022,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "ddf71e2b0e208ac25e08b2c4d60daf0e",
    "relevant_keywords": [
      "machine learning",
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T00:47:50.394868"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究材料科学中的功能材料逆向设计，通过聚类算法和量子化学键描述符来预测材料性能，并未涉及任何金融领域的研究或应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究材料科学中的功能材料逆向设计，通过聚类算法和量子化学键描述符来预测材料性能，并未涉及任何金融领域的研究或应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:27:54.294324"
}