{
  "paper": {
    "id": 4896,
    "title": "Evaluating predictive performance of value-at-risk models in emerging markets: A reality check",
    "abstract": "We investigate the predictive performance of various classes of value-at-risk (VaR) models in several dimensions-unfiltered versus filtered VaR models, parametric versus nonparametric distributions, conventional versus extreme value distributions, and quantile regression versus inverting the conditional distribution function. By using the reality check test of White (2000), we compare the predictive power of alternative VaR models in terms of the empirical coverage probability and the predictive quantile loss for the stock markets of five Asian economies that suffered from the 1997-1998 financial crisis. The results based on these two criteria are largely compatible and indicate some empirical regularities of risk forecasts. The Riskmetrics model behaves reasonably well in tranquil periods, while some extreme value theory (EVT)-based models do better in the crisis period. Filtering often. appears to be useful for some models, particularly for the EVT models, though it could be harmful for some other models. The CaViaR quantile regression models of Engle and Manganelli (2004) have shown some success in predicting the VaR risk measure for various periods, generally more stable than those that invert a distribution function. Overall, the forecasting performance of the VaR models considered varies over the three periods before, during and after the crisis. Copyright (c) 2006 John Wiley & Sons, Ltd.",
    "year": 2006,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "902d40d30ab183c272d1514590ba469c",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:42:04.900716"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on evaluating the predictive performance of various Value-at-Risk (VaR) models, which are primarily used for measuring and managing financial risk. The study compares different VaR methodologies and their effectiveness in different market conditions, which is a core aspect of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on evaluating the predictive performance of various Value-at-Risk (VaR) models, which are primarily used for measuring and managing financial risk. The study compares different VaR methodologies and their effectiveness in different market conditions, which is a core aspect of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:31:32.984498"
}