{
  "paper": {
    "id": 191,
    "title": "An empirical study of classification algorithm evaluation for financial risk prediction",
    "abstract": "A wide range of classification methods have been used for the early detection of financial risks in recent years. How to select an adequate classifier (or set of classifiers) for a given dataset is an important task in financial risk prediction. Previous studies indicate that classifiers' performances in financial risk prediction may vary using different performance measures and under different circumstances. The main goal of this paper is to develop a two-step approach to evaluate classification algorithms for financial risk prediction. It constructs a performance score to measure the performance of classification algorithms and introduces three multiple criteria decision making (MCDM) methods (i.e., TOPSIS, PROMETHEE, and VIKOR) to provide a final ranking of classifiers. An empirical study is designed to assess various classification algorithms over seven real-life credit risk and fraud risk datasets from six countries. The results show that linear logistic, Bayesian Network, and ensemble methods are ranked as the top-three classifiers by TOPSIS, PROMETHEE, and VIKOR. In addition, this work discusses the construction of a knowledge-rich financial risk management process to increase the usefulness of classification results in financial risk detection. (C) 2010 Elsevier B.V. All rights reserved.",
    "year": 2011,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "d5c215593654d944b00f92fdc7b26167",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM",
      "decision tree",
      "neural network",
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T01:47:53.017760"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on evaluating classification algorithms for financial risk prediction, specifically mentioning credit risk and fraud risk datasets. This directly aligns with the domain of Financial Risk Management, as it aims to improve the detection and management of financial risks.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on evaluating classification algorithms for financial risk prediction, specifically mentioning credit risk and fraud risk datasets. This directly aligns with the domain of Financial Risk Management, as it aims to improve the detection and management of financial risks.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:00:20.597057"
}