{
  "paper": {
    "id": 366,
    "title": "Better Classifiers for Credit Scoring: A Comparison Study between Self Organizing Maps (SOM) and Support Vector Machine (SVM)",
    "abstract": "Credit scoring has become an increasingly important area for financial institutions. Self Organizing Maps and Support Vector Machine are two techniques of data mining which are used in different applications of businesses. In this paper, we use descriptive variables in literatures and criteria which effect on credit of customers in Iran financial institutions. We will evaluate these variables with Multi Criteria Decision Making (MCDM) and take into account the psychological and sociology viewpoints of experts. Next We apply and compare SVM method against SOM method on the credit database. For comparing these two methods we use coincidence matrix and the Type I and Type II errors. We show that they arc competitive and most significant in determining the risk of default on bank customers",
    "year": 2009,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "7da2ee27f325b35b8f3683969710f99c",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "unsupervised learning",
      "classification",
      "support vector machine",
      "SVM",
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T01:50:13.994832"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on credit scoring and determining the risk of default for bank customers, which is a key aspect of financial risk management in banking and lending institutions.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on credit scoring and determining the risk of default for bank customers, which is a key aspect of financial risk management in banking and lending institutions.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:58:30.470692"
}