{
  "paper": {
    "id": 2073,
    "title": "Range control-based class imbalance and optimized granular elastic net regression feature selection for credit risk assessment",
    "abstract": "Credit risk, stemming from the failure of a contractual party, is a significant variable in financial institutions. Assessing credit risk involves evaluating the creditworthiness of individuals, businesses, or entities to predict the likelihood of defaulting on financial obligations. While financial institutions categorize consumers based on creditworthiness, there is no universally defined set of attributes or indices. This research proposes Range control-based class imbalance and Optimized Granular Elastic Net regression (ROGENet) for feature selection in credit risk assessment. The dataset exhibits severe class imbalance, addressed using Range-Controlled Synthetic Minority Oversampling TEchnique (RCSMOTE). The balanced data undergo Granular Elastic Net regression with hybrid Gazelle sand cat Swarm Optimization (GENGSO) for feature selection. Elastic net, ensuring sparsity and grouping for correlated features, proves beneficial for assessing credit risk. ROGENet provides a detailed perspective on credit risk evaluation, surpassing conventional methods. The oversampling feature selection enhances the accuracy of minority class by 99.4, 99, 98.6 and 97.3%, respectively.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "07b2bd2b477d040960de7e8619ffa043",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "regression",
      "feature learning",
      "feature representation"
    ],
    "stage1_timestamp": "2025-05-15T02:10:58.961251"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on credit risk assessment, which is a key aspect of financial risk management. It proposes a method for feature selection to improve the accuracy of predicting credit defaults, directly addressing the management of credit risk in financial institutions.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on credit risk assessment, which is a key aspect of financial risk management. It proposes a method for feature selection to improve the accuracy of predicting credit defaults, directly addressing the management of credit risk in financial institutions.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:44:26.167391"
}