{
  "paper": {
    "id": 613,
    "title": "FINANCIAL INFORMATION FRAUD RISK WARNING FOR MANUFACTURING INDUSTRY - USING LOGISTIC REGRESSION AND NEURAL NETWORK",
    "abstract": "This study aims to use financial variables, corporate governance variables, and cash flow variables to construct financial information fraud warning models for the manufacturing industry, and applies logistics regression and back propagation neural network (BPNN) to determine the accuracy rate of identifying normal company samples and fraudulent company samples. In a ratio of '1:2', this study collects the data of 96 fraudulent company samples and 192 normal company samples, over a period of 3 years (a total of 288 samples) for prediction. The results indicate that debt ratio and shareholding ratio of board directors are two important financial variables for the identification of manufacturing industry frauds. Logistic regression has better identification capacity than BPNN in both cases of normal and fraudulent company samples. This study provides a set of correct and real-time financial information fraud warning models for the manufacturing industry, which can predict financial information frauds by observing the changes of various financial variables and shareholding ratio of the board directors in real-time. These findings can serve as a reference to financiers and the manufacturing industry for establishing credit policies.",
    "year": 2011,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "7818a71aed3a49859b0b72b8a45256bf",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "regression",
      "neural network",
      "backpropagation",
      "BP",
      "sigmoid"
    ],
    "stage1_timestamp": "2025-05-15T01:53:24.725224"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要研究使用逻辑回归和神经网络构建财务信息欺诈预警模型，旨在识别和预测制造业中的财务欺诈行为。这属于金融风险管理中的欺诈风险识别和预警范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文主要研究使用逻辑回归和神经网络构建财务信息欺诈预警模型，旨在识别和预测制造业中的财务欺诈行为。这属于金融风险管理中的欺诈风险识别和预警范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:56:19.220189"
}