{
  "paper": {
    "id": 1543,
    "title": "Comparative Analysis on Neural Networks and ARIMA for Forecasting Heterogeneous Portfolio Returns",
    "abstract": "In the domain of portfolio management theory, the principle of separation postulates that all investors will achieve an identical optimal risk portfolio given the same inputs. However, the realization of true optimality depends on the accuracy of technical analysis, conducted by portfolio managers or investors in predicting the rate of return for the financial assets, encompassed in the portfolio. This article leverages the Nonlinear AutoRegressive with Exogenous inputs Neural Network (NARXNN) for the purpose of predicting the prices of ten financial instruments, facilitating the computation of their respective rates of return. Subsequently, a multi-objective optimization problem is formulated to construct an optimal risk portfolio that concurrently maximizes return while minimizing risk. The resulting portfolio is then compared with a similar portfolio derived from the same dataset, utilizing Autoregressive Integrated Moving Average (ARIMA) models to forecast the rates of return for the assets.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "f2fc22ab6068a82ce4e20daf4cf92920",
    "relevant_keywords": [
      "machine learning",
      "neural network",
      "deep learning",
      "representation learning",
      "backpropagation",
      "BP",
      "hidden layer",
      "recurrent neural network",
      "long short-term memory",
      "LSTM"
    ],
    "stage1_timestamp": "2025-05-15T02:04:20.104756"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是使用神经网络和ARIMA模型预测金融资产的回报率，并构建最优风险投资组合，这直接属于投资组合管理的研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是使用神经网络和ARIMA模型预测金融资产的回报率，并构建最优风险投资组合，这直接属于投资组合管理的研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:48:20.844194"
}