{
  "paper": {
    "id": 2218,
    "title": "Transfer-Learning-Based Opinion Mining for New-Product Portfolio Configuration over the Case-Based Reasoning Cycle",
    "abstract": "Due to the ever-changing business environment, enterprises are facing unprecedented challenges in their new-product development (NPD) processes, while the success and survival of NPD projects have become increasingly challenging in recent years. Thus, most enterprises are eager to revamp existing NPD processes so as to enhance the likelihood of new products succeeding in the market. In addition to the determination of sustainable new-product ideas and designs, new-product portfolio management (NPPM) is an active research area for allocating adequate resources to boost project development, while projects that perform poorly can be terminated. Since the existing new-product portfolio configuration is manually decided, this study explores the possibility of standardising NPPM, particularly the configuration mechanism, in a systematic manner. Subsequently, case-based reasoning can be applied to structure the entire NPPM process, in which past knowledge and successful cases can be used to configure new projects. Furthermore, customer feedback was analyzed using the transfer-learning-based text classification model in the case-retrieval process to balance the values of enterprises and customers. A new-product portfolio was therefore configured to facilitate NPPM under an agile-stage-gate model. To verify the effectiveness of the proposed system, a case study in a printer manufacturing company was conducted, where positive feedback and performances were found.",
    "year": 2022,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "62ee59a2791c25aa910ee45603dfe286",
    "relevant_keywords": [
      "machine learning",
      "classification",
      "deep learning",
      "transfer learning"
    ],
    "stage1_timestamp": "2025-05-15T01:04:27.444439"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究新产品组合管理（NPPM）和基于案例推理的配置机制，虽然提到了'portfolio'一词，但其应用场景是新产品开发而非金融投资组合管理。论文的核心技术是迁移学习在文本分类中的应用，用于分析客户反馈，与金融领域的衍生品定价、风险管理或投资组合管理无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究新产品组合管理（NPPM）和基于案例推理的配置机制，虽然提到了'portfolio'一词，但其应用场景是新产品开发而非金融投资组合管理。论文的核心技术是迁移学习在文本分类中的应用，用于分析客户反馈，与金融领域的衍生品定价、风险管理或投资组合管理无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:16:41.542354"
}