{
  "paper": {
    "id": 6376,
    "title": "CAPM in Real World: Risk-Friendly Investments",
    "abstract": "The aim of this paper is to show how the existence of equilibrium in CAPM may be obtained when individuals/investors are risk friendly. This assumption is closer to the real world, since risk aversion is rare and the portfolios implying a greater payoff are the ones which increase the variance of the payoff itself. Specifically, we assume that the wage vectors of the individuals/investors do not lie in the market space, which is the usual assumption for CAPM, namely, the payoff of any portfolio is replicated by the wage of the individuals/investors. The interpretation of such an assumption is that the wealth of the individuals/investors may not invest in financial markets as a whole. The second main result is that the perception of risk by the objective probabilities for the states of the world does not affect the equilibrium existence. This is a consequence of the No-Arbitrage assumption. This condition may be stated in terms of the existence of the objective probabilities for the states of the world. Since CAPM is usually considered as a way to compare the return of the so-called market portfolio and the return of any other portfolio, in the final section of this paper, we do provide the regression form of this altered form of CAPM.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "257191ce7221052fd03b36b19465d8e5",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:57:38.718685"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文主要讨论了CAPM（资本资产定价模型）在现实世界中的应用，特别是当投资者对风险持友好态度时的均衡存在性。CAPM是投资组合管理中的核心理论之一，用于比较市场组合和其他组合的回报。论文的研究目标和内容主要集中在投资组合管理的理论和应用上，并未涉及衍生品定价或金融风险管理的具体技术或应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文主要讨论了CAPM（资本资产定价模型）在现实世界中的应用，特别是当投资者对风险持友好态度时的均衡存在性。CAPM是投资组合管理中的核心理论之一，用于比较市场组合和其他组合的回报。论文的研究目标和内容主要集中在投资组合管理的理论和应用上，并未涉及衍生品定价或金融风险管理的具体技术或应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:27:54.675331"
}