{
  "paper": {
    "id": 1340,
    "title": "Portfolio trading system of digital currencies: A deep reinforcement learning with multidimensional attention gating mechanism",
    "abstract": "As a hot topic in the financial engineering, the portfolio optimization aims to increase investors' wealth. In this paper, a portfolio management system based on deep-reinforcement learning is proposed. In contrast to inflexible traditional methods, the proposed system achieves a better trading strategy through Reinforcement learning. The reward signal of Reinforcement learning is updated by action weights from Deep learning networks. Low price, high price and close price constitute the inputs, but the importance of these three features is quite different. Traditional methods and the classical CNN can't deal with these three features separately, but in our method, a designed depth convolution is proposed to deal with these three features separately. In a virtual currency market, the price rise only occurs in a flash. Traditional methods and CNN networks can't accurately judge the critical time. In order to solve this problem, a three-dimensional attention gating network is proposed and it gives higher weights on rising moments and assets. Under different market conditions, the proposed system achieves more substantial returns and greatly improves the Sharpe ratios. The short-term risk index of the proposed system is lower than those of the traditional algorithms. Simulation results show that the traditional algorithms (including Best, CRP, PAMR, CWMR and CNN) are unable to perform as well as our approach. (C) 2020 Elsevier B.V. All rights reserved.",
    "year": 2020,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "486d46aaef0461a7f2204b0f834f28bd",
    "relevant_keywords": [
      "machine learning",
      "reinforcement learning",
      "deep learning",
      "neural network",
      "convolutional neural network",
      "CNN",
      "attention mechanism"
    ],
    "stage1_timestamp": "2025-05-15T02:01:44.806960"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "The paper focuses on developing a portfolio management system for digital currencies using deep reinforcement learning and attention mechanisms, aiming to optimize trading strategies and improve returns, which directly aligns with the field of Portfolio Management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Portfolio Management\"],\n  \"justification\": \"The paper focuses on developing a portfolio management system for digital currencies using deep reinforcement learning and attention mechanisms, aiming to optimize trading strategies and improve returns, which directly aligns with the field of Portfolio Management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:49:47.742078"
}