{
  "paper": {
    "id": 590,
    "title": "RETRACTED: Research on Risk Assessment of Science and Technology Data in Network Finance Based on Portfolio Empowerment (Retracted Article)",
    "abstract": "At present, the proposed network finance technology data risk assessment time is too long, leading to low accuracy. In order to solve the above problems, this paper puts forward the research on the risk assessment of network financial S&T data based on portfolio weighting, determines the risk index of network financial S&T data, calculates the weight of risk data in network S&T data, searches the risk data characteristic quantity in networks according to network S&T risk index, and completes the extraction of risk data. According to the risk data characteristics of network finance, a decision tree is constructed, the data entropy involved in the decision tree is calculated, the types of risk data characteristics are induced, the nodes of the decision tree are created, and the status of risk data of network finance is obtained. The state of risk data is brought into the definition of Bayesian network probability, and the risk degree of risk data is analyzed to improve the precision of risk data analysis. The experimental results show that the risk assessment of network financial S&T data based on portfolio weighting can effectively shorten the assessment time and improve the accuracy.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "5f81414a42c04a2d191ad4d5011cf5a6",
    "relevant_keywords": [
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T01:52:49.481570"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要研究网络金融科技数据的风险评估，通过构建决策树和计算数据熵来分析风险数据的特征和状态，这属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文主要研究网络金融科技数据的风险评估，通过构建决策树和计算数据熵来分析风险数据的特征和状态，这属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:56:39.965242"
}