{
  "paper": {
    "id": 295,
    "title": "Kernel methods for short-term portfolio management",
    "abstract": "Portfolio optimization problem has been studied extensively. In this paper, we look at this problem from a different perspective. Several researchers argue that the USA equity market is efficient. Some of the studies show that the stock market is not efficient around the earning season. Based on these findings, we formulate the problem as a classification problem by using state of the art machine learning techniques such as minimax probability machine (MPM) and support vector machines (SVM). The MPM method finds a bound on the misclassification probabilities. On the other hand, SVM finds a hyperplane that maximizes the distance between two classes. Both methods prove similar results for short-term portfolio management. (c) 2005 Elsevier Ltd. All rights reserved.",
    "year": 2006,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "dfb4dd51ac49f2dc6511e7bfce804300",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM"
    ],
    "stage1_timestamp": "2025-05-15T00:42:00.394451"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "The paper focuses on using machine learning techniques like SVM and MPM for short-term portfolio management, which directly falls under the domain of Portfolio Management. The study aims to optimize portfolios around the earning season, a specific application in this field.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Portfolio Management\"],\n  \"justification\": \"The paper focuses on using machine learning techniques like SVM and MPM for short-term portfolio management, which directly falls under the domain of Portfolio Management. The study aims to optimize portfolios around the earning season, a specific application in this field.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:32:09.179482"
}