{
  "paper": {
    "id": 1787,
    "title": "Towards Using Universal Big Data in Artificial Intelligence Research and Development to Gain Meaningful Insights and Automation Systems",
    "abstract": "The increasing number of human activities using information and communication technology (ICT) generates a tremendous amount of data. It brings the opportunity to use universal big data for further computation that may deliver new insights and automation system. The technology that enables this work is artificial intelligence (AI). As known, the utilization of AI technology is becoming more and more pervasive in our daily life. Furthermore, discussion related to AI has played an essential role in an organization's decision-making process. Thus, this paper discusses the utilization of AI technology that penetrates end-to-end various aspects of human activities, such as in education, health, business, social life and so forth. The end-to-end process begins with data collection covering various types of data (text, picture, audio, video, animation) and various methods (survey, observation, interview, experiment). Then, it continues with the pre-process data cleansing and process to determine data features, and seeks the relationship within them, using machine learning process with appropriate algorithms. The results may then be used for applications portfolio in order to improve organization strategies and programs. The organization's performance can be visualized from time to time for continuous quality improvement. The end-to-end cycles of processes continue, from data collection, data pre-processing and processing, performance computation monitoring (identification, classification, prediction, and prescription), improving strategy and program, and implementing in the real-life activities until generating more behavioral data, finding pattern and design the systems. As a whole, this end-to-end cycle leads us to an AI automation system, with the power to generate meaningful insights suited to solve current problems, predicting trending issues, and understanding phenomena.",
    "year": 2020,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "3dfaecb537a6283ca0610d7599032ee4",
    "relevant_keywords": [
      "machine learning",
      "classification",
      "feature learning",
      "feature representation",
      "neural network",
      "deep learning",
      "representation learning"
    ],
    "stage1_timestamp": "2025-05-15T00:59:23.062609"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要讨论的是人工智能和大数据技术在多个领域的通用应用，如教育、健康、商业等，并未明确指出其在衍生品定价、金融风险管理或投资组合管理等特定金融领域的应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要讨论的是人工智能和大数据技术在多个领域的通用应用，如教育、健康、商业等，并未明确指出其在衍生品定价、金融风险管理或投资组合管理等特定金融领域的应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:18:49.131167"
}