{
  "paper": {
    "id": 39,
    "title": "BP neural network-based early warning model for financial risk of internet financial companies",
    "abstract": "We built an early warning model for financial risk using a back propagation neural network. To this end, the financial data of 136 listed Internet financial companies in the People's Republic of China were selected, spanning from 2010-2019, as the sample for the empirical test. We categorized the financial status of enterprises as either healthy or early warning by the K-means clustering algorithm. Furthermore, factor analysis was performed to obtain seven common factors for building the early warning model. Overall, we confirmed the model's excellent comprehensive accuracy and prediction efficiency, with accuracy, precision, recall, and specificity rates of 99.51%, 99.71%, 99.71%, and 98.30%, respectively. Thus, the model obtained by training and simulation using the back propagation neural network algorithm can effectively screen enterprises with hidden financial conditions and will not misclassify enterprises with good financial conditions. Notably, the misjudgment and omission rates are considerably low. The model is highly capable of identifying the financial status of Internet financial companies and has good predictive power.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "45bd8eb4381edc4fedf3e47307aa90a6",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "clustering",
      "neural network",
      "backpropagation",
      "BP",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T01:46:03.860182"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on building an early warning model for financial risk in internet financial companies using a back propagation neural network, which directly addresses the identification and prediction of financial risks, falling under the domain of Financial Risk Management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on building an early warning model for financial risk in internet financial companies using a back propagation neural network, which directly addresses the identification and prediction of financial risks, falling under the domain of Financial Risk Management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:01:31.452111"
}