{
  "paper": {
    "id": 1115,
    "title": "Interpretability Meets Generalizability: A Hybrid Machine Learning System to Identify Nonlinear Granger Causality in Global Stock Indices",
    "abstract": "Globalization has posed challenges to financial risk management, connecting markets with each other, and making it more difficult to diversify the portfolio to uncorrelated markets than ever in history. In light of this growing complexity of causal relationships between global stock markets, nonlinear Granger causality has superseded its linear counterpart in providing quantitative evidence for these relationships. In this paper, we propose a hybrid system that extends existing nonlinear Granger causality frameworks using machine learning-based time series prediction models. We improve the accuracy of identifying nonlinear Granger causality by combining p-values of causality statistics from individual machine learning models. By adjusting a model independence coefficient, our model is generalized to datasets where the strength of causality varies. Meanwhile, the causality statistic is still interpretable, because the distribution and critical value are known. Our findings challenge the current understanding that the United States market has the dominating influence and show that Asian markets play a significant role in spreading financial risk worldwide.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "6e28ce8941fd628a7aefb100cd020b82",
    "relevant_keywords": [
      "machine learning",
      "neural network",
      "deep learning",
      "recurrent neural network",
      "long short-term memory",
      "LSTM"
    ],
    "stage1_timestamp": "2025-05-15T01:59:21.566471"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on identifying nonlinear Granger causality in global stock indices to understand the spread of financial risk, which is a key aspect of financial risk management. The study aims to improve the accuracy of identifying these causal relationships to better manage financial risks in interconnected markets.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on identifying nonlinear Granger causality in global stock indices to understand the spread of financial risk, which is a key aspect of financial risk management. The study aims to improve the accuracy of identifying these causal relationships to better manage financial risks in interconnected markets.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:51:59.627198"
}