{
  "paper": {
    "id": 1932,
    "title": "Combining market and accounting-based models for credit scoring using a classification scheme based on support vector machines",
    "abstract": "Credit risk rating is an important issue for both financial institutions and companies, especially in periods of economic recession. There are many different approaches and methods which have been developed over the years. The aim of this paper is to create a credit risk rating model, using a machine learning methodology that combines accounting data with the option-based approach of Black, Scholes, and Merton. The model is built on data for companies listed in the Greek stock exchange, but it is also shown to provide accurate results for non-listed firms as well. Linear and nonlinear support vector machines are used for model building, as well as an innovative additive modeling approach, which enables the construction of comprehensible and accurate credit scoring models. (C) 2014 Elsevier Inc. All rights reserved.",
    "year": 2014,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "bb7b6b52b3ce8c07a56d358c6977e28c",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM"
    ],
    "stage1_timestamp": "2025-05-15T02:09:14.356777"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on creating a credit risk rating model using machine learning techniques, which is a core aspect of financial risk management. The combination of accounting data with the option-based approach further supports its application in assessing credit risk, a key concern in risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on creating a credit risk rating model using machine learning techniques, which is a core aspect of financial risk management. The combination of accounting data with the option-based approach further supports its application in assessing credit risk, a key concern in risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:45:11.622830"
}