{
  "paper": {
    "id": 4557,
    "title": "Household flood risk reduction in the Czech Republic",
    "abstract": "This paper uses household surveys in the Beva River Basin, the Czech Republic to determine the coping and adaptation measures that are implemented for flood risk reduction. In 2012, door-to-door surveys with household residents (N = 304) were completed in areas of high, low, and ostensibly no flood risk. Using a probit model as a regression technique through the statistical software STATA, we explored factors that potentially influence coping and adaptation. Overall, coping and adaptation measures for flooding were not undertaken extensively and the rate of change to adopt measures was slow, even amongst flood-affected households. More work is needed to understand the reasons behind their reticence, especially to confirm how much financial factors are a limiting agent. The regression analysis indicated that more children and more men in the household supported the adoption of adaptation measures. As well, when people perceive that they live in a low or high flood risk zone, the likelihood of taking some adaptation measurements increases compared with the perception of living in a no flood risk zone. Meanwhile, the highest negative correlation was that living in a house elevated off the ground decreases the likelihood of taking other adaptation measurements by 20 %.",
    "year": 2015,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "7282252b61c64d117bfb6f6fb16576d8",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:38:20.504041"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究家庭洪水风险的应对和适应措施，虽然使用了回归分析技术，但其应用领域是自然灾害风险管理，而非金融领域的衍生品定价、金融风险管理或投资组合管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究家庭洪水风险的应对和适应措施，虽然使用了回归分析技术，但其应用领域是自然灾害风险管理，而非金融领域的衍生品定价、金融风险管理或投资组合管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:32:22.813546"
}