{
  "paper": {
    "id": 376,
    "title": "Catalyzing Financial Risk Control Excellence: A Novel Fusion Model - PSO-Boost-Trans",
    "abstract": "In today's financial landscape, characterized by the rapid growth of fintech and the extensive application of big data, the volume and complexity of financial transaction data are increasing. This has heightened the need for intelligent risk control models, posing significant challenges to traditional methods. In this case, research on intelligent risk control models based on deep learning has emerged as a new solution. This paper proposes a PSO-Xgboost-Transformer fusion deep learning model designed to enhance the performance of traditional risk control approaches in managing financial risks. The model integrates the Particle Swarm Optimization (PSO) algorithm, the Xgboost model, and the Transformer model to leverage their respective strengths. Initially, the PSO algorithm is employed to select and optimize features, thereby enhancing the model's robustness and generalization capabilities. Subsequently, the Xgboost model uses these optimized features for prediction and evaluation, generating preliminary risk prediction results.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "deep learning",
    "cache_key": "e3941d5d06d64bd4b91c9ccbbf8ccab5",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "neural network",
      "attention mechanism",
      "feature learning",
      "representation learning"
    ],
    "stage1_timestamp": "2025-05-15T01:37:32.440464"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on developing an intelligent risk control model to enhance the performance of traditional risk control approaches in managing financial risks, which clearly falls under the domain of Financial Risk Management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on developing an intelligent risk control model to enhance the performance of traditional risk control approaches in managing financial risks, which clearly falls under the domain of Financial Risk Management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:03:39.700478"
}