{
  "paper": {
    "id": 1351,
    "title": "An approach to predict and forecast the price of constituents and index of cryptocurrency using machine learning",
    "abstract": "At present, cryptocurrencies have become a global phenomenon in financial sectors, as it is one of the most traded financial instruments worldwide. Cryptocurrency is not only one of the most complicated and abstruse fields among financial instruments but also deemed as a perplexing problem in finance due to its high volatility. This work makes an attempt to apply machine learning techniques on the index and constituents of cryptocurrency with a goal to predict and forecast prices thereof. In particular, the purpose of this article is to predict and forecast the close (closing) price of the cryptocurrency index 30 and nine constituents of cryptocurrencies using machine learning algorithms and models so that it becomes easier for people to trade these currencies. We have used several machine learning techniques and algorithms and compared the models with each other to get the best output. We believe that our work will help reduce the challenges and difficulties faced by people who invest in cryptocurrencies. Moreover, the obtained results can play a major role in cryptocurrency portfolio management and in observing the fluctuations in the prices of constituents of cryptocurrency market. We have also compared our approach with similar state of the art works from the literature, where machine learning approaches have been considered for predicting and forecasting the prices of these currencies. In the sequel, we have found that our best approach presents better and competitive results (especially by using ensemble learning method) than the best works from the literature thereby advancing the state of the art. Using such prediction and forecasting methods, people can easily understand the trend and it would be even easier for them to trade in a difficult and challenging financial instrument like cryptocurrency. (C) 2020 Elsevier B.V. All rights reserved.",
    "year": 2020,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "181ccd7390770b0f436e080f83dfdf6c",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "regression",
      "ensemble learning"
    ],
    "stage1_timestamp": "2025-05-15T00:54:56.359269"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的主要目标是使用机器学习技术预测和预测加密货币的价格，以帮助投资者更容易地交易这些货币。此外，论文还提到其研究结果可以在加密货币投资组合管理中发挥重要作用。因此，该论文的核心技术主要应用于投资组合管理领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的主要目标是使用机器学习技术预测和预测加密货币的价格，以帮助投资者更容易地交易这些货币。此外，论文还提到其研究结果可以在加密货币投资组合管理中发挥重要作用。因此，该论文的核心技术主要应用于投资组合管理领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:21:38.421557"
}