{
  "paper": {
    "id": 768,
    "title": "Recognizing the pattern of beta coefficient based on rough sets and improved SVM",
    "abstract": "Systematic risk (Beta) which is presented by beta is the avoidless risk on the stock market Beta is calculated by linear analysis between the prices of stocks and the security index of stock market However, many studies have showed there are stronger relationships between beta and financial ratios. Therefore, a hybrid intelligent system is applied to recognize the clusters of beta (systematic risk), combining rough set approach and improved SVM. We can get reduced information table with no information loss by rough set approach. And then, this reduced information is used to develop classification rules and train SVM. At the same time, in order to improve the general recognizing ability of SVM, we make use of the particle swarm algorithm to optimize the SVM, and obtain appropriate parameters. The rationale of our hybrid system is using rules developed by rough sets for an object that matches any of the rules and SVM for one that does not match any of them. The effectiveness of our methodology was verified by experiments comparing BP neural networks with our approach.",
    "year": 2007,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "765312457b87b171ffd501e258a104f2",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM",
      "neural network",
      "backpropagation",
      "BP"
    ],
    "stage1_timestamp": "2025-05-15T01:55:07.982794"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用粗糙集和改进的支持向量机（SVM）来识别系统性风险（Beta系数）的模式。系统性风险是金融风险管理中的一个重要概念，论文的研究目标是通过分析Beta系数与财务比率之间的关系来更好地理解和预测市场风险。因此，该论文的主要应用领域是金融风险管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是使用粗糙集和改进的支持向量机（SVM）来识别系统性风险（Beta系数）的模式。系统性风险是金融风险管理中的一个重要概念，论文的研究目标是通过分析Beta系数与财务比率之间的关系来更好地理解和预测市场风险。因此，该论文的主要应用领域是金融风险管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:54:42.578932"
}