{
  "paper": {
    "id": 1632,
    "title": "EVALUATION OF DERIVATIVES IMPACT TO EARLY SYSTEMIC RISK OF EURO AREA",
    "abstract": "Introduction. Evaluation of systemic risk is very complicated, as it is difficult to accurately predict the extent of the links between various institutions, and the possible spread and scale of the country's systemic risk. In addition, the country's systemic crisis is affected by many factors, many elements of the financial system. Financial derivatives are one of many elements of financial system, and the market of financial derivatives is huge compared to other financial instruments. The impact of financial derivatives to economies of various countries has been widely studied, however, the research on their impact to countries' early systemic risk remains under-researched. For this reason, assessment of the impact of derivative financial instruments on the early systemic risk is very relevant. Aim and tasks. The purpose of the article is to assess the impact of financial derivatives on the country's early systemic risk in the Euro area region. Results. It is shown that correlation fluctuates between weak-strong level, when analyzing relationship between various factors of financial derivatives and early systemic risk in the Euro area. Results of linear regression analysis prove that the group of financial derivatives independent variables (interconnection, size, liquidity, complexity, stability, leverage) can be used to reliably estimate the dependent variable (early systemic risk). Logistic regression analysis also provides similar results to the linear regression analysis. Additionally, it is shown, that logistic regression is more suitable to analyze impact on early systemic risk. Analysis of impact of individual financial derivatives factors to early systemic risk demonstrate, that three financial derivatives factors - size, complexity, and leverage - may be the best predictors of an impending systemic crisis. Among these factors, the size factor has the largest impact on early systemic risk of the Euro area, and complexity factor shows improved statistical parameters, which indicates, that this parameter is more suitable to be used in early warning system models. Conclusions. The use of financial derivatives has strong impact on early systemic risk in the Euro area. The size factor of financial derivatives indicates the highest probability of an impending systemic crisis. Nevertheless, complexity factor of financial derivatives is the only statistically significant factor, that has an impact on early systemic risk. The results suggest that the inclusion of these factors in the systemic risk assessment models, which are developed by researchers, could increase the accuracy of the models. It is noted, that country's systemic risk may not necessarily arise in financial derivatives, because there are many different financial products in the financial system. As a result, other financial instruments could also be the subject to further research by scientists. The inclusion of factors of various financial instruments could help to better identify the risks of impeding systemic crisis in systemic risk assessment models.",
    "year": 2020,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "31f80f76ba0e48cbf4665145a3e2b917",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:05:42.526190"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要研究金融衍生品对欧元区早期系统性风险的影响，通过回归分析评估了衍生品的多个因素对系统性风险的预测能力，这属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文主要研究金融衍生品对欧元区早期系统性风险的影响，通过回归分析评估了衍生品的多个因素对系统性风险的预测能力，这属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:47:20.146262"
}