{
  "paper": {
    "id": 1995,
    "title": "RETRACTED: LSTM-Based Deep Model for Investment Portfolio Assessment and Analysis (Retracted Article)",
    "abstract": "In recent years, within the scope of financial quantification, quantitative investment models that support human-oriented algorithms have been proposed. These models attempt to characterize fiat-delayed series through intelligent acquaintance methods to predict data and arrange investment strategies. The standard long short-term memory (LSTM) neural network has the shortcoming of low effectiveness of the fiscal cycle sequence. This work utters throughout the amended LSTM design. The augury result of the neural reticulation was upgraded by coalesce attentional propose to the LSTM class, and a genetic algorithmic program product was formulated. Genetic algorithm (GA) updates the inalienable parameters to a higher generalization aptitude. Using man stock insignitor future data from January 2019 to May 2020, we accomplish a station-of-the-contrivance algorithmic rule. Inferences have shown that the improved LSTM example proposed in this paper outperforms other designs in multiple respect, and it performs effectively in investment portfolio design, which is suitable for future investment.",
    "year": 2022,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "390a9c27c61633a36a56f7d3e196040c",
    "relevant_keywords": [
      "machine learning",
      "neural network",
      "deep learning",
      "long short-term memory",
      "LSTM",
      "attention mechanism"
    ],
    "stage1_timestamp": "2025-05-15T01:02:10.093708"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是改进的LSTM模型结合注意力机制和遗传算法，用于投资组合的设计和评估，明确提到其在投资组合设计中的有效性，这属于投资组合管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是改进的LSTM模型结合注意力机制和遗传算法，用于投资组合的设计和评估，明确提到其在投资组合设计中的有效性，这属于投资组合管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:17:47.756387"
}