{
  "paper": {
    "id": 1572,
    "title": "Analyses on Volatility Clustering in Financial Time-Series Using Clustering Indices, Asymmetry, and Visibility Graph",
    "abstract": "The volatility clustering has critical implications in financial risk management. This paper aims to analyze the existence and cause of volatility clustering in financial time-series using different measures simultaneously. Specifically, we utilize the clustering indices, asymmetry measures, and the power of the scale freeness in the visibility graph. For the experiment, we utilize four representing financial time-series, including the S&P500, one-year US Treasury Constant Maturity rate, Euro-Dollar exchange rate, and Crude oil for the stock, bond, exchange, and commodity markets, respectively. The duration of the experiment is from 2009 to 2018, which is divided into two sub-periods: crisis and post-crisis periods. At first, we identify the positive and slowly decaying non-linear autocorrelation in all markets, which indicates the power-law decay. Also, the autocorrelation of the simulated time-series suggests that the order of return-series with respect to its magnitude contributes more to the volatility clustering than the heavy-tailed distributions. Secondly, we detect that the scale of the return contributes more to volatility clustering than the sign of the return. Lastly, we observe that the clustering and asymmetry measures are more robust measures to the return distribution changes than the PSVG to analyze the volatility clustering.",
    "year": 2020,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "ae2ab5398a8e1f774ee8d8716cc24382",
    "relevant_keywords": [
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T02:05:08.104121"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on analyzing volatility clustering in financial time-series, which is directly related to understanding and managing financial risks. The study uses various measures to examine volatility clustering, a phenomenon critical for risk assessment and management in financial markets.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on analyzing volatility clustering in financial time-series, which is directly related to understanding and managing financial risks. The study uses various measures to examine volatility clustering, a phenomenon critical for risk assessment and management in financial markets.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:47:58.496437"
}