{
  "paper": {
    "id": 26,
    "title": "A Risk Feature Recognition Method of Cross-Border Financial Derivatives' Transaction Based on Fuzzy Support Vector Machine",
    "abstract": "The traditional identification methods of transaction risk characteristics mostly use the amount of profit and cost to complete the risk assessment. The conflict between the two will lead to low stability. Therefore, the identification method of transaction risk characteristics of transnational financial derivatives is proposed. The fuzzy support vector machine method is used to identify the risk characteristics of cross-border financial derivatives transactions and compensate the errors in the identification process. The possibility index, severity index, and financial risk index of cross-border financial derivatives transaction risk are calculated, and the financial risks are screened and ranked. The distance from risk element to positive ideal solution and negative ideal solution is defined, and the joint identification model of transaction risk of transnational financial derivatives is constructed to realize the identification of transaction risk characteristics. The experimental results show that the designed method has good recognition effect and high recognition performance.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "943f0cc6fde3357b1a45841d340d2a7b",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "support vector machine",
      "SVM",
      "classification"
    ],
    "stage1_timestamp": "2025-05-15T01:46:03.786238"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on identifying and assessing risk characteristics of cross-border financial derivatives transactions using a fuzzy support vector machine method. It calculates risk indices and constructs a model for risk identification, which is directly related to financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on identifying and assessing risk characteristics of cross-border financial derivatives transactions using a fuzzy support vector machine method. It calculates risk indices and constructs a model for risk identification, which is directly related to financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:01:33.339429"
}