{
  "paper": {
    "id": 4047,
    "title": "Usage of analytical services in industry today and tomorrow",
    "abstract": "Data is everywhere. Both, machines and men leave a digital shadow behind, which, for some means the success or failure of their business. Enterprises strive to make the most of this scattered, diverse and ever growing data, in order to obtain information they can apply to the decision-making processes. But, apart from the known and researched technical issues of volume, variety and velocity; more essential issues have to be addressed. Namely, how does an enterprise find the analytical model it needs to obtain the information it desires? From simple regression analyses to artificial intelligence, the variety in which data can be analyzed is immense. Involving specialist and consultants is time-consuming, needs effort and is usually too expensive, especially for SMEs. This paper discusses the current options in the usage of analytics by enterprises as well as the existing challenges and elaborates recommendations for the future. Special focus is put on customer-oriented analytics by means of analytical services. In these, the building blocks of analytics are modularized in three layers: Data Interpretation & Cleansing Layer, Data Processing Layer, and Data Visualization Layer. This modularization allows building analytics in a standardized manner. Such services aim at reducing the gap between the holders of expert knowledge and the users of analytics. This is achieved by placing the attention on obtaining the desired information (choosing from a portfolio of analytics) instead of solving fundamental challenges, already addressed by the respective modules. (C) 2016 Published by Elsevier B.V.",
    "year": 2016,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "fb55346757f69ad6f78ab62e8b6895ac",
    "relevant_keywords": [
      "regression",
      "artificial intelligence"
    ],
    "stage1_timestamp": "2025-05-15T01:23:27.275663"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要讨论了企业在数据分析方面的应用和挑战，特别是通过模块化分析服务来简化数据分析过程。虽然提到了回归分析和人工智能等技术，但并未明确指出这些技术在衍生品定价、金融风险管理或投资组合管理等特定金融领域的应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要讨论了企业在数据分析方面的应用和挑战，特别是通过模块化分析服务来简化数据分析过程。虽然提到了回归分析和人工智能等技术，但并未明确指出这些技术在衍生品定价、金融风险管理或投资组合管理等特定金融领域的应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:08:20.109592"
}