{
  "paper": {
    "id": 2381,
    "title": "Intertemporal asset allocation: A comparison of methods",
    "abstract": "This paper compares two recent Monte Carlo methods advocated for the computation of optimal portfolio rules. The candidate methods are the approach based on Monte Carlo with Malliavin Derivatives (MCMD) proposed by Detemple, Garcia and Rindisbacher [Detemple et al., 2003. A Monte-Carlo method for optimal portfolios. Journal of Finance 58, 401-406] and the approach based on Monte Carlo with regression (MCR) of Brandt, Goyal, Santa-Clara and Stroud [Brandt et al., 2003. A simulation approach to dynamic portfolio choice with an application to learning about return predictability. Working paper, Wharton School]. Our comparisons are carried out in the context of various intertemporal portfolio choice problems with two assets, a risky asset and a riskless asset, and different configurations of the state variables. The specifications studied include a linear model with a single state variable admitting an exact solution and a non-linear model with two state variables that requires a purely numerical resolution. The accuracies of the candidate methods are compared. We provide, in particular, efficiency plots displaying the speed-accuracy trade-off for various selections of the relevant simulation and discretization parameters. MCMD is shown to dominate in all the settings considered. (c) 2005 Elsevier B.V. All rights reserved.",
    "year": 2005,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "dbe6e14f8e72593f371b0b6f64a898ec",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:06:10.805134"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "The paper focuses on comparing Monte Carlo methods for computing optimal portfolio rules in intertemporal portfolio choice problems, which is a core topic in Portfolio Management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Portfolio Management\"],\n  \"justification\": \"The paper focuses on comparing Monte Carlo methods for computing optimal portfolio rules in intertemporal portfolio choice problems, which is a core topic in Portfolio Management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:15:26.651831"
}