{
  "paper": {
    "id": 1915,
    "title": "A Type-2 Fuzzy Rule-Based Expert System Model for Portfolio Selection",
    "abstract": "This paper presents a type-2 fuzzy rule based expert system to handle uncertainty in complex problems such as portfolio selection. In a type-2 fuzzy expert system both antecedent and consequent have type-2 membership function. This research uses indirect approach fuzzy modeling, where the rules are extracted automatically by implementing a clustering approach. For this purpose, a new cluster analysis approach based on Fuzzy C-Means (FCM) is developed to generate primary membership of type-2 membership functions. A new cluster validity index based on Xie-Beni validity index is presented. The proposed type-2 fuzzy model is applied in stock market factors (such as risk, return, dividend,...) as the input variables. This model is tested on Tehran Stock Exchange (TSE). Through the intensive experimental tests, the model has successfully selected the most efficient portfolio based on individual investor. The results are very encouraging and can be implemented in a real-time trading system for stock.",
    "year": 2008,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "bfe235f29982ca13267c6a434639c30a",
    "relevant_keywords": [
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T01:01:06.133220"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "The paper explicitly focuses on portfolio selection, utilizing a type-2 fuzzy rule-based expert system to handle uncertainty in selecting stocks based on factors like risk, return, and dividend. The model is tested on the Tehran Stock Exchange to select efficient portfolios, which directly aligns with the domain of Portfolio Management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Portfolio Management\"],\n  \"justification\": \"The paper explicitly focuses on portfolio selection, utilizing a type-2 fuzzy rule-based expert system to handle uncertainty in selecting stocks based on factors like risk, return, and dividend. The model is tested on the Tehran Stock Exchange to select efficient portfolios, which directly aligns with the domain of Portfolio Management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:18:14.794260"
}