{
  "paper": {
    "id": 6751,
    "title": "Toward Big Data Analysis to Improve Enterprise Information Security",
    "abstract": "In recent years, big data and cloud computing are considered key trends of modern computer technology. Extracting valuable information is the key purpose of analyzing big data that needs to be secured in order to avoid any potential risks. Most cloud systems applications contain sensitive data, such as; financial, legal and private information. Therefore, threats on such data may put cloud systems holding this data at high risk. The demand on securing cloud systems applications has been increasing rapidly; however, big data protection is still a challenge. This paper proposes a new methodology to protect big data during analysis by classifying data before any action such as moving, copying or processing take place. Big data files are classified according to the criticality level of their contents into three categories from the most to the least sensitive: restricted, confidential and public. Based on big data classification, the encryption algorithm AES 128 is applied on confidential big data, while the encryption algorithm AES 256 is applied on the restricted big data files. The experimental results show that our method enhances the performance of big data analysis systems and outperforms other approaches in the literature.",
    "year": 2018,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "5cf9f432a70cb7d0fa01a10e9adaa7c3",
    "relevant_keywords": [
      "classification"
    ],
    "stage1_timestamp": "2025-05-15T03:01:03.634752"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究大数据分析和信息安全保护，特别是数据分类和加密技术，并未明确指出其在衍生品定价、金融风险管理或投资组合管理等特定金融领域的应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究大数据分析和信息安全保护，特别是数据分类和加密技术，并未明确指出其在衍生品定价、金融风险管理或投资组合管理等特定金融领域的应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:27:30.774303"
}