{
  "paper": {
    "id": 4207,
    "title": "A novel multi-objective particle swarm optimization for comprehensible credit scoring",
    "abstract": "Credit scoring is an important tool for banks and financial institutions to measure credit risk. Linear discriminant analysis (LDA) which according to the score of each credit applicant categorizes these applicants by a cutoff is a comprehensible and robust method in the credit scoring domain. This work presents a novel multi-objective particle swarm optimization for credit scoring (MOPSO-CS), and MOPSO-CS focuses on enhancing credit scoring models based on LDA in three aspects: (i) to construct a higher accuracy credit scoring model which is easy to be interpreted; (ii) to find the most suitable cutoff for discriminating good credit customers and bad credit customers; and (iii) to improve the sensitivity of the classifier by using multi-objective particle swarm optimization. Finally, through the experiments with two real-world data sets and two benchmark data sets, our proposed MOPSO-CS is compared with 11 counterparts: NaiveBayes, LR, SVM, ANN, DT, CART, bagging-DT, bagging-ANN, RF, MC2 and XGBoost, the results of experiments demonstrate MOPSO-CS outperforms the above-mentioned counterparts in term of sensitivity while maintaining an acceptable accuracy rate.",
    "year": 2019,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "7f7da937e239aa419fd79f2c16402679",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM",
      "decision tree",
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T02:34:13.498280"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on enhancing credit scoring models, which are primarily used by banks and financial institutions to measure credit risk. This directly relates to the assessment and management of financial risk, specifically credit risk, which is a key component of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on enhancing credit scoring models, which are primarily used by banks and financial institutions to measure credit risk. This directly relates to the assessment and management of financial risk, specifically credit risk, which is a key component of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:33:52.446175"
}