{
  "paper": {
    "id": 3044,
    "title": "Online portfolio selection with predictive instantaneous risk assessment",
    "abstract": "Online portfolio selection (OPS) has received increasing attention from machine learning and quantitative finance communities. Despite their effectiveness, the pioneering OPS methods have several key limitations. First, price predictions are usually based on predetermined trends, which is inadequate for a fast-changing market patterns. Second, each asset is treated individually, ignoring the pervading relevance among the assets. Third, the risk terms are usually missing or inappropriate in optimizations. This paper proposes a novel OPS method, namely, the online low-dimension ensemble method, to overcome the limitations. Motivated by the stylized facts for the co-movements of assets, the financial market is regarded as a high-dimensional dynamical system (HDS), and a large number of low-dimensional subsystems (LDSs) are randomly generated from the HDS to extract the correlation information among the assets. The assets' price predictions are first made using these LDSs and then aggregated to formulate the final prediction using ensemble learning techniques. Thanks to the particular merits brought by our predicting scheme, we also develop a novel high-dimensional covariance matrix estimation/prediction method for short-term data, efficiently assessing the instantaneous risk of the projected portfolios. Compared with state-of-the-art methods, our approach obtains more accurate predictions as the correlation information is fully exploited. With the predictive instantaneous risk assessment, a more appropriate optimization problem is proposed, substantially improving the OPS setting and leading to significantly better investment performance. Therefore, this study develops a flexible and promising approach to learning fast-changing market patterns and demonstrates that the high-dimensional feature of the market is a crucial information source for financial modeling with short-term data rather than a barrier in the conventional sense. Extensive experiments on real-world datasets are conducted to illustrate our method further.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "ce54d1a04be081a227339051fb320ecf",
    "relevant_keywords": [
      "machine learning",
      "ensemble learning"
    ],
    "stage1_timestamp": "2025-05-15T02:21:52.253747"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management",
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是开发一种在线投资组合选择（OPS）方法，并引入瞬时风险评估，这直接涉及投资组合管理。同时，论文中提到的风险预测和高维协方差矩阵估计也属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\", \"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是开发一种在线投资组合选择（OPS）方法，并引入瞬时风险评估，这直接涉及投资组合管理。同时，论文中提到的风险预测和高维协方差矩阵估计也属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:38:32.163206"
}