{
  "paper": {
    "id": 2131,
    "title": "Alternative Three Factor Model for Asset Pricing for the Investment, Market and Profitability Premium in Emerging Markets: An Evidence from Pakistan's Stock Exchange",
    "abstract": "The assets pricing is one of the hot topics which are a debate zone of financial markets in emerging economies, and the appropriate pricing model has always been a focus of attention. The investment, market and profitability premium influence the portfolio return with alternative three factor model. This study conduct to the equity returns of Pakistan's companies. We are using half-yearly data for 2002-2014 of one hundred non-financial listed firms at KSE. We do a regression analysis to investigate the impact of three factors (IP, MP and PP) on equity return. Finally, we do investigation and the investment and profitability premiums have a positive and significant impact on portfolio returns. The study also exposes that the alternative three factor model is an appropriate model aimed at the valuation of equities. The CNZ alternative Three Factor Model clarifies 60% -73% the portfolio returns and its explanatory power assortments. Therefore, investors, fund managers and decision makers should be account carefully for investments and profitability factors in their decisions regarding investment, financing and valuation.",
    "year": 2019,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "7a2f1ed6d0c36f116cde818d25cbc125",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:03:03.799518"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文主要研究资产定价模型对投资组合回报的影响，并探讨了投资、市场和盈利能力溢价对投资组合回报的作用。研究结果直接应用于投资组合管理，为投资者和基金经理提供决策支持。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文主要研究资产定价模型对投资组合回报的影响，并探讨了投资、市场和盈利能力溢价对投资组合回报的作用。研究结果直接应用于投资组合管理，为投资者和基金经理提供决策支持。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:17:17.071272"
}