{
  "paper": {
    "id": 6826,
    "title": "Morbid obesity in the UK: A modelling projection study to 2035",
    "abstract": "Background: Morbid obesity (body mass index > 40 kg/m(2)) carries a higher risk of non-communicable disease and is associated with more complex health issues and challenges than obesity body mass index >= 30kg/m2 and <40kg/m2, resulting in much higher financial implications for health systems. Although obesity trends have previously been projected to 2035, these projections do not separate morbid obesity from obesity. This study therefore complements these projections and looks at the prevalence and development of morbid obesity in the UK. Methods: Individual level body mass index data for people aged >15 years in England, Wales (2004-2014) and Scotland (2008-2014) were collated from national surveys and stratified by sex and five-year age groups (e.g. 15-19 years), then aggregated to calculate the annual distribution of healthy weight, overweight, obesity and morbid obesity for each age and sex group. A categorical multi-variate non-linear regression model was fitted to these distributions to project trends to 2035. Results: The prevalence of morbid obesity was predicted to increase to 5, 8 and 11% in Scotland, England and Wales, respectively, by 2035. Welsh women aged 55-64 years had the highest projected prevalence of 20%. In total, almost five million people are forecast to be classified as morbidly obese across the three countries in 2035. Conclusions: The prevalence of morbid obesity is predicted to increase by 2035 across the three UK countries, with Wales projected to have the highest rates. This is likely to have serious health and financial implications for society and the UK health system.",
    "year": 2020,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "325f522a52dc5c1cdaaa8c24471aa7da",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T03:02:07.456846"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究英国肥胖症（特别是病态肥胖）的流行趋势及其对健康系统的影响，使用了回归模型进行预测。虽然提到了财务影响，但并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域的具体应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究英国肥胖症（特别是病态肥胖）的流行趋势及其对健康系统的影响，使用了回归模型进行预测。虽然提到了财务影响，但并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域的具体应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:27:29.961940"
}