{
  "paper": {
    "id": 7952,
    "title": "Convex-concave effect of financial flexibility on hospitality performance: quantile regression approach",
    "abstract": "Purpose - The purpose of this paper is to study the influence of financial flexibility (FF) on enterprise performance (EP) within Taiwan's hospitality industry during the COVID-19 shock and explore whether EP varies with hospitality industry characteristics. Design/methodology/approach - Secondary data of 39 Taiwan Stock Exchange-listed hospitality firms were collected from the Taiwan Economic Journal databases. Quantile regression analysis was applied to examine the FF-EP relationship Findings - The results evidence that there is a U-shaped (convex) FF-EP relationship for hospitality firms in the 10th, 25th and 50th Tobin's Q quantiles and in asset-heavy firms. For asset-light firms, FF has an inverted U-shaped (concave) effect on EP in the 90th Tobin's Q quantile Practical implications - The empirical results highlight the need for Taiwan's hospitality industry as a whole to take rolling adjustment and optimization of FF and concentrate on liquidity risk management after the COVID-19 pandemic and for long-term sustainability. Originality/value - To the best of the authors' knowledge, this study is one of the first to examine the nonlinear FF-EP relationship in the hospitality industry of Taiwan, particularly amid the COVID-19 shock. Moreover, this study extends current literature by revealing the hospitality industry's FF-EP relationship and highlights the importance of the pandemic crisis context.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "900a99a931a83a39179d319fb1032ac3",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T03:13:30.712160"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究财务灵活性对台湾酒店业企业绩效的影响，并探讨了COVID-19冲击下的流动性风险管理。虽然涉及风险管理，但其核心研究并不直接属于衍生品定价、金融风险管理或投资组合管理中的任何一个特定金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究财务灵活性对台湾酒店业企业绩效的影响，并探讨了COVID-19冲击下的流动性风险管理。虽然涉及风险管理，但其核心研究并不直接属于衍生品定价、金融风险管理或投资组合管理中的任何一个特定金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:25:54.904021"
}