{
  "paper": {
    "id": 7369,
    "title": "Zombie Firms during and after Crisis",
    "abstract": "The phenomenon of zombie firms is gaining the attention of economists across different countries of the world; the increased interest is particularly evident after periods of economic crises. In our study, we focus on the development of zombie firms in the period before and after the 2008 crisis within two different economies, i.e., Germany and the Czech Republic, to provide insight into how different conditions and the overall economic context affect the fact that companies are more prone to becoming zombie firms. We implemented a difference-in-differences regression model to estimate the treatment effect by comparing the change (difference) in the differences in observed outcomes between these two countries. The data were obtained from two databases-the database Albertina by Bisnode a.s. providing financial statements of enterprises in the Czech Republic, and the database provided by Creditreform AG, which includes annual report data for a large sample of German companies. The dataset of German enterprises included 1,444,698 observations, i.e., 338,923 firms, and the dataset of Czech enterprises included 2,139,462 observations, i.e., 523,542 firms, both across the years 2000-2016, i.e., the data sample covered the period before and after the 2008 crisis. The different development of the share of zombie firms after the great financial crisis between Germany and the Czech Republic was proven as statistically significant. The findings confirm Germany is a country with a more stable economy and with a significantly lower risk of zombie firms' persistence, while the Czech Republic is at the level of the European average in terms of zombie share. The results also suggest an influence of post-crisis monetary policy on companies and the possible link between low interest rates and a growing share of zombies.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "3cc776c7653a965951fe3bccb706facc",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T03:08:00.744186"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究僵尸企业在经济危机前后的发展情况，并比较了德国和捷克共和国的情况。虽然涉及金融数据和经济政策，但其核心研究并不直接涉及衍生品定价、金融风险管理或投资组合管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究僵尸企业在经济危机前后的发展情况，并比较了德国和捷克共和国的情况。虽然涉及金融数据和经济政策，但其核心研究并不直接涉及衍生品定价、金融风险管理或投资组合管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T14:22:35.334028"
}