{
  "paper": {
    "id": 738,
    "title": "A reduced pricing model for mezzanine financing based on options and support vector machines",
    "abstract": "The correlations between financial variables are always nonlinear and the financial instruments with several influence factors are therefore characteristized with complicated risk-return. Thus, this paper attempts to decompose the mezzanine financing into three parts to conveniently value them respectively. In order to dispose complicated relationship between variables during valuation, the support vector machine is introduced to give a nonparametric estimation of the equity embedded in the mezzanine financing. Therefore, a quantitative analysis framework for the valuation of the mezzanine financing is constructed to deal with the dual risk-return nature of both equity and debt of mezzanine financing. Experimental results display the proposed methodology can efficiently address sophisticated risk-return nature of mezzanine financing and deal with nonlinear dynamics embedded in sample data, which provides investors, issuers and regulators with constructive decision-making basis.",
    "year": 2016,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "dde16fedbcd0f3d3c143efb8009620d1",
    "relevant_keywords": [
      "machine learning",
      "support vector machine",
      "SVM",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:54:34.047561"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Derivatives Pricing"
    ],
    "justification": "该论文的核心技术是使用支持向量机（SVM）对夹层融资中的股权部分进行非参数估计，并构建了一个定量分析框架来评估夹层融资的价值。这属于衍生品定价的范畴，因为夹层融资可以被视为一种复杂的金融工具，其定价涉及非线性动态和风险回报特性。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"衍生品定价\"],\n  \"justification\": \"该论文的核心技术是使用支持向量机（SVM）对夹层融资中的股权部分进行非参数估计，并构建了一个定量分析框架来评估夹层融资的价值。这属于衍生品定价的范畴，因为夹层融资可以被视为一种复杂的金融工具，其定价涉及非线性动态和风险回报特性。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:55:25.460874"
}