{
  "paper": {
    "id": 3815,
    "title": "Does the fundamental indexation portfolio perform better? An Indian investigation",
    "abstract": "Purpose This study aims to compare the fundamental indexation (FI) portfolio vis-a-vis the cap-weighted index (CWI). It also explored the return-generating attributes of the FI portfolios. Design/methodology/approach This study extracted relevant data from the Centre for Monitoring Indian Economy's Prowess database from March 1996 to March 2017 from a sample of National Stock Exchange (NSE) 500 companies. The FI portfolios were constructed with First_50 and Next_50 stocks using the latest and five years of trailing average aggregations. Further, the regression technique was used to identify the return-generating attributes of FI portfolios. Findings It was found that the FI portfolios based on First_50 and Next_50 stocks outperformed the CWI (i.e. NSE_First_50 and NSE_Next_50) in the Indian capital market, and between the two, the FI portfolios based on Next_50 stocks were superior to the FI portfolios based on First_50 stocks. The cross-sectional superiority of FI portfolios is obvious if they are sorted according to four fundamentals, namely, total income, sales, operating cash flows and profit before depreciation interest tax and amortisation. The return-generating process of FI portfolios is well-explained by market premium followed by value premium and investment premium. Practical implications This study may enable portfolio managers and investors to measure FI portfolios' superiority in the Indian capital market and identify the return-generating attributes of FI portfolios so that the loadings can be switched amongst different priced factors for higher yield. Further, this study extends the FI literature, providing evidence from one of the world's fastest-growing economies. Originality/value To the best of the knowledge, this is amongst the first few studies to explore the performance of FI portfolios vis-a-vis CWIs in India, and to use Fama and French (2015) asset pricing models to understand the return-generating attributes of FI portfolios. It is also novel in the sense that it considers the FI portfolios for a longer duration, predating 1997 and coinciding with the inception of CWIs, namely, NSE_First_50 (inception: 1995) and NSE_Next_50 (inception: 1996), reducing the apprehensions of data-snooping biases.",
    "year": 2022,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "61682f2df6d35458b0ab485bf1337c85",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:21:08.225859"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "The paper focuses on comparing fundamental indexation (FI) portfolios with cap-weighted index (CWI) portfolios and explores the return-generating attributes of FI portfolios. This research is directly related to the construction, evaluation, and performance analysis of investment portfolios, which falls under the domain of Portfolio Management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Portfolio Management\"],\n  \"justification\": \"The paper focuses on comparing fundamental indexation (FI) portfolios with cap-weighted index (CWI) portfolios and explores the return-generating attributes of FI portfolios. This research is directly related to the construction, evaluation, and performance analysis of investment portfolios, which falls under the domain of Portfolio Management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:08:47.554071"
}