{
  "paper": {
    "id": 929,
    "title": "Hybrid Model for Large Scale Forecasting of Power Consumption",
    "abstract": "After the electricity liberalization in Europe, the electricity market moved to a more competitive supply market with higher efficiency in power production. As a result of this competitiveness, accurate models for forecasting long-term power consumption become essential for electric utilities as they help operating and planning of the utility's facilities including Transmission and Distribution (T&D) equipments. In this paper, we develop a multi-step statistical analysis approach to interpret the correlation between power consumption of residential as well as industrial buildings and its main potential driving factors using the dataset of the Irish Commission for Energy Regulation (CER). In addition we design a hybrid model for forecasting long-term daily power consumption on the scale of portfolio of buildings using the models of conditional inference trees and linear regression. Based on an extensive evaluation study, our model outperforms two robust machine learning algorithms, namely random forests (RF) and conditional inference tree (ctree) algorithms in terms of time efficiency and prediction accuracy for individual buildings as well as for a portfolio of buildings. The proposed model reveals that dividing buildings in homogeneous groups, based on their characteristics and inhabitants demographics, can increase the prediction accuracy and improve the time efficiency.",
    "year": 2017,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "b9e050d80385ddc68c609ad2947a993f",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "regression",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-16T17:50:25.544272"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究电力消费的长期预测模型，虽然提到了投资组合（portfolio of buildings），但这是指建筑物的组合而非金融资产组合。论文的核心技术应用于能源市场而非金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究电力消费的长期预测模型，虽然提到了投资组合（portfolio of buildings），但这是指建筑物的组合而非金融资产组合。论文的核心技术应用于能源市场而非金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:25:11.473251"
}