{
  "paper": {
    "id": 2065,
    "title": "The Development of an Industry Environment for the Internet of Things: Evidence From China",
    "abstract": "The rapid development of the supply chain of the Internet of Things (IoT) industry may trigger financial risk contagion among IoT manufacturers. This article collects data on listed IoT companies in the Chinese market from 2010 to 2019 and explores the development of the environment for the IoT industry. Two dynamic time wrapping (DTW) networks are created to analyze the topological structures of the IoT industry environment. Both the standard DTW and strongly connected DTW networks are revolutionary in terms of their interconnectedness in the IoT industry. We found that the level of clustering and transitivity of the network continued to decline between 2010 and 2019; i.e., the efficiency of financial risk contagion on IoT networks was significantly reduced. This article contributes to the literature in two aspects. First, it reveals that China's IoT industry is increasingly competitive; financial risks have become more difficult to transfer. The IoT industry has become more robust and exhibits a lower likelihood of financial risk contagion. Second, the article provides empirical evidence for the theory of coevolution, showing that risk contagion ability in an industry setting is decreasing with the development of individual firms.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "2481257ea3989ea6551449ca698c0679",
    "relevant_keywords": [
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T02:10:58.936027"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文研究了物联网行业中金融风险传染的动态变化，并分析了网络拓扑结构对风险传染效率的影响，这直接涉及金融风险管理的核心问题。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文研究了物联网行业中金融风险传染的动态变化，并分析了网络拓扑结构对风险传染效率的影响，这直接涉及金融风险管理的核心问题。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:44:26.764625"
}