{
  "paper": {
    "id": 2497,
    "title": "Do the US president's tweets better predict oil prices? An empirical examination using long short-term memory networks",
    "abstract": "The price of oil is highly complex to predict as it is impacted by global demand and supply, geopolitical events, and market sentiment. The accuracy of such predictions, however, has far-reaching implications for supply chain performance, portfolio management, and expected stock market returns. This paper contributes to the oil price prediction literature by evaluating the predictive impact of the US President's communication on Twitter, while benchmarking various Natural Language Processing (NLP) techniques, including Term Frequency-Inverse Document Frequency (TF-IDF), Word2Vec, Doc2Vec, Global Vectors for Word Representation (GloVe), and Bidirectional Encoder Representations from Transformers (BERT). These techniques are combined with a deep neural network Long Short-Term Memory (LSTM) architecture using a five-day lag for both the oil price and the textual Twitter data. The data was collected during the term of US President Donald Trump, resulting in 1449 days of crude oil price prediction and a total of 16,457 tweets. The study is validated for Brent and West Texas Intermediate blends, using the daily price of a barrel of crude oil as the target variable. The results confirm that including the US President's tweets significantly increases the predictive power of oil price prediction models, and that an LSTM architecture with BERT as NLP technique has the best performance.",
    "year": 2024,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "a36fdbfd8ba47b73b16ac4c841ceaf8c",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "neural network",
      "long short-term memory",
      "LSTM",
      "representation learning",
      "feature representation"
    ],
    "stage1_timestamp": "2025-05-15T01:07:35.672269"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是使用LSTM和NLP技术预测原油价格，而原油价格的预测对投资组合管理有直接的影响，因为原油价格是许多投资组合中的重要组成部分。论文摘要中也明确提到了预测准确性对投资组合管理的影响。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是使用LSTM和NLP技术预测原油价格，而原油价格的预测对投资组合管理有直接的影响，因为原油价格是许多投资组合中的重要组成部分。论文摘要中也明确提到了预测准确性对投资组合管理的影响。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:14:11.115242"
}