{
  "paper": {
    "id": 123,
    "title": "Financial risk assessment in shipping: a holistic machine learning based methodology",
    "abstract": "Corporate financial distress (FD) prediction models are of great importance to all stakeholders, including regulators and banks, who rely on acceptable estimates of default risk, for both individual borrowers and bank loan portfolios. Whilst this subject has been covered extensively in finance research, its application to international shipping companies has been limited while the focus has mainly been on the application of traditional linear modelling, using sparse, cross-sectional financial statement data. Insufficient attention has been paid to the noisy and incomplete nature of shipping company financial statement information. This study contributes to the literature through the design, development and testing of a novel holistic machine learning methodology which integrates predictor evaluation and missing data analysis into the distress prediction process. The model was validated using a longitudinal dataset of over 5000 company year-end financial statements combined with macroeconomic and market predictors. We applied this methodology first for individual company level distress prediction before testing the models' ability to provide accurate confidence intervals by backtesting conditional value-at-risk estimations of the distress rates for bank portfolios. We conclude that, by adopting a holistic approach, our methodology can enhance financial monitoring of company loans and bank loan portfolios thereby providing a practical early warning system for financial distress.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "3d6875bcd385fd82bc6ef4b124205157",
    "relevant_keywords": [
      "machine learning",
      "classification",
      "feature learning",
      "feature representation"
    ],
    "stage1_timestamp": "2025-05-15T01:47:13.993117"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on developing a machine learning methodology for predicting corporate financial distress, which is a key aspect of financial risk management. It specifically mentions backtesting conditional value-at-risk estimations for bank portfolios, further reinforcing its application in risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on developing a machine learning methodology for predicting corporate financial distress, which is a key aspect of financial risk management. It specifically mentions backtesting conditional value-at-risk estimations for bank portfolios, further reinforcing its application in risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:00:47.689424"
}