{
  "paper": {
    "id": 2970,
    "title": "Fault diagnosis based on feature clustering of time series data for loss and kick of drilling process",
    "abstract": "With the increase of drilling depth, complicated geological environments lead to a high risk of loss and kick. Fault diagnosis plays an essential role in minimizing the financial and environmental losses of the drilling process. On account of the temporal correlation of drilling parameters, a fault diagnosis method based on feature clustering of time series data for loss and kick of the drilling process is presented in this paper. Distance correlation is conducted for parameter combination to retain the whole information of drilling process. Global trend, local trends, and approximate entropy features are extracted to illustrate the characteristic of the time series. Density-based clustering method is performed for each combination to mine the local similarity among drilling parameters. Based on the clustering results of each combination as the inputs, the Bayesian classifier is further utilized to obtain the final fault diagnosis result. Experiments are executed with the actual data collected from a practical drilling process. The results indicate that the proposed method has both low false alarm rate and low miss alarm rate. (C) 2021 Elsevier Ltd. All rights reserved.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "5ff89af1a12196ee62bd0de38e56b65f",
    "relevant_keywords": [
      "clustering",
      "classification",
      "feature representation"
    ],
    "stage1_timestamp": "2025-05-15T02:21:19.201550"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究钻井过程中的故障诊断方法，涉及时间序列数据的特征聚类和分类技术，但其应用场景是钻井工程而非金融领域。论文中未提及任何与衍生品定价、金融风险管理或投资组合管理相关的内容。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究钻井过程中的故障诊断方法，涉及时间序列数据的特征聚类和分类技术，但其应用场景是钻井工程而非金融领域。论文中未提及任何与衍生品定价、金融风险管理或投资组合管理相关的内容。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:39:18.165215"
}