{
  "paper": {
    "id": 3010,
    "title": "Mapping the knowledge structure of artificial neural network research in the stock market: a bibliometric analysis and future research pathways",
    "abstract": "Purpose - In past decades, artificial neural network (ANN) models have revolutionised various stock market operations due to their superior ability to deal with nonlinear data and garnered considerable attention from researchers worldwide. The present study aims to synthesize the research field concerning ANN applications in the stock market to a) systematically map the research trends, key contributors, scientific collaborations, and knowledge structure, and b) uncover the challenges and future research areas in the field. Design/methodology/approach - To provide a comprehensive appraisal of the extant literature, the study adopted the mixed approach of quantitative (bibliometric analysis) and qualitative (intensive review of influential articles) assessment to analyse 1,483 articles published in the Scopus and Web of Science indexed journals during 1992-2022. The bibliographic data was processed and analysed using VOSviewer and R software. Findings - The results revealed the proliferation of articles since 2018, with China as the dominant country, Wang J as the most prolific author, Expert Systems with Applications as the leading journal, computer science as the dominant subject area, and stock price forecasting as the predominantly explored research theme in the field. Furthermore, portfolio optimization, sentiment analysis, algorithmic trading, and crisis prediction are found as recently emerged research areas. Originality/value - To the best of the authors' knowledge, the current study is a novel attempt that holistically assesses the existing literature on ANN applications throughout the entire domain of stock market. The main contribution of the current study lies in discussing the challenges along with the viable methodological solutions and providing application area-wise knowledge gaps for future studies.",
    "year": 2025,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "c07ef5f485e4721353266cfa5bd660c1",
    "relevant_keywords": [
      "machine learning",
      "neural network",
      "deep learning",
      "backpropagation",
      "BP",
      "recurrent neural network",
      "long short-term memory",
      "LSTM"
    ],
    "stage1_timestamp": "2025-05-15T01:12:43.059582"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文主要探讨人工神经网络在股票市场中的应用，特别是提到了投资组合优化作为最近出现的研究领域之一。虽然论文还提到了其他应用如股票价格预测、情感分析等，但投资组合管理是明确提到的金融研究领域之一。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文主要探讨人工神经网络在股票市场中的应用，特别是提到了投资组合优化作为最近出现的研究领域之一。虽然论文还提到了其他应用如股票价格预测、情感分析等，但投资组合管理是明确提到的金融研究领域之一。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:11:55.204229"
}