{
  "paper": {
    "id": 1691,
    "title": "Research on credit risk management of the state-owned commercial bank",
    "abstract": "With the increasing opening of the financial market, the state-owned commercial banks in China are faced with the unprecedented challenges. As the core of national finance and vital of national economy, the state-owned commercial banks could not rival with foreign banks unless they make profound changes. And the reform of credit risk management is a major step that determines whether the state-owned commercial banks in China would survive the challenges or not. So in this paper, analyze the reasons why credit risk forms, put forward some countermeasures that aim to improve the state-owned commercial banks' credit risk management and directing against early-warning mechanism of credit risk, construct the fuzzy neural network model for credit risk analysis of commercial bank.",
    "year": 2005,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "74b622d52063e46b6557231643df7ebf",
    "relevant_keywords": [
      "neural network",
      "fuzzy neural network"
    ],
    "stage1_timestamp": "2025-05-15T02:06:22.468006"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on credit risk management in state-owned commercial banks, proposing countermeasures and constructing a fuzzy neural network model for credit risk analysis, which clearly falls under the domain of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on credit risk management in state-owned commercial banks, proposing countermeasures and constructing a fuzzy neural network model for credit risk analysis, which clearly falls under the domain of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:46:59.479668"
}