{
  "paper": {
    "id": 527,
    "title": "Quantitative Portfolio Management: Review and Outlook",
    "abstract": "This survey aims to provide insightful and objective perspectives on the research history of quantitative portfolio management strategies with suggestions for the future of research. The relevant literature can be clustered into four broad themes: portfolio optimization, risk-parity, style integration, and machine learning. Portfolio optimization attempts to find the optimal trade-off of future returns per unit of risk. Risk-parity attempts to match the exposure of various asset classes such that no single asset class dominates portfolio risk. Style integration combines risk factors on a security level such that rebalancing differences cancel out. Finally, machine learning utilizes large arrays of tunable parameters to predict future asset behavior and solve non-convex optimization problems. We conclude that machine learning will likely be the focus of future research.",
    "year": 2024,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "8055121f14a7c2f583cd09db7e055849",
    "relevant_keywords": [
      "machine learning"
    ],
    "stage1_timestamp": "2025-05-15T00:44:21.081642"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "The paper explicitly focuses on quantitative portfolio management strategies, discussing themes such as portfolio optimization, risk-parity, style integration, and machine learning in the context of managing investment portfolios. These topics are central to the field of Portfolio Management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Portfolio Management\"],\n  \"justification\": \"The paper explicitly focuses on quantitative portfolio management strategies, discussing themes such as portfolio optimization, risk-parity, style integration, and machine learning in the context of managing investment portfolios. These topics are central to the field of Portfolio Management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:30:02.633881"
}