{
  "paper": {
    "id": 484,
    "title": "Long Short-Term Memory Recurrent Neural Network for Predicting the Return of Rate Underframe the Fama-French 5 Factor",
    "abstract": "The multifactor approach helps determine the linear connection between a diversified portfolio's return and risk; however, the efficacy of the model models is still limited in the experiment. Algorithms in machine learning have recently grown in popularity to compensate for some of the shortcomings of theoretical models. This study applied a machine learning technique to compare the performance of the Fama-French 5-factor model (FF5). Two approaches are employed in the Fama-French model: Long Short Term Memory Recurrent Neural Network (LSTM-RNN) and Maximum Likelihood Estimation (MLE). From January 1, 2010, through March 3, 2022, the stock market in Ho Chi Minh City was experimentally researched. The rolling window approach is used in combination with the Root Mean Square Error (RMSE), and the results of the FF5 model with the LSTM-RNN algorithm are more efficient in prediction error than the MLE methodology. This contribution encourages investors and hedge fund managers to use the LSTM-RNN algorithm to boost forecasting efficiency.",
    "year": 2022,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "92eb18cc253c12276481c1cb39e96ab6",
    "relevant_keywords": [
      "machine learning",
      "neural network",
      "deep learning",
      "recurrent neural network",
      "long short-term memory",
      "LSTM"
    ],
    "stage1_timestamp": "2025-05-15T00:43:47.432691"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文主要研究了使用LSTM-RNN算法来预测股票回报率，并与Fama-French 5因子模型进行比较，目的是提高投资组合的预测效率。这直接关联到投资组合管理的领域，因为预测回报率是投资组合构建和优化的关键步骤。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文主要研究了使用LSTM-RNN算法来预测股票回报率，并与Fama-French 5因子模型进行比较，目的是提高投资组合的预测效率。这直接关联到投资组合管理的领域，因为预测回报率是投资组合构建和优化的关键步骤。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:30:32.049816"
}