{
  "paper": {
    "id": 1317,
    "title": "VISUALIZING THE EFFECTIVENESS OF PRODUCT PORTFOLIO WITH RESPECT TO PRODUCT SPECIFICATIONS",
    "abstract": "Most companies consistently analyze product portfolio to gain insights for establishing future strategies. The effectiveness of portfolio a kind of analysis index referring to market share of portfolio with respect to the number of models in portfolio. Since there are too many products in the market, companies need to divide market into comprehensible size for analysis. Traditionally, market segmentation is used for categorization. However, it has limitations on implementation especially in fast-changing markets consisting of an excessive number of products. To overcome this issue, we propose a new method to divide a market with respect to product specifications in the perspective of engineering design. Since it is conducted on market data, practitioners are able to analyze market objectively by reflecting up-to-date market situation. We adopt self-organizing map as a clustering method to visualize the effectiveness of portfolio. Engineering designers are able to gain clues on candidate models for elimination and the direction of specifications for new models from visualized analysis results. We develop a Matlab-based software to enhance usability for practitioners.",
    "year": 2015,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "7ea13d1ed42af1801ea7f1d9a3b3bc35",
    "relevant_keywords": [
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T00:54:24.653602"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要讨论的是产品组合的有效性分析，以及如何通过产品规格进行市场分割和可视化，其应用场景是工程设计和产品管理，而非金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要讨论的是产品组合的有效性分析，以及如何通过产品规格进行市场分割和可视化，其应用场景是工程设计和产品管理，而非金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:21:43.928598"
}