{
  "paper": {
    "id": 3006,
    "title": "Multi-Asset Market Making via Multi-Task Deep Reinforcement Learning",
    "abstract": "Market making (MM) is a trading activity by an individual market participant or a member firm of an exchange that buys and sells same securities with the primary goal of profiting on the bid-ask spread, which contributes to the market liquidity. Reinforcement learning (RL) is emerging as a quite popular method for automated market making, in addition to many other financial problems. The current state of the art in MM based on RL includes two recent benchmarks which use temporal-difference learning with Tile-Codings and Deep Q Networks (DQN). These two benchmark approaches focus on single-asset modelling, limiting their applicability in realistic scenarios, where the MM agents are required to trade on a collection of assets. Moreover, the Multi-Asset trading reduces the risk associated with the returns. Therefore, we design a Multi-Asset Market Making (MAMM) model, known as MTDRLMM, based on Multi-Task Deep RL. From a Multi-Task Learning perspective, multiple assets are considered as multiple tasks of the same nature. These assets share common characteristics among them, along with their individual traits. The experimental results show that the MAMM is more profitable than Single-Asset MM, in general. Moreover, the MTDRLMM model achieves the state-of-the-art in terms of investment return in a collection of assets.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "aaf1ea4d21cf66d08368c2a73671e771",
    "relevant_keywords": [
      "machine learning",
      "reinforcement learning",
      "deep learning",
      "neural network",
      "representation learning",
      "deep belief network",
      "DBM"
    ],
    "stage1_timestamp": "2025-05-15T02:21:19.306349"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是使用多任务深度强化学习进行多资产做市（Multi-Asset Market Making），旨在通过交易多种资产来提高收益并降低风险。这属于投资组合管理的范畴，因为它涉及对多种资产的管理和优化以实现更好的投资回报。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是使用多任务深度强化学习进行多资产做市（Multi-Asset Market Making），旨在通过交易多种资产来提高收益并降低风险。这属于投资组合管理的范畴，因为它涉及对多种资产的管理和优化以实现更好的投资回报。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:38:33.139917"
}