{
  "paper": {
    "id": 140,
    "title": "Supply Chain Finance Assistance for Small and Medium-Sized Enterprises Using Cognitive Web Services",
    "abstract": "When it comes to offering loans to small and medium-sized enterprises, the supply chain finance industries will produce cash flow and commodities (SMEs). The supply management is implemented with cognitive web service. Under the terms of information exchange, a credit risk assessment will be performed for supply chain finance with data analytics. In support vector machine technology, parameters are chosen using a genetic algorithm. To analyze the credit risk of support vector machines, a BP neural network was used to link the evolutionary algorithm with supply chain finance (GASVM-BPNN-SCF). Using a genetic algorithm and a support vector machine has overall classification accuracy equal to the BP neural network method. In addition, the role of the supply chain (SC) in mediating the link between SCF adoption, and the importance of supply chain effectiveness (SCE) is discussed. This research helps marketers and professionals better understand how to use SCF in their enterprises to reduce risk and improve SCF by providing data and connecting with financial institutions.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "9c96f78dd27376ee04d31b613e8e6783",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM",
      "neural network",
      "backpropagation",
      "BP"
    ],
    "stage1_timestamp": "2025-05-15T01:47:14.114421"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用机器学习方法（如支持向量机和BP神经网络）进行信用风险评估，这直接关联到金融风险管理中的信用风险控制。论文明确提到通过数据分析来评估供应链金融中的信用风险，并旨在帮助企业降低风险。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是使用机器学习方法（如支持向量机和BP神经网络）进行信用风险评估，这直接关联到金融风险管理中的信用风险控制。论文明确提到通过数据分析来评估供应链金融中的信用风险，并旨在帮助企业降低风险。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:00:45.183187"
}