{
  "paper": {
    "id": 2636,
    "title": "AI-assisted analytical model of seismic displacement estimation for frictional isolated bridge portfolios under pulse-like ground motions",
    "abstract": "Accurate bearing displacement assessment is crucial for frictional isolated bridges under pulse-like ground motions. In order to cope with the efficiency requirement brought by large-scale bridge portfolio estimation, the artificial intelligence (AI) method, a powerful tool to address multi-parameter issues, is widely adopted in seismic performance analysis for bridge networks. However, the traditional machine learning (TML) method pursues the overall prediction performance, the prediction effect in sensitive intervals caused by pulse-effect can not be assured. To face this challenge, this study proposed an AI-assisted analytical (AIA) method, which owns the characteristics of high efficiency, high accuracy and clear physical meaning. In the first step of the AIA method, the relationship between primary factor (pulse period) and output (seismic displacement) is established through an analytical model; in the second step, the undetermined parameters of the analytical model are estimated with the assistance of the AI method. The results indicate that the AIA model only requires 0.1 times data for model training and achieves overall predictive performance similar to TML methods. Moreover, the predictive effect of the AIA model in the sensitive range is greatly improved compared to the TML method. Finally, based on AIA method, an effective seismic fragility prediction method is proposed for frictional isolated bridge networks. The fragility curves illustrated by AIA method and FE analysis are in good agreement, which exhibited the satisfactory efficiency of the proposed AIA method.",
    "year": 2024,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "f40bc598af7d7b6271207ebcc3bf3610",
    "relevant_keywords": [
      "machine learning",
      "neural network",
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T01:08:42.044636"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是使用AI辅助分析方法来评估地震位移，应用于桥梁工程领域，特别是摩擦隔离桥梁的地震性能分析。虽然提到了'portfolio'一词，但这里的'bridge portfolio'指的是桥梁网络而非金融投资组合。论文内容与衍生品定价、金融风险管理或投资组合管理无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是使用AI辅助分析方法来评估地震位移，应用于桥梁工程领域，特别是摩擦隔离桥梁的地震性能分析。虽然提到了'portfolio'一词，但这里的'bridge portfolio'指的是桥梁网络而非金融投资组合。论文内容与衍生品定价、金融风险管理或投资组合管理无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:13:39.899294"
}