{
  "paper": {
    "id": 1222,
    "title": "Loss given default models incorporating macroeconomic variables for credit cards",
    "abstract": "Based on UK data for major retail credit cards, we build several models of Loss Given Default based on account level data, including Tobit, a decision tree model, a Beta and fractional logit transformation. We find that Ordinary Least Squares models with macroeconomic variables perform best for forecasting Loss Given Default at the account and portfolio levels on independent hold-out data sets. The inclusion of macroeconomic conditions in the model is important, since it provides a means to model Loss Given Default in downturn conditions, as required by Basel II, and enables stress testing. We Find that bank interest rates and the unemployment level significantly affect LGD. (C) 2011 International Institute of Forecasters. Published by Elsevier B.V. All rights reserved.",
    "year": 2012,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "c2dbdb0f529bcaedc9b4428c794af49d",
    "relevant_keywords": [
      "decision tree",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T00:53:09.954241"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on modeling Loss Given Default (LGD) for credit cards, incorporating macroeconomic variables to improve forecasting accuracy and enable stress testing, which are key aspects of financial risk management, particularly in the context of Basel II requirements.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on modeling Loss Given Default (LGD) for credit cards, incorporating macroeconomic variables to improve forecasting accuracy and enable stress testing, which are key aspects of financial risk management, particularly in the context of Basel II requirements.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:23:19.984027"
}