{
  "paper": {
    "id": 1615,
    "title": "Optimization heuristics for determining internal rating grading scales",
    "abstract": "Basel II imposes regulatory capital on banks related to the default risk of their credit portfolio. Banks using an internal rating approach compute the regulatory capital from pooled probabilities of default. These pooled probabilities can be calculated by clustering credit borrowers into different buckets and computing the mean PD for each bucket. The clustering problem can become very complex when Basel II regulations and real-world constraints are taken into account. Search heuristics have already proven remarkable performance in tackling this problem. A Threshold Accepting algorithm is proposed, which exploits the inherent discrete nature of the clustering problem. This algorithm is found to outperform alternative methodologies already proposed in the literature, such as standard k-means and Differential Evolution. Besides considering several clustering objectives for a given number of buckets, we extend the analysis further by introducing new methods to determine the optimal number of buckets in which to cluster banks' clients. (C) 2009 Elsevier B.V. All rights reserved.",
    "year": 2010,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "f237b9e5ef537f1cdadd57bad99d00a8",
    "relevant_keywords": [
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T00:57:46.848598"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on optimizing internal rating grading scales for banks to compute regulatory capital related to default risk, which is a key aspect of financial risk management under Basel II regulations.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on optimizing internal rating grading scales for banks to compute regulatory capital related to default risk, which is a key aspect of financial risk management under Basel II regulations.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:19:44.064312"
}