{
  "paper": {
    "id": 3405,
    "title": "Environmental, social and governance controversies and systematic risk: A machine learning approach",
    "abstract": "We examine the relationship between environmental, social and governance (ESG) controversies and systematic risk among non-financial firms in the STOXX Europe 600 index from 2016 to 2022. We apply random forest regression to predict firm-level systematic risk and employ explainable AI techniques to assess the role of ESG controversies. The results show a negative relationship between ESG controversies and systematic risk, with higher controversies predicting increased systematic risk. Traditional regression models, such as pooled ordinary least squares and year- and industry-fixed effects, show a similar relationship. However, our model exhibits an average prediction error of 0.25 for 2022, representing a 30 percent reduction in the prediction error compared to the benchmark. Systematic risk increases significantly for firms embroiled in ESG controversies for the first time (first timers) and those with frequent issues (regulars). Sector-wise, systematic risk is most pronounced in the machinery sector and least in the real estate sector.",
    "year": 2025,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "235418231a6110f5a45c142a5d95cccf",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "regression",
      "decision tree",
      "random forest"
    ],
    "stage1_timestamp": "2025-05-15T02:25:40.233296"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on predicting firm-level systematic risk using machine learning techniques, which is a core aspect of financial risk management. The study examines the relationship between ESG controversies and systematic risk, aiming to improve risk prediction models.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on predicting firm-level systematic risk using machine learning techniques, which is a core aspect of financial risk management. The study examines the relationship between ESG controversies and systematic risk, aiming to improve risk prediction models.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:36:49.702998"
}