{
  "paper": {
    "id": 3471,
    "title": "A generalized algorithm for modelling & forecasting the share prices of the banking sector",
    "abstract": "The issue of modelling and forecasting the share prices of the banking sector remains a challenge because of high volatilities in individual stock prices. Reliably forecasting the future values of shares is essential to minimize the risk for investors, but there is currently no standard forecasting procedure or technique that can be used in modelling and forecasting the share prices of the banking sector. This research is concerned with the development of a forecasting algorithm that can be applied in modelling and forecasting the share prices of the banking sector. It proposes six steps that, when followed, may lead to obtaining superior models. These steps are Data Selection, Data Preparation, Training the Model, Refining the Model, Testing the Model, and Forecast Production. These building steps were used to build a forecasting model for HSBC Bank Plc. and Lloyds TSB using the Back-propagation Neural Network. Empirical results show that superior models were obtained by applying the proposed algorithm compared to the financial forecasting models published in the literature.",
    "year": 2007,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "0465a3dd14d2f5323c5fe8b9050a9ba3",
    "relevant_keywords": [
      "neural network",
      "backpropagation",
      "BP"
    ],
    "stage1_timestamp": "2025-05-15T02:26:48.448253"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是开发一种用于预测银行股股价的算法，这直接关系到投资决策和资产配置，属于投资组合管理的范畴。虽然论文提到了风险最小化，但主要研究目标是股价预测而非风险管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是开发一种用于预测银行股股价的算法，这直接关系到投资决策和资产配置，属于投资组合管理的范畴。虽然论文提到了风险最小化，但主要研究目标是股价预测而非风险管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:36:25.706780"
}