{
  "paper": {
    "id": 739,
    "title": "A new fusion neural network model and credit card fraud identification",
    "abstract": "Credit card fraud identification is an important issue in risk prevention and control for banks and financial institutions. In order to establish an efficient credit card fraud identification model, this article studied the relevant factors that affect fraud identification. A credit card fraud identification model based on neural networks was constructed, and in-depth discussions and research were conducted. First, the layers of neural networks were deepened to improve the prediction accuracy of the model; second, this paper increase the hidden layer width of the neural network to improve the prediction accuracy of the model. This article proposes a new fusion neural network model by combining deep neural networks and wide neural networks, and applies the model to credit card fraud identification. The characteristic of this model is that the accuracy of prediction and F1 score are relatively high. Finally, use the random gradient descent method to train the model. On the test set, the proposed method has an accuracy of 96.44% and an F1 value of 96.17%, demonstrating good fraud recognition performance. After comparison, the method proposed in this paper is superior to machine learning models, ensemble learning models, and deep learning models.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "5ccd73809719d6d12bf8e39bc8c71ab5",
    "relevant_keywords": [
      "machine learning",
      "classification",
      "neural network",
      "deep learning",
      "hidden layer",
      "backpropagation",
      "BP"
    ],
    "stage1_timestamp": "2025-05-15T01:54:34.058039"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是构建一种新的融合神经网络模型，用于信用卡欺诈识别，这直接涉及金融机构的风险预防和控制，属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"该论文的核心技术是构建一种新的融合神经网络模型，用于信用卡欺诈识别，这直接涉及金融机构的风险预防和控制，属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:55:25.332132"
}