{
  "paper": {
    "id": 224,
    "title": "Financial Portfolio Management Based on Shaped- Based Unsupervised Machine Learning: A Dynamic Time Warping Baycenter Averaging Approach to International Markets and Periods of Downside Event Risks",
    "abstract": "Empirical evidence has shown that modern portfolio theory relating to diversification had failed investors in the recent financial crises, times when investors would hope that diversification is an effective tool to sustain portfolio performance. Almost all markets around the world declined, with varying degrees, at the 2008 financial crisis and 2020 COVID-19 market crisis. Correlation-based diversification optimized portfolios were not spared, generating significant losses. Recent research on an unsupervised machine learning method of time-series clustering using Dynamic Time Warping (DTW) as a distance measure have shown research promise as a financial portfolio diversification method and shown prospects of overcoming correlation convergence issues during periods of downside event risks. This research validates the applicability of DTW cluster diversification to achieve persistent portfolio performance in international developed markets, even across periods of market weakness. Results showed outperformance of mean and median return and Sharpe metrics of optimally weighted DTW cluster diversification, against correlation-based diversification methods. The findings will augment existing literature in the use of data science approach to portfolio diversification.",
    "year": 2023,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "30823afa7e69dafd0054859721fc1220",
    "relevant_keywords": [
      "machine learning",
      "unsupervised learning",
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T00:40:34.201832"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是使用动态时间规整（DTW）和无监督机器学习方法进行时间序列聚类，以改进投资组合的多样化策略。研究目标是验证该方法在国际发达市场中实现持续投资组合表现的有效性，特别是在市场疲软时期。这直接属于投资组合管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是使用动态时间规整（DTW）和无监督机器学习方法进行时间序列聚类，以改进投资组合的多样化策略。研究目标是验证该方法在国际发达市场中实现持续投资组合表现的有效性，特别是在市场疲软时期。这直接属于投资组合管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:32:44.075995"
}