{
  "paper": {
    "id": 3796,
    "title": "Measuring the response of gold prices to uncertainty: An analysis beyond the mean",
    "abstract": "This paper provides an innovative perspective on the role of gold as a hedge and safe haven. We use a quantile-on-quantile regression approach to capture the dependence structure between gold returns and changes in uncertainty under different gold market conditions, while considering the nuances of uncertainty levels. To capture the core uncertainty effects on gold returns, a dynamic factor model is used. This technique allows summarizing the impact of six different indexes (namely economic, macroeconomic, microeconomic, monetary policy, financial and political uncertainties) within one aggregate measure of uncertainty. In doing so, we show that the gold's role as a hedge and safe haven cannot be assumed to hold at all times. This ability seems to be sensitive to the gold's various market states (bearish, normal or bullish) and to whether the uncertainty is low, middle or high. Interestingly, we find a positive and strong relationship between gold returns and the uncertainty composite indicator when the uncertainty attains its highest level and under normal gold market scenario. This suggests that holding a diversified portfolio composed of gold could help protecting against exposure to uncertain risks.",
    "year": 2018,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "db871d64e4ba39f730eb7bac02da7c7b",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:21:08.036589"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk",
      "Portfolio Management"
    ],
    "justification": "该论文研究了黄金作为对冲和避险资产在不同市场条件下的表现，这直接关联到金融风险管理中的风险对冲策略。同时，论文提到持有包含黄金的多样化投资组合可以帮助抵御不确定性风险，这属于投资组合管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\", \"投资组合管理\"],\n  \"justification\": \"该论文研究了黄金作为对冲和避险资产在不同市场条件下的表现，这直接关联到金融风险管理中的风险对冲策略。同时，论文提到持有包含黄金的多样化投资组合可以帮助抵御不确定性风险，这属于投资组合管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:08:49.197960"
}