{
  "paper": {
    "id": 2614,
    "title": "Application of neural network technologies to assess the competence of personnel in the tasks of controlling the operational risk of a credit institution",
    "abstract": "The article is devoted to issues of controlling the operational risks of a credit institution associated with the actions of personnel. Operational risk control is an important aspect of a credit institution's business. Despite the fact that the Bank of Russia in regulatory documents described in detail the set of actions that banks should take to control operational risks, in practice credit institutions experience serious difficulties in dealing with operational risk associated with the actions of personnel. This may be explained, first, by the difficulty of identifying and formalizing the specified risk. One of the main sources of operational risks associated with personnel actions is employees' lack of qualifications. This can lead to reduced availability and quality of services provided by credit institutions, as well as possible financial and reputational losses. The purpose of the research conducted by the authors is to improve the system of control of operational risks in a credit institution using artificial intelligence technologies, including the development of tools for assessing in an automated mode the level of criticality of the influence of personnel competence on the occurrence of operational risk events. To achieve this goal, an artificial neural network (ANN) was developed using the high-level Keras library in Python. This paper defines a set of key indicators that have the most significant impact on the possibility of operational risk associated with the actions of the personnel in a credit institution. The article presents the results of checking the generated sets of training and test data using application software packages that implement mathematical methods to assess the consistency of the generated data sets. The paper presents graphs showing the results of training and testing of the artificial neural network that has been constructed. The results obtained are new and may allow credit institutions to significantly increase the efficiency of their work by digitalizing the solution of tasks to control the level of operational risk associated with the actions of personnel.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "b6f6330e97bbf92dde5741d2e33fc6e7",
    "relevant_keywords": [
      "machine learning",
      "neural network",
      "deep learning",
      "backpropagation",
      "BP",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T02:17:32.053729"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是应用神经网络评估信用机构操作风险中的人员能力问题，这直接关联到金融风险管理中的操作风险控制。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是应用神经网络评估信用机构操作风险中的人员能力问题，这直接关联到金融风险管理中的操作风险控制。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:41:07.064486"
}