{
  "paper": {
    "id": 7418,
    "title": "Forecasting Financial Market Trends in a Complex Business Environment",
    "abstract": "Applications for the stock market that can be relied upon to provide the information regular and professional investors need to make better-informed purchases are a boon to both. A well-thought-out sales approach may help buyers mitigate risk, zero in on the companies most likely to provide the highest returns, and increase their chances of making a purchase. Due to numerous interrelationships between various company values, executing stock market research utilizing batch processing methods provides an exceptionally tough task. Technology advancements, such as the licensing of global processes, usher in a new age for stock market forecasting. The present market climate has increased the significance of data applications. An interesting and new contribution made by this work is the proposal of a deep learning-based resilience time series model for forecasting future market values. By analyzing financial time series, this study aimed to build a sophisticated strategy for forecasting stock market prices. The use of artificial intelligence (AI) to forecast future market behavior is one of the most intriguing developments in this generation of technological breakthroughs. Particularly promising results have been found when applying deep learning techniques to the task of predicting the actions of market players. In this paper, we propose a method for forecasting the final prices of publicly traded firms like Tesla, Inc. and Apple, Inc. by merging a convolutional neural network with long short-term memory (LSTM). These two methods were both developed with the help of deep learning techniques. The time frame covered by statistics used in these projections is two years. To evaluate the performance of our deep learning models, we compared their market predictions using several different metrics, including mean squared error (MSE), root mean squared error (RMSE), normalized root mean squared error (NRMSE), and Pearson's R. When compared to the options, the CNN-LSTM deep learning algorithm did the best. When comparing convolution neural networks CNN-LSTM model to the normal LSTM and a simpler deep learning variant, the latter showed to be more effective at forecasting stock market values. This was the case when examining all three variants together.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "6f924a32b0e6d6b015e7a919868a77a2",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "neural network",
      "convolutional neural network",
      "CNN",
      "long short-term memory",
      "LSTM",
      "representation learning"
    ],
    "stage1_timestamp": "2025-05-15T03:08:37.740616"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究使用深度学习模型（CNN-LSTM）预测股票市场价格，虽然涉及金融市场，但并未明确指出其应用于衍生品定价、金融风险管理或投资组合管理等特定领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究使用深度学习模型（CNN-LSTM）预测股票市场价格，虽然涉及金融市场，但并未明确指出其应用于衍生品定价、金融风险管理或投资组合管理等特定领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:26:38.286656"
}