{
  "paper": {
    "id": 6263,
    "title": "Identifying changes in predictors of business failures during and after the economic crisis in Italy",
    "abstract": "Following the prolonged economic crisis of recent years, a new economic shake-up due to the COVID-19 pandemic is under way. We consider whether banks and financial institutions may apply the same models as before for credit scoring and predicting risk. In particular, we investigate the prediction of survival or failure of Small Business Enterprises in Italy between 2008 and 2013, and between 2013 and 2018, using logistic regression models based on baseline balance sheet data. By fitting appropriate models including interaction with the time period, we identify several major differences. Notably, the Investment Rigidity Ratio was very strongly associated with failure probability in the first period but not the second, and a low Tangible Assets Ratio had a much stronger protective effect in the first period than in the second. The effect of the age of the firm also differed between the periods: younger firms were at greater risk of failure than older firms in 2008-2013 but this was not seen in 2013-2018. Especially in times of major changes, it is vital that quantitative aids to decision-making should be valid and up-to-date.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "e84196a01b0e522e721f63215ed2a7d1",
    "relevant_keywords": [
      "classification",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:56:37.249063"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on predicting the survival or failure of Small Business Enterprises using logistic regression models, which is directly related to credit risk assessment—a key component of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on predicting the survival or failure of Small Business Enterprises using logistic regression models, which is directly related to credit risk assessment—a key component of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:28:30.591781"
}