{
  "paper": {
    "id": 257,
    "title": "Risk model of financial supply chain of Internet of Things enterprises: A research based on convolutional neural network",
    "abstract": "The emergence of the financial supply chain provides assistance for small, medium and micro enterprises in the supply chain through a secured credit model based on real trade. Moreover, in the multi-level structure of the financial supply chain of the Internet of Things enterprise, there are information barriers and information islands. Besides, data is often not transmitted smoothly, and the intermediate offline process is complicated. What is worse, the efficiency is low, and the verification cost is high. Therefore, based on supply chain finance, an evolutionary risk model is constructed in this paper. Firstly, the income matrix of the regulatory risk model is established, and the convolutional neural network used will pool the training data to the maximum and set the local corresponding normalization layer. With the help of the evolutionary risk theory, the dynamic equation of the financial supply chain is obtained, forming the dynamic path and abnormal model of strategy selection. Then, a compact pattern tree is added to the knowledge granularity method to mine data anomalies. Finally, an experimental platform is built to verify the effectiveness of the method proposed in this paper, and experiments are performed on the accuracy of model evolution conditions, abnormal data identification, and abnormal numerical examples. The experimental results prove that the algorithm in this paper is consistent with the set parameters, and the effect is significantly higher than other comparison methods. The experimental mining time and the comparison method are shortened by 6 similar to 13S. The research results obtained from this paper solve the problem that the decision-making of supply chain finance and the supervision and review of supply chain enterprise are complex, which improves the characteristics identification of supply chain platform, and provides reference suggestions for financial institutions and supply chain platforms.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "68b7ee3243575adeb7f9fdbb0820bd58",
    "relevant_keywords": [
      "neural network",
      "deep learning",
      "convolutional neural network",
      "CNN"
    ],
    "stage1_timestamp": "2025-05-15T01:48:30.819133"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是构建一个基于卷积神经网络的进化风险模型，用于解决金融供应链中的风险问题，包括监管风险和数据异常识别，这直接属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是构建一个基于卷积神经网络的进化风险模型，用于解决金融供应链中的风险问题，包括监管风险和数据异常识别，这直接属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:59:32.544493"
}