{
  "paper": {
    "id": 5515,
    "title": "Comparison of Health Care Results in Public Health Systems of European Countries",
    "abstract": "Health of citizens is a precondition for economic prosperity. Ensuring optimal functioning of health systems at limited financial resources of countries and regions is a difficult task. Its solution requires a lot of information that can be obtained only by appropriate analysis of data collected by authorized world, European and national institutions. About the state of public health systems there are collected and published a number of data on the regional, national, EU or OECD countries, continental and the world level. These databases can be used for comparative analyses on health status, risk factors to health, health care resources and utilization, as well as health expenditure and financing. Huge differences in health and healthcare exist between and within countries and regions. The aim of this article is to present the results of application of multivariate comparison statistical methods, regression analysis, factor analysis and cluster analysis, which provide an overview of the health care status and public health systems expenditures, various causal relations and regional differences or similarities. This information is essential to the development of national and international health policies for treatment and financial budget of public health systems.",
    "year": 2016,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "21c5ea441432f7dad8f551dfea27b8af",
    "relevant_keywords": [
      "regression",
      "clustering",
      "principal components analysis"
    ],
    "stage1_timestamp": "2025-05-15T02:48:51.271510"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要关注的是欧洲国家公共卫生系统的比较分析，使用了回归分析、聚类分析和主成分分析等统计方法，但其应用领域是公共卫生政策和经济预算，而非金融领域的衍生品定价、金融风险管理或投资组合管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要关注的是欧洲国家公共卫生系统的比较分析，使用了回归分析、聚类分析和主成分分析等统计方法，但其应用领域是公共卫生政策和经济预算，而非金融领域的衍生品定价、金融风险管理或投资组合管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:30:03.440292"
}