{
  "paper": {
    "id": 610,
    "title": "Comparing Prediction Power of Artificial Neural Networks Compound Models in Predicting Credit Default Swap Prices through Black-Scholes-Merton Model",
    "abstract": "Default risk is one of the most important types of risks, and credit default swap (CDS) is one of the most effective financial instruments to cover such risks. The lack of these instruments may reduce investment attraction, particularly for international investors, and impose potential losses on the economy of the countries lacking such financial instruments, among them, Iran. After the 2007 financial crisis, the importance of CDS has increasingly augmented because theoretically and practically, this instrument could significantly prevent catastrophes such as the mentioned crisis. The present study seeks to predict the price of CDS contracts with the Merton model as well as the compound neural network models including ANFIS, NNARX, AdaBoost, and SVM regression, and compare the predictive power of these algorithms which are among the most prestigious, intelligent models in finance. The research statistical population includes the A-rated North American and European companies which are known as the reference entities for credit default swaps. Data were collected from the Bloomberg Terminal for an eight-year period from 2008 to 2015. Contracts of 125 companies were selected as the statistical sample. The results reveal that the average predictive power of the NNARX is higher than that of other algorithms under scrutiny.",
    "year": 2020,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "27aa6ac2a1a34351414a3d4430416185",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "regression",
      "support vector machine",
      "SVM",
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T01:52:49.565170"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Derivatives Pricing",
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用机器学习模型（如ANFIS、NNARX、AdaBoost和SVM回归）来预测信用违约互换（CDS）的价格，这直接涉及衍生品定价。同时，由于CDS是用于管理信用风险的工具，研究其价格预测也属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"衍生品定价\", \"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是使用机器学习模型（如ANFIS、NNARX、AdaBoost和SVM回归）来预测信用违约互换（CDS）的价格，这直接涉及衍生品定价。同时，由于CDS是用于管理信用风险的工具，研究其价格预测也属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:56:37.223010"
}