{
  "paper": {
    "id": 169,
    "title": "Development of machine learning models for predicting depressive symptoms in knee osteoarthritis patients",
    "abstract": "Knee osteoarthritis (KOA) combined with depressive symptoms is prevalent and leads to poor outcomes and significant financial burdens. However, practical tools for identifying at-risk patients remain limited. A robust prediction model is needed to address this gap. This study aims to develop and validate a predictive model to identify KOA patients at risk of developing depressive symptoms. The China Health and Retirement Longitudinal Survey (CHARLS) data were used for model development and the Osteoarthritis Initiative (OAI) for external validation. 18 potential predictors were selected using LASSO regression. 4 machine learning models-logistic regression, decision tree, random forest, and artificial neural network-were developed. Model performance was assessed using the area under the operating characteristic curve (AUC), calibration curves, and decision curve analysis. The most important features were extracted from the optimal model on external validation. A total of 469 individuals were included, with 70% used for training and 30% for testing. The random forest model achieved the best performance, with an AUC of 0.928 in the test set, outperforming logistic regression (AUC 0.622), decision tree (AUC 0.611), and neural network models (AUC 0.868). External validation revealed an AUC of 0.877 (95% CI: 0.864-0.889) for the adjusted random forest model. Pain severity was the most significant predictor, followed by the five-time sit-to-stand test (FTSST) and sleep problems. This study is the first in China to apply a predictive model for depressive symptoms in KOA patients, offering a practical tool for early risk identification using routinely available data.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "0b16f0799d24a0c95174583d6b59b05a",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "decision tree",
      "neural network",
      "random forest"
    ],
    "stage1_timestamp": "2025-05-15T01:47:52.934702"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究使用机器学习模型预测膝骨关节炎患者的抑郁症状，属于医疗健康领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究使用机器学习模型预测膝骨关节炎患者的抑郁症状，属于医疗健康领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T14:24:43.679970"
}