{
  "paper": {
    "id": 207,
    "title": "A Study of Malware Datasets and Techniques to Detect the Malware using Deep Learning Approach",
    "abstract": "Cyber analytics play a vital role in solving the various domain problems in our day-to-day life. In this, Malware and web based attacks are most common types. Business organizations have their own apps to run their business. Malware captures the business information and corrupt the system. Malwares are developed based on financial gain. Security issues are now a big challenge with the ever increasing risk of malware attacks. Recently researchers are highly motivated to detect the malwares in the cyber field. Similarly some international highly trained programmer's community are also interested to detect the malwares for profit yielding purpose. The proposed study is based on the different malware datasets, deep learning techniques and its applications involved in malware analysis. The study infers the comprehensive comparison between different neural networks using Deep learning algorithm such as CNN, LSTM, RNN, GRU, GAN, Transfer learning, etc for Static malware analysis with different datasets.",
    "year": 2020,
    "source": "WOS",
    "area": "financial_risk",
    "method": "deep learning",
    "cache_key": "888c14a2470ae2a3d5ab6e33b810609c",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "classification",
      "neural network",
      "convolutional neural network",
      "CNN",
      "recurrent neural network",
      "long short-term memory",
      "LSTM"
    ],
    "stage1_timestamp": "2025-05-15T01:35:04.557257"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究使用深度学习技术进行恶意软件检测，虽然提到恶意软件可能出于财务目的开发，但论文的核心技术和应用场景集中在网络安全领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究使用深度学习技术进行恶意软件检测，虽然提到恶意软件可能出于财务目的开发，但论文的核心技术和应用场景集中在网络安全领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:04:03.446001"
}