{
  "paper": {
    "id": 1178,
    "title": "Comparison of Empirical Methods for the Reproduction of Global Manufacturing Companies' Credit Ratings",
    "abstract": "The quantitative assessment of the credit quality of manufacturing companies is a task of great interest to researchers and practitioners. This is underpinned by the elevated credit risk of these companies stemming from rapid technological changes. However, few studies have addressed this issue specifically for manufacturing companies. This study aimed to fill this research gap by comparing the predictive power of various methods in reproducing manufacturing companies' public credit ratings from available financial and non-financial data. The sample included 109 manufacturing companies from developed and emerging markets over the period 2005-2016. The analysis included three methods: ordered logistic regression (OLR) and two machine learning techniques, random forest and gradient boosting. The results showed that machine learning techniques outperformed OLR in terms of predictive power. In the best specification model, random forest had an accuracy of 50%, followed by gradient boosting (47%) and OLR (25%). We also tested two types of sampling in the training and test sets: random and time-dependent. The results showed that the models' predictive power was greater with random sampling. The inclusion of macroeconomic variables did not improve the models' predictive power due to the rating agencies' preferred through-the-cycle rating approach. The study's findings have implications for the development of manufacturing firms' internal credit ratings. They can also be useful for researchers exploring the accuracy of empirical models in predicting industrial firms' insolvency and creditworthiness.",
    "year": 2020,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "5fa8fc7d105c22dab6265304bddf096e",
    "relevant_keywords": [
      "machine learning",
      "classification",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T01:59:56.262542"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用机器学习方法（如随机森林和梯度提升）来预测制造企业的信用评级，这直接关系到信用风险的管理和评估，属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"该论文的核心技术是使用机器学习方法（如随机森林和梯度提升）来预测制造企业的信用评级，这直接关系到信用风险的管理和评估，属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:51:37.873723"
}