{
  "paper": {
    "id": 200,
    "title": "Network Forensics Analysis of Cyber Attacks on Computer Systems using Machine Learning Techniques",
    "abstract": "With the rapid development of technology, significant progress has been observedregarding the Internet and interconnected devices, increasing the risk of cyberattackstargeting these platforms. These attacks take diverse and sophisticated forms andpose a serious threat to companies, potentially causing substantial financial lossesand service disruptions. In response, the pressing need exists to develop robust de-fense strategies. This research focuses on analyzing attacks on information systems,specifically concentrating on network forensics using machine learning techniques.The initial phase involves executing various attack scenarios in a virtual environment,recording network packets, and extracting relevant features to create a dataset. A clas-sification framework is then created that includes machine learning algorithms suchas random forest, support vector machine (SVM), and Na & iuml;ve Bayes. Comparing theperformance of these algorithms on the study's dataset has revealed the random forestalgorithm to achieve the highest accuracy rate at 94.8%, with Naive Bayes having the lowest at 78.9",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "06fc8e1672c756471eda604c1305c456",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T01:47:53.058730"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究网络取证和机器学习技术在分析网络攻击中的应用，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究网络取证和机器学习技术在分析网络攻击中的应用，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T14:24:02.251072"
}