{
  "paper": {
    "id": 6500,
    "title": "Utilization and financial outcomes of an asthma disease management program delivered to medicaid members - Results of a three-group comparison study",
    "abstract": "Background: Although various studies have reported the financial outcomes of disease management programs for commercial populations, few have addressed the outcomes for Medicaid recipients. McKesson Heath Solutions (MHS) disease management programs support clients whose members have serious chronic illnesses including asthma, diabetes, congestive heart failure, coronary artery disease, chronic obstructive pulmonary disease, and mental health conditions. This study describes financial outcomes of the MHS asthma disease management program by evaluating changes in health services utilization measures for Medicaid members who participated in the asthma disease management program. Objective: To analyze and describe medical care utilization for asthma patients enrolled in a Medicaid managed care organization located in the eastern US. Methods: Medicaid participants were identified and referred to the asthma program by the healthcare plan. Two comparison groups were used in the study to more reliably assess program impact. The first comparison group included members who were referred to the program, but who chose not to participate. The second group included members who were identified through medical claims data, but who were not contacted or referred to the program by the plan. All eligible participants with at least 30 days of program participation, and all non-participants with at least 30 days of effective plan enrollment in the pre- and post-program periods were included in the study. The utilization rates for the three groups were compared in the pre- and post-program periods. The effect of group membership on inpatient admissions (IP), emergency department (ED) visits, and hospital outpatient department/physician office (MD) visits was analyzed using Poisson regressions. The regression analyses controlled for baseline levels of utilization, demographics, and relative risk scores generated by D(x)CG(R) software (manufactured by D(x)CG(R) in Boston, Massachusetts, USA). Results: While the MHS asthma disease management program has created positive financial outcomes for commercial populations, this study extends that scope to include a Medicaid population as well. 313 Medicaid participants experienced significant decreases in IP admissions and ED visits following program implementation. Participants also experienced decreased MD visits between the pre-program and program periods; however, their post-program MD visits were not reliably predicted by group membership after controlling for demographic differences and relative risk scores. Conclusions: The experience of the MHS asthma disease management program demonstrates its efficacy and relevance to Medicaid populations. This study strongly suggests that a structured asthma program may create positive financial outcomes while promoting enhanced self-management through continued support, education, and patient involvement.",
    "year": 2003,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "4776edf975c194eba31290974e19dcfa",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:58:34.264043"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究哮喘疾病管理项目对医疗补助成员的健康服务利用和财务结果的影响，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究哮喘疾病管理项目对医疗补助成员的健康服务利用和财务结果的影响，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:27:52.977972"
}