{
  "paper": {
    "id": 3940,
    "title": "Does screening for maternal ACEs in prenatal care predict pregnancy health risk above and beyond demographic and routine mental health screening?",
    "abstract": "Background: Adverse childhood experiences (ACEs), including abuse, neglect, and/or household dysfunction, are associated with physical and mental health difficulties in pregnancy and the postpartum period. These associations have prompted the adoption of screening for ACEs in prenatal care settings; however, little is known about whether asking about ACEs in the prenatal care context is additive to other forms of routine prenatal demographic and mental health screening. Objective: To identify whether ACEs are predictive of cumulative pregnancy health risk and identify whether ACEs predict maternal health risks in pregnancy above and beyond screening for financial stress, depression, and anxiety. Participants and setting: The electronic medical records of three hundred and thirty-eight patients who accessed prenatal care at a low-risk primary care maternity clinic were included. Methods: Women retrospectively self-reported their ACEs during their second prenatal primary care visit (similar to 20 weeks' gestation) and reported financial stress as well as their depressive and anxious symptoms using the PHQ-2 and GAD-2. Health risk factors and complications were documented by healthcare providers in the files at birth. Approximately 32% of patients reported at least one ACE. Results: Regression analyses revealed that after accounting for financial stress, neither depression nor anxiety predicted cumulative health risk in the antenatal period. ACEs significantly predicted cumulative health risk (B = 0.14, p = .02) and an additional 1.7% of variance in the outcome. However, the model only accounted for 5.0% of the variance in cumulative health risk. Conclusions: The total health risk predicted by demographic and ACEs screening is modest in this low-risk sample. Additional research on the implications of broader trauma-informed approaches is needed to evaluate their impact.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "d104f83309b44904cc0893af8cc16ef2",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:31:28.438917"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是孕期健康风险评估，特别是关于不良童年经历（ACEs）对孕期健康的影响，与金融领域无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是孕期健康风险评估，特别是关于不良童年经历（ACEs）对孕期健康的影响，与金融领域无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:34:44.127405"
}