{
  "paper": {
    "id": 2027,
    "title": "Model Talk: Calculative Cultures in Quantitative Finance",
    "abstract": "This paper explores how calculative cultures shape perceptions of models and practices of model use in the financial industry. A calculative culture comprises a specific set of practices and norms concerning data and model use in an organizational setting. Drawing on interviews with model users (data scientists, software developers, traders, and portfolio managers) working in algorithmic securities trading, I argue that the introduction of complex machine-learning models changes the dynamics in calculative cultures, which leads to a displacement of human judgment in quantitative finance. In this paper, I distinguish between three calculative cultures: (1) an idealistic culture of undivided trust in models, (2) a pragmatic culture of skepticism toward model accuracy, and (3) a pragmatic idealist culture of early stage skepticism and implementation and production-phase idealism. Based on the empirical material, the analysis engages with examples of each of the three calculative cultures. The study contributes to the social studies of finance and science and technology studies more broadly by showing how perceptions of models shape and are shaped through model work in data-intensive, computerized finance.",
    "year": 2021,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "6505aff1f936355accb7f4cd704ff5dc",
    "relevant_keywords": [
      "machine learning"
    ],
    "stage1_timestamp": "2025-05-15T01:02:10.263990"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文讨论了在算法证券交易中使用机器学习模型，并提到了投资组合经理作为模型用户之一。这表明论文的研究内容与投资组合管理相关，尽管主要焦点是计算文化对模型使用的影响。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文讨论了在算法证券交易中使用机器学习模型，并提到了投资组合经理作为模型用户之一。这表明论文的研究内容与投资组合管理相关，尽管主要焦点是计算文化对模型使用的影响。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:17:44.126303"
}