{
  "paper": {
    "id": 1879,
    "title": "Chinese corporate fraud risk assessment with machine learning",
    "abstract": "Corporate fraud is becoming a vital concern of Chinese financial industry in recent years. However, manual investigation of certain suspicious companies could result in mass consumption of resources. Aside from financial variables which were widely used in previous research, this paper has included novel features to assess Chinese corporate fraud, such as transfer of shares and Institutional Shareholdings, and these features are proven to be effective. We also present an efficient and accurate framework for corporate fraud detection that could be used as a fraud risk early warning system for financial institutions and regulatory authorities. Five machine learning methods have been implemented in the experiment and are compared using six metrics. Among these methods, XGboost has relatively higher performance overall in comparison to other models. Feature analysis has also been performed to analyze the influences of different groups of features in different models. This result illustrates that the models would achieve the best performance when all features are included, while financial condition has the most important impact among these groups. In addition, since the dataset being used is public, the result is simple for other researchers to reproduce and improve.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "8c473412ce45acfec3cb6ae385ec1077",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "decision tree",
      "feature learning",
      "feature representation"
    ],
    "stage1_timestamp": "2025-05-15T02:08:39.016908"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用机器学习方法进行企业欺诈风险评估，这直接关联到金融风险管理中的欺诈风险识别与控制。论文明确提到其框架可作为金融机构和监管机构的欺诈风险预警系统，属于金融风险管理的应用范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是使用机器学习方法进行企业欺诈风险评估，这直接关联到金融风险管理中的欺诈风险识别与控制。论文明确提到其框架可作为金融机构和监管机构的欺诈风险预警系统，属于金融风险管理的应用范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:45:30.602204"
}