{
  "paper": {
    "id": 402,
    "title": "Joint loan risk prediction based on deep learning-optimized stacking model",
    "abstract": "In recent years, China's automobile industry has undergone rapid development, creating new opportunities for the auto loan industry. Currently, auto financing companies are actively seeking to expand their cooperation with banks. Therefore, improving the approval rate and scale of joint loan business is of significant practical importance. In this paper, we propose a Stacking-based financial institution risk approval model and select the optimal stacking model by comparing its performance with other models. Additionally, we construct a bank approval model using deep learning techniques on a biased data set, with feature extraction performed using convolution neural networks (CNN) and feature-based counterfactual augmentation used for balanced sampling. Finally, we optimize the model of the prediction of auto finance companies by selecting the optimal coefficients of loss function based on the features and results of the bank approval model. The proposed approach leads to an approximately 6% increase in the joint loan approval rate on the actual data set, as demonstrated by experimental results.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "deep learning",
    "cache_key": "3fe0c58bf9b044ea5506427659974087",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "deep learning",
      "neural network",
      "convolutional neural network",
      "CNN",
      "feature learning",
      "feature representation"
    ],
    "stage1_timestamp": "2025-05-15T01:37:32.512154"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用深度学习和Stacking模型来预测联合贷款风险，并提高贷款审批率。这直接涉及信用风险评估和管理，属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是使用深度学习和Stacking模型来预测联合贷款风险，并提高贷款审批率。这直接涉及信用风险评估和管理，属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:03:39.107931"
}