{
  "paper": {
    "id": 5729,
    "title": "Smoothing algorithms by constrained maximum likelihood: methodologies and implementations for Comprehensive Capital Analysis and Review stress testing and International Financial Reporting Standard 9 expected credit loss estimation",
    "abstract": "In the process of loan pricing, stress testing, capital allocation, modeling of probability of default (PD) term structure and International Financial Reporting Standard 9 expected credit loss estimation, it is widely expected that higher risk grades carry higher default risks, and that an entity is more likely to migrate to a closer nondefault rating than a more distant nondefault rating. In practice, sample estimates for the rating-level default rate or rating migration probability do not always respect this monotonicity rule, and hence the need for smoothing approaches arises. Regression and interpolation techniques are widely used for this purpose. A common issue with these, however, is that the risk scale for the estimates is not fully justified, leading to a possible bias in credit loss estimates. In this paper, we propose smoothing algorithms for rating-level PD and rating migration probability. The smoothed estimates obtained by these approaches are optimal in the sense of constrained maximum likelihood, with a fair risk scale determined by constrained maximum likelihood, leading to more robust credit loss estimation. The proposed algorithms can be easily implemented by a modeler using, for example, the SAS procedure PROC NLMIXED. The approaches proposed in this paper will provide an effective and useful smoothing tool for practitioners in the field of risk modeling.",
    "year": 2018,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "d1780ded5be071c3048d17fa4c86de38",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:50:53.891712"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on smoothing algorithms for rating-level probability of default (PD) and rating migration probability, which are critical for stress testing and expected credit loss estimation under International Financial Reporting Standard 9. These applications are directly related to assessing and managing credit risk, a core aspect of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on smoothing algorithms for rating-level probability of default (PD) and rating migration probability, which are critical for stress testing and expected credit loss estimation under International Financial Reporting Standard 9. These applications are directly related to assessing and managing credit risk, a core aspect of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:29:37.762842"
}