{
  "paper": {
    "id": 1284,
    "title": "Stock price reaction to the drug development setbacks in the pharmaceutical industry",
    "abstract": "Background Investments in pharmaceutical companies remain challenging due to the inherent uncertainties of risk assessment. Objectives Our paper aims to assess the impact of the drug development setbacks (DDS) on the stock price of pharmaceutical companies while taking into account the company's financial situation, pipeline size and trend of the stock price before the DDS. Methods The model-based clustering based on finite Gaussian mixture modeling was employed to identify the clusters of pharmaceutical companies with homogenous parameters. An artificial neural network was constructed to aid the prediction of the positive mean rate of return 120 days after the DDS. Results Our results reveal that a higher pipeline size and a lower rate of return before the DDS, as well as a lower ratio of the market value of the equity and the book value of the total liabilities, are associated with a positive mean rate of return 120 days after the DDS. Conclusion In general, the DDS have a negative impact on the company's stock price, but this risk can be minimized by investors choosing the companies that satisfy certain criteria.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "055744a2162beb042338856f63014cf2",
    "relevant_keywords": [
      "neural network",
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T02:01:11.849129"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究药物开发挫折对制药公司股价的影响，并利用神经网络和聚类方法预测股价回报率。虽然涉及金融分析，但并未明确应用于衍生品定价、金融风险管理或投资组合管理等特定金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究药物开发挫折对制药公司股价的影响，并利用神经网络和聚类方法预测股价回报率。虽然涉及金融分析，但并未明确应用于衍生品定价、金融风险管理或投资组合管理等特定金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:50:31.310266"
}