{
  "paper": {
    "id": 8709,
    "title": "Older marijuana users: Life stressors and perceived social support",
    "abstract": "Background: Given increasing numbers of older-adult marijuana users, this study examined the association of marijuana use and marijuana use disorder with life stressors and perceived social support in the 50+ age group. Methods: Data came from the 2012-2013 National Epidemiologic Survey on Alcohol and Related Conditions (N = 14,715 respondents aged 50+). Life stressors were measured with 12 items related to interpersonal, legal, and financial problems and being a crime victim. Perceived social support was measured with the 12-item Interpersonal Support Evaluation List. Using principal component analysis (PCA), we identified four components of life stressors. Linear regression-analyses was used to test associations of past-year marijuana use and use disorder with PCA scores of each component and perceived social support. Results: Of the 50+ age group, 3.89% were past-year marijuana users and 0.68% had marijuana use disorder. Marijuana users, especially those with marijuana use disorder (17.54% of past-year users), had high rates of mental and other substance use disorders. Controlling for other potential risk factors for stress, including health status and mental and other substance use disorders, marijuana use and use disorder were still significantly associated with more life stressors and lower perceived social support, possibly from low levels of social integration. Conclusions: A substantial proportion of older-adult marijuana users need help with mental health and substance use problems. Further examination of older marijuana users' life stressors and social support networks may aid in developing more systematic intervention strategies to address needs and reduce marijuana use. (C) 2016 Elsevier Ireland Ltd. All rights reserved.",
    "year": 2016,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "bf33e24342455afee412bdaa663a81ee",
    "relevant_keywords": [
      "principal components analysis"
    ],
    "stage1_timestamp": "2025-05-15T03:21:24.745722"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究老年大麻使用者的生活压力源和感知社会支持，属于公共卫生和社会心理学领域，与衍生品定价、金融风险管理或投资组合管理无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究老年大麻使用者的生活压力源和感知社会支持，属于公共卫生和社会心理学领域，与衍生品定价、金融风险管理或投资组合管理无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:25:35.583499"
}