{
  "paper": {
    "id": 2747,
    "title": "Earnings forecasting and mean-variance efficient portfolios in the United States",
    "abstract": "Guerard and Takano (J Investing 1, 48-54, 1992), Guerard et al. (Ann Oper Res 45, 91-108, 1993) and Bloch et al. (Jpn World Econ 5: 3-26, 1993) reported mean-variance efficient portfolios for the Japanese and U.S. equity markets that were composed of a regression-weighted composite model of earnings, book value, cash flow, sales, and their relative variables outperformed their respective equity benchmarks by approximately 400 basis points annually. The optimized portfolios produced higher Sharpe Ratios than the benchmarks in Japan and the United States; the U.S. survivor-biased-free Sharpe Ratio was 1.20 whereas the benchmark was 0.96. Markowitz and Xu (J Portfolio Manag 21, 60-69. 1994) tested the composite model strategy and found that its excess returns were statistically significant from a variety of models tested, and the composite model strategy was not the result of data mining. We report updated US portfolio results for the 1995-2022 period that verifies the Guerard et al. (Ann Oper Res 45, 91-108, 1993) research and demonstrates that the Guerard and Markowitz post-publication, out-of-sample.",
    "year": 2025,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "8d0231b55392ee24575ea49d7aede605",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:10:16.434718"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "The paper focuses on constructing mean-variance efficient portfolios using regression-weighted composite models of financial variables, which is a core technique in portfolio management. The study evaluates the performance of these portfolios against benchmarks, a typical concern in portfolio management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Portfolio Management\"],\n  \"justification\": \"The paper focuses on constructing mean-variance efficient portfolios using regression-weighted composite models of financial variables, which is a core technique in portfolio management. The study evaluates the performance of these portfolios against benchmarks, a typical concern in portfolio management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T14:24:23.662847"
}