{
  "paper": {
    "id": 1153,
    "title": "Reinforcement learning policy recommendation for interbank network",
    "abstract": "In this paper, we analyze the effect of a policy recommendation on the performance of an artificial interbank market. Financial institutions stipulate lending agreements following a public recommendation and their individual information. The former is modeled by a reinforcement learning optimal policy that maximizes the system's fitness and gathers information on the economic environment. The policy recommendation directs economic actors to create credit relationships through the optimal choice between a low interest rate or a high liquidity supply. The latter, based on the agents' balance sheet, allows determining the liquidity supply and interest rate that the banks optimally offer their clients within the market. Thanks to the combination between the public and the private signal, financial institutions create or cut their credit connections over time via a preferential attachment evolving procedure able to generate a dynamic network. Our results show that the emergence of a core-periphery interbank network, combined with a certain level of homogeneity in the size of lenders and borrowers, is essential to ensure the system's resilience. Moreover, the optimal policy recommendation obtained through reinforcement learning is crucial in mitigating systemic risk.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "741ed04aab3c6bfce568ee81f8e4aca8",
    "relevant_keywords": [
      "reinforcement learning"
    ],
    "stage1_timestamp": "2025-05-15T01:59:21.726435"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是强化学习，用于优化银行间市场的政策推荐，以增强系统的韧性和降低系统性风险。这直接涉及金融风险管理领域，特别是系统性风险的缓解。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是强化学习，用于优化银行间市场的政策推荐，以增强系统的韧性和降低系统性风险。这直接涉及金融风险管理领域，特别是系统性风险的缓解。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:51:40.187274"
}