{
  "paper": {
    "id": 1378,
    "title": "DEVELOPING AN ENHANCED PORTFOLIO TRADING SYSTEM USING K-MEANS AND GENETIC ALGORITHMS",
    "abstract": "The objective of this study is to enhance the ability of an index fund strategy using k-means clustering and genetic algorithms. This study proposes a novel enhanced portfolio mechanism consisting of two phases. In the first phase, a subset of all the index shares is selected using k-means clustering based on investor information. In the second phase, a genetic algorithm is employed to search for the optimal stock weights in the selected clusters. In order to identify the usefulness of the proposed model, this study is compared against the conventional approach of using an index fund strategy with tracking error minimization. For measuring trading performance, the tracking error, which is a measure of how closely a portfolio follows the index as a benchmark, is evaluated. Furthermore, the information ratio is used to compare the performance of the proposed model in terms of the risk-adjusted return. An empirical study of the proposed model is simulated in the Korea stock exchange market.",
    "year": 2018,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "583757c8550c14cd47f482adf7699eb1",
    "relevant_keywords": [
      "unsupervised learning",
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T00:54:56.544717"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "The paper focuses on enhancing an index fund strategy by using k-means clustering and genetic algorithms to optimize stock selection and weights, which is directly related to portfolio management. The study evaluates tracking error and information ratio, both of which are key metrics in portfolio management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Portfolio Management\"],\n  \"justification\": \"The paper focuses on enhancing an index fund strategy by using k-means clustering and genetic algorithms to optimize stock selection and weights, which is directly related to portfolio management. The study evaluates tracking error and information ratio, both of which are key metrics in portfolio management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T14:22:34.733863"
}