{
  "paper": {
    "id": 7976,
    "title": "Predictive Performance of an Updated Polygenic Risk Score for Age-Related Macular Degeneration",
    "abstract": "Purpose: A recent genome-wide association study of age-related macular degeneration (AMD) identified new AMD-associated risk variants. These variants now can be incorporated into an updated polygenic risk score (PRS). This study aimed to assess the performance of an updated PRS, PRS2023, in an independent cohort of older individuals with retinal imaging data and to compare performance with an older PRS, PRS2016. Design: Cross-sectional study. Participants: A total of 4175 participants of European ancestry, 70 years of age or older, with genotype and retinal imaging data. Methods: We used logistic regression models and area under the receiver operating characteristic curve (AUC) to assess the performance of PRS2023 compared with PRS2016. AMD status and severity were graded using color fundus photography. Main Outcome Measures: Association of PRS2023 and PRS2016 with AMD risk at baseline. Results: At enrollment among 4175 participants, 2605 participants (62.4%) had no AMD and 853 participants (20.4%), 671 participants (16.1%), and 46 participants (1.1%) had early, intermediate, and late-stage AMD, respectively. More than 27% of the participants with a high PRS2023 (top quartile) had intermediate or late-stage AMD, compared with < 15% for those in the middle 2 quartiles and less than 13% for those in the lowest quartile. Both PRS2023 and PRS2016 were associated significantly with AMD after adjustment for age, sex, smoking status, and lipid levels, with increasing odds ratios (ORs) for worsening AMD grades. PRS2023 outperformed PRS2016 (P = 0.03 for all AMD and P = 0.03 for late AMD, DeLong test comparing AUC). PRS2023 was associated with late-stage AMD with an adjusted OR of 5.05 (95% confidence interval [CI], 3.41-7.47) per standard deviation. The AUC of a model containing conventional or nongenetic risk factors and PRS2023 was 91% (95% CI, 87%-95%) for predicting late-stage AMD, which improved 12% over the model without the PRS (AUC, 79%; P < 0.001 for difference). Conclusions: A new PRS, PRS2023, for AMD outperforms a previous PRS and predicts increasing risk for late-stage AMD (with stronger association for more severe imaging-confirmed AMD grades). Our findings have clinical implications for the improved prediction and risk stratification of AMD. Financial Disclosure(s): Proprietary or commercial disclosure may be found in the Footnotes and Disclosures at the end of this article. Ophthalmology 2024;131:880-891 (c) 2024 by the American Academy of Ophthalmology",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "8e892c459cdebef3a40a2ae91d464e82",
    "relevant_keywords": [
      "classification",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T03:14:07.178925"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是年龄相关性黄斑变性（AMD）的多基因风险评分（PRS）的预测性能，属于医学和遗传学领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是年龄相关性黄斑变性（AMD）的多基因风险评分（PRS）的预测性能，属于医学和遗传学领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:25:54.803587"
}