{
  "paper": {
    "id": 709,
    "title": "Establishment of a Financial Crisis Early Warning System for Domestic Listed Companies Based on Three Decision Tree Models",
    "abstract": "The financial crisis is a realistic problem that the general enterprise must encounter in the process of financial management. Due to the impact of the COVID-19 and the Sino-US trade war, domestic companies with unsound financial conditions are at risk of shutdowns and bankruptcies. Therefore, it is urgently needed to study the financial warning of enterprises. In this study, three decision tree models are used to establish the financial crisis early warning system. These three decision tree models include C50, CART, and random forest decision trees. In addition, the ROC curve was used for comprehensive evaluation of the accuracy analysis of the model to confirm the predictive ability of each model. This result can provide reference for domestic financial departments and provide financial management basis for the investing public.",
    "year": 2020,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "f462f378a8152c136310538fb86fe100",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T01:53:59.507167"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on establishing a financial crisis early warning system for domestic listed companies using decision tree models, which is directly related to identifying and managing financial risks, a core aspect of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on establishing a financial crisis early warning system for domestic listed companies using decision tree models, which is directly related to identifying and managing financial risks, a core aspect of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:55:47.939081"
}