{
  "paper": {
    "id": 1954,
    "title": "Financial Risk Assessment of Photovoltaic Industry Listed Companies Based on Text Mining",
    "abstract": "At present, the research on photovoltaic companies' financial risk early warning model mainly focuses on financial indicators and non-financial indicators from corporate governance structure and external audit opinions. There are few literature studies on the companies' internal information from their annual report. To solve the above problem, firstly, this paper aims to establish a comprehensive assessment indicators system including financial and non-financial indicators considering the companies' internal information. Secondly, this paper uses text mining and a binary logistic regression model to evaluate the financial risk for 37 listed companies in the photovoltaic industry. The results showed that profitability was the most significant factor. Probability, as well as negative sentiment ratios, are both negatively correlated with the occurrence of financial risk, while development capability is positively associated with financial risk. These findings can be used as an effective supplement for financial risk evaluation in the photovoltaic industry and provide reference strategies for developing listed companies in the photovoltaic industry.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "5cd785643e396d426776557f847d1210",
    "relevant_keywords": [
      "classification",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:09:14.422361"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心研究内容是使用文本挖掘和二元逻辑回归模型评估光伏行业上市公司的财务风险，这直接属于金融风险管理的范畴。论文明确提到建立财务风险评估指标体系，并分析财务风险的发生与盈利能力、发展能力等因素的关系，这些都是金融风险管理的研究内容。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"该论文的核心研究内容是使用文本挖掘和二元逻辑回归模型评估光伏行业上市公司的财务风险，这直接属于金融风险管理的范畴。论文明确提到建立财务风险评估指标体系，并分析财务风险的发生与盈利能力、发展能力等因素的关系，这些都是金融风险管理的研究内容。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:45:10.379402"
}