{
  "paper": {
    "id": 3285,
    "title": "Out-of-sample realized volatility forecasting: does the support vector regression compete combination methods",
    "abstract": "This article investigates whether the nonlinear support vector regression method under the Heterogeneous Auto-Regressive model (SVR-HAR) can compete for combination methods in terms of out-of-sample realized volatility forecasting. Empirical analyses are conducted based on the CSI 300 index high-frequency data, two new combination methods are employed and compared with the forecasting ability of the SVR method. The empirical results show that SVR-HAR models outperform individual models and all the combination methods, although the new combination methods are superior to other combination strategies. Specifically, HAR models with realized semi-variances as regressors obtains the lowest forecasting errors, confirming the strong forecasting ability of nonlinear SVR method and the realized semi-variances. The portfolio performance further confirms the highest economic value for models employing realized semi-variances and nonlinear SVR method in terms of volatility forecasting.",
    "year": 2021,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "cd948359401317cd5a892833827f6aba",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "regression",
      "support vector machine",
      "SVM"
    ],
    "stage1_timestamp": "2025-05-15T01:15:26.192171"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk",
      "Portfolio Management"
    ],
    "justification": "该论文主要研究使用支持向量回归方法进行已实现波动率的预测，并评估其在投资组合表现中的经济价值。波动率预测是金融风险管理中的核心问题，而投资组合表现评估则直接关联到投资组合管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\", \"投资组合管理\"],\n  \"justification\": \"该论文主要研究使用支持向量回归方法进行已实现波动率的预测，并评估其在投资组合表现中的经济价值。波动率预测是金融风险管理中的核心问题，而投资组合表现评估则直接关联到投资组合管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:10:13.778190"
}