{
  "paper": {
    "id": 777,
    "title": "Design of an intelligent financial sharing platform driven by digital economy and its role in optimising accounting transformation production",
    "abstract": "With the expansion of business scope, the environment faced by enterprises has also changed, and competition is becoming increasingly fierce. Traditional financial systems are increasingly difficult to handle complex tasks and predict potential financial risks. In the context of the digital economy era, the booming financial sharing services have reduced labour costs and improved operational efficiency. This paper designs and implements an intelligent financial sharing platform, establishes a fund payment risk early warning model based on an improved support vector machine algorithm, and tests it on the Financial Distress Prediction dataset. The experimental results show that the effectiveness of using F2 score and AUC evaluation methods can reach 0.9484 and 0.9023, respectively. After using this system, the average financial processing time per order decreases by 43%, and the overall financial processing time decreases by 27%. Finally, this paper discusses the role of intelligent financial sharing platform in accounting transformation and optimisation of production.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "297dc62c4c9fb737eec818df42aba5c7",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM"
    ],
    "stage1_timestamp": "2025-05-15T01:55:07.997456"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文设计了一个智能财务共享平台，并建立了基于改进支持向量机算法的资金支付风险预警模型，用于预测潜在的财务风险，这属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文设计了一个智能财务共享平台，并建立了基于改进支持向量机算法的资金支付风险预警模型，用于预测潜在的财务风险，这属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:54:41.559330"
}