{
  "paper": {
    "id": 5865,
    "title": "Good budget or good care: The dilemma of social health insurance in Vietnam",
    "abstract": "Objective: 2014 marked a rising public commitment to universal health coverage in Vietnam to eliminate the financial burden for patients, but there are lots of hindrances. It is evident that patients met difficulties to validate their insurances, so health insurance does not significantly address out-of-pocket payments issues. Furthermore, the unequal geographical distribution of hospitals in Vietnam has created an inequality between non-residing patients and residing patients; the former usually pay more. This calls into question how the validity of healthcare insurance and patient's residence could be related to patient's financial status and their satisfaction with health insurance. Methods: Bayesian regression models are employed to analyze a data set of 1042 inpatients in hospitals of all levels in Northern Vietnam. Result: The results show that living in the same region as the hospital and having valid insurance is negatively correlated with the impoverishing risk. Regarding patients' satisfaction with health insurance, it is negatively correlated with having a residence in the same region as the hospital but positively correlated with higher socioeconomic status and insurance validity. Finally, on average, the satisfaction of patients who have already recovered from the illness and those who quit early is lower than that of patients who needed follow-up in medical care or stop in the middle. Conclusion: This article suggests that policymakers consider addressing the unequal geographical distribution of hospitals and healthcare quality to help patients avoid going to hospitals outside their regions, which may generate a financial burden for patients and lower their satisfaction with health insurance.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "35c76537a6a60615f6d6b32200765275",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:52:31.357586"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究越南社会医疗保险的预算与护理质量之间的困境，以及患者满意度和财务负担的关系。虽然使用了回归模型进行分析，但其核心内容与衍生品定价、金融风险管理或投资组合管理无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究越南社会医疗保险的预算与护理质量之间的困境，以及患者满意度和财务负担的关系。虽然使用了回归模型进行分析，但其核心内容与衍生品定价、金融风险管理或投资组合管理无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:28:57.653572"
}