{
  "paper": {
    "id": 1663,
    "title": "Implementation of Density-Based Spatial Clustering of Application with Noise and Genetic Algorithm in Portfolio Optimization with Constraint",
    "abstract": "Every investor is hoping to get a high rate of return for their portfolio with as little risk as possible, so investors try to balance the performance and risk of the portfolio through diversification. Diversification is a technique to improve the performance of the portfolio by minimizing the risk of the portfolio. The motivation of this research is to investigate the portfolio selection strategies through clustering method and application of the genetic algorithm. Clustering is used to diversify the portfolio by forming a homogenous cluster with respect to their financial ratios. Seven financial ratio characteristics that used are Earning Per Share (EPS), Price Earnings Ratio (PER), Price / Earnings Growth (PEG), Return of Equity (ROE), Debt Equity Ratio (DER), Current Ratio (CR) and Profit Margin (PM). Density-based Spatial Clustering of Application with Noise (DBSCAN) used as clustering method, then Genetic Algorithm (GA) used for portfolio selection. GA automatically select the optimum risk and return portfolio based on the clustered stocks by deciding which assets and their respective weights included in the portfolio. The GA constructed based on Mean Variance Cardinality Constrained Portfolio Optimization (MVCCPO) model and called a Constrained Genetic Algorithm. The method successfully gives a higher level of return (41.05 %) and Sharpe ratio (32.67) compared to the S&P 500 index in the same period of time (12.34 % and 2.7 respectively).",
    "year": 2019,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "e82ff1f58971011d03dc6f69f8d5a20e",
    "relevant_keywords": [
      "unsupervised learning",
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T02:06:22.361065"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是使用DBSCAN聚类方法和遗传算法进行投资组合优化，旨在通过多样化和优化风险与回报来改进投资组合的性能，这直接属于投资组合管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是使用DBSCAN聚类方法和遗传算法进行投资组合优化，旨在通过多样化和优化风险与回报来改进投资组合的性能，这直接属于投资组合管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:47:17.799225"
}