{
  "paper": {
    "id": 869,
    "title": "Closing the gap on institutional delivery in northern India: a case study of how integrated machine learning approaches can enable precision public health",
    "abstract": "Introduction Meeting ambitious global health goals with limited resources requires a precision public health (PxPH) approach. Here we describe how integrating data collection optimisation, traditional analytics and causal artificial intelligence/machine learning (ML) can be used in a use case for increasing hospital deliveries of newborns in Uttar Pradesh, India. Methods Using a systematic behavioural framework we designed a large-scale survey on perceptual, interpersonal and structural drivers of women's behaviour around childbirth (n=5613). Multivariate logistic regression identified factors associated with institutional delivery (ID). Causal ML determined the cause-and-effect ordering of these factors. Variance decomposition was used to parse sources of variation in delivery location, and a supervised learning algorithm was used to distinguish population subgroups. Results Among the factors found associated with ID, the causal model showed that having a delivery plan (OR=6.1, 95% CI 6.0 to 6.3), believing the hospital is safer than home (OR=5.4, 95% CI 5.1 to 5.6) and awareness of financial incentives were direct causes of ID (OR=3.4, 95% CI 3.3 to 3.5). Distance to the hospital, borrowing delivery money and the primary decision-maker were not causal. Individual-level factors contributed 69% of variance in delivery location. The segmentation analysis showed four distinct subgroups differentiated by ID risk perception, parity and planning. Conclusion These findings generate a holistic picture of the drivers and barriers to ID in Uttar Pradesh and suggest distinct intervention points for different women. This demonstrates data optimised to identify key behavioural drivers, coupled with traditional and ML analytics, can help design a PxPH approach that maximise the impact of limited resources.",
    "year": 2020,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "d15c0a1e5d8f1a34d7cb57b0b89fa1c2",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:56:17.470420"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究如何通过机器学习和数据分析优化公共卫生策略，特别是提高印度北方新生儿医院分娩率。虽然使用了机器学习技术，但其应用领域是公共卫生而非金融研究。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究如何通过机器学习和数据分析优化公共卫生策略，特别是提高印度北方新生儿医院分娩率。虽然使用了机器学习技术，但其应用领域是公共卫生而非金融研究。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:54:13.962178"
}