{
  "paper": {
    "id": 1318,
    "title": "Research and Implementation of Financial Decision Model Based on Artificial Intelligence",
    "abstract": "Artificial intelligence has reached a new level in the global. Because of the improvement of the current neural network depth learning algorithm, some basic artificial intelligence technology has developed rapidly. In the financial sector, artificial intelligence can greatly optimize the process of a series of existing financial transaction, which can be applied and served to customers at the front end to achieve a variety of financial transactions and financial analysis decisions. Based on this, the research and implementation of financial decision model based on artificial intelligence were studied in this paper. The impact of artificial intelligence on the financial industry was introduced first. Technical problems and solutions, theoretical support and key technologies were introduced. Finally, the specific process of financial decision model based on Agent artificial intelligence was introduced in detail. The test results show that the financial decision model based on artificial intelligence can be used for risk prevention and control, which makes our financial services more personalized and intelligent, so that the financial risk control ability is more powerful.",
    "year": 2017,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "7128c40a868c0757f5faf87e27b73239",
    "relevant_keywords": [
      "neural network",
      "deep learning",
      "representation learning",
      "backpropagation",
      "BP",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T02:01:44.685224"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文提到基于人工智能的金融决策模型可以用于风险预防和控制，这表明其主要应用领域是金融风险管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文提到基于人工智能的金融决策模型可以用于风险预防和控制，这表明其主要应用领域是金融风险管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:49:49.667387"
}