{
  "paper": {
    "id": 2581,
    "title": "The enhanced gain effects of ESG's non-linearity on portfolios: An asset pricing tree model perspective",
    "abstract": "This study investigates the incremental benefits of ESG criteria on investment portfolio performance, with a particular focus on the non-linear attributes of ESG factors. Employing linear regression models, the research establishes that ESG factors contribute supplementary information to investment portfolios, thereby augmenting the models' explanatory power regarding returns. The integration of ESG data with financial data within an asset pricing framework is further explored, revealing that non-linear integration surpasses conventional linear integration techniques. The findings indicate that the positive impact of ESG information on investment portfolios intensifies with the maturation of regulatory frameworks, manifesting a distinctive efficacy in non-linear models that transcends the capabilities of traditional financial metrics. While ESG metrics offer significant insights for portfolio construction, their correlation with corporate performance is not strictly linear. Moreover, the study demonstrates that the efficacy of ESG varies across different corporate entities, influenced by sector-specific and market capitalization factors. This variability suggests that the strategic application of ESG in investment strategies, when combined with other financial indicators, is more likely to maximize the value of ESG data.",
    "year": 2025,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "40b622338ccc94cbc148b193ca896360",
    "relevant_keywords": [
      "regression",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T01:08:10.935244"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文主要研究ESG标准对投资组合绩效的影响，并探讨了ESG因素如何增强投资组合的回报解释力。研究重点在于投资组合的构建和优化，属于投资组合管理领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文主要研究ESG标准对投资组合绩效的影响，并探讨了ESG因素如何增强投资组合的回报解释力。研究重点在于投资组合的构建和优化，属于投资组合管理领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:13:43.562890"
}