{
  "paper": {
    "id": 6281,
    "title": "(Relationship between Oil, Gold and Malaysian Stock Market during COVID-19 Movement Control Order using Quantile Regression and Time Series)",
    "abstract": "The COVID-19 pandemic has had a negative impact on the financial sector and world's economy. Generally, investors will invest in low-risk assets such as gold and crude oil when the economy is unstable. Therefore, this study aims to examine the relationship between these commodities towards Bursa Malaysia KLCI (KLSE) price index and to determine the properties of Barrick Gold Corp (GOLD) and Crude Oil WTI Futures (WTI). The relationship between KLSE, GOLD, and WTI help investors to understand the impact of commodity assets on Malaysia index market during COVID-19 pandemic. The data were collected at four different time points, 40 days before and during phase 1 and 3 of movement control order (MCO). The period are from 17 January to 17 March 2020 and 18 March to 18 May 2020 for before and during phase 1 and 29 March to 28 May 2021 and 1 June to 29 July 2021 for before and during phase 3. The time series linear regression (TSLM) and quantile regression (QREG) methods were used. Crude Oil WTI Futures (WTI) showed a linear relationship with FTSE Bursa Malaysia KLCI (KLSE) before phase 1 of MCO and acts as a safe haven asset during MCO of phase 1 and 3. Next, Barrick Gold Corp (LGOLD) is a hedging asset for all phases of MCO except during phase 3 of the MCO and is a safe haven asset prior to MCO phase 1. Investors can combine gold and stock market into their portfolio or invest in oil related instruments to lower the risk of losses.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "579842789aa69f607386796cc25cf476",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:56:37.322560"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文研究了黄金和原油与马来西亚股市之间的关系，旨在帮助投资者理解这些商品资产对马来西亚指数市场的影响，并建议投资者如何将这些资产纳入投资组合以降低风险。这直接涉及投资组合管理的核心内容。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文研究了黄金和原油与马来西亚股市之间的关系，旨在帮助投资者理解这些商品资产对马来西亚指数市场的影响，并建议投资者如何将这些资产纳入投资组合以降低风险。这直接涉及投资组合管理的核心内容。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:28:30.345735"
}