{
  "paper": {
    "id": 3811,
    "title": "Mutual Fund Governance and Performance: A Quantile Regression Analysis of Morningstar's Stewardship Grade",
    "abstract": "Manuscript Tytpe: Empirical Research Question/Issue: We study the relation between mutual fund performance and Morningstar's fiduciary grades using quantile regression models. This research is important because we shed new light on the principal-agent issue in the mutual fund industry, and investors and professional managers often use Morningstar's rating system to guide their investment decisions. Quantile regressions allow us to examine the differential impact of mutual fund governance variables such as manager incentives and board quality on fund performance across the entire performance distribution. Research Findings/Insights: Quantile regressions find a strong contemporaneous association between Stewardship Grade and Sharpe Ratio. Manager incentives, though not significant in the OLS regression, are positively related to the fund performance for better performing funds, and negatively correlated with portfolio turnover. However, manager incentives are shown to have little predictive power for funds' future performance. In contrast, board quality, which is in the center stage of the proposed SEC mutual fund regulation, bears little relationship with contemporaneous fund performance, yet is strongly related to funds' future performance. Theoretical/Academic Implications: Our analyses and results have two important implications for the principal-agent theory. Our finding that board quality has a more profound impact on fund performance than manager incentives suggests that incentive alignment through compensation contracts is less effective in mitigating agency problems than quality board monitoring. Our quantile regression results also provide new insights to the analysis of corporate governance research. The major advantage of using quantile regression is that it reveals the whole spectrum of heterogeneous mutual fund performance responses to their governance efforts, especially the behavior of funds at the tails of the distribution; hence better corporate governance policies can be drawn up and instituted. This methodology is useful for other governance research as well and entails meaningful regulatory implications when firms/industries are heterogeneous and the conditional means of traditional regression analysis does not provide much information and guidance for corporate decision making. Practitioner/Policy Implications: This study shows that fund performance is associated with manager incentives contemporaneously, while board quality predicts fund performance in the long haul. This finding has important regulatory implications, as the efficacy of SEC's proposal on board and chairman independence is under great debate. Our results also provide useful information for investors who use Morningstar's Stewardship grades to guide their investments.",
    "year": 2011,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "465303a581fa1b7ba8ceb1da9cc0780c",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:21:08.216340"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文研究了共同基金治理与绩效之间的关系，特别是通过分位数回归分析Morningstar的Stewardship Grade对基金绩效的影响。这直接涉及到投资组合管理领域，因为共同基金的绩效和治理是投资组合管理中的核心问题。论文还讨论了投资者如何利用这些信息来指导投资决策，进一步强调了其在投资组合管理中的应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文研究了共同基金治理与绩效之间的关系，特别是通过分位数回归分析Morningstar的Stewardship Grade对基金绩效的影响。这直接涉及到投资组合管理领域，因为共同基金的绩效和治理是投资组合管理中的核心问题。论文还讨论了投资者如何利用这些信息来指导投资决策，进一步强调了其在投资组合管理中的应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:08:48.053901"
}