{
  "paper": {
    "id": 278,
    "title": "Modeling for project portfolio benefit prediction via a GA-BP neural network",
    "abstract": "Project portfolio benefit (PPB) prediction can effectively help managers monitor the acquisition of PPBs, thereby better achieving their target benefits. However, no valid model is available for PPB prediction. To narrow this research gap, we develop a model based on a backpropagation neural network improved with a genetic algo-rithm (GA-BPNN) to quantitatively forecast PPBs. First, the evaluation criteria for benefits are determined. Second, the input and output variables of the model are determined and calculated. Third, the initial weights and thresholds of the BPNN are improved by the GA. Fourth, based on the above optimization results, the GA-BPNN model is trained and tested. Last, the numerical example is provided to demonstrate the application of the proposed model. The results indicate that the established model is feasible and effective in predicting PPBs, with an average prediction accuracy rate of 98.64 %, which is 18.24 % better than that of the base BPNN. The model proposed in this paper effectively realizes the quantitative prediction of PPBs, enriching the research on project portfolio management (PPM) and providing managers with a tool to effectively predict PPBs.",
    "year": 2022,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "ecfaadd90883e9ea8d2e30188253d330",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "neural network",
      "deep learning",
      "backpropagation",
      "BP",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T00:41:04.847399"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究项目组合效益（PPB）预测，虽然提到了项目组合管理（PPM），但这属于项目管理领域，而非金融领域的投资组合管理。论文的核心技术是GA-BP神经网络的应用，并未涉及衍生品定价、金融风险管理或金融投资组合管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究项目组合效益（PPB）预测，虽然提到了项目组合管理（PPM），但这属于项目管理领域，而非金融领域的投资组合管理。论文的核心技术是GA-BP神经网络的应用，并未涉及衍生品定价、金融风险管理或金融投资组合管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:32:13.007606"
}