{
  "paper": {
    "id": 52,
    "title": "A Financial Risk Early Warning of Listed Companies Based on PCA and BP Neural Network",
    "abstract": "Financial risk, as one of the most influential and destructive risks in business, will make enterprises unable to escape the fate of bankruptcy if not warned and prevented in time. In the paper, we conducted research on the financial risk early warning of listed companies. A total of 250 companies were randomly selected from the Chinese A-share market from 2019 to 2021. By building the 26 financial indicators of listed companies and constructing the PCA-BP neural network, we compared the financial risk early warning effects among PCA-BPNN, SVM, and Logistic. It is found that the financial data processed by PCA can better adapt to the financial risk early warning model. The PCA-BPNN model improved the prediction accuracy of the financial risk early warning, which has strong generalization ability for the prediction of financial risk. Research findings have certain reference significance for precise judgment on the financial risk of companies.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "41f0daf370f71cf6ead0220c8433ca17",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM",
      "principal components analysis",
      "neural network",
      "backpropagation",
      "BP"
    ],
    "stage1_timestamp": "2025-05-15T01:46:03.902891"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on developing a financial risk early warning system for listed companies using PCA and BP neural network, which directly addresses the identification and prevention of financial risks, a core aspect of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on developing a financial risk early warning system for listed companies using PCA and BP neural network, which directly addresses the identification and prevention of financial risks, a core aspect of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:01:13.614963"
}