{
  "paper": {
    "id": 1780,
    "title": "Portfolio construction using bootstrapping neural networks: evidence from global stock market",
    "abstract": "The study investigates the investment value of global stock markets by a portfolio construction method combined with bootstrapping neural network architecture. A residual sample will be generated from bootstrapping sample procedure and then incorporated into the estimation of the expected returns and the covariant matrix. The outputs are further processed by the traditional Markowitz optimization procedure. In order to examine the efficacy of the proposed approach, the illustrated case was compared with traditional Markowitz mean-variance analysis, as well as the James-Stein and minimum-variance estimators. From the empirical results, it indicated that this novel approach significantly outperforms most of benchmark models based on various risk-adjusted performance measures. It can be shown that this new approach has great promise for enhancing the estimation of the investment value by Markowitz mean-variance analysis in the global stock markets.",
    "year": 2020,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "23eacbda1d6e63296ec6f27e6c28ec2a",
    "relevant_keywords": [
      "neural network",
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T00:59:23.045940"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "The paper focuses on a portfolio construction method using bootstrapping neural networks to enhance the estimation of investment value in global stock markets, which is a core aspect of portfolio management. The study compares the proposed approach with traditional Markowitz mean-variance analysis and other estimators, further emphasizing its application in portfolio management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Portfolio Management\"],\n  \"justification\": \"The paper focuses on a portfolio construction method using bootstrapping neural networks to enhance the estimation of investment value in global stock markets, which is a core aspect of portfolio management. The study compares the proposed approach with traditional Markowitz mean-variance analysis and other estimators, further emphasizing its application in portfolio management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:18:49.761581"
}