{
  "paper": {
    "id": 1226,
    "title": "Pairs trading on different portfolios based on machine learning",
    "abstract": "This article presents an advanced visualization and analytics approach for financial research. Statistical arbitrage, particularly pairs trading strategy, has gained ground in the financial market and machine learning techniques are applied to the finance field. The cointegration approach and long short-term memory (LSTM) were utilized to achieve stock pairs identification and price prediction purposes, respectively, in this project. This article focused on the US stock market, investigating the performance of pairs trading on different types of portfolios (aggressive and defensive portfolio) and compare the accuracy of price prediction based on LSTM. It can be briefly concluded that LSTM offers higher prediction precision on aggressive stocks and implementing pairs trading on the defensive portfolio would gain higher profitability during a specific period between 2016 and 2017. However, predicting tools like LSTM only offer limited advice on stock movement and should be cautiously utilized. We conclude that analytics and visualization can be effective for financial analysis, forecasting and investment strategy.",
    "year": 2021,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "abfc8201bf19651b788db852a76d4979",
    "relevant_keywords": [
      "machine learning",
      "long short-term memory",
      "LSTM",
      "deep learning",
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T00:53:09.981326"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文主要研究了基于机器学习的配对交易策略在不同投资组合（激进型和防御型）中的应用，并比较了LSTM在价格预测上的准确性。这些内容直接涉及投资组合的构建和优化，属于投资组合管理领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文主要研究了基于机器学习的配对交易策略在不同投资组合（激进型和防御型）中的应用，并比较了LSTM在价格预测上的准确性。这些内容直接涉及投资组合的构建和优化，属于投资组合管理领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:23:19.333603"
}