{
  "paper": {
    "id": 3572,
    "title": "The possibilities and consequences of investment decisions by stepwise optimization",
    "abstract": "The paper deals with the application of stochastic optimization principles for investment decision making. The authors present the investment management system based on an adequate portfolio model. For optimal portfolio construction and stock selection, the method of stochastically informative expertise and ranging is used. Investment portfolios in equity and currency markets are formed considering investor risk tolerance and risk preference level, as well as an individual utility function. Investment portfolios are constructed according to three criteria: return, risk, and reliability. The markets of Germany, the USA, and China, as well as foreign exchange markets, are analysed. The results reveal the efficient investment possibilities in the mentioned markets, allowing to reach investment return substantially exceeding market index return. Along with that, an innovative stochastic clustering methodology for investment assets is proposed. The obtained results are of great value for individual as well as institutional investors and are a suitable means to form efficient investment strategies in financial markets.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "5ed0b1f20e460f7080b0dfe7329a6726",
    "relevant_keywords": [
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T02:27:53.959503"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文主要讨论了基于随机优化原则的投资决策系统，包括投资组合的构建和股票选择方法，考虑了投资者的风险偏好和效用函数，并分析了不同市场的投资效率。这些内容明确指向投资组合管理领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文主要讨论了基于随机优化原则的投资决策系统，包括投资组合的构建和股票选择方法，考虑了投资者的风险偏好和效用函数，并分析了不同市场的投资效率。这些内容明确指向投资组合管理领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:35:59.804554"
}