{
  "paper": {
    "id": 2633,
    "title": "Decomposition of non-performing loans dynamics into a debt-servicing capacity and a risk taking indicators",
    "abstract": "Using Colombian credit vintage data, we decompose non -performing loans into two main components: one capturing the evolution of borrowers' payment capacity and another reflecting changes in the credit risk assumed by banks when granting loans. We employ intrinsic estimators and penalized regression techniques to address the perfect multicollinearity inherent in the model. Our analysis reveals that these two components have evolved differently over time and that they interact with the real and credit cycles distinctively. In particular, we find that a favorable economic environment and loose financial conditions improve the payment capacity of borrowers to meet their obligations, but coincide with increased risk -taking by financial institutions. Finally, we advocate for the adoption of this decomposition as a policy tool, easily applicable by financial and economic authorities with access to a continuous flow of credit vintage data. This methodology facilitates the identification of credit risk origins, thereby informing economic policies aimed at mitigating systemic financial risks.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "c995e91048c75dd5a1ec5a76d71939ff",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:17:32.151331"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on decomposing non-performing loans into components related to borrowers' payment capacity and banks' risk-taking behavior, which directly addresses credit risk identification and systemic financial risk mitigation. This falls under the domain of Financial Risk Management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on decomposing non-performing loans into components related to borrowers' payment capacity and banks' risk-taking behavior, which directly addresses credit risk identification and systemic financial risk mitigation. This falls under the domain of Financial Risk Management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:41:06.115136"
}