{
  "paper": {
    "id": 566,
    "title": "Agricultural loan delinquency prediction using machine learning methods",
    "abstract": "The recent economic downturn in the agricultural sector that started in 2013 has caused some concerns for farmers' repayment capacity, which raises the need for precise prediction of financial stress in the agricultural sector. Machine learning has been shown to improve predictions with large financial data, however, its application remains limited in the agricultural sector. In this study, we approximate financial stress by agricultural loan delinquency, and predict it by employing a logistic regression and several machine learning methods. The main datasets include the Call Reports and Summary of Deposits from the Federal Deposit Insurance Corporation (FDIC). Our results show that ensemble learning methods have the best performance in prediction accuracy, with improvement of 26 percentage points at most and that the Naive Bayes classifier is the best method to maintain the lowest cost from false predictions when the failure of identifying potentially high-risk loans is very costly. From the perspective of banks, while there are important benefits to using machine learning, the bank-level costs arc also important considerations that may lead to different choices of machine learning methods.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "d08730a96eb211a92c0ff630d88c3749",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "regression",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T01:52:49.380206"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用机器学习方法预测农业贷款违约，这直接涉及信用风险的管理和评估，属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是使用机器学习方法预测农业贷款违约，这直接涉及信用风险的管理和评估，属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:56:42.925029"
}