{
  "paper": {
    "id": 3731,
    "title": "Regularizing portfolio optimization",
    "abstract": "The optimization of large portfolios displays an inherent instability due to estimation error. This poses a fundamental problem, because solutions that are not stable under sample fluctuations may look optimal for a given sample, but are, in effect, very far from optimal with respect to the average risk. In this paper, we approach the problem from the point of view of statistical learning theory. The occurrence of the instability is intimately related to over-fitting, which can be avoided using known regularization methods. We show how regularized portfolio optimization with the expected shortfall as a risk measure is related to support vector regression. The budget constraint dictates a modification. We present the resulting optimization problem and discuss the solution. The L2 norm of the weight vector is used as a regularizer, which corresponds to a diversification 'pressure'. This means that diversification, besides counteracting downward fluctuations in some assets by upward fluctuations in others, is also crucial because it improves the stability of the solution. The approach we provide here allows for the simultaneous treatment of optimization and diversification in one framework that enables the investor to trade off between the two, depending on the size of the available dataset.",
    "year": 2010,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "23ad3ba6b25ecf21a091d0fc58de39de",
    "relevant_keywords": [
      "machine learning",
      "regression",
      "support vector machine",
      "SVM"
    ],
    "stage1_timestamp": "2025-05-15T01:20:03.618493"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心内容是讨论如何通过正则化方法优化大型投资组合，解决由于估计误差导致的不稳定性问题，并探讨了多样化对解决方案稳定性的重要性。这些内容直接关联到投资组合管理的核心问题。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心内容是讨论如何通过正则化方法优化大型投资组合，解决由于估计误差导致的不稳定性问题，并探讨了多样化对解决方案稳定性的重要性。这些内容直接关联到投资组合管理的核心问题。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:08:52.002509"
}