{
  "paper": {
    "id": 791,
    "title": "Portfolio Construction with Hierarchical Momentum",
    "abstract": "This article presents a portfolio construction approach that combines the hierarchical clustering of a large asset universe with the stock price momentum. On one hand, investing in high-momentum stocks enhances returns by capturing the momentum premium. On the other hand, hierarchical clustering of a high- dimensional asset universe ensures sparse diversification, stabilizes the portfolio across economic regimes, and mitigates the problem of increased drawdowns typically present in momentum portfolios. Moreover, the proposed portfolio construction approach avoids the covariance matrix inversion. An out-of-sample backtest on a non-survivorship-biased dataset of international stocks shows that, compared to the model-based and model-free benchmarks, hierarchical momentum portfolios achieve improved cumulative and risk-adjusted portfolio returns as well as decreased portfolio drawdowns net of transaction costs. The study further suggests that the unique characteristics of the hierarchical momentum portfolios arise because of both dimensionality reduction via clustering and momentum-based stock selection.",
    "year": 2024,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "cf6dac1478515d19a306b140846c6e04",
    "relevant_keywords": [
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T00:48:22.250841"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "The paper focuses on a portfolio construction approach that combines hierarchical clustering with stock price momentum to improve returns and reduce drawdowns. This directly addresses the optimization and management of investment portfolios, which is a core aspect of Portfolio Management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Portfolio Management\"],\n  \"justification\": \"The paper focuses on a portfolio construction approach that combines hierarchical clustering with stock price momentum to improve returns and reduce drawdowns. This directly addresses the optimization and management of investment portfolios, which is a core aspect of Portfolio Management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:27:49.915396"
}