{
  "paper": {
    "id": 4343,
    "title": "Credit risk assessment with Bayesian model averaging",
    "abstract": "Many credit risk models are based on the selection of a single logistic regression model, on which to base parameter estimation. When many competing models are available, and without enough guidance from economical theory, model averaging represents an appealing alternative to the selection of single models. Despite model averaging approaches have been present in statistics for many years, only recently they are starting to receive attention in economics and finance applications. This contribution shows how Bayesian model averaging can be applied to credit risk estimation, a research area that has received a great deal of attention recently, especially in the light of the global financial crisis of the last few years and the correlated attempts to regulate international finance. The paper considers the use of logistic regression models under the Bayesian Model Averaging paradigm. We argue that Bayesian model averaging is not only more correct from a theoretical viewpoint, but also slightly superior, in terms of predictive performance, with respect to single selected models.",
    "year": 2017,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "54a9971ec47bb5da8344440018ec383c",
    "relevant_keywords": [
      "classification",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:36:05.218995"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on applying Bayesian model averaging to credit risk estimation, which is a key aspect of financial risk management, particularly in assessing the likelihood of default and managing credit portfolios.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on applying Bayesian model averaging to credit risk estimation, which is a key aspect of financial risk management, particularly in assessing the likelihood of default and managing credit portfolios.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:33:21.001376"
}