{
  "paper": {
    "id": 1212,
    "title": "Comparison of Discrete Choice and Machine Learning Models for Simultaneous Modeling of Mobility Tool Ownership in Agent-Based Travel Demand Models",
    "abstract": "Individual travel behavior, such as mode choice, is determined to a distinct degree by the respective portfolio of available mobility tools, such as the number of cars, public transit pass ownership, or a carsharing membership. However, the choice of different mobility tools is interdependent, and individuals weigh alternatives against each other. This process of parallel trade-offs is currently not reflected in typically used sequential logit models of agent-based travel demand models. This study fills this research gap by applying discrete choice and neural network models on a synthetic population to model multiple mobility tool ownership simultaneously. Using data from a national household travel survey, both model types approximated the given target distributions of mobility tools more accurately than the sequence of three corresponding logit models. Owing to its greater flexibility, the tested shallow and deep neural network exhibited higher predictive accuracy than simultaneous discrete choice models. The results indicated that neural networks with only one hidden layer were more robust and easier to formulate and interpret than deep networks with three hidden layers. Finally, the flat neural network was applied to a different synthetic population resulting in equally accurate results.",
    "year": 2024,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "73f764779343136d13c043b2681ee8ba",
    "relevant_keywords": [
      "machine learning",
      "neural network",
      "deep learning",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T00:53:09.915578"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是使用离散选择和机器学习模型来模拟个体出行行为中的移动工具所有权，这与衍生品定价、金融风险管理或投资组合管理等金融领域无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是使用离散选择和机器学习模型来模拟个体出行行为中的移动工具所有权，这与衍生品定价、金融风险管理或投资组合管理等金融领域无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:23:21.800448"
}