{
  "paper": {
    "id": 3035,
    "title": "Analyzing Pedagogic Practice and Assessments in a Cross-Campus Programming Course",
    "abstract": "Teaching programming efficiently to students in the first year of computer science education is challenging. It is especially cumbersome to retain the interest of both groups, when the student group consists of novice (i.e., those who have never programmed before) and expert programmers in the same crowd. Thus, individualized teaching cannot be achieved in a traditional lecture hall for a larger student population setting and poses a pedagogical challenge. This article presents various pedagogical approaches and explores different assessment forms to foster student active learning (SAL), drawing from years of experience teaching a programming course. A detailed analysis has been conducted to understand the effect on the students' learning and perception of a course given different pedagogical approaches and varied assessment forms. The analysis is based on a course offered across three different campuses with the same course description. The key difference between the campuses however is the choice of pedagogical approach, where one of the campuses uses a bottom-up pedagogy. In contrast, the other two campuses use the top-down pedagogy to teach programming concepts to the students. Across the three campuses, the assessment form in the course has varied from regular practical school exams together with a theoretical multiple choice format, a practical home exam during the pandemic and most recently a portfolio. The findings show no significant differences in the learning outcomes based on an analysis of the grades across campuses and extensive student surveys.",
    "year": 2024,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "739b61d9c5f7b26d43c6701a7c0e9cc6",
    "relevant_keywords": [
      "active learning"
    ],
    "stage1_timestamp": "2025-05-15T01:12:43.139400"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要探讨编程课程的教学方法和评估形式，属于教育技术领域，与衍生品定价、金融风险管理或投资组合管理无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要探讨编程课程的教学方法和评估形式，属于教育技术领域，与衍生品定价、金融风险管理或投资组合管理无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:11:33.650585"
}