{
  "paper": {
    "id": 105,
    "title": "A portfolio recommendation system based on machine learning and big data analytics",
    "abstract": "This research paper introduces a portfolio recommendation system that utilizes machine learning and big data analytics to offer a profitable stock portfolio and stock analytics via a web application. The system's effectiveness was evaluated through backtesting and user evaluation studies, which consisted of two parts: user evaluation and performance evaluation. The findings indicate that the development of a machine learning-based portfolio recommendation system and big data analytics can effectively meet the expectations of the majority of users and enhance users' financial knowledge. This study contributes to the growing body of research on utilizing advanced technologies for portfolio recommendation and highlights the potential of machine learning and big data analytics in the financial industry.",
    "year": 2023,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "50fbef1265cafc83db335ff51240c013",
    "relevant_keywords": [
      "machine learning",
      "big data analytics",
      "portfolio recommendation"
    ],
    "stage1_timestamp": "2025-05-15T00:39:32.533555"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "The paper focuses on developing a portfolio recommendation system using machine learning and big data analytics, which directly pertains to the field of portfolio management by aiding in the selection and optimization of stock portfolios.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Portfolio Management\"],\n  \"justification\": \"The paper focuses on developing a portfolio recommendation system using machine learning and big data analytics, which directly pertains to the field of portfolio management by aiding in the selection and optimization of stock portfolios.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:33:48.826503"
}