{
  "paper": {
    "id": 4315,
    "title": "Modeling Temporal Dependence of Average Surface Treating Pressure in the Williston Basin Using Dynamic Multivariate Regression",
    "abstract": "The oil and gas industry has shifted paradigms after seeing the drastic decrease in oil prices since 2015. Companies are now focused as much on cost reduction as much as production maximization to drive profitable operations. This aspect is more prevalent in unconventional plays with the need for long horizontal drilling and hydraulic fracturing (HF) operations to develop and produce from the tight reservoirs. There exists an optimum point between the costs of HF treatment and the expected production. Because of the paradigm shift, many operators are now focused on re-developing existing assets at much lower costs instead of developing newer, more costly assets. Re-fracturing existing wells provides an opportunity for companies to add economical wells to their portfolio. Re-fracturing consists of pumping HF treatments in wells that were previously drilled and completed. Although it may seem that the HF process on a well would be easier the second time around, this is not always the case. There are often numerous operational and engineering parameters that may cause screen outs due to excessively high surface treating pressure (STP) that can drastically affect the economics of a re-fractured well. Being able to isolate the effects of these parameters and estimate their marginal effect on treatment will help engineers design to better HF treatments and surface equipment to effectively implement treatments in the field. This novel study uses field treatment data from re-fractured wells to create dynamic multivariate regression models to characterize the effects of treatment parameters on the average STP. The model allows for engineers to isolate the effects of other treatment parameters and estimate their marginal effects on average STP by holding other variables of interest constant. The model also attempts to account for the temporal dependence of stress shadow effects from the previous zones by using the average STP as a good approximation. It was found that the distance between zones (perforation standoff) was statistically significant at the 90% level, average pump rate, acid volume displaced, and the presence of a 3.5 liner were all statistically significant predictors of average STP at the 95% level and average surface treating pressure from the previous stage at 99% significance. The model was used to predict the STP for another re-fractured well, which showed reasonable results.",
    "year": 2022,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "3c7db9c6ed96df7784554a40aa9a59a5",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:25:50.532813"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究石油和天然气行业中水力压裂作业的表面处理压力建模，其核心技术是动态多元回归模型，应用于工程设计和操作优化，并未涉及任何金融领域的研究或应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究石油和天然气行业中水力压裂作业的表面处理压力建模，其核心技术是动态多元回归模型，应用于工程设计和操作优化，并未涉及任何金融领域的研究或应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:07:56.162975"
}