{
  "paper": {
    "id": 1199,
    "title": "Data-driven cooperative trading framework for a risk-constrained wind integrated power system considering market uncertainties",
    "abstract": "As wind power continues to integrate into modern power systems, the bidding strategies of wind power producers are becoming more important than ever. However, the current trading strategies of wind power producers may be impractical because their market uncertainties, financial risk, and cooperative behaviors are generally not considered. Therefore, this paper proposes a data-driven framework for risk-constrained coordinated bidding strategy for a wind integrated power system that participates in the electricity balancing market. In this framework, a price uncertainty predictor consisting of ridge regression, non-pooling convolu-tional neural network, and linear quantile regression is first modeled to evaluate the day-ahead electricity price uncertainty. The financial risk for this uncertainty is also formulated as a bidding constraint based on acceptable downside risk. Moreover, a risk-constrained cooperative bidding model considering market uncertainties is presented to maximize the interests of the wind power producer. Then, an improved firefly algorithm is developed to tackle the bidding model, and the adaptive moment estimation method is utilized to improve the convergence speed and exploitation ability of the algorithm. Finally, the Shapley value is introduced for profit distribution for cooperative power producers. The proposed framework and bidding model have been comprehensively evaluated on a modified IEEE 30-bus system. The findings reveal that the daily profit of the proposed uncertainty predictor is increased by U.S.$ 777 compared with the categorical boosting -based uncertainty predictor. Furthermore, the proposed methods also achieve better competitive results in the aspects of cooperative behavior, optimal performance, and forecasting accuracy compared with other algorithms.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "2ffc62d36fc04d9d180108984b2a80dc",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "regression",
      "neural network",
      "deep learning",
      "convolutional neural network",
      "CNN"
    ],
    "stage1_timestamp": "2025-05-15T01:59:56.348895"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究风力发电生产商在电力平衡市场中的投标策略，虽然涉及金融风险和不确定性预测，但其核心应用领域是电力市场运营和可再生能源集成，而非特定的金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究风力发电生产商在电力平衡市场中的投标策略，虽然涉及金融风险和不确定性预测，但其核心应用领域是电力市场运营和可再生能源集成，而非特定的金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:50:57.122406"
}