{
  "paper": {
    "id": 696,
    "title": "Relevance of hybrid artificial intelligence for improving the forecasting accuracy of natural resource prices",
    "abstract": "The prediction performance of traditional forecasting methods is low due to the high level of complexity in a series of energy prices. The present study attempts to compare the traditional regression, machine learning tools and hybrid models to conclude the outperforming model. The first step is to propose the effective denoising technique for Tadawul energy index, which has confirmed the superiority of CSD based denoising. However, we use the CSD-ARIMA, CSD-ANN, and CSD-RNN as hybrid models. As a result, CSD-RNN outperforms both other models in terms of MSE, MAPE, RMSE and Dstat. The findings are useful for policy makers, investors and portfolio managers to forecast the energy trends, and hedge the portfolio risk accordingly. (c) 2023 China University of Geosciences (Beijing) and Peking University. Published by Elsevier B.V. on behalf of China University of Geosciences (Beijing). This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/).",
    "year": 2024,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "a14b12da2f798297d112a72dce4540f4",
    "relevant_keywords": [
      "machine learning",
      "regression",
      "neural network",
      "deep learning",
      "recurrent neural network",
      "RNN",
      "denoising autoencoder"
    ],
    "stage1_timestamp": "2025-05-15T00:47:18.452258"
  },
  "domain_result": {
    "success": false,
    "error": "Client error '429 Too Many Requests' for url 'https://api.deepseek.com/v1/chat/completions'\nFor more information check: https://developer.mozilla.org/en-US/docs/Web/HTTP/Status/429",
    "application_domains": [
      "None"
    ],
    "justification": "API调用失败: Client error '429 Too Many Requests' for url 'https://api.deepseek.com/v1/chat/completions'\nFor more information check: https://developer.mozilla.org/en-US/docs/Web/HTTP/Status/429",
    "raw_response": null
  },
  "timestamp": "2025-05-20T16:28:28.385506"
}