{
  "paper": {
    "id": 2253,
    "title": "Equity premium predictions with many predictors: A risk-based explanation of the size and value factors",
    "abstract": "This paper investigates whether a direct mechanism can be found that demonstrates that the size and value factors of Fama and French (1993) are indeed ICAPM factors, as some have suggested. The results endorse this hypothesis: small size and value portfolios reflect changes in future investment opportunities. To test the hypothesis, the paper forecasts the equity premium using disaggregated portfolio returns with a partial least squares (PLS) regression approach. PLS is chosen as it is particularly suited to condense a large set of portfolios into a single index. The index portfolio obtained from the forecast performs well out of sample and hedges against future market risk, in addition to explaining future market returns in sample. Thus, the index portfolio may be viewed as an additional risk factor in the form of a Merton (1973) state variable. The index places larger weights on small size and value portfolios. This also provides a possible explanation for why equal-weighted portfolios typically perform better out of sample compared to factors implied by traditional mean-variance approaches and asset pricing models. (C) 2017 Elsevier B.V. All rights reserved.",
    "year": 2018,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "1c04e2e00090012dc64536182acf4ff5",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:05:04.432006"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文主要研究如何利用部分最小二乘（PLS）回归方法预测股权溢价，并构建一个指数组合来对冲未来市场风险。研究重点在于解释和优化投资组合的表现，特别是小规模和价值投资组合的表现，这直接关联到投资组合管理的领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文主要研究如何利用部分最小二乘（PLS）回归方法预测股权溢价，并构建一个指数组合来对冲未来市场风险。研究重点在于解释和优化投资组合的表现，特别是小规模和价值投资组合的表现，这直接关联到投资组合管理的领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:15:58.914881"
}