{
  "paper": {
    "id": 1513,
    "title": "A Study on Credit Risk Assessment in Banking Sector using Data Mining Techniques",
    "abstract": "The emerging complexity of banking and its dynamic environment, risk assessment has become very important, particularly in the financial sector. As a result, there is a high level of competition between financial institutions, resulting in the loss of most loans. In order to improve credit quality and reduce credit risk, banks and researchers have developed credit scoring models to improve the credit assessment process during the credit assessment process. It is quite difficult for anyone for assess credibility of customer due to the complexity of the database. In order to tackle such issues, there is need for a framework which can decides the risk assessment by combining some characteristics. In this paper a brief study of risk assessment models using machine learning approach is discussed as well as proposed architecture is designed with an aim to significantly reduce the dimensionality of the data as well as to increase the accuracy of the classifications compared to other existing methods.",
    "year": 2018,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "446df09185d401e148fba9e4e6963ba5",
    "relevant_keywords": [
      "machine learning",
      "classification",
      "feature learning",
      "feature representation"
    ],
    "stage1_timestamp": "2025-05-15T02:04:19.968792"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on credit risk assessment in the banking sector using data mining and machine learning techniques, which is a core aspect of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on credit risk assessment in the banking sector using data mining and machine learning techniques, which is a core aspect of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:48:23.964994"
}