{
  "paper": {
    "id": 7221,
    "title": "The self-reinforcing dynamics of economic insecurity and obesity",
    "abstract": "This article models the dynamic effects of economic insecurity on body weight. Using Australian panel data, we infer an individual's level of economic insecurity as a function of exposure to various financial risks and employ regression equations to explore its effect upon current period body mass index (BMI) scores. Estimates reveal that a sustained standard deviation increase in economic insecurity raises an individual's BMI at a rate of approximately 0.35 units per year. Quantile regressions are then used to estimate the sensitivity of body weight to insecurity at different percentiles of the distribution and we find that persons who are overweight and obese are much more seriously affected. This implies that shocks that make individuals more financially vulnerable can generate harmful self-sustaining cycles of risk and weight gain. We also model the dynamics of insecurity and show that it is a persistent phenomenon for persons with high levels of exposure and lower incomes. This finding indicates that persons of lower socio-economic status are more likely to encounter vicious cycles of increasing insecurity and obesity, which partially explains why weight-related health problems are unusually highly concentrated amongst these individuals.",
    "year": 2017,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "6f1913965c9e7f727c5953f70d8e4543",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T03:06:35.278705"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究经济不安全感对体重指数（BMI）的动态影响，虽然涉及金融风险的概念，但其核心技术和研究成果并未应用于衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究经济不安全感对体重指数（BMI）的动态影响，虽然涉及金融风险的概念，但其核心技术和研究成果并未应用于衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:26:39.590161"
}