{
  "paper": {
    "id": 5357,
    "title": "Path modelling to bankruptcy: causes and symptoms of the banking crisis",
    "abstract": "This article studies the bankruptcy of US banks since 2009. It first analyses the financial symptoms that precede bankruptcy, such as low profitability, insufficient revenue or low solvency ratios. It also goes into the causes of these symptoms. It poses several hypotheses on causes of failure, such as loan growth (some of them risky), specialization (in this case concentration in real estate) and the pursuit of a turnover-driven strategy neglecting margin. It presents and tests a structural equation modelling based on partial least squares path modelling (PLS-PM) and logistic regression. Results show that, 5 years before the crisis, failed banks had, compared to solvent banks, the following: higher loan growth, higher concentration on real estate loans, higher risk ratios, higher turnover, but lower margins. A relationship is found between symptoms and causes. Failed banks present a significant relationship between the percentage of real estate loans and risk. This relationship is negative in excellent banks, confirming that they allocated less real estate loans with a high quality. Nonfailed banks compensated increases in risk by strengthening their core capital.",
    "year": 2014,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "959e5e7247baec754a4057df73b47e37",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:46:45.016131"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文研究了银行破产前的财务症状和原因，使用了结构方程模型和逻辑回归来分析风险因素，如贷款增长、房地产贷款集中度和风险比率，这些都属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"该论文研究了银行破产前的财务症状和原因，使用了结构方程模型和逻辑回归来分析风险因素，如贷款增长、房地产贷款集中度和风险比率，这些都属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:30:32.542199"
}