{
  "paper": {
    "id": 1641,
    "title": "The origins and underpinning principles of e-scape",
    "abstract": "In this article I describe the context within which we developed project e-scape and the early work that laid the foundations of the project. E-scape (e-solutions for creative assessment in portfolio environments) is centred on two innovations. The first concerns a web-based approach to portfolio building; allowing learners to build their portfolios in real-time, directly from hand-held peripheral technologies in studios, workshops, laboratories, and from off-site settings. The second concerns the development of a radical web-based approach to the assessment of performance as captured in these portfolios. In many parts of the world, portfolios feature as part of school-based assessments-including those undertaken for school-leaving and certification purposes. In this setting assessment reliability is critical and (judged by practice in England & Wales) is typically far from satisfactory. The approach developed within e-scape has radically improved assessment reliability. Whilst these two innovations represent the most dramatic outcomes of the project, they arose from a set if principles held by the team of researchers in the Technology Education Research Unit (TERU) at Goldsmiths University of London. And central to these principles is that both the portfolio and the assessment approaches should be embedded in a view of active learning, such that engagement with them has a positive impact on classroom practice. As the title suggests, this paper outlines the origins, underlying principles and early development of project e-scape.",
    "year": 2012,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "3e0c98e7af30019b99d80fc8ca73b1b0",
    "relevant_keywords": [
      "active learning"
    ],
    "stage1_timestamp": "2025-05-15T00:58:18.200645"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要讨论的是教育技术领域的项目e-scape，涉及基于网络的组合构建和评估方法，与金融领域的衍生品定价、金融风险管理或投资组合管理无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要讨论的是教育技术领域的项目e-scape，涉及基于网络的组合构建和评估方法，与金融领域的衍生品定价、金融风险管理或投资组合管理无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:19:40.695525"
}