{
  "paper": {
    "id": 2475,
    "title": "PREDICTION OF THE DELAY IN THE PORTFOLIO CONSTRUCTION USING NAIVE BAYESIAN CLASSIFICATION ALGORITHMS",
    "abstract": "Projects suspensions are between the most insistent tasks confronted by the construction field accredited to the sector's difficulty and its essential delay risk foundations' interdependence. Machine learning provides a perfect group of techniques, which can attack those complex systems. The study aimed to recognize and progress a well organized predictive data tool to examine and learn from delay sources depend on preceding data of construction projects by using decision trees and naive Bayesian classification algorithms. An intensive review of available data has been conducted to explore the real reasons and causes of construction project delays. The results show that the postponement of delay of interim payments is at the forefront of delay factors caused by the employer's decision. Even the least one is to leave the job site caused by the contractor's second part of the contract, the repeated unjustified stopping of the work at the site, without permission or notice from the client's representatives. The developed model was applied to about 97 projects and used as a prediction model. The decision tree model shows higher accuracy in the prediction.",
    "year": 2021,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "9cf41a3716522b29f11f53e8b2bcafd4",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T01:07:03.107297"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究建筑项目中的延迟预测，使用了机器学习分类算法，但其应用场景是建筑项目管理，而非金融领域的衍生品定价、金融风险管理或投资组合管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究建筑项目中的延迟预测，使用了机器学习分类算法，但其应用场景是建筑项目管理，而非金融领域的衍生品定价、金融风险管理或投资组合管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:14:40.266015"
}