{
  "paper": {
    "id": 311,
    "title": "Harnessing Machine Learning for Classifying Economic Damage Trends in Transportation Infrastructure Projects",
    "abstract": "Given the highly visible nature, transportation infrastructure construction projects are often exposed to numerous unexpected events, compared to other types of construction projects. Despite the importance of predicting financial losses caused by risk, it is still difficult to determine which risk factors are generally critical and when these risks tend to occur, without benchmarkable references. Most of existing methods are prediction-focused, project type-specific, while ignoring the timing aspect of risk. This study filled these knowledge gaps by developing a neural network-driven machine-learning classification model that can categorize causes of financial losses depending on insurance claim payout proportions and risk occurrence timing, drawing on 625 transportation infrastructure construction projects including bridges, roads, and tunnels. The developed network model showed acceptable classification accuracy of 74.1%, 69.4%, and 71.8% in training, cross-validation, and test sets, respectively. This study is the first of its kind by providing benchmarkable classification references of economic damage trends in transportation infrastructure projects. The proposed holistic approach will help construction practitioners consider the uncertainty of project management and the potential impact of natural hazards proactively, with the risk occurrence timing trends. This study will also assist insurance companies with developing sustainable financial management plans for transportation infrastructure projects.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "dc536bdf951fc90454dfdfde1d38cfb3",
    "relevant_keywords": [
      "machine learning",
      "classification",
      "neural network",
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T01:49:04.719223"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是利用机器学习对交通基础设施建设项目中的经济损失趋势进行分类，虽然涉及金融损失预测，但其核心应用领域是建筑项目管理和保险赔付分析，而非衍生品定价、金融风险管理或投资组合管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是利用机器学习对交通基础设施建设项目中的经济损失趋势进行分类，虽然涉及金融损失预测，但其核心应用领域是建筑项目管理和保险赔付分析，而非衍生品定价、金融风险管理或投资组合管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:59:06.251191"
}