{
  "paper": {
    "id": 442,
    "title": "Systemic financial risk early warning of financial market in China using Attention-LSTM model",
    "abstract": "We propose an Attention-LSTM neural network model to study the systemic risk early warning of China. Based on text mining, the network public opinion index is constructed and used as a training set to be incorporated into the early warning model to test the early warning effect. The results show that: (i) the network public opinion is the non-linear Granger causality of systemic risk. (ii) The Attention-LSTM neural network has strong generalization ability. Early warning effects have been significantly improved. (iii) Compared with the BP neural network model, the SVR model and the ARIMA model, the LSTM neural network early warning model has a higher accuracy rate, and its average prediction accuracy for systemic risk indicators has been improved over short, medium and long terms. When the attention mechanism is included in the LSTM, the Attention-LSTM neural network model is even more accurate in all the cases.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "deep learning",
    "cache_key": "9c98171be8694482a477806a208a606a",
    "relevant_keywords": [
      "machine learning",
      "neural network",
      "deep learning",
      "backpropagation",
      "BP",
      "long short-term memory",
      "LSTM",
      "attention mechanism"
    ],
    "stage1_timestamp": "2025-05-15T01:38:17.411860"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用Attention-LSTM模型进行系统性金融风险的早期预警，这直接属于金融风险管理的范畴。论文的研究目标是提高系统性风险的预测准确性，并通过网络舆情指数等数据来测试预警效果，这些都是金融风险管理中的典型应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"该论文的核心技术是使用Attention-LSTM模型进行系统性金融风险的早期预警，这直接属于金融风险管理的范畴。论文的研究目标是提高系统性风险的预测准确性，并通过网络舆情指数等数据来测试预警效果，这些都是金融风险管理中的典型应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:03:37.215116"
}