{
  "paper": {
    "id": 1816,
    "title": "Risk measures-based cluster methods for finance",
    "abstract": "This paper performs an extensive comparison of cluster techniques for financial applications based on risk measures and returns as classification variables. We consider the cluster techniques and risk measures largely used in the literature. For the analysis, we use a database composed of daily returns of the U.S. equity market. As for financial applications, we consider capital determination, portfolio optimization, and asset pricing. We found that the number of clusters varies over the years. The years with the fewest clusters coincide with periods of instability, such as 2008 (Subprime Crisis) and 2015 (slowdown in United States domestic product). Overall, we observe that our data support the superiority of the Fanny and MC approaches. By construction, both techniques are more robust to the distinct probabilistic distribution of data, which is typically the case for financial data. Furthermore, our results highlight the practical utility of considering risk measures and returns as classification variables in financial applications.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "7f24724f7cd1792f6cb9ebbc0ae64fa4",
    "relevant_keywords": [
      "unsupervised learning",
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T02:08:03.849867"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk",
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是基于风险度量和回报的聚类方法，应用于资本确定、投资组合优化和资产定价。这些应用场景明确指向金融风险管理和投资组合管理领域。论文还提到在金融不稳定时期（如2008年金融危机）的应用，进一步强调了其在风险管理中的实用性。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\", \"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是基于风险度量和回报的聚类方法，应用于资本确定、投资组合优化和资产定价。这些应用场景明确指向金融风险管理和投资组合管理领域。论文还提到在金融不稳定时期（如2008年金融危机）的应用，进一步强调了其在风险管理中的实用性。\"\n}\n```"
  },
  "timestamp": "2025-05-20T14:24:44.654195"
}