{
  "paper": {
    "id": 180,
    "title": "RETRACTED: Research on Securities Portfolio Model Based on Genetic Optimization Neural Network (Retracted Article)",
    "abstract": "Portfolio is an investment management concept different from individual asset management. This consideration leads to an interesting result, that is, investors should buy a variety of securities at the same time instead of one kind of securities for diversified investment. Aiming at the limitations of BPNN (BP neural network) in traditional artificial neural network and its shortcomings such as many iterations, low convergence accuracy, and poor generalization, a portfolio method based on GA_BPNN (Genetic Optimization Neural Network) was proposed. The setting of GA (genetic algorithm) parameters and BPNN parameters are discussed in detail, and the implementation steps of genetic BP algorithm are described. The results show that the evaluation indexes of GA_BPNN prediction model are obviously better than those of the comparison prediction model, with the coincidence rate of 77.96% and the average absolute error of 12.451. The combination of GA and BPNN can effectively solve this problem. The simulation results of optimizing securities portfolio show that its optimization scheme is better than quadratic programming method, and this method is more correct, efficient, and practical.",
    "year": 2022,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "8e9ac6972d6bb6d6c7fcae7a947956a5",
    "relevant_keywords": [
      "neural network",
      "backpropagation",
      "BP"
    ],
    "stage1_timestamp": "2025-05-15T00:40:02.131183"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "The paper focuses on optimizing securities portfolio using a genetic optimization neural network, which is a direct application in the field of portfolio management. The study compares the proposed method with traditional quadratic programming methods in the context of portfolio optimization, indicating its primary application in this specific financial domain.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Portfolio Management\"],\n  \"justification\": \"The paper focuses on optimizing securities portfolio using a genetic optimization neural network, which is a direct application in the field of portfolio management. The study compares the proposed method with traditional quadratic programming methods in the context of portfolio optimization, indicating its primary application in this specific financial domain.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:32:54.555446"
}