{
  "paper": {
    "id": 5010,
    "title": "A multi-layer multi-view stacking model for credit risk assessment",
    "abstract": "Credit risk assessment plays a key role in determining the banking policies and commercial strategies of financial institutions. Ensemble learning approaches have been validated to be more competitive than individual classifiers and statistical techniques for default prediction. However, most researches focused on improving overall prediction accuracy rather than improving the identification of actual defaulted loans. In addition, model interpretability has not been paid enough attention in previous studies. To fill up these gaps, we propose a Multi-layer Multi-view Stacking Integration (MLMVS) approach to predict default risk in the P2P lending scenario. As the main innovation, our proposal explores multi-view learning and soft probability outputs to produce multi-layer integration based on stacking. An interpretable artificial intelligence tool LIME is embedded for interpreting the prediction results. We perform a comprehensive analysis of MLMVS on the Lending Club dataset and conduct comparative experiments to compare it with a number of well-known individual classifiers and ensemble classification methods, which demonstrate the superiority of MLMVS.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "f1b89f36abc93f76195bd1be45e1016c",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "ensemble learning",
      "interpretable artificial intelligence",
      "stacking"
    ],
    "stage1_timestamp": "2025-05-15T02:43:06.891572"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on credit risk assessment and default prediction in the P2P lending scenario, which is a key aspect of financial risk management. The proposed MLMVS approach aims to improve the identification of actual defaulted loans, directly addressing risk management challenges.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on credit risk assessment and default prediction in the P2P lending scenario, which is a key aspect of financial risk management. The proposed MLMVS approach aims to improve the identification of actual defaulted loans, directly addressing risk management challenges.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:31:31.001190"
}