{
  "paper": {
    "id": 168,
    "title": "E-Commerce Enterprises Financial Risk Prediction Based on FA-PSO-LSTM Neural Network Deep Learning Model",
    "abstract": "The rapid development of Internet information technology has made e-commerce enterprises face complex and changing financial problems. Combining artificial intelligence algorithms and dynamic monitoring of financial risks has been a current research hotspot. Based on this, this paper conducts an empirical study with a sample of listed Chinese e-commerce enterprises from 2012 to 2022. Firstly, using factor analysis (FA) to obtain the common factors between the original financial and non-financial indicators has the effect of reducing the overfitting risk of the model. Secondly, the mean square error (MSE) of the output and predicted values of the Long Short-Term Memory neural network (LSTM) is used as the fitness function of the intelligent swarm optimization algorithm, and then the Particle Swarm Optimization (PSO) algorithm is used to optimize the learning rate (LR) and the number of hidden layer neurons in the Long Short-Term Memory (LSTM) neural network. Finally, a financial risk prediction model based on FA-PSO-LSTM deep learning is constructed, and multiple benchmark models are introduced for comparative analysis on each evaluation index. The study shows that for nonlinear multivariate data with complex structure, the fused deep learning model proposed in this paper achieves the lowest values in mean square error (MSE), mean absolute error (MAE), and mean absolute percentage error (MAPE). This indicates that the model has the best prediction effect, which is helpful to help managers make relevant decisions efficiently and scientifically and make the enterprise sustainable.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "cfcfc1282c38e0c57f82988248184604",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "neural network",
      "deep learning",
      "long short-term memory",
      "LSTM",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T01:47:52.931820"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是构建一个基于FA-PSO-LSTM深度学习的财务风险预测模型，旨在帮助电子商务企业管理者高效科学地做出相关决策，这直接属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是构建一个基于FA-PSO-LSTM深度学习的财务风险预测模型，旨在帮助电子商务企业管理者高效科学地做出相关决策，这直接属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:00:23.673514"
}