{
  "paper": {
    "id": 1597,
    "title": "Expanding and Interpreting Financial Statement Fraud Detection Using Supply Chain Knowledge Graphs",
    "abstract": "The relationships within a supply chain are crucial for analyzing business transactions and can reveal significant patterns in disclosed financial data. These relationships also aid in the assessment and detection of financial fraud. Recent studies employing graph neural networks (GNNs) have demonstrated enhanced detection capabilities by integrating corporate financial features with supply chain relationships, surpassing traditional methods that rely solely on financial features. However, these studies face notable limitations: (1) they do not model enterprise associations across consecutive years, hindering the detection of long-term financial fraud, and (2) they lack efficacy in interpretive analyses of supply chain relationships to uncover patterns of fraud or risk transfer. To address these gaps, this paper introduces an interpretable and efficient Heterogeneous Graph Convolutional Network (ieHGCN) designed to analyze supply chain knowledge graphs. It also extends the model's learning scope to multi-year financial data for detecting fraud. The experimental results indicate that our method, offering both extensibility and interpretability, significantly outperforms existing machine learning and GNN approaches in continuous multi-year fraud detection, achieving the highest AUC of 0.7498, a 3.8% improvement over the leading method. Furthermore, meta-path analysis reveals that companies sharing the same supplier exhibit correlated financial fraud risks and that fraud can propagate through the supply chain, providing novel insights into anti-fraud and risk management strategies through enhanced interpretability.",
    "year": 2025,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "86edd1a7b930f8e9970a1d2b46ca536e",
    "relevant_keywords": [
      "machine learning",
      "classification",
      "neural network",
      "deep learning",
      "representation learning",
      "graph neural networks (GNNs)",
      "Heterogeneous Graph Convolutional Network (ieHGCN)"
    ],
    "stage1_timestamp": "2025-05-15T02:05:08.220854"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on detecting financial fraud through supply chain knowledge graphs and interpretable models, which is directly related to identifying and managing financial risks, a core aspect of Financial Risk Management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on detecting financial fraud through supply chain knowledge graphs and interpretable models, which is directly related to identifying and managing financial risks, a core aspect of Financial Risk Management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:47:56.059027"
}