{
  "paper": {
    "id": 608,
    "title": "Forecasting the direction of daily changes in the India VIX index using deep learning",
    "abstract": "The VIX index is an indicator of the market's perception of risk, and an accurate fore-cast of the movements in VIX can be very useful for investment risk management. So, the aim of this study is to predict the day-to-day movement of the India VIX using six deep learning archi-tectures. All six architectures performed well and achieved a higher level of accuracy with minor differences than in previous studies. The findings of the study are of great relevance for assessing short-term risk as well as long-term strategies for hedgers, risk-averse investors, volatility trad-ers, investors, and financial researchers.& COPY; 2023 Published by Elsevier Ltd on behalf of Indian Institute of Management Bangalore. This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/ by-nc-nd/4.0/)",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "deep learning",
    "cache_key": "4c39e5a8bc96297c2aa581855adf2bc4",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "neural network",
      "representation learning",
      "backpropagation",
      "BP",
      "hidden layer",
      "recurrent neural network",
      "long short-term memory",
      "LSTM"
    ],
    "stage1_timestamp": "2025-05-15T01:40:14.309985"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on predicting the movements of the India VIX index, which is a key indicator of market risk perception. This prediction is directly relevant to assessing and managing financial risk, making it primarily applicable to the Financial Risk Management domain.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on predicting the movements of the India VIX index, which is a key indicator of market risk perception. This prediction is directly relevant to assessing and managing financial risk, making it primarily applicable to the Financial Risk Management domain.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:02:47.407130"
}