{
  "paper": {
    "id": 1118,
    "title": "Based on Information Fusion Technique with Data Mining in the Application of Finance Early-Warning",
    "abstract": "Data mining has been widely applied to make prediction for finance crisis risk, and they often obtain a good result. Financial distress prediction can be formulated as a classification problem using data mining. Many data mining methods for classification can be used to solve the finance early-warning problem, however, one time data mining process cannot often obtain a well support decision, and one single method has its weakness for classification. In this paper, we use information fusion technique to build a finance early-warning model based on data mining methods, which can integrate the respective strengths from different data mining methods to improve the prediction accuracy rate, it fuses the different data mining results to gain the prediction results for reliable decision. We also choose the real dataset of Chinese listed manufacturing companies to predict the finance risk with information fusion technique based on SVM and Logistic model, and make comparison with the two methods to make prediction respectively. (C) 2013 The Authors. Published by Elsevier B.V.",
    "year": 2013,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "ef93b861608383656a2dffcc80faefe5",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM"
    ],
    "stage1_timestamp": "2025-05-15T01:59:21.572934"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要研究使用信息融合技术和数据挖掘方法来构建金融早期预警模型，旨在提高金融风险预测的准确性。这直接涉及金融风险管理领域，特别是财务困境预测和危机预警。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文主要研究使用信息融合技术和数据挖掘方法来构建金融早期预警模型，旨在提高金融风险预测的准确性。这直接涉及金融风险管理领域，特别是财务困境预测和危机预警。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:51:59.363302"
}