{
  "paper": {
    "id": 2377,
    "title": "Hedging Strategies of Green Assets against Dirty Energy Assets",
    "abstract": "Previous studies argue that the relationships between clean/green and dirty energy assets are time-varying, but there is a lack of evidence on the hedging ability of clean energy stocks and green bonds for dirty assets, such as crude oil and an energy stock index exchange traded fund (ETF), and the portfolio implications. Furthermore, potential drivers of the dynamics of the hedge portfolio returns are still unknown. To address these research gaps, the authors provide an extensive analysis of the hedging ability of clean/green assets against two dirty energy assets (crude oil prices and energy ETF) using daily data from 3 January 2012 to 29 November 2019. Using corrected dynamic conditional correlation models, the authors model correlation and then compute hedge ratios and hedging effectiveness, which all seem to vary with time. The results from hedging effectiveness indicate that investors should follow a dynamic hedging strategy and that clean energy stocks are more effective hedge than green bonds, especially for crude oil. The application of regression analyses shows that the implied volatilities of US equities and crude oil as well as US dollar index have a negative impact on the hedge portfolio returns, whereas gold prices and inflation have a positive impact.",
    "year": 2020,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "ffb17be1751d896d21d79fec267a242a",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:06:10.785992"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk",
      "Portfolio Management"
    ],
    "justification": "The paper focuses on analyzing the hedging ability of clean/green assets against dirty energy assets, which involves computing hedge ratios and hedging effectiveness. This is directly related to financial risk management. Additionally, the study discusses portfolio implications and dynamic hedging strategies, which fall under portfolio management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\", \"Portfolio Management\"],\n  \"justification\": \"The paper focuses on analyzing the hedging ability of clean/green assets against dirty energy assets, which involves computing hedge ratios and hedging effectiveness. This is directly related to financial risk management. Additionally, the study discusses portfolio implications and dynamic hedging strategies, which fall under portfolio management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:15:26.963646"
}