{
  "paper": {
    "id": 625,
    "title": "Research on Deep Learning-Based Financial Risk Prediction",
    "abstract": "Financial text-based risk prediction is an important subset for financial analysis. Through automatic analysis of public financial comments, fundamentals on current financial expectations can be evaluated. A deep learning method for financial risk prediction based on sentiment classification is proposed in this paper. The proposed method consists of two steps. Firstly, the abstract of the financial message is extracted according to the seq2seq model. During the extraction process, the seq2seq model can cope with the situation of different input message lengths. After the abstraction, invalid information in the financial messages can be effectively filtered, thus accelerating the subsequent sentiment classification step. The sentiment classification step is performed through the GRU model according to the abstracted texts. The proposed method has the following advantages: (1) it can handle financial messages of different lengths; (2) it can filter out the invalid information of financial messages; (3) because the extracted abstract is more refined, it can speed up the subsequent sentiment classification step; and (4) it has better sentiment classification accuracy. The proposed method in this paper is then verified through financial message dataset from the financial social network StockTwits. By comparing the classification performances, it can be seen that compared with the classical SVM and LSTM methods, the proposed method in this paper can improve the accuracy of sentiment classification by 5.57% and 2.58%, respectively.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "4ba3fb87b598a767ac4184b066b44847",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "classification",
      "support vector machine",
      "SVM",
      "neural network",
      "recurrent neural network",
      "long short-term memory",
      "LSTM",
      "sequence-to-sequence learning",
      "seq2seq",
      "encoder-decoder"
    ],
    "stage1_timestamp": "2025-05-15T01:53:24.776430"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是基于深度学习的金融风险预测方法，通过情感分类来分析金融文本以评估金融风险，这直接属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是基于深度学习的金融风险预测方法，通过情感分类来分析金融文本以评估金融风险，这直接属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T14:24:02.301541"
}