{
  "paper": {
    "id": 1835,
    "title": "Appraising the Risk Assessment of Non-Structural Components via Simplified and Machine-Learning-Based Approaches",
    "abstract": "Uncertainties in building element modelling and ground motions are indispensable for rigorous seismic risk quantification. demand-intensity models simply relate building performance to intensity and subsequently risk. This article describes developments toward non-structural element (NSEs) risk quantification. The demand-intensity models are applied to infilled reinforced concrete (RC) case-study buildings. Implicit and explicit NSE numerical modelling is used to validate the models versus the direct integration of risk exceedance. For faster estimation techniques, machine learning models are trained to estimate the demand-intensity model fitting parameters on a modest dataset of RC infilled buildings. Among these, the extreme gradient boosting (XGBoost) demonstrated superior performance, indicating further possible directions for improvement where larger datasets are available. These models facilitate the simple retrieving of demand-intensity models without extensive structural analysis and can be utilized for both structural and non-structural elements when assessing risk in single or multiple buildings as part of portfolio analysis.",
    "year": 2024,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "39fe2b7478735f725a81a4ea291400e5",
    "relevant_keywords": [
      "machine learning",
      "regression",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T00:59:53.316500"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究非结构构件的地震风险评估，涉及建筑性能建模和机器学习方法的应用，但并未提及任何与金融领域直接相关的应用场景或研究目标。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究非结构构件的地震风险评估，涉及建筑性能建模和机器学习方法的应用，但并未提及任何与金融领域直接相关的应用场景或研究目标。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:18:43.161667"
}