{
  "paper": {
    "id": 1107,
    "title": "Network effects on risk co-movements: A network quantile autoregression-based analysis",
    "abstract": "Interconnections and volatilities among financial institutions, notably during periods of extreme risk events, are fundamental factors in studies of financial markets. Utilizing tail-event-driven networks, we depict the risk interdependencies among financial institutions and introduce a novel ranking strategy for institutional influence based on network effects and quantile regression techniques. This interdependence is examined through the prism of joint extreme movements, utilizing bivariate extreme value theory and classification analysis. To validate their effectiveness and applicability in the real world, we deploy these methodologies on Systemically Important Financial Institutions (SIFIs). Additionally, we provide a ranking of the importance of eight U.S. institutions based on tail risks, offering regulators valuable insights and references.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "87e93684d4848315f0647ca061cbe8d0",
    "relevant_keywords": [
      "classification",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:58:43.526573"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on analyzing risk interdependencies among financial institutions, particularly during extreme risk events, and introduces a ranking strategy for institutional influence based on tail risks. This directly addresses the identification and management of systemic risks, which is a core aspect of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on analyzing risk interdependencies among financial institutions, particularly during extreme risk events, and introduces a ranking strategy for institutional influence based on tail risks. This directly addresses the identification and management of systemic risks, which is a core aspect of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:52:00.365662"
}