{
  "paper": {
    "id": 2514,
    "title": "Improving decision making in the management of hospital readmissions using modern survival analysis techniques",
    "abstract": "Hospital readmissions lead to unnecessary demand for healthcare resources, greater financial costs, and poorer patient outcomes. These consequences have led hospitals to attempt to identify high-risk patients with predictive models, but research has rarely focused on survival analysis techniques, model applications, and performance measures. This study establishes the uses of survival models to support managerial decision-making for readmissions. First, machine learning and statistical survival techniques are applied, ten of which have not been used in previous readmission research. Secondly, applications of survival models in a decision support capacity are proposed, relating to intervention targeting, follow-up care customisation, and demand forecasting. Thirdly, performance measures for the proposed applications are determined and used for empirical model assessment. These performance measures have not been applied in previous readmission research. The empirical assessment is based on adult admissions to the Emergency Department of Gold Coast University Hospital (n = 46,659) and Robina Hospital (n = 23,976) in Queensland, Australia. The relevant aspects of performance were determined to be discrimination and calibration, as measured by time-dependent concordance and D-Calibration respectively. A range of discrimination and calibration combinations can be achieved by different models, with the Recursively Imputed Survival Tree, Cox regression, and hybrid Cox-ANN techniques being most promising. Survival approaches linking techniques, proposed applications, and performance measurement should be given greater consideration in future healthcare research and in institutions aiming to manage readmissions.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "43b119e9316b46b2e18e0316a530d907",
    "relevant_keywords": [
      "machine learning",
      "decision tree",
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T02:16:32.547529"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究医院再入院的管理决策，应用生存分析技术来预测高风险患者和优化医疗资源分配，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究医院再入院的管理决策，应用生存分析技术来预测高风险患者和优化医疗资源分配，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:41:35.149255"
}