{
  "paper": {
    "id": 1579,
    "title": "Portfolio design for home healthcare devices production using a new data-driven optimization methodology",
    "abstract": "Covid-19 pandemic left scars on different industries, and now that we are experiencing the post-pandemic situation, it is essential to plan our next moves. When it comes to home healthcare devices (HHDs), they can be useful in many aspects such as keeping the patients safe at the home. Nowadays, the world is experiencing the post-pandemic situation, then it is needed to adapt to new circumstances as it was done during the pandemic. One of the factors that has been impacted by the new situation is the demand for HHDs which had been increased tremendously during the pandemic. The current study aims to forecast the so-called demand by utilizing machine learning techniques to design a product portfolio considering the shortage cost by benefiting from the Bayesian Best-Worst method (BBWM). A mixed-integer non-linear mathematical model is proposed to reach this goal which designs a portfolio of devices and determines the number of needed machines to produce them. An HHD manufacturing factory has been considered as a real-life case study to approve the functionality of the proposed methodology. Several businesses that have experienced post-pandemic demand fluctuations may benefit from the findings of this study.",
    "year": 2023,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "75c4378ed249de34be9e4fc336d2aaa0",
    "relevant_keywords": [
      "machine learning"
    ],
    "stage1_timestamp": "2025-05-15T00:57:12.705359"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是利用机器学习和优化方法设计家庭医疗设备的产品组合，并预测需求，其核心应用领域是生产管理和供应链优化，而非金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是利用机器学习和优化方法设计家庭医疗设备的产品组合，并预测需求，其核心应用领域是生产管理和供应链优化，而非金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T14:23:00.267526"
}