{
  "paper": {
    "id": 3181,
    "title": "A Deep Learning-based Cryptocurrency Price Prediction Scheme for Financial Institutions",
    "abstract": "A cryptocurrency is a network-based digital exchange medium, where the records are secured using strong cryptographic algorithms such as Secure Hash Algorithm 2 (SHA-2) and Message Digest 5 (MD5). It uses blockchain technology to make the transactions secure, transparent, traceable, and immutable. Due to these properties, the cryptocurrencies have gained popularity in almost all the sectors especially in financial sectors. Though, cryptocurrencies are getting recognition form the approval bodies, but still, the uncertainty and dynamism in their prices risk the investments substantially. Cryptocurrency price prediction has become a trending research topic globally. Many machine learning and deep learning algorithms such as Gated Recurrent Unit (GRU), Neural Networks (NN), and Long short-term memory (LSTM) have been used by the researchers to predict and analyze the factors affecting the cryptocurrency prices. In this paper, a LSTM and GRU-based hybrid cryptocurrency prediction scheme is proposed, which focuses on only two cryptocurrencies, namely Litecoin and Monero. The results depict that the proposed scheme accurately predicts the prices with high accuracy, revealing that the scheme can be applicable in various cryptocurrencies price predictions.",
    "year": 2020,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "67bb9cd0a5710839a88af6c6ab53bcbb",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "neural network",
      "long short-term memory",
      "LSTM",
      "Gated Recurrent Unit",
      "GRU"
    ],
    "stage1_timestamp": "2025-05-15T02:23:33.517381"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究使用LSTM和GRU模型预测加密货币价格，虽然涉及金融领域，但并未明确指出其应用于衍生品定价、金融风险管理或投资组合管理等特定金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究使用LSTM和GRU模型预测加密货币价格，虽然涉及金融领域，但并未明确指出其应用于衍生品定价、金融风险管理或投资组合管理等特定金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:38:04.530805"
}