{
  "paper": {
    "id": 532,
    "title": "Predicting the Product Life Cycle of Songs on the Radio How Record Labels can Manage Product Portfolios and Prioritise Artists by Using Machine Learning Techniques",
    "abstract": "In terms of determining the success of a musical artist's song, there is a positive correlation of radio play success and music sales success. Therefore, being able to forecast the future plays of a song on the radio can serve as powerful risk management and product portfolio management tools for record labels and other stakeholders of a song. This research strives to predict the remaining product life cycle of a song on the radio after it has been played for one or two months. The best results were achieved using a k-d tree to calculate the songs the most similar to the test songs and use a Random Forest model to forecast radio plays. Accuracy of 82.78% and 83.44% was achieved for the two time periods, respectively. This explorative research leads to over 4500 test metrics to find the best combination of models and pre-processing techniques. Other algorithms tested were KNN, MLP, and CNN. The features only consist of daily radio plays and use no musical features.",
    "year": 2021,
    "source": "WOS",
    "area": "portfolio",
    "method": "deep learning",
    "cache_key": "99d3a053b3652c64a7cd1722148f6075",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "regression",
      "decision tree",
      "neural network",
      "deep learning",
      "convolutional neural network",
      "CNN"
    ],
    "stage1_timestamp": "2025-05-15T00:37:01.801123"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究使用机器学习技术预测歌曲在电台播放的生命周期，目的是帮助唱片公司管理产品组合和优先考虑艺术家。虽然提到了风险管理和产品组合管理，但这些概念是在音乐产业的背景下讨论的，而非金融领域。因此，论文的核心技术并未应用于指定的金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究使用机器学习技术预测歌曲在电台播放的生命周期，目的是帮助唱片公司管理产品组合和优先考虑艺术家。虽然提到了风险管理和产品组合管理，但这些概念是在音乐产业的背景下讨论的，而非金融领域。因此，论文的核心技术并未应用于指定的金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:34:35.508712"
}