{
  "paper": {
    "id": 3349,
    "title": "Changes in the market structure and risk management of Bitcoin and its forked coins",
    "abstract": "Inconsistency of consensus results in blockchain forks, which create a new financial risk. After filtering out Bitcoin's linear, nonlinear, and lag impacts on forked coins, this study employs a bottom-up hierarchical clustering algorithm to examine the logarithmic return series for Bitcoin and its 14 forked coins from 2018 to 2021. The results indicate that the market for forked coins can be divided into three clusters: SegWit-supported forked coins, mature forked coins, and the latest forked coins. Bitcoin and the mature forked coins form a cluster, and its performance is superior to others. Although Bitcoin's return significantly affects that of its forked coins, it does not affect the market structure. Furthermore, this study provides references for risk aversion among investors in forked coins and presents macro-level information for cryptocurrency market authorities.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "21fc9d22a9382bb064371e4f8a304aea",
    "relevant_keywords": [
      "unsupervised learning",
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T02:25:13.754212"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on analyzing the market structure and risk management of Bitcoin and its forked coins, providing insights for risk aversion among investors and information for cryptocurrency market authorities. This aligns with the domain of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on analyzing the market structure and risk management of Bitcoin and its forked coins, providing insights for risk aversion among investors and information for cryptocurrency market authorities. This aligns with the domain of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:36:51.401480"
}