{
  "paper": {
    "id": 1287,
    "title": "Hybrid system with genetic algorithm and artificial neural networks and its application to retail credit risk assessment",
    "abstract": "The databases of the banks around the world have accumulated large quantities of information about clients and their financial and payment history. These databases can be used for the credit risk assessment, but they are commonly high dimensional. Irrelevant features in a training dataset may produce less accurate results of classification analysis. Data preprocessing is required to prepare the data for classification to increase the predictive accuracy. Feature selection is a preprocessing technique commonly used on high dimensional data and its purposes include reducing dimensionality, removing irrelevant and redundant features, facilitating data understanding, reducing the amount of data needed for learning, improving predictive accuracy of algorithms, and increasing interpretability of models. In this paper we investigate the extent to which the total data, owned by a bank, can be a good basis for predicting the borrower's ability to repay the loan on time. We propose a feature selection technique for finding an optimum feature subset that enhances the classification accuracy of neural network classifiers. Experiments were conducted on the credit dataset collected at a Croatian bank to assess the accuracy of our technique. We found that the hybrid system with genetic algorithm is competitive and can be used as feature selection technique to discover the most significant features in determining risk of default. (C) 2012 Elsevier Ltd. All rights reserved.",
    "year": 2012,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "6b273a788258d003b517aabff63183d4",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "neural network",
      "feature learning",
      "feature representation"
    ],
    "stage1_timestamp": "2025-05-15T02:01:11.857266"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on credit risk assessment using a hybrid system with genetic algorithm and artificial neural networks to predict borrowers' ability to repay loans, which is a key aspect of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on credit risk assessment using a hybrid system with genetic algorithm and artificial neural networks to predict borrowers' ability to repay loans, which is a key aspect of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:50:31.037396"
}