{
  "paper": {
    "id": 2483,
    "title": "A data driven typology of electric vehicle user types and charging sessions",
    "abstract": "The understanding of charging behavior has been recognized as a crucial element in optimizing roll out of charging infrastructure. While current literature provides charging choices and categorizations of charging behavior, these seem oversimplified and limitedly based on charging data. In this research we provide a typology of charging behavior and electric vehicle user types based on 4.9 million charging transactions from January 2017 until March 2019 and 27,000 users on 7079 Charging Points the public level 2 charging infrastructure of 4 largest cities and metropolitan areas of the Netherlands. We overcome predefined stereotypical expectations of user behavior by using a bottom-up data driven two-step clustering approach that first clusters charging sessions and thereafter portfolios of charging sessions per user. From the first clustering (Gaussian Mixture) 13 distinct charging session types were found; 7 types of daytime charging sessions (4 short, 3 medium duration) and 6 types of overnight charging sessions. The second clustering (Partition Around Medoids) clustering result in 9 user types based on their distinct portfolio of charging session types. We found (i) 3 daytime office hours charging user types (ii) 3 overnight user types and (iii) 3 non-typical user types (mixed day and overnight chargers, visitors and car sharing). Three user types show significant peaks at larger battery sizes which affects the time between sessions. Results show that none of the user types display solely stereotypical behavior as the range of behaviors is more varied and more subtle. Analysis of population composition over time revealed that large battery users increase over time in the population. From this we expect that shifts charging portfolios will be observed in future, while the types of charging remain stable.",
    "year": 2020,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "4e351a956933839dffb55678e80a9957",
    "relevant_keywords": [
      "unsupervised learning",
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T01:07:03.118227"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究电动汽车用户的充电行为分类和用户类型划分，使用了无监督学习和聚类技术，但其应用场景是充电基础设施的优化，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究电动汽车用户的充电行为分类和用户类型划分，使用了无监督学习和聚类技术，但其应用场景是充电基础设施的优化，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:14:39.955360"
}