{
  "paper": {
    "id": 1707,
    "title": "Demonstrating Tactical Combat Casualty Care in Simulated Environments to Enable Passive, Autonomous Documentation: Protocol for a Prospective Simulation-Based Study",
    "abstract": "Background: The Telemedicine & Advanced Technology Research Center (TATRC) commenced a new research portfolio specifically addressing Autonomous Casualty Care (AC2) in 2023. The first project within this portfolio addresses the current and historical challenges of capturing tactical combat casualty care (TCCC) data in operational settings. Objective: The initial autonomous casualty care effort, the Passive Data Collection using Autonomous Documentation research project, conducts systematic, simulated patient and casualty care scenarios, leveraging suites of passive sensor inputs to populate a data repository that will automate future combat care. Methods: To obtain the required datasets, TATRC will engage care provider participants who provided consent in one of 6 randomized simulated TCCC scenarios leveraging an institutional review board-approved office protocol (#M-11057). These simulations will leverage mannikins (low and high fidelity) and live simulated patients (eg, human actors who provided consent). All consenting participants (eg, both the care providers and live simulated patients) will be equipped with suites of sensors that will passively collect data on care delivery actions and patient physiology. Simulated data is being collected at Fort Detrick, Results: Across all research locations, TATRC will collect and annotate approximately 2500 simulation procedures tasks by March 2025. These study data will generate the first machine learning and artificial intelligence algorithms to populate Department of Defense (DD) Form 1380 fields accurately and reliably. Additional data collected past March 2025 will be used to continue to refine and mature the algorithm. Conclusions: The military health care system (MHS) lacks real-world datasets for TCCC care at the point of injury. Developing a data repository of simulated TCCC data is required as an essential step toward automating TCCC care. If TATRC's research efforts result in the ability to automate care delivery documentation, this will alleviate the cognitive burden of TCCC care providers in austere, chaotic environments. By generating a TCCC data repository through this Autonomous Documentation research project, TATRC will have opportunities to leverage this research data to create machine learning and artificial intelligence models to advance passive, automated medical documentation across the health care continuum. International Registered Report Identifier (IRRID): DERR1-10.2196/67673",
    "year": 2025,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "d7a254b4f7fc7a8f3cdffa28faaabc40",
    "relevant_keywords": [
      "machine learning",
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T00:58:50.610564"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究在模拟环境中使用被动传感器和机器学习来自动记录战术战斗伤员护理数据，其应用领域是军事医疗保健，与金融领域无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究在模拟环境中使用被动传感器和机器学习来自动记录战术战斗伤员护理数据，其应用领域是军事医疗保健，与金融领域无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:19:14.838509"
}