{
  "paper": {
    "id": 1965,
    "title": "Systemic risk assessment through high order clustering coefficient",
    "abstract": "In this article we propose a novel measure of systemic risk in the context of financial networks. To this aim, we provide a definition of systemic risk which is based on the structure, developed at different levels, of clustered neighbours around the nodes of the network. The proposed measure incorporates the generalized concept of clustering coefficient of order l of a node i introduced in Cerqueti et al. (2018). Its properties are also explored in terms of systemic risk assessment. Empirical experiments on the time-varying global banking network show the effectiveness of the presented systemic risk measure and provide insights on how systemic risk has changed over the last years, also in the light of the recent financial crisis and the subsequent more stringent regulation for globally systemically important banks.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "58aaee3a9bfe1789ef29670829ca20eb",
    "relevant_keywords": [
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T02:09:48.255901"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on proposing a novel measure of systemic risk in financial networks, which is a key aspect of financial risk management. The empirical experiments on the time-varying global banking network further confirm its application in assessing and managing systemic risk.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on proposing a novel measure of systemic risk in financial networks, which is a key aspect of financial risk management. The empirical experiments on the time-varying global banking network further confirm its application in assessing and managing systemic risk.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:45:09.648384"
}