{
  "paper": {
    "id": 4354,
    "title": "Network analysis of a financial market based on genuine correlation and threshold method",
    "abstract": "A financial market is an example of an adaptive complex network consisting of many interacting units. This network reflects market's behavior. In this paper, we use Random Matrix Theory (RMT) notion for specifying the largest eigenvector of correlation matrix as the market mode of stock network. For a better risk management, we clean the correlation matrix by removing the market mode from data and then construct this matrix based on the residuals. We show that this technique has an important effect on correlation coefficient distribution by applying it for Dow Jones Industrial Average (DJIA). To study the topological structure of a network we apply the removing market mode technique and the threshold method to Tehran Stock Exchange (TSE) as an example. We show that this network follows a power-law model in certain intervals. We also show the behavior of clustering coefficients and component numbers of this network for different thresholds. These outputs are useful for both theoretical and practical purposes such as asset allocation and risk management. (C) 2011 Elsevier B.V. All rights reserved.",
    "year": 2011,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "e5f9c3be2318ecf281c3b7d2d6831223",
    "relevant_keywords": [
      "clustering",
      "principal components analysis"
    ],
    "stage1_timestamp": "2025-05-15T02:36:05.254491"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk",
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是通过随机矩阵理论和阈值方法来分析金融市场的网络结构，并特别提到了这些技术在风险管理和资产配置中的应用。论文明确指出了这些方法对于风险管理的改进作用，并且提到了资产分配这一投资组合管理的关键方面。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\", \"Portfolio Management\"],\n  \"justification\": \"该论文的核心技术是通过随机矩阵理论和阈值方法来分析金融市场的网络结构，并特别提到了这些技术在风险管理和资产配置中的应用。论文明确指出了这些方法对于风险管理的改进作用，并且提到了资产分配这一投资组合管理的关键方面。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:33:20.574230"
}