{
  "paper": {
    "id": 347,
    "title": "An empirical study on credit risk management: the case of nonbanking financial companies",
    "abstract": "The existing banking structure in India is very rich and serves its customers and borrowers very efficiently and effectively to meet their respective requirements and expectations. The main function of both banking and nonbanking financial institutions is to provide loans to their clients. We build a risk assessment model to rate the risk associated with the credit exposure on a probability scale and consequently to map probability to score bands for nonbank financial company (NBFC) customers. Our aim is to predict future default behaviors of NBFC customers using credit scores. The Pearson chi-squared test is used to study the association between two categorical variables. Logistical regression, neural network and decision tree models are developed and compared in order to find the best fit. For model comparison we use Kolmogorov-Smirnov, the receiver operator characteristic index, average square error and Gini statistics. The score card is used to check the creditworthiness of each customer. This research should provide key determinants of defaulters for the NBFC sector.",
    "year": 2018,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "f54d47df86da73acf772f13ec6e76d63",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "regression",
      "decision tree",
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T01:49:41.078678"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on building a risk assessment model to predict future default behaviors of nonbank financial company (NBFC) customers using credit scores, which is a core aspect of financial risk management, specifically credit risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on building a risk assessment model to predict future default behaviors of nonbank financial company (NBFC) customers using credit scores, which is a core aspect of financial risk management, specifically credit risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:59:01.216150"
}