{
  "paper": {
    "id": 8710,
    "title": "Development of a prediction model for child maltreatment recurrence in Japan: A historical cohort study using data from a Child Guidance Center",
    "abstract": "To develop a prediction model for the first recurrence of child maltreatment within the first year after the initial report, we carried out a historical cohort study using administrative data from 716 incident cases of child maltreatment (physical abuse, psychological abuse, or neglect) not receiving support services, reported between April 1, 1996 through March 31, 2011 to Shiga Central Child Guidance Center, Japan. In total, 23 items related to characteristics of the child, the maltreatment, the offender, household, and other related factors were selected as predictive variables and analyzed by multivariate logistic regression model for association with first recurrence of maltreatment. According to the stepwise selection procedure six factors were identified that include 9-13 year age of child (AOR =3.43/95%CI = 1.52-7.72), <40 year age of the offender (AOR= 1.65/95%CI = 1.09-2.51), offender's history of maltreatment during childhood (AOR = 2.56/95%Cl = 1.31-4.99), household financial instability or poverty (AOR= 1.64/95%Cl =1.10-2.45), absence of someone in the community who could watch over the child (AOR= 1.68/95%Cl = 1.16-2.44), and the organization as the referral source (AOR = 2.21/95%CI = 1.24-3.93). Using these six predictors, we generated a linear prediction model with a sensitivity and specificity of 45.2% and 82.4%, respectively. The model may be useful to assess the risk of further maltreatment and help the child and family welfare administrations to develop preventive strategies for recurrence. (C) 2016 The Author(s). Published by Elsevier Ltd.",
    "year": 2016,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "640c86118586982838d187f0f9f17bfd",
    "relevant_keywords": [
      "classification",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T03:21:24.748752"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究儿童虐待复发的预测模型，属于社会工作和儿童福利领域，与金融研究领域无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究儿童虐待复发的预测模型，属于社会工作和儿童福利领域，与金融研究领域无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:25:35.534541"
}