{
  "paper": {
    "id": 2451,
    "title": "Impulsivity, trauma history, and interoceptive awareness contribute to completion of a criminal diversion substance use treatment program for women",
    "abstract": "Introduction In the US, women are one of the fastest-growing segments of the prison population and more than a quarter of women in state prison are incarcerated for drug offenses. Substance use criminal diversion programs can be effective. It may be beneficial to identify individuals who are most likely to complete the program versus terminate early as this can provide information regarding who may need additional or unique programming to improve the likelihood of successful program completion. Prior research investigating prediction of success in these programs has primarily focused on demographic factors in male samples. Methods The current study used machine learning (ML) to examine other non-demographic factors related to the likelihood of completing a substance use criminal diversion program for women. A total of 179 women who were enrolled in a criminal diversion program consented and completed neuropsychological, self-report symptom measures, criminal history and demographic surveys at baseline. Model one entered 145 variables into a machine learning (ML) ensemble model, using repeated, nested cross-validation, predicting subsequent graduation versus termination from the program. An identical ML analysis was conducted for model two, in which 34 variables were entered, including the Women's Risk/Needs Assessment (WRNA). Results ML models were unable to predict graduation at an individual level better than chance (AUC = 0.59 [SE = 0.08] and 0.54 [SE = 0.13]). Post-hoc analyses indicated measures of impulsivity, trauma history, interoceptive awareness, employment/financial risk, housing safety, antisocial friends, anger/hostility, and WRNA total score and risk scores exhibited medium to large effect sizes in predicting treatment completion (p < 0.05; ds = 0.29 to 0.81). Discussion Results point towards the complexity involved in attempting to predict treatment completion at the individual level but also provide potential targets to inform future research aiming to reduce recidivism.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "519d84929f457a8c093e551121aa9cab",
    "relevant_keywords": [
      "machine learning",
      "classification"
    ],
    "stage1_timestamp": "2025-05-15T02:15:27.086060"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究使用机器学习预测女性完成药物滥用刑事分流治疗项目的可能性，研究内容涉及心理学、犯罪学和公共卫生领域，与金融研究领域无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究使用机器学习预测女性完成药物滥用刑事分流治疗项目的可能性，研究内容涉及心理学、犯罪学和公共卫生领域，与金融研究领域无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:42:27.172019"
}