{
  "paper": {
    "id": 9082,
    "title": "DEEP Study: Indirect and Out-of-pocket Costs of Persistent Orofacial Pain",
    "abstract": "Persistent orofacial pain (POFP) is common and caused by a group of conditions affecting the face, head, or mouth. Recent research highlighted a problematic care pathway with high costs to the health care provider, but the financial impact on patients and employers is not understood. This study aimed to describe patient (out-of-pocket) and employer (indirect) costs of POFP and to identify whether the dichotomized Graded Chronic Pain Scale (GCPS) was predictive of costs. A cohort of 198 patients was recruited from primary and secondary care settings in North East England and followed over a 24-mo period. Patients completed the GCPS and Use of Services and Productivity Questionnaire every 6 mo and a Time and Travel Questionnaire at 14 mo. Questionnaires examined the implications of health care utilization on patients' everyday lives and personal finances. Time and travel costs were calculated and applied to use-of-services data to estimate out-of-pocket costs, while the human capital method and QQ method (quantity and quality of work completed) were used to estimate absenteeism and presenteeism costs, respectively. Per person per 6-mo period (in 2017 pounds sterling), mean out-of-pocket costs were 333 pound (95% CI, 289 pound to 377) pound, and indirect costs were 1,242 pound (95% CI, 1,014 pound to 1,470) pound. Regression analyses indicated that over 6 mo, the GCPS was predictive of the following: out-of-pocket costsa difference of 311 pound between low and high GCPS per person per 6-mo period (95% CI, 280 pound to 342; pound P < 0.01, n = 705 observations over 24 mo); indirect costsa difference of 2,312 pound between low and high GCPS per person per 6-mo period (95% CI, 1,886 pound to 2,737; pound P < 0.01; n = 352 observations over 24 mo). This analysis highlights hidden costs of POFP and supports the use of the dichotomized GCPS to identify patients at risk of higher impact and associated costs and thereby stratify care pathways and occupational health support appropriately.",
    "year": 2018,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "8cb966f7197bc3c07b635e3759020456",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T03:25:27.701909"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究持续性口面部疼痛对患者和雇主的经济影响，涉及医疗费用和间接成本的计算，但并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究持续性口面部疼痛对患者和雇主的经济影响，涉及医疗费用和间接成本的计算，但并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:25:12.718595"
}