{
  "paper": {
    "id": 322,
    "title": "An Attribute Selection Based Classifier to Predict Financial Distress",
    "abstract": "Financial distress prediction (FDP) has become increasingly essential in resolving corporate financial risk management during the past decade. Most of the previous research in this field tried to treat bankruptcy predictions and financial problems by using traditional bankruptcy prediction models or Artificial Intelligence (AI) technologies. Financial distress information is likely to affect investors' decision, and investor will make a wrong decision if he excessively depends on the viewpoint of financial analysts or his personal subjective estimation. This study thus attempts to construct a new and objective model of FDP. This model also aims to provide a reference for enterprises to conduct risk assessment of financial condition and provide advance on investment directions. In proposed model, six attribute selections which can reduce variables as follows: (1) ChiSquared, (2) Filtered, (3) GainRatio, (4) InfoGain, (5) ReliefF, (6) SymmetricalUncertainty. Furthermore, five classification methods are utilized to identify financial distress in this paper: (1) Decision tree C4.5, (2) IBK, (3) SVM, (4) RandomForest, (5) RBFNetwork. The experimental data is collected by Taiwan Economic Journal Corporation (TEJ). Experimental result shows that the ReliefF attribute method has a better ability in six attribute selection methods, and tree C4.5 based on 90: 10 partition data is the best classification method in accuracy.",
    "year": 2016,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "940dece71051ab7491eed51d91fff17d",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T01:49:40.970844"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是构建一个用于预测财务困境的模型，旨在帮助企业进行财务状况的风险评估，这直接属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是构建一个用于预测财务困境的模型，旨在帮助企业进行财务状况的风险评估，这直接属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:59:04.658004"
}