{
  "paper": {
    "id": 1827,
    "title": "Provisioning Robust and Interpretable AI/ML-based Service Bundles",
    "abstract": "Coalition operations environments are characterised by the need to share intelligence, surveillance and reconnaissance services. Increasingly, such services are based on artificial intelligence (AI) and machine learning (ML) technologies. Two key issues in the exploitation of AI/ML services are robustness and interpretability. Employing a diverse portfolio of services can make a system robust to 'unknown unknowns'. Interpretability - the need for services to offer explanation facilities to engender user trust - can be addressed by a variety of methods to generate either transparent or post hoc explanations according to users' requirements. This paper shows how a service-provisioning framework for coalition operations can be extended to address specific requirements for robustness and interpretability, allowing automatic selection of service bundles for intelligence, surveillance and reconnaissance tasks. The approach is demonstrated in a case study on traffic monitoring featuring a diverse set of AI/ML services based on deep neural networks and heuristic reasoning approaches.",
    "year": 2018,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "76e57ce041c4868193756a406e7482bf",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "neural network",
      "deep neural networks",
      "interpretability"
    ],
    "stage1_timestamp": "2025-05-15T00:59:53.284637"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要讨论的是在联盟作战环境中如何提供鲁棒和可解释的AI/ML服务捆绑，应用于情报、监视和侦察任务，特别是交通监控案例。虽然涉及机器学习和深度神经网络等技术，但并未提及任何与衍生品定价、金融风险管理或投资组合管理相关的应用场景或研究目标。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要讨论的是在联盟作战环境中如何提供鲁棒和可解释的AI/ML服务捆绑，应用于情报、监视和侦察任务，特别是交通监控案例。虽然涉及机器学习和深度神经网络等技术，但并未提及任何与衍生品定价、金融风险管理或投资组合管理相关的应用场景或研究目标。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:18:44.636690"
}