{
  "paper": {
    "id": 285,
    "title": "RETRACTED: Sublinear Expectation Nonlinear Regression for the Financial Risk Measurement and Management (Retracted Article)",
    "abstract": "Financial risk is objective in modern financial activity. Management and measurement of the financial risks have become key abilities for financial institutions in competition and also make the major content in finance engineering and modern financial theories. It is important and necessary to model and forecast financial risk. We know that nonlinear expectation, including sublinear expectation as its special case, is a new and original framework of probability theory and has potential applications in some scientific fields, specially in finance risk measure and management. Under the nonlinear expectation framework, however, the related statistical models and statistical inferences have not yet been well established. In this paper, a sublinear expectation nonlinear regression is defined, and its identifiability is obtained. Several parameter estimations and model predictions are suggested, and the asymptotic normality of the estimation and the mini-max property of the prediction are obtained. Finally, simulation study and real data analysis are carried out to illustrate the new model and methods. In this paper, the notions and methodological developments are nonclassical and original, and the proposed modeling and inference methods establish the foundations for nonlinear expectation statistics.",
    "year": 2013,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "c7a7076d8fa3a0a1a613fd5cd7a4f412",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:49:04.584901"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on the modeling and forecasting of financial risks using sublinear expectation nonlinear regression, which is directly related to financial risk measurement and management, as stated in the title and abstract.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on the modeling and forecasting of financial risks using sublinear expectation nonlinear regression, which is directly related to financial risk measurement and management, as stated in the title and abstract.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:59:28.892011"
}