{
  "paper": {
    "id": 4755,
    "title": "Detecting label adopters in double materiality application: a machine learning approach",
    "abstract": "PurposeThis paper aims to detect the use of label adoption practices by early adopters of double materiality reporting.Design/methodology/approachA gradient boosting machine was used to analyse variables related to financial performance, corporate governance, sustainability reports and control variables of 162 European companies listed on the Dow Jones Sustainability Index (DJSI), which claim to apply double materiality reporting.FindingsThe model achieved an overall accuracy of 81.8%, correctly detecting label adopters at 78.6% and committed adopters at 84.2%. These results demonstrate the high accuracy of the model in distinguishing between label and committed adopters, reducing the risk of type I and II errors.Research limitations/implicationsThis study is limited to large DJSI companies in Europe that explicitly state the use of double materiality in their sustainability reports. The results may differ if companies of various sizes or in different regions were analysed.Practical implicationsThe results highlight challenges for regulators in identifying companies falsely claiming compliance with double materiality reporting in their sustainability reports. Furthermore, this research has implications for assurers, who are responsible for endorsing the provision of sustainability information and may be assisted in this task by the use of detecting tools. Additionally, capital providers can use these tools to ensure companies genuinely implement sustainability practices, not just adopt labels.Originality/valueThis research integrates empirical evidence with the use of machine learning techniques to offer fresh insights into the phenomenon of greenwashing, focusing specifically on the early adoption of the double materiality principle.",
    "year": 2025,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "cfd11179d12d29790dab4e44da73ac40",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "gradient boosting"
    ],
    "stage1_timestamp": "2025-05-15T02:40:27.999679"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究使用机器学习技术检测公司在可持续发展报告中的标签采用行为，虽然涉及金融绩效和公司治理，但其核心应用并不直接属于衍生品定价、金融风险管理或投资组合管理中的任何一个领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究使用机器学习技术检测公司在可持续发展报告中的标签采用行为，虽然涉及金融绩效和公司治理，但其核心应用并不直接属于衍生品定价、金融风险管理或投资组合管理中的任何一个领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:31:57.813350"
}