{
  "paper": {
    "id": 9077,
    "title": "PREDICTING HOSPITAL CHARGE AND LENGTH OF STAY FOR CONGENITAL HEART-DISEASE SURGERY",
    "abstract": "Three hundred twenty-two consecutive operations between December 1985 and December 1989 for 10 types of low-risk congenital cardiac malformations were reviewed to determine the hospital charge and postoperative length of stay. Multiple regression analysis of variance was used to predict the influence of the primary diagnosis and various preoperative parameters. The average hospital charge was $27,262 +/- $20,644 and the postoperative length of stay was 9.3 +/- 8.3 days Age at operation alone did not influence the dependent variables. The diagnosis of atrial septal defect (p = 0.002) or coarctation of the aorta (p = 0.002) decreased the mean charge, whereas the 8 other primary diagnoses did not significantly influence the mean charge. Other preoperative factors found to be predictive of increased hospital charge were: the date of operation (p <0.001) cyanosis (p = 0.008), previous thoracic surgery (p = 0.02), failure to thrive (p <0.001), associated major extra cardiac anomalies (p <0.001), oxygen requirement (p = 0.02), and distance >100 miles from home to hospital (p = 0.05). A primary diagnosis of atrial septal defect decreased the mean postoperative length of stay by 3.1 days (p <0.001). Other preoperative conditions increased the mean postoperative length of stay: major extracardiac malformation (p <0.001), failure to thrive (p <0.001), and oxygen requirement (p = 0.003). Charge and length of stay equations were generated which may assist in the prediction of resource utilization in this patient population. These data should not limit the trend to repair cardiac malformations at an earlier age since age at operation alone, considered as part of a multivariate model, did not influence hospital charge or length of stay. Provision of the financial support to repair common cardiac malformations in children is sound economic policy because a lifetime of productivity can be expected for the majority of these children.",
    "year": 1993,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "059ad2d640a008ee94792c5b43d0f211",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T03:25:27.671584"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是医院收费和住院时间的预测，属于医疗健康领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是医院收费和住院时间的预测，属于医疗健康领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:25:12.765455"
}