{
  "paper": {
    "id": 3414,
    "title": "Digital financial inclusion and household financial vulnerability: An empirical analysis of rural and urban disparities in China",
    "abstract": "In recent times, a notable increase in the leverage ratios among numerous households across China has been witnessed, culminating in heightened household financial vulnerability. Concurrently, the sphere of digital inclusive finance has witnessed rapid advancement, establishing itself as a crucial mechanism for Chinese households to counteract financial risk shocks. This research article meticulously constructs an ordered regression model, anchored in microlevel data from household surveys, to delve into the influence and operative mechanisms of digital inclusive finance on the vulnerability of household finances. Empirical findings from this study robustly indicate that the evolution of digital inclusive finance significantly mitigates the household financial vulnerability. A thorough mechanism analysis reveals that digital inclusive finance primarily curtails household financial vulnerability through several avenues: it notably enhances financial literacy, augments the income derived from household financial assets, and elevates contributions to commercial insurance. Intriguingly, a heterogeneity analysis underscores that the impact of digital inclusive finance is more pronounced in reducing financial vulnerability amongst households registered in rural areas and those with lower income levels. This article contributes to the expansion of the theoretical framework concerning household financial vulnerability, offering insightful guidance and policy implications for addressing financial vulnerability concerns and forestalling macro-financial risks.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "0522d02a090d3bc8515aa0572a758db5",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:26:09.112904"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究数字普惠金融对家庭财务脆弱性的影响，虽然涉及金融风险，但其核心研究并不直接涉及衍生品定价、金融风险管理或投资组合管理等特定金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究数字普惠金融对家庭财务脆弱性的影响，虽然涉及金融风险，但其核心研究并不直接涉及衍生品定价、金融风险管理或投资组合管理等特定金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:36:49.574508"
}