{
  "paper": {
    "id": 3608,
    "title": "A Quantitative Risk Framework for DER-rich Power System Planning and Decision Making",
    "abstract": "The increased penetration of Distributed Energy Resources (DERs) within power networks is bringing challenges, an important one being the potential voltage excursions within the system that must be mitigated, as voltage must be maintained within statutory range at all times and at any node of the system by regulation. This paper proposes a scalable framework based on machine learning techniques (ML) to assess voltage excursion risks node by node and derive the related marginal probabilities in response to any net-loads under various DER penetration scenarios. The framework is then used to quantify the resulting financial impact of voltage excursion in large-scale networks. Therefore, this novel end-to-end risk framework supports decision making in the planning phase of networks in response to any intermittent DER penetration scenario. We show through simulations that the framework is both scalable to high-dimensional systems and efficient to handle vast number of scenarios. In our simulations, the use of ML technique enables to lower the computing time by a factor of 800 compared to load flow solving, while maintaining an accuracy >= 95%, enabling the assessment of vast number of scenarios. Copyright (C) 2020 The Authors.",
    "year": 2020,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "dd2e78c36df4ffc8699549f9e2c8a000",
    "relevant_keywords": [
      "machine learning"
    ],
    "stage1_timestamp": "2025-05-15T02:27:54.128491"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究分布式能源资源（DERs）在电力系统中的电压偏移风险及其财务影响，虽然涉及风险评估和财务量化，但其核心应用场景是电力系统规划和决策，而非金融研究领域中的衍生品定价、金融风险管理或投资组合管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究分布式能源资源（DERs）在电力系统中的电压偏移风险及其财务影响，虽然涉及风险评估和财务量化，但其核心应用场景是电力系统规划和决策，而非金融研究领域中的衍生品定价、金融风险管理或投资组合管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:35:58.659753"
}