{
  "paper": {
    "id": 3129,
    "title": "Bayesian Value-at-Risk with product partition models",
    "abstract": "In this paper we propose a novel Bayesian methodology for Value-at-Risk computation based on parametric Product Partition Models. Value-at-Risk is a standard tool for measuring and controlling the market risk of an asset or portfolio, and is also required for regulatory purposes. Its popularity is partly due to the fact that it is an easily understood measure of risk. The use of Product Partition Models allows us to remain in a Normal setting even in the presence of outlying points, and to obtain a closed-form expression for Value-at-Risk computation. We present and compare two different scenarios: a product partition structure on the vector of means and a product partition structure on the vector of variances. We apply our methodology to an Italian stock market data set from Mib30. The numerical results clearly show that Product Partition Models can be successfully exploited in order to quantify market risk exposure. The obtained Value-at-Risk estimates are in full agreement with Maximum Likelihood approaches, but our methodology provides richer information about the clustering structure of the data and the presence of outlying points.",
    "year": 2012,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "773e669a9d75f3894f067f75a60f2901",
    "relevant_keywords": [
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T01:13:45.278725"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文提出了一种基于贝叶斯方法的新颖Value-at-Risk计算方法，Value-at-Risk是衡量和控制资产或投资组合市场风险的标准工具，属于金融风险管理的核心内容。论文的研究目标和应用场景明确指向风险管理领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文提出了一种基于贝叶斯方法的新颖Value-at-Risk计算方法，Value-at-Risk是衡量和控制资产或投资组合市场风险的标准工具，属于金融风险管理的核心内容。论文的研究目标和应用场景明确指向风险管理领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:11:27.973461"
}