{
  "paper": {
    "id": 953,
    "title": "ROLE OF E-BUSINESS IN THE PERCEPTION OF ICT IMPACT ON REVENUE GROWTH",
    "abstract": "Perceived gain from the use of e-business information and communication technologies (ICT) represents the main driver that motivates companies to implement them. The study focuses on the perception of e-business ICT applications within companies. On the sample of 11,072 companies from 27 EU states, we have determined which of e-business ICT application the companies use and how they perceive the impact of ICT on their revenue growth. An ordinal regression and decision tree analysis have been used to identify a portfolio of e-business ICT applications. We have also proposed three hypotheses to test whether the perceived impact of ICT is influenced by the number of implemented e-business ICT applications, or by the number of procurement-orientated e- business ICT applications, or even by the number of sales-orientated ones. The research not only helps practitioners to recognize which tools are behind the positive perception regarding the impact of ICT on revenue growth, but it tries to answer the question of whether the quantity of implemented applications really improves the acknowledged influence of ICT on revenue growth.",
    "year": 2015,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "c8de7ffbf6e703b6ac121aa84dc2e21c",
    "relevant_keywords": [
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T00:50:08.696925"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究电子商务信息通信技术（ICT）对公司收入增长的影响，以及公司对这些技术的感知。虽然使用了决策树分析，但其应用场景是电子商务和公司收入增长，而非衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究电子商务信息通信技术（ICT）对公司收入增长的影响，以及公司对这些技术的感知。虽然使用了决策树分析，但其应用场景是电子商务和公司收入增长，而非衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:25:52.139386"
}