{
  "paper": {
    "id": 1726,
    "title": "Predicting Financial Risk Associated to Bitcoin Investment by Deep Learning",
    "abstract": "The financial risk of investing in Bitcoin is increasing, and everyone participating in the transaction is aware of it. The rise and fall of bitcoin's value is difficult to predict, and the system is fraught with uncertainty. As a result, this study proposed to use the Deep learning technique for predicting fi-nancial risk associated with bitcoin investment, that is linked to its weighted price on the bitcoin market's volatility. The dataset used included Bitcoin historical data, which was acquired at one-minute intervals from selected exchanges of January 2012 through December 2020. The deep learning lin-ear-SVM-based technique was used to obtain an advantage in handling the high-dimensional challenges related with bitcoin-based transaction transac-tions large data volume. Four variables (High, Low, Close, and Volume (BTC).) are conceptualized to predict weighted price, in order to indicate if there is a propensity of financial risk over the effect of their interaction. The results of the experimental investigation show that the financial risk associated with bitcoin investing is accurately predicted. This has helped to discover engagements and disengagements with doubts linked with bitcoin investment transactions, resulting in increased confidence and trust in the system as well as the elimination of financial risk. Our model had a significantly greater prediction accuracy, demonstrating the utility of deep learning systems in detecting financial problems related to digital currency.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "52b0434328492156336d762bbc74a53e",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "support vector machine",
      "SVM",
      "deep learning",
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T02:06:52.670629"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on using deep learning techniques to predict financial risk associated with Bitcoin investment, specifically addressing market volatility and uncertainty. This directly aligns with the domain of financial risk management, as it aims to identify and mitigate potential financial risks in cryptocurrency investments.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on using deep learning techniques to predict financial risk associated with Bitcoin investment, specifically addressing market volatility and uncertainty. This directly aligns with the domain of financial risk management, as it aims to identify and mitigate potential financial risks in cryptocurrency investments.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:46:56.879527"
}