{
  "paper": {
    "id": 974,
    "title": "Globally Explainable AutoML Evolved Models of Corporate Credit Risk",
    "abstract": "Corporate credit ratings are one of the most relevant financial indicators in credit risk analysis. These are generated by different rating agencies which base their methodologies on the use of various financial variables of each company and the experience of their analysts; their impact on the market is of such importance that their mismanagement can trigger major financial crises such as the one that occurred in 2008. Along with this, the great importance of internal models for calculating credit risk and international regulations and agreements seek to have a level of explainability of the methods used to perform this risk management. This paper proposes the use of Automatic Machine Learning (AutoML) as a tool for the generation of a machine learning model that performs a prediction of corporate credit ratings using data from balance sheets, financial statements, and descriptive information about the company. The main contribution of this work lies in the development of the level of interpretability of each model as a second goal to be optimized with a global measure of explainability, allowing the generation of models that can better explain their results.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "f81747fe115486eb131980971a265a2a",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "feature representation",
      "neural network",
      "deep learning",
      "representation learning"
    ],
    "stage1_timestamp": "2025-05-15T01:57:29.823114"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on using AutoML to predict corporate credit ratings, which is a key aspect of credit risk analysis in financial risk management. The study aims to improve the explainability of models used for credit risk prediction, aligning with the goals of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on using AutoML to predict corporate credit ratings, which is a key aspect of credit risk analysis in financial risk management. The study aims to improve the explainability of models used for credit risk prediction, aligning with the goals of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:53:04.806781"
}