{
  "paper": {
    "id": 5964,
    "title": "Estimating loss given default based on time of default",
    "abstract": "The Basel II capital structure requires a minimum capital to cover the exposures of credit, market, and operational risks in banks. The Basel Committee gives three methodologies to estimate the required capital; standardized approach, Internal Ratings-Based (IRB) approach, and Advanced IRB approach. The IRB approach is typically favored contrasted with the standard approach because of its higher accuracy and lower capital charges. The loss given default (LGD) is a key parameter in credit risk management. The models are fit to a sample data of credit portfolio obtained from a bank in Jordan for the period of January 2010 until December 2014. The best parametric models are selected using several goodness-of-fit criteria. The results show that LGD fitted with Gamma distribution. After that, the financial variables as a covariate that affect on two parameters in Gamma regression will find.",
    "year": 2020,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "d4951a0c9f47d5e22beacaa49440170f",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:53:33.333762"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on estimating loss given default (LGD), which is a key parameter in credit risk management, and discusses methodologies aligned with Basel II capital structure requirements. This directly pertains to financial risk management, specifically credit risk assessment and mitigation.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on estimating loss given default (LGD), which is a key parameter in credit risk management, and discusses methodologies aligned with Basel II capital structure requirements. This directly pertains to financial risk management, specifically credit risk assessment and mitigation.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:28:56.623489"
}