{
  "paper": {
    "id": 1266,
    "title": "Forecasting stock market volatility with various geopolitical risks categories: New evidence from machine learning models",
    "abstract": "This paper investigates how geopolitical risks influence the prediction performance on the US stock market volatility with machine learning models. Further, it compares the predictive performance of individual and combination forecast methods. With SHAP algorithm, it could identify which factor has a great impact and fully extract the information of geopolitical risks in predicting. Empirical results show that military build-ups and escalation of war have great importance on predicting realized volatility among various geopolitical risks. The research further emphasizes the superior performance of machine learning and forecast combination methods, especially SVR method and trimmed mean combination. In addition, by allocating portfolio according to the machine learning-based volatility forecasts, particularly elastic net and random forest, a mean-variance investor can achieve sizeable financial benefits. Our paper provides substantial implications for political risk management and volatility forecasting.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "cda65b10023149a239503a3ea2c3a523",
    "relevant_keywords": [
      "machine learning",
      "support vector machine",
      "SVM",
      "decision tree",
      "neural network",
      "deep learning",
      "random forest"
    ],
    "stage1_timestamp": "2025-05-15T02:01:11.792583"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk",
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是使用机器学习模型预测股票市场波动性，这直接关联到金融风险管理。此外，论文还提到根据波动性预测进行投资组合分配，这属于投资组合管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\", \"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是使用机器学习模型预测股票市场波动性，这直接关联到金融风险管理。此外，论文还提到根据波动性预测进行投资组合分配，这属于投资组合管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:50:32.878573"
}