{
  "paper": {
    "id": 1171,
    "title": "Optimal Enterprise Risk Management and Decision Making With Shared and Dependent Risks",
    "abstract": "Dynamic enterprise risk management (ERM) entails holistic decision making for critical corporate functions such as capital budgeting and risk management. The interplay across business divisions, however, is complicated due to their natural interactions through risk exposures that are shared and dependent across an intricate corporate structure. This article develops an integrated optimization framework via a copula-based decision tree interface to facilitate ERM decision making to meet the specified enterprise goal in a multiperiod setting. We illustrate our model and provide managerial insights with a case study for a financial services company engaged in both banking and insurance businesses.",
    "year": 2017,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "f0bc9f51c5e6d84028e5800f8db332b5",
    "relevant_keywords": [
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T01:59:56.252018"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on developing an optimization framework for enterprise risk management (ERM) in a multiperiod setting, specifically addressing shared and dependent risks across business divisions. This directly pertains to the field of financial risk management, as it involves holistic decision-making for corporate risk management functions.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on developing an optimization framework for enterprise risk management (ERM) in a multiperiod setting, specifically addressing shared and dependent risks across business divisions. This directly pertains to the field of financial risk management, as it involves holistic decision-making for corporate risk management functions.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:51:38.583930"
}