{
  "paper": {
    "id": 1700,
    "title": "Portfolio diversification with varying investor abilities",
    "abstract": "We introduce new mathematical methods to study the optimal portfolio size of investment portfolios over time, considering investors with varying skill levels. First, we explore the benefit of portfolio diversification on an annual basis for poor, average and strong investors defined by the 10th, 50th and 90th percentiles of risk -adjusted returns, respectively. Second, we conduct a thorough regression experiment examining quantiles of risk -adjusted returns as a function of portfolio size across investor ability, testing for trends and curvature within these functions. Finally, we study the optimal portfolio size for poor, average and strong investors in a continuously temporal manner using more than 20 years of data. We show that strong investors should hold concentrated portfolios, poor investors should hold diversified portfolios; average investors have a less obvious distribution with the optimal number varying materially over time.",
    "year": 2024,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "dd8e68bd4361a1317ddc53f6a59443c5",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T00:58:50.590931"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "The paper focuses on studying the optimal portfolio size for investors with varying skill levels, which is a core topic in portfolio management. It discusses diversification benefits and optimal portfolio distribution over time, directly addressing portfolio management strategies.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Portfolio Management\"],\n  \"justification\": \"The paper focuses on studying the optimal portfolio size for investors with varying skill levels, which is a core topic in portfolio management. It discusses diversification benefits and optimal portfolio distribution over time, directly addressing portfolio management strategies.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:19:15.502011"
}