{
  "paper": {
    "id": 7652,
    "title": "Slavery in Europe: Part 2, Testing a Predictive Model",
    "abstract": "Since the passage of the Victims of Trafficking and Violence Protection Act and the United Nations Palermo Protocols of 2000, there has been an increased focus on the magnitude and complexity of modern day slavery. Yet, surprisingly, little empirical work exists. A comprehensive review of the literature by Elzbieta Gozdziak and Micah Bump in 2008 found that quantitative methodologies were noticeably scarce and that the dominant anti-trafficking discourse was not evidence based. One reason for this scarcity has been the difficulty in obtaining reliable representative data. In this paper, we utilize a novel measure of contemporary slavery in Europe that illustrates one way to fill this gap. Using this measure as a dependent variable, we test one of the first predictive models of slavery. Employing multivariate regression analysis, we find that several predictors-state stability risk, freedom of speech, access to financial services, geography, and age-are significantly predictive of cross-national variation in slavery across Europe. We conclude by outlining a research agenda to develop a better empirical understanding of modern day slavery. This is essential for the development of more effective government policies and responses, with an eye toward the eventual significant reduction or eradication of slavery.",
    "year": 2014,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "7149d8f6d878a0fd69d003d37671e2cc",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T03:10:33.114419"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究现代奴隶制的预测模型，涉及社会政策而非金融领域。虽然使用了回归分析，但其应用场景与衍生品定价、金融风险管理或投资组合管理无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究现代奴隶制的预测模型，涉及社会政策而非金融领域。虽然使用了回归分析，但其应用场景与衍生品定价、金融风险管理或投资组合管理无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:26:14.519142"
}