{
  "paper": {
    "id": 8800,
    "title": "Dietary patterns and multiple chronic diseases in older adults",
    "abstract": "Background The prevalence rate of multiple chronic diseases among the elderly is relatively high, posing a risk to their health and also imposing a financial burden on them. Optimal dietary patterns have positive effects on multiple chronic diseases. This study aimed to identify dietary patterns associated with multiple chronic diseases in older adults. Methods Dietary intake was assessed through two non-consecutive 24-hour dietary recalls. The presence of multiple chronic diseases was assessed based on the existence of dyslipidemia, hypertension, chronic kidney disease, sleep disorders, diabetes, moderate or severe depressive symptoms, and cognitive impairment, with two or more of these conditions being considered. Latent class analysis was used to identify types of multiple chronic diseases, and two-step cluster analysis was used to determine individual dietary patterns. Logistic regression analysis with robust standard errors was conducted to determine the associations between dietary patterns and types of multiple chronic diseases. Results Three dietary patterns and three types of multiple chronic diseases were identified. Individuals following a diet rich in legumes, meat, vegetables and fruits (HLMVF dietary pattern) were 59% less likely to have the cardiometabolic cognitive impairment comorbidity (CCC) than those following a diet rich in milk and eggs but with low grain intake (HME-LG) (OR = 0.41, 95% CI: 0.27-0.64, P < 0.001) and 66% less likely to have the especially sleep disorders comorbidity (ESC) than those following a diet rich in grains but lacking milk and eggs (HG-LME) (OR = 0.34, 95% CI: 0.14-0.87, P < 0.05). Discussion The HLMVF dietary pattern may serve as a healthy dietary pattern to reduce the incidence of multiple chronic diseases and should be promoted among the older adult population.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "a8dd7755380a6d2fe22fdaefc72c9d4c",
    "relevant_keywords": [
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T03:22:26.092035"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究老年人的饮食模式与多种慢性疾病之间的关系，属于公共卫生和营养学领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究老年人的饮食模式与多种慢性疾病之间的关系，属于公共卫生和营养学领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:25:35.387648"
}