{
  "paper": {
    "id": 2177,
    "title": "A data-driven Recommendation Tool for Sustainable Utility Service Bundles",
    "abstract": "Managers in electric utilities face the disruption of their conventional business model of selling electricity per kilowatt-hour for invariant prices. However, the forthcoming widespread uptake of sustainable energy technologies - such as rooftop solar, batteries, heat pumps and electric vehicles - by residential customers also represents a chance for local utilities to diversify their service portfolio. To appropriately market these technologies to households, utilities need data on consumers. In this paper, we present a novel data-driven service bundle recommendation model incorporating technologies and tariffs for residential customers based on individual household data. We validate the model in a case study and quantify the utility of sharing different levels of household data. We find substantial synergies of flexible sustainable technologies and time-varying tariffs, leading to higher cost reductions for customers than tariff-switching alone that can be recommended based on easy-to-obtain data. This demonstrates a large potential for energy service bundle marketing by local utilities. The presented Machine Learning recommendation models enable more reliable recommendations than a naive benchmark. Our research thus demonstrates the potential of data-driven utility marketing strategies that focus on service bundling and the integration of customers' energy consumption data.",
    "year": 2024,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "d092f92681ec3e8bec803828633489cb",
    "relevant_keywords": [
      "machine learning"
    ],
    "stage1_timestamp": "2025-05-15T01:03:36.733647"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是基于机器学习的能源服务捆绑推荐模型，用于电力公用事业公司向住宅客户推广可持续能源技术和可变电价。虽然涉及数据分析和推荐系统，但其应用场景属于能源服务营销，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是基于机器学习的能源服务捆绑推荐模型，用于电力公用事业公司向住宅客户推广可持续能源技术和可变电价。虽然涉及数据分析和推荐系统，但其应用场景属于能源服务营销，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:16:45.503615"
}