{
  "paper": {
    "id": 1926,
    "title": "Sovereign risk in the Euro area: a multivariate stochastic process approach",
    "abstract": "In this paper we jointly model financial and real components of sovereign risk, by means of correlated stochastic processes, and apply the model to Euro Area countries. For each country we consider, as a target measure, the Debt/GDP ratio. We model the time dynamics of both the Debt and the GDP by means of a linear combination of two stochastic equations: an Euro Area systematic process and a country-specific idiosyncratic process. Doing so, we provide an early warning predictive model of sovereign debt sustainability, considering both the financial and the real economy sides, and in terms of both common and country-specific factors. We provide an estimation procedure for the parameters of the processes, which allows to calculate the implied probabilities of default for each country. The empirical findings show a clear clustering effect between northern and southern countries, especially on the financial side. The inclusion of the GDP growth rate in the derivation of default probabilities partially changes the clustering structure, showing that the sovereign risk of some countries (especially that of France and Italy) is strongly affected not only by the debt evolution, but also by the growth of the GDP.",
    "year": 2017,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "0ba53799dacacba729005aa37ccea598",
    "relevant_keywords": [
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T02:09:14.326135"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on modeling sovereign risk and calculating implied probabilities of default for Euro Area countries, which are key aspects of financial risk management, particularly in assessing credit risk and debt sustainability.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on modeling sovereign risk and calculating implied probabilities of default for Euro Area countries, which are key aspects of financial risk management, particularly in assessing credit risk and debt sustainability.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:45:11.916160"
}