{
  "paper": {
    "id": 4330,
    "title": "A multicriteria outranking approach for modeling corporate credit ratings: An application of the ELECTRE TRI-NC method",
    "abstract": "Corporate credit ratings are widely used in financial services for risk management, investment, and financing decisions. In this study, the use of a recently developed multicriteria outranking approach, namely the ELECTRE TRI-NC method, is examined for constructing internal credit rating models in an expert-based judgmental framework. The models are constructed in a multicriteria classification (sorting) setting and the results are analyzed in terms of their internal properties as well as their deviations from risk rating categories defined by rating agencies (i.e. external benchmarking). A simulation/scenario analysis is conducted to examine the results and performance of the outranking models in relation to their parameters. Empirical results are provided for a sample of European firms rated by three leading rating agencies. (C) 2018 Elsevier Ltd. All rights reserved.",
    "year": 2019,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "3049a938c32d2ea2ca16c0a9644e430f",
    "relevant_keywords": [
      "classification"
    ],
    "stage1_timestamp": "2025-05-15T02:36:05.176641"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on constructing internal credit rating models using the ELECTRE TRI-NC method, which is directly related to assessing and managing credit risk, a key aspect of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on constructing internal credit rating models using the ELECTRE TRI-NC method, which is directly related to assessing and managing credit risk, a key aspect of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:33:21.255163"
}