{
  "paper": {
    "id": 1843,
    "title": "Simulation of digital holographic recording and reconstruction using a generalized matrix method",
    "abstract": "In recent years, research efforts in the field of digital holography have expanded significantly, due to the ability to obtain high-resolution intensity and phase images. The information contained in these images have become of great interest to the machine learning community, with applications spanning a wide portfolio of research areas, including bioengineering. In this work, we seek to demonstrate a high-fidelity simulation of holographic recording. By accurately and numerically simulating the propagation of a coherent light source through a series of optical elements and the object itself, we accurately predict the optical interference of the object and reference wave at the recording plane, including diffraction effects, aberrations, and speckle. We show that the optical transformation that predicts the complex field at the recording plane can be generalized for arbitrary holographic recording configurations using a matrix method. In addition, we provide a detailed description of digital phase reconstruction and aberration compensation for a variety of off-axis holographic configurations. Reconstruction errors are presented for the various holographic recording geometries and complex field objects. While the primary objective of this work is not to evaluate phase reconstruction approaches, the reconstruction of simulated holograms provides validation of the generalized simulation method. The long-term goal of this work is that the generalized holographic simulation motivates the use of phase reconstruction of the simulated holograms to populate databases for training machine-learning algorithms aimed at classifying relevant objects recorded through a variety of holographic setups. (C) 2020 Optical Society of America",
    "year": 2021,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "f25cc2371421e1ac47d0075164c60383",
    "relevant_keywords": [
      "machine learning",
      "classification",
      "deep learning",
      "feature representation",
      "representation learning"
    ],
    "stage1_timestamp": "2025-05-15T01:00:27.274263"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究数字全息记录和重建的模拟方法，其核心技术应用于光学和机器学习领域，特别是生物工程，并未提及或应用于衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究数字全息记录和重建的模拟方法，其核心技术应用于光学和机器学习领域，特别是生物工程，并未提及或应用于衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:18:42.333856"
}