{
  "paper": {
    "id": 3808,
    "title": "Mapping temperate forest tree species using dense Sentinel-2 time series",
    "abstract": "Precise information on tree species composition is critical for forest management and conservation, but mapping tree species with satellite data over large areas is still a challenge. Since 2017, Sentinel-2A/B provide multispectral time series with global coverage at an unprecedented spatial and temporal resolution. This is a new opportunity for mapping tree species over large areas that has not yet been fully explored. Because of the high spatial and temporal resolution, Sentinel-2 time series improve the characterization of vegetation phenology and canopy structure, parameters that are intrinsically linked to tree species. The objective of this study was to test the utility of a Sentinel-2 time-series based approach for mapping tree species in a temperate forest region in Central Europe. Using stand-wise forest inventory data for single species stands we assess how well main and minor tree species can be mapped, and if the addition of environmental variables and spatial texture metrics improves the classification accuracy. Our time series approach utilizes all available Sentinel-2 observations and an ensemble of radial basis convolution filters to build cloud-free 5-day time series for each spectral band. The time series are then used as input features to classify seventeen tree species. Our results show the potential of Sentinel-2 time-series based classification, but they also show the challenges associated with mapping a diverse portfolio of tree species. Accuracy of the nine main species, with an area proportion greater than 0.5%, ranged between 98.9% and 66.8%, which is promising for a large area. Adding detailed environmental data and texture metrics to the spectral model only marginally increased the accuracy of a few minor tree species. Overall, the eight minor tree species with area proportions less than 0.5% were most strongly affected by classification errors. Although the absolute mapped area of minor species correlated well with the estimated reference area, the small class areas of minor species lead to high classification errors in relative terms. Mapping minor tree species is challenging for statistical reasons (i.e., class imbalance, small sample size and class variance). Using all available Sentinel-2 data allows building dense time series at high spatial resolution that are mandatory for improved tree species mapping. We were able to show that the spectral time series is the prime explanatory information, even when complementing our analyses with texture information and various environmental data. The results suggest that with the applied data harmonization approach precise regional tree species mapping is feasible.",
    "year": 2021,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "ec2442a753ed4c74629293561009fe9c",
    "relevant_keywords": [
      "classification"
    ],
    "stage1_timestamp": "2025-05-15T01:21:08.209783"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究利用Sentinel-2时间序列数据进行温带森林树种分类，其核心技术应用于森林管理和保护，与衍生品定价、金融风险管理和投资组合管理等金融领域无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究利用Sentinel-2时间序列数据进行温带森林树种分类，其核心技术应用于森林管理和保护，与衍生品定价、金融风险管理和投资组合管理等金融领域无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:08:48.355327"
}