{
  "paper": {
    "id": 397,
    "title": "Developing a dynamic carbon benchmarking method for large building property estates",
    "abstract": "As supermarkets are known to be energy intensive, improvements made to their efficiency can enable operators to reduce not only carbon emissions but also costs, in line with corporate and legislative targets. This study presents a novel benchmarking method to appraise emission and cost performances across a portfolio, enabling building managers to identify sites that are underperforming, taking as a case study a large number of food retail stores. Multiple layers, detailed variable selection including weather features and regression technique comparisons (Multivariate Linear Regression (MLR), Artificial Neural Network (ANN) and Decision Tree (DT)), are considered in model construction. Efficiency is evaluated on multiple bases with a focus on emissions. These are clustered together to produce a benchmark to inform investment decision-making across a portfolio. The DT technique was found to be the most effective, producing a benchmark with low average error (1.5 kgCO(2) m(-2) period(-1)) and high maximum error (21 kgCO(2) m(-2) period(-1)) indicating high accuracy and high discernment respectively. This model also correctly classified buildings known to perform poorly into the worst 30% of buildings in the portfolio. This work highlights the need for further research into natural gas consumption benchmarking and particularly the use of humidity data to better understand the issues in decarbonising heat. (C) 2021 Elsevier B.V. All rights reserved.",
    "year": 2022,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "a963e14d574f9d6f1e8c16901fedf478",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "regression",
      "decision tree",
      "clustering",
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T00:43:10.478259"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是建筑能源效率和碳排放的基准测试方法，虽然提到了投资组合（portfolio）的概念，但这是指建筑物业组合，而非金融投资组合。论文的核心技术并未应用于衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是建筑能源效率和碳排放的基准测试方法，虽然提到了投资组合（portfolio）的概念，但这是指建筑物业组合，而非金融投资组合。论文的核心技术并未应用于衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:31:12.348840"
}