{
  "paper": {
    "id": 3819,
    "title": "Hybrid models based on rough set classifiers for setting credit rating decision rules in the global banking industry",
    "abstract": "Banks are important to national, and even global, economic stability. Banking panics that follow bank insolvency or bankruptcy, especially of large banks, can severely jeopardize economic stability. Therefore, issuers and investors urgently need a credit rating indicator to help identify the financial status and operational competence of banks. A credit rating provides financial entities with an assessment of credit worthiness, investment risk, and default probability. Although numerous models have been proposed to solve credit rating problems, they have the following drawbacks: (1) lack of explanatory power; (2) reliance on the restrictive assumptions of statistical techniques; and (3) numerous variables, which result in multiple dimensions and complex data. To overcome these shortcomings, this work applies two hybrid models that solve the practical problems in credit rating classification. For model verification, this work uses an experimental dataset collected from the Bankscope database for the period 1998-2007. Experimental results demonstrate that the proposed hybrid models for credit rating classification outperform the listing models in this work. A set of decision rules for classifying credit ratings is extracted. Finally, study findings and managerial implications are provided for academics and practitioners. (C) 2012 Elsevier B.V. All rights reserved.",
    "year": 2013,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "8e8e7e742970ba58dae6c061a1251117",
    "relevant_keywords": [
      "classification",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T02:30:28.626922"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on developing hybrid models for credit rating classification, which is directly related to assessing credit worthiness, investment risk, and default probability. These are key components of financial risk management in the banking industry.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on developing hybrid models for credit rating classification, which is directly related to assessing credit worthiness, investment risk, and default probability. These are key components of financial risk management in the banking industry.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:35:08.001166"
}