{
  "paper": {
    "id": 2599,
    "title": "Is it obligor or instrument that explains recovery rate: Evidence from US corporate bond",
    "abstract": "This study investigates the impacts of unobservable firm heterogeneity on modelling corporate bond recovery rates at the instrument level. Based on the recovery information over a long horizon from 1986 to 2012, we find that an obligor-varying linear factor model presents significant improvements in explaining the variations of recovery rates with a remarkably high intra-class correlation being observed. It emphasizes that the inclusion of an obligor-varying random effect term has effectively explained the unobservable firm level information shared by instruments of the same issuer and thus results in an improvement of predictive accuracy of recovery rates. The empirical results show that the latent economic cyclical effects have been well represented by firm level heterogeneity, and strong evidence is presented for the normal distributional assumption of the recovery rates. Finally, we demonstrate the choice of recovery rate models may influence portfolio risk with the obligor-varying factor model generating a more right clustered loss distribution than other regression methods on the aggregated portfolio. (C) 2016 Elsevier B.V. All rights reserved.",
    "year": 2017,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "946dec439fdd00c6ad9006308231a894",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:08:41.838716"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要研究公司债券回收率的建模及其对投资组合风险的影响，这属于金融风险管理中信用风险管理的范畴。论文强调了模型对回收率预测准确性的改进及其对投资组合损失分布的影响，这些都是金融风险管理的关键问题。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文主要研究公司债券回收率的建模及其对投资组合风险的影响，这属于金融风险管理中信用风险管理的范畴。论文强调了模型对回收率预测准确性的改进及其对投资组合损失分布的影响，这些都是金融风险管理的关键问题。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:13:42.349812"
}