{
  "paper": {
    "id": 308,
    "title": "Utilization of Quantization Method on Credit Risk Assessment",
    "abstract": "Credit risk assessment is critical factor in credit risk management, which has played a key role in financial and banking industry. Many classification methods are used in credit risk assessment aiming to establish classifiers to predict the credit state of the corporate (good or bad). However, most of classification methods can not handle continuous variables. So, continuous variables must be quantified. In this paper, we first propose an improved quantization method, namely IDM, based on the statistical independence; then we use data mining techniques, i.e., C4.5 decision tree, Naive-Bayes and SVM classifier, to classify and predict the quantified credit data. The aim is to investigate the effect of quantization method on the classification of credit approval data. The Experimental results show that our approach significantly improves the mean accuracy of classification than other known quantization methods. This denotes that the proposed method can make an effective interpretation and point out the ability of design of a new intelligent assistance credit approval data system.",
    "year": 2014,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "f36ae61ce821bfeb69421c08536c80f9",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T01:49:04.693201"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on improving credit risk assessment through quantization methods and machine learning techniques, which is a key aspect of financial risk management in the banking industry.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on improving credit risk assessment through quantization methods and machine learning techniques, which is a key aspect of financial risk management in the banking industry.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:59:06.734026"
}