{
  "paper": {
    "id": 2564,
    "title": "Ensemble Deep Learning Models for Forecasting Cryptocurrency Time-Series",
    "abstract": "Nowadays, cryptocurrency has infiltrated almost all financial transactions; thus, it is generally recognized as an alternative method for paying and exchanging currency. Cryptocurrency trade constitutes a constantly increasing financial market and a promising type of profitable investment; however, it is characterized by high volatility and strong fluctuations of prices over time. Therefore, the development of an intelligent forecasting model is considered essential for portfolio optimization and decision making. The main contribution of this research is the combination of three of the most widely employed ensemble learning strategies: ensemble-averaging, bagging and stacking with advanced deep learning models for forecasting major cryptocurrency hourly prices. The proposed ensemble models were evaluated utilizing state-of-the-art deep learning models as component learners, which were comprised by combinations of long short-term memory (LSTM), Bi-directional LSTM and convolutional layers. The ensemble models were evaluated on prediction of the cryptocurrency price on the following hour (regression) and also on the prediction if the price on the following hour will increase or decrease with respect to the current price (classification). Additionally, the reliability of each forecasting model and the efficiency of its predictions is evaluated by examining for autocorrelation of the errors. Our detailed experimental analysis indicates that ensemble learning and deep learning can be efficiently beneficial to each other, for developing strong, stable, and reliable forecasting models.",
    "year": 2020,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "b3b72fbe78ee573295ae8fc7d704cb0b",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "regression",
      "neural network",
      "deep learning",
      "long short-term memory",
      "LSTM",
      "convolutional neural network",
      "CNN"
    ],
    "stage1_timestamp": "2025-05-15T01:08:10.836970"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的主要目标是开发一个智能预测模型，用于加密货币价格的预测，以支持投资组合优化和决策制定。这直接关联到投资组合管理领域，因为价格预测是构建和调整投资组合的关键输入。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的主要目标是开发一个智能预测模型，用于加密货币价格的预测，以支持投资组合优化和决策制定。这直接关联到投资组合管理领域，因为价格预测是构建和调整投资组合的关键输入。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:14:03.744210"
}