{
  "paper": {
    "id": 6888,
    "title": "Development of stock market trend prediction system using multiple regression",
    "abstract": "The Stock market trend prediction is an efficient medium for investors, public companies and government to invest money by taking into account the profit and risk. The existing studies on the development of stock-based prediction systems rely on data acquired from social media sources (sentiment-based) and secondary data sources (financial-sites). However, the data acquired from such sources is usually sparse in nature. Moreover, the selection of predictor variables is also poor, which ultimately degrades the performance of prediction model. The problems associated with existing approaches can be overcome by proposing an effective prediction model with improved quality of input data and enhanced selection/inclusion of predictor variables. This work presents the results of stock prediction by applying a multiple regression model using R software. The results obtained show that the proposed system achieved a prediction accuracy of 95% on KSE 100-index dataset, 89% on Lucky Cement, 97% on Abbot Company dataset. Furthermore, user-friendly interface is provided to assist individuals and companies to invest or not in a specific stock.",
    "year": 2019,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "f3e909f6a1cefcd88e65efafa6d697fb",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T03:02:41.261296"
  },
  "domain_result": {
    "success": false,
    "error": "Client error '429 Too Many Requests' for url 'https://api.deepseek.com/v1/chat/completions'\nFor more information check: https://developer.mozilla.org/en-US/docs/Web/HTTP/Status/429",
    "application_domains": [
      "None"
    ],
    "justification": "API调用失败: Client error '429 Too Many Requests' for url 'https://api.deepseek.com/v1/chat/completions'\nFor more information check: https://developer.mozilla.org/en-US/docs/Web/HTTP/Status/429",
    "raw_response": null
  },
  "timestamp": "2025-05-20T15:27:07.405227"
}