{
  "paper": {
    "id": 2890,
    "title": "Developing a Model to Predict High Health Care Utilization Among Patients in a New York City Safety Net System",
    "abstract": "Background:Health care facilities use predictive models to identify patients at risk of high future health care utilization who may benefit from tailored interventions. Previous predictive models that have focused solely on inpatient readmission risk, relied on commercial insurance claims data, or failed to incorporate social determinants of health may not be generalizable to safety net hospital populations. To address these limitations, we developed a payer-agnostic risk model for patients receiving care at the largest US safety net hospital system. Methods:We transformed electronic health record and administrative data from 833,969 adult patients who received care during July 2016-July 2017 into demographic, utilization, diagnosis, medication, and social determinant variables (including homelessness and incarceration history) to predict health care utilization during the following year.We selected the final model by developing and validating multiple classification and regression models predicting 10+ acute days, 5+ acute days, or continuous acute days. We compared a portfolio of performance metrics while prioritizing positive predictive value for patients whose predicted utilization was among the top 1% to maximize clinical utility. Results:The final model predicted continuous number of acute days and included 17 variables. For the top 1% of high acute care utilizers, the model had a positive predictive value of 47.6% and sensitivity of 17.3%. Previous health care utilization and psychosocial factors were the strongest predictors of future high acute care utilization. Conclusions:We demonstrated a feasible approach to predictive high acute care utilization in a safety net hospital using electronic health record data while incorporating social risk factors.",
    "year": 2023,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "ea698f3153e73c4ca5fe69c56c923c22",
    "relevant_keywords": [
      "classification",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:11:48.282865"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是医疗保健领域中的高利用率预测模型，使用了分类和回归技术来预测患者的医疗资源使用情况，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是医疗保健领域中的高利用率预测模型，使用了分类和回归技术来预测患者的医疗资源使用情况，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:12:20.251441"
}