{
  "paper": {
    "id": 5657,
    "title": "A decision support system for strategic planning on pig farms",
    "abstract": "This paper reported on a decision support system (DSS) for strategic planning on pig farms. The DSS was based on a stochastic simulation model of investment decisions (ISM). ISM described a farm with one loan and one building using 23 variables. The simulation model calculated the results of a strategic plan for an individual pig farm over a time horizon of a maximum of 20 years for a given scenario. For six distinct replacement strategies, regression metamodels were specified to describe the outcome of the response variable as a function of the farm variables. The regression results indicated that a linear function with only nine or ten farm variables gave a reasonable estimate of the results of the simulation model. Turnover ratio, feed conversion ratio, percentage of meat, farm size, family expenses, and experience were the main parameters determining future relative farm position. For farms with high levels of family expenditures and/or financial leverage an economic replacement strategy was optimal. Risk attitudes played a minor role in the choice of the optimal strategy, because one strategy was preferred to another regardless of risk preference. To analyze the attractiveness of a chosen strategic plan for different 'what-if' scenarios, the visual method using graphical representations offered sufficient information. The number of years ahead for which the decision maker evaluated the consequences of simulated strategic plans influenced which strategy was preferred.",
    "year": 1995,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "e6611c9fbca9b49e713642f986e6a0d2",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:49:50.395606"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是猪场战略规划的决策支持系统，虽然涉及投资决策和风险态度，但其核心应用领域是农业管理而非金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是猪场战略规划的决策支持系统，虽然涉及投资决策和风险态度，但其核心应用领域是农业管理而非金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:30:01.701346"
}