{
  "paper": {
    "id": 37,
    "title": "Financial asset yield series forecasting based on risk-neutral fuzzy bilinear regression and probabilistic neural network",
    "abstract": "Application of quantitative methods for forecasting purposes in financial markets has attracted significant attention from researchers and managers in recent years when conventional time series forecasting models can hardly develop the inherent rules of complex nonlinear dynamic financial systems. In this paper, based on the fuzzy technique integrated with the statistical tools and artificial neural network, a new hybrid forecasting system consisting of three stages is constructed to exhibit effectively improved forecasting accuracy of financial asset price. The sum of squared errors is minimized to determine the coefficients in fitting the fuzzy autoregression model stage for formulating sample groups to deal with data containing outliers. Fuzzy bilinear regression model introducing risk view based on quadratic programming algorithm that reflects the properties of both least squares and possibility approaches without expert knowledge is developed in the second stage. The main idea of the model considers the sub-models tracking the possible relations between the spread and the center, also linking the estimation deviation with risk degree of fitness of the model. In the third stage, fuzzy bilinear regression forecasting combining with the optimal architecture of probabilistic neural network classifiers indicates that the proposed method has great contribution to control over-wide interval financial data with a certain confidence level. Statistical validation and performance analysis using historical financial asset yield series on Shanghai Stock Exchange composite index all exhibit the effectiveness and stability of the proposed hybrid forecasting formulation compared with other forecasting methods.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "48a01cfb3cdd858f709e33a6fa2ea193",
    "relevant_keywords": [
      "machine learning",
      "neural network",
      "deep learning",
      "regression",
      "classification"
    ],
    "stage1_timestamp": "2025-05-15T01:46:03.858182"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是构建一个混合预测系统，用于提高金融资产价格预测的准确性，并特别提到了控制具有特定置信水平的宽区间金融数据。这直接关联到金融风险管理中的风险度量和预测。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是构建一个混合预测系统，用于提高金融资产价格预测的准确性，并特别提到了控制具有特定置信水平的宽区间金融数据。这直接关联到金融风险管理中的风险度量和预测。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:01:31.813017"
}