{
  "paper": {
    "id": 6584,
    "title": "Admission Data Predict High Hospital Readmission Risk",
    "abstract": "Purpose: The purpose of this study was to identify data available at the time of hospital admission that predict readmission risk. Methods: We performed a retrospective multiple regression analysis of 958 adult, nonpregnant patients admitted to the Family Medicine Service between June 2012 and October 2013. Data were abstracted from hospital administrative sources and electronic medical records. The outcome was 30-day hospital readmission. Candidate readmission predictors included polypharmacy (>= 6 medicines), Charlson comorbidity index, age, sex, insurance status, emergency department use, smoking, nursing report of cognitive issues, patient report of social support or financial issues, and a history of heart failure, pneumonia, or chronic obstructive pulmonary disease. Results: Patients at the Family Medicine Service had a 14% readmission risk. Bivariate analysis showed that high Charlson scores (>= 5), polypharmacy, heart failure, pneumonia, or chronic obstructive pulmonary disease each increased readmission risk (P <.05). A logistic model showed an estimated odds ratio for readmission for high Charlson scores of 1.7 (95% confidence interval, 1.1-2.6) and of 2.1 for polypharmacy (95% confidence interval, 1.3-3.7). The model yielded a readmission risk estimate of 6% if neither a high Charlson score nor polypharmacy was present, 9% if only the Charlson score was high, 12% if only polypharmacy was present, and 19% if both were present. The receiver operating characteristics curve for the 2-factor model yielded an estimated area under the curve of 85%. Cross-validation supported this result. Conclusions: Polypharmacy and higher Charlson score at admission predict readmission risk as well as or better than published risk prediction models. The model could help to conserve limited resources and to target interventions for reducing readmission among the highest-risk patients.",
    "year": 2016,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "96bb471eebb973abdbd298d2152db03f",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:59:36.991086"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究医院再入院风险的预测模型，涉及医疗数据分析，并未提及任何金融领域的应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究医院再入院风险的预测模型，涉及医疗数据分析，并未提及任何金融领域的应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:27:32.696729"
}