{
  "paper": {
    "id": 369,
    "title": "A Classification-Based Consensus Decision-Making Approach with Unknown Class Information for Portfolio Selection Under Hesitant Fuzzy Linguistic Environment",
    "abstract": "In the portfolio selection process, experts often identify superior alternatives through negotiation and subsequently determine the portfolio structure and ratio. The trust relationships between experts and their divergent opinions on alternative classifications can influence portfolio results, which are rarely considered in existing studies. In this study, we consider the cognitive and affective trust degree of experts and propose a classification-based consensus decision-making (CCDM) approach for portfolio selection. Initially, a cognitive-affective trust network is proposed to determine experts' weights. Subsequently, assuming that the class information, including the number of classifications and that of alternatives in each classification assigned by experts, is unknown, a classification-based consensus-reaching process (CCRP) based on hesitant fuzzy linguistic preference relations (HFLPRs) is proposed for the consensual classifications of alternatives. To obtain the optimal portfolio structure and ratio, a portfolio optimization model that considers realistic constraints is developed. Finally, an application example, comparative analysis, and sensitivity analysis are presented to verify the feasibility and effectiveness of the proposed approach.",
    "year": 2025,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "064b766ba9da3ea16dc1258466702eef",
    "relevant_keywords": [
      "classification"
    ],
    "stage1_timestamp": "2025-05-15T00:42:32.541530"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是提出一种基于分类的共识决策方法（CCDM）用于投资组合选择，并开发了一个考虑现实约束的投资组合优化模型。这些内容直接针对投资组合管理的核心问题，即如何选择和优化投资组合的结构和比例。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是提出一种基于分类的共识决策方法（CCDM）用于投资组合选择，并开发了一个考虑现实约束的投资组合优化模型。这些内容直接针对投资组合管理的核心问题，即如何选择和优化投资组合的结构和比例。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:31:34.836196"
}