{
  "paper": {
    "id": 158,
    "title": "Credit scoring using least squares support vector machine based on data of Thai financial institutions",
    "abstract": "The quantitative method known as credit scoring has been developed for the credit assessment problem. Credit scoring is essentially an application of classification techniques, which classify credit customers into different risk groups. The Financial institutions are being more and more obliged to build credit scoring models assessing the risk of default of their clients. Support Vector Machine is a promising new technique that has recently emanated and become popular for data classification. Least Squares Support Vector Machines (LS-SVM) are re-formulations to the standard SVMs. The cost function is a regularized least squares function with equality. constraints. The solution can be found efficiently by iterative method like the conjugate Gradient algorithm. Then in this paper, Least Squares Support Vector Machine is considered by approaching to the credit scoring with the data of Thai financial institutions. The optimum model will be able to divide the group of customers into four groups: very good, rather good, suspiciously bad and very bad with high accuracy.",
    "year": 2007,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "caa61ed09768d19ea2423cd15fb2570b",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM"
    ],
    "stage1_timestamp": "2025-05-15T01:47:14.209192"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on credit scoring, which is a method used to assess the risk of default by clients. This directly relates to managing financial risks, specifically credit risk, within financial institutions.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on credit scoring, which is a method used to assess the risk of default by clients. This directly relates to managing financial risks, specifically credit risk, within financial institutions.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:00:25.123182"
}