{
  "paper": {
    "id": 1306,
    "title": "Application of Pretopological Hierarchical Clustering for Buildings Portfolio",
    "abstract": "Our paper deals with the problem of the comparison of heterogeneous energy consumption profiles for energy optimization. Doing case-by-case in depth auditing of thousands of buildings would require a massive amount of time and money as well as a significant number of qualified people. Thus, an automated method must be developed in order to establish a relevant and effective recommendations system. Comparing sites to extract similar profiles refers to a machine learning set of methods called clustering. To answer this problematic, pretopology is used to model the sites' consumption profiles and a multi-criteria hierarchical clustering algorithm, using the properties of pretopological space, has been developed using a Python library. The pretopological hierarchical clustering algorithm is able to identify the clusters and provide a hierarchy between complex items. Tested on benchmarks of generated time series (from literature and from french energy company), the algorithm is able to identify the clusters using Pearson's correlation with an Adjusted Rand Index of I and returns relevant results on real energy systems' consumption data.",
    "year": 2021,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "24db1e53c5bc3cb930402d75a2373740",
    "relevant_keywords": [
      "machine learning",
      "unsupervised learning",
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T00:54:24.636744"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是能源消耗数据的聚类分析，用于优化建筑能源管理，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是能源消耗数据的聚类分析，用于优化建筑能源管理，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:22:04.740560"
}