{
  "paper": {
    "id": 4416,
    "title": "DISCLOSURE OF RELATED PARTY TRANSACTIONS AND INFORMATION REGARDING TRANSFER PRICING BY THE COMPANIES LISTED ON BUCHAREST STOCK EXCHANGE",
    "abstract": "After the financial scandals occurred in the last years, the related party transactions and transfer prices have begun to be considered, a powerful instrument of financial frauds, this perception contributing to the faltering confidence of the investors. In this context, we considered that a disclosure of information about the related party transactions and transfer pricing aspects could assist investors in analysing whether there is a risk with regards to the related party transactions and could be a starting point for the increasing of the investors 'confidence. Therefore, the objective of our study is to analyse how the Romanian companies listed on Bucharest Stock Exchange disclosed during 2012-2014 the related party transactions and information regarding transfer pricing. Furthermore, we used a linear regression model in order to test the influence of some factors on the disclosures made by companies from our sample. The factors included in our regression model are represented by type of the auditor (Big Four or non-Big Four), type of related parties involved in transactions (residents or non-residents), nature of capital (foreign or local), conceptual framework applied (IFRS or local GAAP) and sector of activity.",
    "year": 2016,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "2aaa67435cf41d219f25bd4c530d399a",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:37:16.731504"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是上市公司关联交易和转移定价的信息披露问题，以及这些披露如何影响投资者信心。虽然涉及金融领域，但其核心内容并不直接涉及衍生品定价、金融风险管理或投资组合管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是上市公司关联交易和转移定价的信息披露问题，以及这些披露如何影响投资者信心。虽然涉及金融领域，但其核心内容并不直接涉及衍生品定价、金融风险管理或投资组合管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:32:57.052500"
}