{
  "paper": {
    "id": 2802,
    "title": "Towards an intelligent adaptive security framework for preventing and detecting credit card fraud",
    "abstract": "As fraud and cybercrime become more frequent and sophisticated, preventing users from being exposed to risk is a significant challenge for the scientific community. Current banking systems use One Time Password (OTP) sent to the mobile phone to prevent user impersonation attacks. However, it could be compromised by man-in-the-middle attacks. It also presents usability and unavailability problems if the SMS service is inaccessible, especially when traveling or in case of a damaged or stolen phone. Using Machine Learning (ML) techniques to detect and prevent fraudulent actions allows financial organizations to stay one step ahead of fraudsters, whose scale and sophistication continue to grow. Specifically, ML systems can be used to identify additional authentication factors to make the system more robust against attacks. To prevent identity theft attacks and minimize fraudulent transactions, we propose in this work a comprehensive design that combines adaptive multi-factor authentication and adaptive fraud detection for banking systems based on the use of ML technology.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "b6343531afb9506d2e2e78ec6213e843",
    "relevant_keywords": [
      "machine learning",
      "classification",
      "feature learning",
      "feature representation",
      "neural network",
      "deep learning",
      "representation learning"
    ],
    "stage1_timestamp": "2025-05-15T02:19:08.488904"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是使用机器学习技术来预防和检测信用卡欺诈，虽然涉及金融领域的安全问题，但并不直接属于衍生品定价、金融风险管理或投资组合管理中的任何一个特定领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是使用机器学习技术来预防和检测信用卡欺诈，虽然涉及金融领域的安全问题，但并不直接属于衍生品定价、金融风险管理或投资组合管理中的任何一个特定领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:40:08.333665"
}