{
  "paper": {
    "id": 600,
    "title": "Introducing Learning Automata to Financial Portfolio Components Selection",
    "abstract": "In this paper, we introduce a novel method to select the components of a portfolio of securities. This method is based on a reinforcement learning technique known as learning automata. Several heuristic solutions for the portfolio weights selection problem have been introduced in literature. The point is that these applications assumes that portfolio components are given. The difference of our work is that we propose some heuristic in order to select the portfolio components instead of the weights. In terms of heuristic, we propose learning automata because its ability to solve complex systems such as a the optimal portfolio components. We test the use of learning automata in terms of financial indicators optimization. Our findings show that our proposed method improves the portfolio optimization performance in terms of accuracy and computational effort.",
    "year": 2018,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "7a383bb4952ff84ec6181d8dbb9e2119",
    "relevant_keywords": [
      "reinforcement learning"
    ],
    "stage1_timestamp": "2025-05-15T00:45:39.083103"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "The paper introduces a novel method based on learning automata for selecting components of a securities portfolio, which is a core aspect of portfolio management. The research focuses on optimizing financial indicators and improving portfolio performance, directly aligning with the objectives of portfolio management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Portfolio Management\"],\n  \"justification\": \"The paper introduces a novel method based on learning automata for selecting components of a securities portfolio, which is a core aspect of portfolio management. The research focuses on optimizing financial indicators and improving portfolio performance, directly aligning with the objectives of portfolio management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:29:28.246072"
}