{
  "paper": {
    "id": 3677,
    "title": "(INTER) ACTIVE METHODOLOGICAL STRATEGIES IN DISTANCE EDUCATION AS FROM THE STUDENT EVALUATIONS",
    "abstract": "Introduction: Distance education (DE) is a teaching modality that is increasingly present in the permanent training of health professionals. Among the challenges that have to be overcome are the use of methodologies that lead to active and meaningful learning. The paper discusses the use of strategies and the importance of (inter) active methodologies in the development of the pedagogical process in DE through evaluations carried out by students of a Specialization Course in Family Health, which uses a unique and differentiated methodology for DE. The methodological (inter) active teaching/learning strategies have the following characteristics: the use of real or simulated experiences, leading to the development of the skills to solve essential professional practice tasks in different contexts and to offer learning in a meaningful way, prioritizing the relationship of theory with the professional-student's practice. The methodological strategies are: the use of three fictional cities, contextualizing the problems in the health area, reproducing situations as close to reality as possible, challenging students to solve the situations-problems; study of complex cases, with discussions of clinical cases, establishing a direct relationship with professional activities, aimed at the communication, interaction, theory-practice relationship, with guided studies and discussion forums; presentation of exhibition materials on themes with slides, texts, videos and audio; creation of a portfolio to record the acquired knowledge and the establishment of relationships with the professional's reality. Methodology: The course is evaluated by the students through a questionnaire with objective questions (using the Likert scale) and different spaces and moments for qualitative evaluations (through testimonials). We present the data of an exploratory study, which analyzed the results obtained about the methodology used according to the following criteria: propitiative strategies for meaningful learning, activities that promote active learning, interactivity and communication in the proposed activities, types of strategies and variety of strategies used. Tutor's follow-up and interaction when carrying out assignments were also highlighted as criteria for assessment of the course methodology. Results: The course has already been evaluated by more than 800 students. Its effectiveness and contribution to the training of health professionals was verified based on the data obtained, which indicated that more than 80% of students were satisfied with the methodology adopted, the strategies and the interaction with the tutor. The statements show that the types of activities used allow reflection on the practice and lead to changes in attitudes in professional activity. Conclusion: From the evaluation of the students, we conclude that: (1) it is possible to approximate the contents of the students' reality through methodological strategies that contextualize the themes; (2) that the conduction of the pedagogical process, through the use of strategies aimed at active learning, is effective in DE, and it is possible to create the necessary skills for professional performance through this type of teaching, which concretely translates the meaning of the student being a subject of their own learning.",
    "year": 2018,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "572f6f14901b03d04c3b2a75c26d9904",
    "relevant_keywords": [
      "active learning"
    ],
    "stage1_timestamp": "2025-05-15T01:19:26.255537"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要讨论的是远程教育中的互动教学方法及其在学生评估中的应用，与衍生品定价、金融风险管理或投资组合管理等金融领域无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要讨论的是远程教育中的互动教学方法及其在学生评估中的应用，与衍生品定价、金融风险管理或投资组合管理等金融领域无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:09:13.601559"
}