{
  "paper": {
    "id": 6544,
    "title": "MSCAN: AN AUTOMATED IN-SITU FAULT DETECTION SYSTEM FOR DESKTOP FUSED FILAMENT FABRICATION 3D PRINTERS UTILIZING A NON-CONTACT SENSOR",
    "abstract": "Fused filament fabrication (FFF) has gained widespread recognition across diverse industries owing to its rapid prototyping and cost-effectiveness advantages. As a result, it is the most prevalent modality for desktop 3D printing. However, FFF can be susceptible to a variety of printing defects and jeopardize the printing quality. Monitoring when defects occur during 3D printing and promptly stopping faulty printing remains a significant challenge. To address this challenge, engineers have developed techniques for detecting and characterizing defects during the FFF printing process. They can be categorized into contact and non-contact detection methodologies. Non-contact methods usually rely on computer vision or laser scanning. However, computer vision needs the assistance of machine learning and demands a substantial amount of training data for accurate detection. Moreover, computer vision is susceptible to ambient light conditions. The laser scanning method detects the printing defects by comparing the point cloud obtained from scanning the printed object with the CAD model. However, this approach heavily depends on the precision of the laser scanner, and achieving high accuracy often entails a significant financial investment for a good laser scanner. To improve accuracy and cost-effectiveness, a low-cost contact-based detection system called MTouch was developed in prior work. However, using contact sensors carries a risk of damaging fragile prints and leading to printing failures. In response, this paper introduces a non-contact, cost-effective, and robust detection method, MScan, to detect defects during the printing process. In the MScan setup, a laser-camera sensor is designed with a laser stripe emitter and a camera module based on laser triangulation to assess the absence of the printed object during the printing process. Additionally, MScan employs an effective and straightforward image processing and data acquisition algorithm to ensure its robustness and computational efficiency. The effectiveness of MScan is demonstrated experimentally by deploying it on an Ender 3 desktop FFF 3D printer. A fault detection accuracy of over 95% is achieved. Furthermore, MScan's robustness to lighting variations is experimentally demonstrated.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "922038a05dd38dccf695b89189b3fb52",
    "relevant_keywords": [
      "machine learning"
    ],
    "stage1_timestamp": "2025-05-15T02:59:07.537274"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究一种用于3D打印过程中缺陷检测的非接触式传感器系统，其核心技术应用于制造业中的质量控制，与金融领域无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究一种用于3D打印过程中缺陷检测的非接触式传感器系统，其核心技术应用于制造业中的质量控制，与金融领域无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:27:32.859821"
}