{
  "paper": {
    "id": 1863,
    "title": "Brazilian banks risk and risk",
    "abstract": "This study analyzes the marginal contribution of Brazilian banks to the systemic risk. The objective is to identify whether banks that share common characteristics similarly contribute to systemic financial shocks. First, the risk assumed by a sample of listed banks is measured from the accounting, market, and regulatory perspectives. Sample banks were segregated using an unsupervised clustering model. The results were compared with the methodology currently used by the Central Bank of Brazil to segment the banking institutions. Finally, we evaluate the banking groups' marginal contribution to systemic financial risk using 4CoVaR. . These results suggest that institutions that share similar characteristics in relation to their risk profiles behave similarly during times of greater market stress. Notably, size, geographic diversification, and liquidity were common attributes among banks contributing significantly to systemic risk during financial crises. This study advances the field of banking finance by introducing an analytical framework that goes beyond the traditional focus on bank balance sheet size, aligning with international standards for evaluating the systemic importance of financial institutions.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "c0f58efcdd122546aca74fb3e56a7597",
    "relevant_keywords": [
      "unsupervised learning",
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T02:08:38.899609"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on analyzing the marginal contribution of Brazilian banks to systemic risk using unsupervised learning and clustering techniques, which are applied to evaluate financial risk management, specifically systemic risk during financial crises.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on analyzing the marginal contribution of Brazilian banks to systemic risk using unsupervised learning and clustering techniques, which are applied to evaluate financial risk management, specifically systemic risk during financial crises.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:45:31.909235"
}