{
  "paper": {
    "id": 2028,
    "title": "Boosting Credit Risk Data Quality Using Machine Learning and eXplainable AI Techniques",
    "abstract": "Data play a crucial role in decision making for modern businesses, and the reliability of these decisions highly depends on the data quality. This problem is particularly relevant when we deal with financial data used for risk assessment and reporting. Basel regulations mandate that banks hold a certain amount of capital based on the level of risk in their portfolios expressed in terms of risk-weighted assets (RWAs). The quality of a bank's risk management is directly impacted by the quality of the asset data used to calculate RWAs. In this study, we present a data quality (DQ) framework and show how machine learning paired with eXplainable Artificial Intelligence (XAI) techniques can be used to perform automatic DQ monitoring using a human-in-the-loop approach in credit risk. By obtaining expert feedback about model output enriched with XAI explanations, we clearly demonstrate the power of ML in terms of enhancing credit risk data quality and the advantages of using XAI to assist experts in analysing model outputs.",
    "year": 2025,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "59f1222d365e1a9c3730a7681cf3a710",
    "relevant_keywords": [
      "machine learning",
      "classification",
      "feature learning",
      "feature representation",
      "neural network",
      "deep learning",
      "representation learning"
    ],
    "stage1_timestamp": "2025-05-15T02:10:25.710591"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on enhancing credit risk data quality using machine learning and explainable AI techniques, which directly relates to improving risk assessment and reporting in financial institutions, a core aspect of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on enhancing credit risk data quality using machine learning and explainable AI techniques, which directly relates to improving risk assessment and reporting in financial institutions, a core aspect of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:44:47.764080"
}