{
  "paper": {
    "id": 2699,
    "title": "Prior knowledge distillation based on financial time series",
    "abstract": "One of the major characteristics of financial time series is that they contain a large amount of nonstationary noise, which is challenging for deep neural networks. People normally use various features to address this problem. However, the performance of these features depends on the choice of hyper-parameters. In this paper, we propose to use neural networks to represent these indicators and train a large network constructed of smaller networks as feature layers to fine-tune the prior knowledge represented by the indicators. During back propagation, prior knowledge is transferred from human logic to machine logic via gradient descent. Prior knowledge is the neural network's deep belief and teaches the network to not be affected by non-stationary noise. Moreover, co-distillation is applied to distill the structure into a much smaller size to reduce redundant features and the risk of overfitting. In addition, the decisions of the smaller networks in terms of gradient descent are more robust and cautious than those of large networks. In numerical experiments, we find that our algorithm is faster and more accurate than traditional methods on real financial datasets. We also conduct experiments to verify the method.",
    "year": 2020,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "6194fa4d1186b63e44a353db1194b194",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "neural network",
      "backpropagation",
      "BP",
      "deep belief network",
      "DBM",
      "feature learning",
      "feature representation",
      "representation learning"
    ],
    "stage1_timestamp": "2025-05-15T02:18:06.264200"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究金融时间序列中的非平稳噪声问题，并提出了一种基于神经网络的特征学习和知识蒸馏方法。虽然论文提到在真实金融数据集上进行了实验，但并未明确指出其核心技术应用于衍生品定价、金融风险管理或投资组合管理等特定金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究金融时间序列中的非平稳噪声问题，并提出了一种基于神经网络的特征学习和知识蒸馏方法。虽然论文提到在真实金融数据集上进行了实验，但并未明确指出其核心技术应用于衍生品定价、金融风险管理或投资组合管理等特定金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:40:38.174556"
}