{
  "paper": {
    "id": 381,
    "title": "Research on Credit Risk Assessment in Commercial Bank Based on Information Integration",
    "abstract": "Credit risk is the main risk faced by commercial bank during operation, how to manage credit risk is a focus for financial specialists. Therefore effective assessment of credit risk is very important. The risks faced by banks during operation can be regarded as a kind of research of uncertain problems' study. The essence of multi-sensor data integration is as follows: to have a best decision according to much information from different sensors. A kind of credit risk assessment model based on information integration is developed depending on the idea of multi-sensor information integration. This model includes three algorithms, as follows: BP neural network, SVM and DS evidence theory. This model has not only the classifying capacity of BP neural network and SVM, but also the decision ability of DS evidence theory. The essence of the model has two key steps, first we can obtain elementary decision, then we depend on DS evidence theory has a integration of processed outputs data by BP neural network and SVM. Depending on some data of certain bank, we have a simulation aiming at three models: BP model, SVM model and new developed model. The results show the developed new model can obtain better assessment compared with two models at same conditions.",
    "year": 2009,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "5bd56125af03e0d0850eddcc217c2d1d",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM",
      "neural network",
      "backpropagation",
      "BP"
    ],
    "stage1_timestamp": "2025-05-15T01:50:14.045107"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是开发一种基于信息整合的信用风险评估模型，用于商业银行的信用风险管理。这直接属于金融风险管理的范畴，特别是信用风险管理。论文中提到的BP神经网络、SVM和DS证据理论都是为了更好地评估和管理信用风险，而不是衍生品定价或投资组合管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是开发一种基于信息整合的信用风险评估模型，用于商业银行的信用风险管理。这直接属于金融风险管理的范畴，特别是信用风险管理。论文中提到的BP神经网络、SVM和DS证据理论都是为了更好地评估和管理信用风险，而不是衍生品定价或投资组合管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:58:28.465731"
}