{
  "paper": {
    "id": 1602,
    "title": "A fuzzy risk assessment strategy based on big data for multinational financial markets",
    "abstract": "This research aims to use data science methods to mine valuable information in big data and use fuzzy theory to construct a risk assessment strategy that is applicable to multinational financial markets. First of all, in order to ensure that the data of multinational financial markets are better connected, low-quality data has been cleaned up and simplified, including missing value and too much time gap. Then, we analyze the daily signal fluctuations based on statistical methods to find the causality and investment risks of multinational financial markets. Finally, the fuzzy inference system consists of multiple inputs and multiple outputs. The inputs are US stocks, Kur, Ske, CF and SD, respectively, and the outputs are ups, downs, uncertain, may-be-ups, and may-be-downs. From the experimental results, it is known that the misjudgment ratio is used as a prerequisite for performance evaluation, and reliable results are obtained for both tradable ratio (Low/Medium-risk area: 1.8, 16 %) and accuracy (Low/Medium-risk area: 66.7, 70.7 %). In summary, the performance of the proposed method has been verified. The risk assessment of multinational financial markets has become a possibility. In future research work, we will continue to explore the possibility of machine learning and optimization algorithms to improve performance and share this result on an open platform.",
    "year": 2018,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "4b75982fba023dcac2d845c6faf767fd",
    "relevant_keywords": [
      "machine learning"
    ],
    "stage1_timestamp": "2025-05-15T02:05:08.250960"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用模糊理论和数据科学方法构建适用于跨国金融市场的风险评估策略，这直接属于金融风险管理的范畴。论文的研究目标和实验设计都集中在风险识别和评估上，而非衍生品定价或投资组合管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是使用模糊理论和数据科学方法构建适用于跨国金融市场的风险评估策略，这直接属于金融风险管理的范畴。论文的研究目标和实验设计都集中在风险识别和评估上，而非衍生品定价或投资组合管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:47:55.636266"
}