{
  "paper": {
    "id": 1330,
    "title": "Constructing early warning indicators for banks using machine learning models",
    "abstract": "This research contributes to bank liquidity risk management by employing supervised machine learning models to provide banks with early warnings of liquidity stress using market-based indicators. Identifying increasing levels of stress as early as possible provides management with a crucial window of time in which to assess and develop a potential response. This study uses publicly available data from 2007 to 2021, covering two severe stress periods: the 2007-2008 global financial crisis and the COVID-19 crisis. The current version of the developed model then applies backtesting using the data from the COVID-19 crisis. The findings of this study show that the ensemble model with the RUSBoost algorithm predicts red and amber days with a success rate 21% greater than the average of other machine learning models; thus, it can greatly contribute to bank risk management.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "7013d32487780214323da38cded2ca21",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "decision tree",
      "ensemble model"
    ],
    "stage1_timestamp": "2025-05-15T02:01:44.762540"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on using machine learning models to provide early warnings for bank liquidity stress, which is a critical aspect of financial risk management, specifically in the context of bank liquidity risk.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on using machine learning models to provide early warnings for bank liquidity stress, which is a critical aspect of financial risk management, specifically in the context of bank liquidity risk.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:49:48.603064"
}