{
  "paper": {
    "id": 2547,
    "title": "Designing an Early Warning System for Stock Market Crashes Based On Adaptive Neuro Fuzzy Inference System Forecasting",
    "abstract": "In this paper, we focus on building a financial early warning system (EWS) to predict stock market crashes by using stock market volatility and rising stock prices. The relation of stock market volatility with stock market crashes is analyzed empirically in this study. Also, Istanbul Stock Exchange (ISE) National 100 Index data will be used to achieve a better results from the point of modeling purpose. A stock market crash risk indicator is computed to predict crashes and to give an early warning signal. Besides, adaptive neuro fuzzy inference system (ANFIS) will be used as a training tool for EWS. The empirical results show that the proposed adaptive neuro fuzzy model is successful thanks to the ANFIS that includes both artificial neural network learning ability and the fuzzy logic inference mechanism.",
    "year": 2009,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "d104440fddea41eeaf074b8e103ad37e",
    "relevant_keywords": [
      "machine learning",
      "neural network",
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T02:16:32.709555"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on building an early warning system to predict stock market crashes using adaptive neuro fuzzy inference system (ANFIS), which is a technique aimed at managing financial risk by providing early signals of potential market downturns.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on building an early warning system to predict stock market crashes using adaptive neuro fuzzy inference system (ANFIS), which is a technique aimed at managing financial risk by providing early signals of potential market downturns.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:41:33.240284"
}