{
  "paper": {
    "id": 708,
    "title": "Predicting Financial Distress of Slovak Enterprises: Comparison of Selected Traditional and Learning Algorithms Methods",
    "abstract": "Predicting the risk of financial distress of enterprises is an inseparable part of financial-economic analysis, helping investors and creditors reveal the performance stability of any enterprise. The acceptance of national conditions, proper use of financial predictors and statistical methods enable achieving relevant results and predicting the future development of enterprises as accurately as possible. The aim of the paper is to compare models developed by using three different methods (logistic regression, random forest and neural network models) in order to identify a model with the highest predictive accuracy of financial distress when it comes to industrial enterprises operating in the specific Slovak environment. The results indicate that all models demonstrated high discrimination accuracy and similar performance; neural network models yielded better results measured by all performance characteristics. The outputs of the comparison may contribute to the development of a reputable prediction model for industrial enterprises, which has not been developed yet in the country, which is one of the world's largest car producers.",
    "year": 2020,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "f58ce6386a81ea9dc1c31a7802d3ddf1",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "neural network",
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T01:53:59.486055"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on predicting financial distress of enterprises using machine learning models, which is a key aspect of financial risk management as it helps in assessing the stability and potential risks associated with enterprises.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on predicting financial distress of enterprises using machine learning models, which is a key aspect of financial risk management as it helps in assessing the stability and potential risks associated with enterprises.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:55:48.058445"
}