{
  "paper": {
    "id": 425,
    "title": "Corporate Default Predictions Using Machine Learning: Literature Review",
    "abstract": "Corporate default predictions play an essential role in each sector of the economy, as highlighted by the global financial crisis and the increase in credit risk. This study reviews the corporate default prediction literature from the perspectives of financial engineering and machine learning. We define three generations of statistical models: discriminant analyses, binary response models, and hazard models. In addition, we introduce three representative machine learning methodologies: support vector machines, decision trees, and artificial neural network algorithms. For both the statistical models and machine learning methodologies, we identify the key studies used in corporate default prediction. By comparing these methods with findings from the interdisciplinary literature, our review suggests some new tasks in the field of machine learning for predicting corporate defaults. First, a corporate default prediction model should be a multi-period model in which future outcomes are affected by past decisions. Second, the stock price and the corporate value determined by the stock market are important factors to use in default predictions. Finally, a corporate default prediction model should be able to suggest the cause of default.",
    "year": 2020,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "8d688f6004eee153a80058232c4481c9",
    "relevant_keywords": [
      "machine learning",
      "support vector machine",
      "SVM",
      "decision tree",
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T01:50:52.617787"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on corporate default prediction, which is a key aspect of credit risk management, a subfield of financial risk management. The review discusses various statistical and machine learning models specifically applied to predict corporate defaults, addressing credit risk assessment and mitigation.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on corporate default prediction, which is a key aspect of credit risk management, a subfield of financial risk management. The review discusses various statistical and machine learning models specifically applied to predict corporate defaults, addressing credit risk assessment and mitigation.\"\n}\n```"
  },
  "timestamp": "2025-05-20T14:24:02.228136"
}