{
  "paper": {
    "id": 1223,
    "title": "Optimizing Financial Risk Models in Digital Transformation-Deep Learning for Enterprise Management Decision Systems",
    "abstract": "The digital transformation of enterprises has amplified the complexity of financial risks, underscoring the significance of optimizing financial risk warning models to ensure sustainable development. This study integrates several deep learning techniques, including Back Propagation Neural Network (BPNN), Bi-Long Short-Term Memory (Bi-LSTM), and transfer learning, to enhance the risk warning system and improve the accuracy and efficiency of financial risk prediction models. The results demonstrate that the proposed algorithm surpasses the baseline models in various metrics. For instance, on the Altman's Z-Score dataset, there is an improvement of 1.4% in accuracy, a reduction of over 48.8% in FLOP, and an enhancement of 43.5% in MAPE. These outcomes underscore the significant advancements in risk identification, decision support, and proactive risk management facilitated by the proposed model. As a result, enterprises can derive benefits from more precise and reliable financial risk warning tools, and effectively address the challenges brought about by digital transformation.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "6cf168926184938e61da882c6a4830fc",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "neural network",
      "backpropagation",
      "BP",
      "long short-term memory",
      "LSTM",
      "representation learning"
    ],
    "stage1_timestamp": "2025-05-15T02:00:30.491887"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用深度学习模型（如BPNN和Bi-LSTM）来优化财务风险预警系统，提高财务风险预测的准确性和效率。这直接应用于金融风险管理领域，特别是企业财务风险的识别和预警。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"该论文的核心技术是使用深度学习模型（如BPNN和Bi-LSTM）来优化财务风险预警系统，提高财务风险预测的准确性和效率。这直接应用于金融风险管理领域，特别是企业财务风险的识别和预警。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:50:54.973517"
}