{
  "paper": {
    "id": 612,
    "title": "Controlling Shareholder Characteristics and Corporate Debt Default Risk: Evidence Based on Machine Learning",
    "abstract": "The influence of controlling shareholder characteristics on corporate risk has been a popular topic for discussion in academic and theoretical circles. However, current research lacks systematic and quantitative conclusions based on predictive ability, as it only focuses on the causal relationship between a single characteristic of the controlling shareholder and corporate risk. This paper utilizes the back propagation neural network based on gray wolf algorithm (GWO-BP) method in the machine learning algorithm for the first time and takes the listed companies that publicly issue bonds in the Chinese bond market as a research sample. It summarizes the qualities of controlling shareholders from the perspective of controlling shareholders' risk-taking and benefits expropriation and examines multi-dimensional controlling shareholder characteristics for predicting the debt default risk of companies. This research established that: (1) Overall, the characteristics of controlling shareholders can improve the ability to predict the debt default of a company; (2) The features of the investment portfolio of the controlling shareholder have a higher degree of predicting the debt default risk of a company,while the properties of equity structure and related transactions have a lower degree of predicting the risk of corporate debt default.This research not only uses machine learning methods to study controlling shareholders in China from a more comprehensive perspective but also provides a useful incentive for bondholders to protect their interests.",
    "year": 2022,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "8d7d03760b175f63c7632bf1a0ac4bc2",
    "relevant_keywords": [
      "machine learning",
      "neural network",
      "backpropagation",
      "BP"
    ],
    "stage1_timestamp": "2025-05-15T00:45:39.134715"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用机器学习方法（GWO-BP神经网络）来预测公司债务违约风险，这直接涉及金融风险管理中的信用风险分析。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"该论文的核心技术是使用机器学习方法（GWO-BP神经网络）来预测公司债务违约风险，这直接涉及金融风险管理中的信用风险分析。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:29:25.571757"
}