{
  "paper": {
    "id": 2524,
    "title": "Credit Risk Evaluation Using a C-Variable Least Squares Support Vector Classification Model",
    "abstract": "Credit risk evaluation is one of the most important issues in financial risk management, In this paper, a C-variable least squares Support vector classification (C-VLSSVC) model is proposed for credit risk analysis. The main idea of this model is based oil the prior knowledge that different classes may have different importance for modeling and more weights should be given to those classes with more importance. The C-VLSSVC model can be constructed by a simple modification of the regularization parameter in LSSVC, whereby more weights are given to the lease squares classification errors with important classes than the lease squares classification errors with unimportant classes while keeping the regularized terms in its original form. For illustration purpose, a real-world credit dataset is used to test the effectiveness of the C-VLSSVC model.",
    "year": 2009,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "854f49c9dd7fb386ef5ef7e833964581",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM"
    ],
    "stage1_timestamp": "2025-05-15T02:16:32.595350"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on credit risk evaluation, which is a critical aspect of financial risk management. The proposed C-VLSSVC model is specifically designed for credit risk analysis, indicating its primary application in financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on credit risk evaluation, which is a critical aspect of financial risk management. The proposed C-VLSSVC model is specifically designed for credit risk analysis, indicating its primary application in financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:41:34.481325"
}