{
  "paper": {
    "id": 2280,
    "title": "Building a model to predict portfolio delinquency",
    "abstract": "There is a real and important need in the financial system, mainly in Colombia, to apply this type of default prediction models, because although the bank companies collect data and there is a human operation involved in the analysis of credit granting a tool is needed that allows a deeper vision of the analysis of the records and an evaluation that allows reliable decisions to be made. Although there will always be a risk and on many times, a late payment will happen it is very importantto be able to reduce it based on a model that performs an a priori evaluation. In addition to the need, it is found that there are several techniques that are usually used for this type of predictive models such as logistic regression, neural networks, decision trees, which, having a set of updated and truedata, give very reliable results that help to good management practices in the financial sector and a good classification of both new and existing clients that require a new credit granting.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "6671a12145996d33647f34350de47e5f",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "regression",
      "decision tree",
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T02:13:31.780975"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on building a model to predict portfolio delinquency, which is directly related to assessing and mitigating credit risk, a key aspect of financial risk management. The use of machine learning techniques for default prediction aligns with risk management practices in the financial sector.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on building a model to predict portfolio delinquency, which is directly related to assessing and mitigating credit risk, a key aspect of financial risk management. The use of machine learning techniques for default prediction aligns with risk management practices in the financial sector.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:43:20.623373"
}