{
  "paper": {
    "id": 3797,
    "title": "Multi-omics consensus portfolio to refine the classification of lung adenocarcinoma with prognostic stratification, tumor microenvironment, and unique sensitivity to first-line therapies",
    "abstract": "Background: Molecular classification of lung adenocarcinoma (LUAD) based on transcriptomic features has been widely studied. The complementarity of data obtained from multilayer molecular biology could help the LUAD classification via combining multi-omics information.Methods: We successfully divided samples from the The Cancer Genome Atlas (TCGA) (n=437) into four subtypes (CS1, CS2, CS3 and CS4) by 10 comprehensive multi-omics clustering methods in the movics R package. Meanwhile, external validation sets from different sequencing technologies proved the robustness of the grouping model. The relationship between subtypes, prognosis, molecular features, tumor microenvironment and response to first-line therapy was further analyzed. Next we used univariate Cox regression analysis and Lasso regression analysis to explore the application of biomarkers in clinical prognosis and constructed a prognostic model.Results: CS1 showed the worst overall survival (OS) among all four clusters, possibly related to its poor immune infiltration, higher tumor mutation and worse chromosomal stability. Patients in different subtypes differed significantly in cancer stem cell characteristics, activation of cancer-related pathways, sensitivity to chemotherapy and immunotherapy. The prognostic model showed good predictive performance. The 1-, 2-and 3-year areas under the curve of risk score were 0.779, 0.742 and 0.678, respectively. Seven genes (DKK1, TSPAN7, ID1, DLGAP5, HHIPL2, CD40 and SEMA3C) used to build the model may be potential therapeutic targets for LUAD. Conclusions: Four LUAD subtypes with different molecular characteristics and clinical implications were identified successfully through bioinformatic analysis. Our results may contribute to precision medicine and inform the development of rational clinical strategies for targeted and immune therapies.",
    "year": 2022,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "505ad79460a13e032fbdf9b8e8498520",
    "relevant_keywords": [
      "classification",
      "clustering",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:21:08.043503"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究肺癌腺癌的分子分类和预后模型构建，属于生物医学领域，未涉及任何金融研究领域的应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究肺癌腺癌的分子分类和预后模型构建，属于生物医学领域，未涉及任何金融研究领域的应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:08:49.068574"
}