{
  "paper": {
    "id": 1628,
    "title": "Research on Risk Assessment and Prediction of RMB Internationalization Based on the PCA-SA-BPNN Model",
    "abstract": "This paper combines principal component analysis, a BP neural network, and a simulated annealing algorithm, to construct a PCA-SA-BPNN risk forecast model to evaluate and predict the RMB internationalization risk status of China. First, we analyze the risk of RMB internationalization and its transmission mechanism from the perspective of the economic characteristics of neighboring countries and trading partner countries. Second, we use the FASP index system construction method for reference to construct a forecast index system for macro- and microrisks brought about by RMB internationalization. Then, the weight of each index is determined through index common degree analysis and principal component analysis, and the risk of RMB internationalization is divided. On this basis, the risks of RMB internationalization in China from 2000 to 2019 are divided into four categories. Based on the BP neural network algorithm optimized by the simulated degradation algorithm, the PCA-SA-BPNN model of RMB internationalization risk forecast is constructed. Finally, the validity of the model is verified by experimental verification, and the risk status of RMB internationalization in 2020 is simulated and predicted. The research results show that the risk status of RMB internationalization in 2020 is basically safe, and the risks of RMB internationalization mainly come from macroeconomic growth risks and systemic risks of the financial system.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "f673763dab99c01e9acb15a43bce6e7d",
    "relevant_keywords": [
      "neural network",
      "backpropagation",
      "BP",
      "principal components analysis"
    ],
    "stage1_timestamp": "2025-05-15T02:05:42.493536"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是构建一个PCA-SA-BPNN模型来评估和预测人民币国际化的风险状态，这直接涉及金融风险管理领域。论文的研究目标和实验设计都集中在风险分析和预测上，而不是衍生品定价或投资组合管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是构建一个PCA-SA-BPNN模型来评估和预测人民币国际化的风险状态，这直接涉及金融风险管理领域。论文的研究目标和实验设计都集中在风险分析和预测上，而不是衍生品定价或投资组合管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T14:23:36.699403"
}