{
  "paper": {
    "id": 1544,
    "title": "Stock Portfolio Management: Prediction of Risk using Text Classification",
    "abstract": "Decision making task utilizes different categorization techniques which have major contribution in building automated system capable to automate the decision for better organization and management of resources. The objective of this research is to assess the relative performance of some well-known classification methods for managing portfolio by predicting financial performance of a company on the basis of text documents. This approach is quite useful for managing portfolios on the basis of predicted risk category by framing the risk categorization task to assess company's financial outlook in the form of a classification problem. Availability of financial text information in electronic form and positive correlation between news reports on company's financial status make its classification a useful tool for investors to predict financial outlook of a company before investing their money in particular stock. Major contribution of classifier is that it enables to manage investor's portfolio. Among the proposed classification techniques combined naive bayes and K-NN (NBKNN) with bigrams and unigrams with Latent Semantic Analysis (LSA) approach for features extraction has high potential of classifying and predicting risk from available financial news. We developed a text classification algorithm that classifies financial news article by using a combination of a reduced but highly informative word feature sets and a variant of weighted majority algorithm. Short learning time is additional advantage of this technique resulted due to its computational efficiency along with relatively high accuracy. We measure the accuracy on precision basis and also do a comparative analysis of combined NBKNN with other classification techniques. The major contribution lies in developing new classification method and its application in portfolio management.",
    "year": 2010,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "6133d14547e2ebf558ea53c8978beaed",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM",
      "decision tree",
      "feature learning",
      "feature representation"
    ],
    "stage1_timestamp": "2025-05-15T02:04:20.108756"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是使用文本分类方法来预测公司财务表现和风险类别，目的是为了帮助投资者管理投资组合。论文明确提到其应用在于投资组合管理，而非衍生品定价或金融风险管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是使用文本分类方法来预测公司财务表现和风险类别，目的是为了帮助投资者管理投资组合。论文明确提到其应用在于投资组合管理，而非衍生品定价或金融风险管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:48:20.728418"
}