{
  "paper": {
    "id": 246,
    "title": "Ant colony algorithm for clustering in portfolio optimization",
    "abstract": "This research aims to describe portfolio optimization using clustering methods with ant colony approach. Two stock portfolios of LQ45 Indonesia is proposed based on the cluster results obtained from ant colony optimization (ACO). The first portfolio consists of assets with ant colony displacement opportunities beyond the defined probability limits of the researcher, where the weight of each asset is determined by mean-variance method. The second portfolio consists of two assets with the assumption that each asset is a cluster formed from ACO. The first portfolio has a better performance compared to the second portfolio seen from the Sharpe index.",
    "year": 2018,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "2c38b96e49f955a17857839b70e6e67e",
    "relevant_keywords": [
      "clustering",
      "unsupervised learning"
    ],
    "stage1_timestamp": "2025-05-15T00:41:04.728803"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "The paper focuses on optimizing stock portfolios using ant colony optimization (ACO) and clustering methods, specifically applied to the LQ45 Indonesia stock portfolio. The research aims to improve portfolio performance, as evidenced by the use of the Sharpe index to compare portfolio performance, which is a key aspect of portfolio management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Portfolio Management\"],\n  \"justification\": \"The paper focuses on optimizing stock portfolios using ant colony optimization (ACO) and clustering methods, specifically applied to the LQ45 Indonesia stock portfolio. The research aims to improve portfolio performance, as evidenced by the use of the Sharpe index to compare portfolio performance, which is a key aspect of portfolio management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:32:20.748601"
}