{
  "paper": {
    "id": 980,
    "title": "Simulation of autonomous resource allocation through deep reinforcement learning-based portfolio-project integration",
    "abstract": "Resource allocation has always been a critical challenge for construction project planning, and it affects the cost, duration, and quality of the projects. However, current methods mainly focus on a single project and lack integrated planning and optimization across a construction company's multiple projects. This paper describes a simulation of an Autonomous Resource Allocation (ARA) model using Deep Reinforcement Learning (DRL) agents and methods like Double Deep Q-Networks and combined experience replay to develop and test ARA algorithms based on data harvesting from the Internet of Things (IoT) devices. The results show that DRL can successfully perform ARA by capturing the complex interactions among resource allocation features, without needing retraining when situations change. It shows promising future possibilities for construction companies to improve resource utilization and project performance for larger and more complex construction projects.",
    "year": 2024,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "f237f1aced20155c1df1389f63321aa0",
    "relevant_keywords": [
      "machine learning",
      "reinforcement learning",
      "deep learning",
      "neural network",
      "representation learning",
      "deep belief network",
      "DBM",
      "restricted Boltzmann machine"
    ],
    "stage1_timestamp": "2025-05-15T00:50:08.790761"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是建筑项目中的资源分配问题，使用了深度强化学习技术，但其应用场景是建筑行业而非金融领域。虽然标题中提到了'portfolio-project integration'，但这里的'portfolio'指的是建筑项目的组合，而非金融投资组合。因此，该论文的核心技术与上述金融研究领域无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是建筑项目中的资源分配问题，使用了深度强化学习技术，但其应用场景是建筑行业而非金融领域。虽然标题中提到了'portfolio-project integration'，但这里的'portfolio'指的是建筑项目的组合，而非金融投资组合。因此，该论文的核心技术与上述金融研究领域无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:25:46.140617"
}