{
  "paper": {
    "id": 1246,
    "title": "A Six Sigma approach to predicting corporate defaults",
    "abstract": "The progression of a corporation from a status of financial stability into the status of financial distress usually happens over relatively large periods of time, raising the opportunity of identifying these 'falling' corporations ahead of time. Consequently, a critical risk management objective is to provide investment portfolio managers with an early notice of deteriorating financial status for a corporation. We consider a model built using equity inferred Probability of Default (PD) metrics. We follow a Design for Six Sigma Define, Measure, Analyze, Design, Verify (DMADV) approach to enhance the predictability power of the PD by constructing a two-dimensional risk space for estimating likelihood of default. We use such techniques as classification and regression tree (CART) analysis and logistic regression, and build a control plan using censored data analysis. We test our model on two actual portfolios. The potential savings revealed by these tests are significant, re-assuring us of the performance of our methodology. Copyright (c) 2005 John Wiley T Sons, Ltd.",
    "year": 2005,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "bfdf1f3273e62888fba9dda8f48644fa",
    "relevant_keywords": [
      "classification",
      "regression",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T02:00:30.594195"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk",
      "Portfolio Management"
    ],
    "justification": "The paper focuses on predicting corporate defaults using a Six Sigma approach and equity inferred Probability of Default (PD) metrics, which is directly related to financial risk management. Additionally, it mentions providing early notices to investment portfolio managers, indicating relevance to portfolio management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\", \"Portfolio Management\"],\n  \"justification\": \"The paper focuses on predicting corporate defaults using a Six Sigma approach and equity inferred Probability of Default (PD) metrics, which is directly related to financial risk management. Additionally, it mentions providing early notices to investment portfolio managers, indicating relevance to portfolio management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:50:34.652573"
}