{
  "paper": {
    "id": 2180,
    "title": "Drivers of risk correlation among financial institutions: A study based on a textual risk disclosure perspective",
    "abstract": "Risk correlation is an important feature of financial institutions and a source of systemic risk. Despite the importance of risk correlation, few studies have examined its mechanism. Based on 538,269 textual risk disclosures of 1,953 financial institutions during 2006-2020, this study uses text mining methods to identify the risks and construct risk disclosure similarity measurements to verify that financial institutions with similar risk disclosures have a stronger risk correlation. The channel analysis reveals that when different financial institutions disclose infective risks simultaneously, the market perceives their susceptibility to common factors, leading to a more pronounced left-tail dependence. Additionally, a cross-sectional analysis is conducted to explore the heterogeneity among different subsectors, suggesting that risk disclosure similarity within the same subsector is higher due to the peer effect. However, this heightened similarity tends to mitigate the positive impact of risk disclosure similarity on risk correlation. A two-stage regression analysis considering endogeneity supports the main findings.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "9d3e5ef9e0da6328fe2ddf27c453a140",
    "relevant_keywords": [
      "text mining",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:12:17.383944"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要研究金融机构之间的风险相关性及其机制，通过文本挖掘方法分析风险披露相似性对风险相关性的影响，这直接涉及金融风险管理领域的研究。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文主要研究金融机构之间的风险相关性及其机制，通过文本挖掘方法分析风险披露相似性对风险相关性的影响，这直接涉及金融风险管理领域的研究。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:44:03.197119"
}