{
  "paper": {
    "id": 637,
    "title": "Factors that Impact the Accuracy of Clustering-Based Load Forecasting",
    "abstract": "Due to the deregulation of the power system, the electric power industry is undergoing a transformation in terms of its planning and operation strategies. Because of the importance in reducing financial and operational risk, improving load forecasting accuracy is paramount. In some load forecasting applications, K-means clustering is used to group customers prior to forecasting. This method has been shown to improve the accuracy of load predictions. However, there are situations where K-means clustering reduces load forecasting accuracy. This paper studies the factors that affect the performance of K-means clustering. Additionally, several strategies have been proposed to tackle the lower estimation accuracy problems for this clustering algorithm. The data used for validating the proposed strategies associated with the factors is from the Consolidated Edison Company of New York, Inc. (Con Edison). The mean absolute percent error and relative mean square error are utilized to evaluate the forecasting results of K-means-based least squares support vector machines (LS-SVM) and preprocessed K-means-based LS-SVM. Additionally, the outperformance of preprocessed K-means-based LS-SVM is demonstrated via the data results.",
    "year": 2016,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "8b9711f6aa308f8fac2b386576726b9c",
    "relevant_keywords": [
      "machine learning",
      "unsupervised learning",
      "clustering",
      "support vector machine",
      "SVM"
    ],
    "stage1_timestamp": "2025-05-15T01:53:24.865525"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究电力负荷预测中的聚类算法性能及其改进策略，虽然提到了减少财务和运营风险，但其核心技术和应用场景属于电力系统运营优化，并未明确指出其在衍生品定价、金融风险管理或投资组合管理等金融领域的应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究电力负荷预测中的聚类算法性能及其改进策略，虽然提到了减少财务和运营风险，但其核心技术和应用场景属于电力系统运营优化，并未明确指出其在衍生品定价、金融风险管理或投资组合管理等金融领域的应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:56:16.168278"
}