{
  "paper": {
    "id": 1339,
    "title": "The Selection of Industry 4.0 Technologies Through Bayesian Networks: An Operational Perspective",
    "abstract": "Many manufacturing firms today are considering whether to adopt one or more technologies associated with the Industry 4.0 vision. Yet, neither academic nor practitioner literature provide much guidance about these technology choices. This article aims at understanding how Industry 4.0 (I4.0) technologies can impact operational performance and at discovering possible synergies among I4.0 technologies. More specifically, the research seeks to analyze the full network of relationships between I4.0 technologies and operational performance, assess the impact of single technologies on performance, construct portfolios of technologies depending on the firms' operational targets, and identify possible operational improvements to achieve by adjusting a portfolio of I4.0 technologies. To pursue these research goals, we use a Bayesian network and machine-learning algorithms to drive firms' investment decisions based on I4.0 technologies. The analysis has been conducted on a sample of 289 Italian manufacturing firms and companies that provide services directly related to manufacturing activities. Our findings provide managerial insights and intuitions to improve operational performance by either adopting single I4.0 technologies or creating an ad hoc portfolio of technologies.",
    "year": 2024,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "512879f9977fd802d747304c87c940c5",
    "relevant_keywords": [
      "machine learning"
    ],
    "stage1_timestamp": "2025-05-15T00:54:24.744955"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究如何通过贝叶斯网络和机器学习算法来选择工业4.0技术以提升运营绩效，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究如何通过贝叶斯网络和机器学习算法来选择工业4.0技术以提升运营绩效，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:21:40.341907"
}