{
  "paper": {
    "id": 3301,
    "title": "Hierarchical structure of Turkey's foreign trade",
    "abstract": "We examine the hierarchical structures of Turkey's foreign trade by using real prices of their commodity export and import move together over time. We obtain the topological properties among the countries based on Turkey's foreign trade during the 1996-2010 period by using the concept of hierarchical structure methods (minimal spanning tree, (MST) and hierarchical tree, (HT)). These periods are divided into two subperiods, such as 1996-2002 and 2003-2010, in order to test various time-window and observe the temporal evolution. We perform the bootstrap techniques to investigate a value of the statistical reliability to the links of the MSTs and HTs. We also use a clustering linkage procedure in order to observe the cluster structure much better. From the structural topologies of these trees, we identify different clusters of countries according to their geographical location and economic ties. Our results show that the DE (Germany), UK (United Kingdom), FR (France), IT (Italy) and RU (Russia) are more important within the network, due to a tighter connection with other countries. We have also found that these countries play a significant role for Turkey's foreign trade and have important implications for the design of portfolio and investment strategies. (c) 2011 Elsevier B.V. All rights reserved.",
    "year": 2011,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "b38b53c51ae68151a796bc39e259df71",
    "relevant_keywords": [
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T01:15:54.709839"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文通过分析土耳其的外贸网络结构，识别出关键国家及其在经济网络中的重要性，并明确指出这些发现对投资组合和投资策略的设计具有重要意义。这直接关联到投资组合管理领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文通过分析土耳其的外贸网络结构，识别出关键国家及其在经济网络中的重要性，并明确指出这些发现对投资组合和投资策略的设计具有重要意义。这直接关联到投资组合管理领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:10:12.686773"
}