{
  "paper": {
    "id": 737,
    "title": "Financial Risk Early Warning Model of Listed Companies Under Rough Set Theory Using BPNN",
    "abstract": "In order to reduce the risk of enterprise management, the financial risk early warning methods of listed companies are mainly studied. The financial risk characteristics of listed companies are analysed. With the help of rough set theory, the financial risk indicators are selected, and the financial risk early warning index system is established. The financial risk early warning model is constructed by using back propagation neural network (BPNN) algorithm based on deep learning. Finally, the accuracy and feasibility of the constructed neural network model are verified. The results show that rough set theory can be used to screen financial risk indicators and select important indicators, which can simplify the data and reduce the complexity of calculation. BPNN can calculate the simplified data and identify and evaluate the financial risk. Empirical analysis shows that the proposed method can shorten the training time of the model to a certain extent and improve the accuracy of financial risk prediction.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "2681046dc6bbfc137632a0e71a610865",
    "relevant_keywords": [
      "machine learning",
      "neural network",
      "deep learning",
      "backpropagation",
      "BP",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T01:54:34.044555"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on constructing a financial risk early warning model for listed companies using rough set theory and BPNN, which is directly related to identifying and evaluating financial risks, a core aspect of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on constructing a financial risk early warning model for listed companies using rough set theory and BPNN, which is directly related to identifying and evaluating financial risks, a core aspect of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:55:25.576086"
}