{
  "paper": {
    "id": 3339,
    "title": "The global risk trinity of hydrocarbon economies: Evidence from the method of moments quantile regression",
    "abstract": "This paper addresses the critical requirement to understand how global political and economic trends affect stock market dynamics in the Gulf Cooperation Council (GCC) region. Prompted by the region's economic dependency on oil and the growing integration of GCC markets into global financial systems, it investigates the impact of three global risk factors on both Islamic and conventional stock markets in the GCC: financial risk (US CDS and global interest rate volatility), commodity price risk (oil price volatility), and political risk (global geopolitical risk). The present research adopts the method of moments quantile regression to assess the asymmetrical effects of these risks across various market conditions from 2011 to 2021. The findings show significant disparities in stock market responses to global risks in bearish, bullish, and normal states, highlighting the nuances of market dynamics in the GCC. In the face of rising global hazards, Islamic assets may provide potential for portfolio diversification. Policy recommendations emphasize the necessity of incorporating global risk variables into investment strategies to reduce volatility and improve market stability in the GCC.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "a7d216965d67d6642ce6b3aa09043fe0",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:25:13.716040"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk",
      "Portfolio Management"
    ],
    "justification": "该论文研究了全球风险因素对海湾合作委员会（GCC）地区股票市场的影响，并探讨了伊斯兰资产在投资组合多样化中的潜力。这直接涉及金融风险管理和投资组合管理领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\", \"投资组合管理\"],\n  \"justification\": \"该论文研究了全球风险因素对海湾合作委员会（GCC）地区股票市场的影响，并探讨了伊斯兰资产在投资组合多样化中的潜力。这直接涉及金融风险管理和投资组合管理领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:36:51.770400"
}