{
  "paper": {
    "id": 2586,
    "title": "Machine learning, knowledge risk, and principal-agent problems in automated trading",
    "abstract": "Present-day securities trading is dominated by fully automated algorithms. These algorithmic systems are characterized by particular forms of knowledge risk (adverse effects relating to the use or absence of certain forms of knowledge) and principal-agent problems (goal conflicts and information asymmetries arising from the delegation of decision-making authority). Where automated trading systems used to be based on human-defined rules, increasingly, machine-learning (ML) techniques are being adopted to produce machine-generated strategies. Drawing on 213 interviews with market participants involved in automated trading, this study compares the forms of knowledge risk and principal-agent relations characterizing both human-defined and ML-based automated trading systems. It demonstrates that certain forms of ML-based automated trading lead to a change in knowledge risks, particularly concerning dramatically changing market settings, and that they are characterized by a lack of insight into how and why trading rules are being produced by the ML systems. This not only intensifies but also reconfigures principal-agent problems in financial markets.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "19e3fffb2196f04424bcc878d179669b",
    "relevant_keywords": [
      "machine learning",
      "neural network",
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T02:17:01.683864"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要探讨了自动化交易系统中机器学习应用带来的知识风险和委托代理问题，并未明确指出其核心技术应用于衍生品定价、金融风险管理或投资组合管理等特定金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要探讨了自动化交易系统中机器学习应用带来的知识风险和委托代理问题，并未明确指出其核心技术应用于衍生品定价、金融风险管理或投资组合管理等特定金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:41:08.671842"
}