{
  "paper": {
    "id": 3427,
    "title": "Digital health technologies for high-risk pregnancy management: three case studies using Digilego framework",
    "abstract": "Objective: High-risk pregnancy (HRP) conditions such as gestational diabetes mellitus (GDM), hypertension (HTN), and peripartum depression (PPD) affect maternal and neonatal health. Patient engagement is critical for effective HRP management (HRPM). While digital technologies and analytics hold promise, emerging research indicates limited and suboptimal support offered by the highly prevalent pregnancy digital solutions within the commercial marketplace. In this article, we describe our efforts to develop a portfolio of digital products leveraging advances in social computing, data science, and digital health. Methods: We describe three studies that leverage core methods from Digilego digital health development framework to (1) conduct large-scale social media analysis (n = 55 301 posts) to understand population-level patterns in women's needs, (2) architect a digital repository to enable women curate HRP related information, and (3) develop a digital platform to support PPD prevention. We applied a combination of qualitative coding, machine learning, theory-mapping, and programmatic implementation of theory-linked digital features. Further, we conducted preliminary testing of the resulting products for acceptance with sample of pregnant women for GDM/HTN information management (n = 10) and PPD prevention (n = 30). Results: Scalable social computing models using deep learning classifiers with reasonable accuracy have allowed us to capture and examine psychosociobehavioral drivers associated with HRPM. Our work resulted in two digital health solutions, MyPregnancyChart and MomMind are developed. Initial evaluation of both tools indicates positive acceptance from potential end users. Further evaluation with MomMind revealed statistically significant improvements (P < .05) in PPD recognition and knowledge on how to seek PPD information. Discussion: Digilego framework provides an integrative methodological lens to gain micro-macro perspective on women's needs, theory integration, engagement optimization, as well as subsequent feature and content engineering, which can be organized into core and specialized digital pathways for women engagement in disease management. Conclusion: Future works should focus on implementation and testing of digital solutions that facilitate women to capture, aggregate, preserve, and utilize, otherwise siloed, prenatal information artifacts for enhanced self-management of their high-risk conditions, ultimately leading to improved health outcomes.",
    "year": 2024,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "590085ecf9e90c6939296db86d0e0ddc",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "classification"
    ],
    "stage1_timestamp": "2025-05-15T01:16:55.563444"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究数字健康技术在管理高风险妊娠中的应用，包括社交媒体分析、数字健康解决方案的开发等，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究数字健康技术在管理高风险妊娠中的应用，包括社交媒体分析、数字健康解决方案的开发等，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:09:45.644708"
}