{
  "paper": {
    "id": 8660,
    "title": "A Sentiment-Aware Trading Volume Prediction Model for P2P Market Using LSTM",
    "abstract": "With the development of Internet lending, the use of peer-to-peer (P2P) as a new financial credit model has been increasing in China. However, this rapid development has led to a major potential risk. A few P2P enterprises operate well in the beginning but close within a short period because of the suspension of business, fraud, illegal fundraising, and blind expansion. Effective supervision of the P2P industry is an urgent problem. Trading volume reflects the operation stability of P2P platforms. Hence, predicting the volume of the P2P market is an important research topic. This paper first analyzes the trading data of a P2P platform. It is found that the sentiment of investor comments is related to the trading volume of the P2P platform. Then, we use the TextCNN model to classify the sentiment of investor comments and obtain the time series of changes in sentiment. It is verified that the time series of change in sentiment and the P2P volume index has statistical causality and a strong correlation. This paper proposes a model that uses the trend of change in investor sentiment to predict P2P trading volume. This model uses the historical time series change in investor sentiment, the P2P volume index, and WeekDay characteristics to predict future P2P trading volume. The experimental results show that the proposed model is better than a few existing baseline methods. Compared with baseline regression, the Pearson coefficient of the predicted and actual values of the proposed model is increased by 13.26%, the mean squared error is decreased by 27.62%, and the R-squared value is increased by 28.48%.",
    "year": 2019,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "148cf695b8123d1b98e8ad314f7ebede",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "classification",
      "regression",
      "neural network",
      "convolutional neural network",
      "CNN",
      "long short-term memory",
      "LSTM"
    ],
    "stage1_timestamp": "2025-05-15T03:20:56.008778"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究使用情感分析和LSTM模型预测P2P市场的交易量，虽然涉及金融领域，但并未直接应用于衍生品定价、金融风险管理或投资组合管理等特定领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究使用情感分析和LSTM模型预测P2P市场的交易量，虽然涉及金融领域，但并未直接应用于衍生品定价、金融风险管理或投资组合管理等特定领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:25:35.811171"
}