{
  "paper": {
    "id": 2683,
    "title": "A multi-agent virtual market model for generalization in reinforcement learning based trading strategies",
    "abstract": "Many studies have successfully used reinforcement learning (RL) to train an intelligent agent that learns profitable trading strategies from financial market data. Most of RL trading studies have simplified the effect of the actions of the trading agent on the market state. The trading agent is trained to maximize long-term profit by optimizing fixed historical data. However, such approach frequently results in the trading performance during out-of-sample validation being considerably different from that during training. In this paper, we propose a multi-agent virtual market model (MVMM) comprised of multiple generative adversarial networks (GANs) which cooperate with each other to reproduce market price changes. In addition, the action of the trading agent can be superimposed on the current state as the input of the MVMM to generate an action-dependent next state. In this research, real historical data were replaced with the simulated market data generated by the MVMM. The experimental results indicated that the trading strategy of the trained RL agent achieved a 12% higher profit and exhibited low risk of loss in the 2019 China Shanghai Shenzhen 300 stock index futures backtest.(c) 2023 Elsevier B.V. All rights reserved.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "20df4345fb11f8f07512cf3b9114360a",
    "relevant_keywords": [
      "machine learning",
      "reinforcement learning",
      "deep learning",
      "neural network",
      "generative adversarial networks",
      "GANs"
    ],
    "stage1_timestamp": "2025-05-15T02:18:06.170818"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是使用多智能体虚拟市场模型（MVMM）和强化学习（RL）来训练交易策略，以提高利润并降低损失风险。这直接关联到投资组合管理领域，因为其目标是优化交易策略以实现更好的投资回报和风险管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是使用多智能体虚拟市场模型（MVMM）和强化学习（RL）来训练交易策略，以提高利润并降低损失风险。这直接关联到投资组合管理领域，因为其目标是优化交易策略以实现更好的投资回报和风险管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:40:39.235464"
}