{
  "paper": {
    "id": 1606,
    "title": "RATING FOR ASSESSMENT OF CREDIT UNIONS: AN APPLICATION OF THE PEARLS MODEL",
    "abstract": "As other financial organizations, to perform their activities credit unions carry out loans and intermediation operations, offering credit risk to other agents. The goal of this paper is to present a rating model for assessment of credit unions. It was used financial data available through the COSIF system of Central Bank of Brazil, the PEARLS model of economic-financial assessment and the classification methodology of the Brazilian Guarantee Fund for Credit Unions (FGCOOP). The rating model was estimated through multinomial logistic regression. The total accuracy was 80.1%. With the model results and considering its high accuracy degree, it is possible to verify that the use of PEARLS model allowed the development of a model for monitoring the risks that credit unions represent to financial market. The achieved rating model is simple and has a practical relevance to agents. The academic relevance is related to the methodology for economic-financial assessment of credit unions which can be a reference for future studies. Moreover, the relevance is highlighted due to lack of studies on ratings to assess financial firms in Brazil.",
    "year": 2020,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "0b902daa3d2e9b9c39895b35c8cc4dcb",
    "relevant_keywords": [
      "classification",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:05:08.277781"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on developing a rating model for assessing credit unions using the PEARLS model and multinomial logistic regression, which is aimed at monitoring the risks that credit unions represent to the financial market. This clearly falls under the domain of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on developing a rating model for assessing credit unions using the PEARLS model and multinomial logistic regression, which is aimed at monitoring the risks that credit unions represent to the financial market. This clearly falls under the domain of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:47:55.245835"
}