{
  "paper": {
    "id": 1684,
    "title": "Machine Learning and Process Mining applied to Process Optimization: Bibliometric and Systemic Analysis",
    "abstract": "The highly competitive business environment has been increasing with the advent of Industry 4.0, since the fast-changing market requirements need rapid decision-making to improve productivity. Hence, the smart factory has been highlighted as a digitized and connected production facility, which can use and combine data analytics and artificial intelligence algorithms and techniques to manage and eliminate failures in advance by accurate prediction. Thus, the purpose of this study is to identify the unfilled gaps and the opportunities regarding machine learning and process mining applied to process optimization, through a literature review based on the last five years of study. In order to accomplish these goals, the current study was based on the Knowledge Development Process - Constructivist (ProKnow-C) methodology. Firstly, a bibliographic portfolio was created through Articles Selection and Filters Application. This found that, from 3562 published articles across five databases between 2014 and 2018, only 32 articles relating to the topic were relevant. Secondly, the bibliometric analysis allowed the interpretation and the evaluation of the bibliographic portfolio regarding its impact factor, the scientific recognition of the articles, the publishing year and the highlighted authors. Thirdly, the systemic analysis carried out thorough reading of all selected articles to identify the main researched problems, the proposed goals and resources, the unfilled gaps and the opportunities. (C) 2019 The Authors. Published by Elsevier B.V.",
    "year": 2019,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "68180594f3e837db646a2d76795fa929",
    "relevant_keywords": [
      "machine learning"
    ],
    "stage1_timestamp": "2025-05-15T00:58:18.413823"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究机器学习和过程挖掘在过程优化中的应用，并未提及任何与衍生品定价、金融风险管理或投资组合管理相关的具体应用场景或研究目标。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究机器学习和过程挖掘在过程优化中的应用，并未提及任何与衍生品定价、金融风险管理或投资组合管理相关的具体应用场景或研究目标。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:19:35.581436"
}