{
  "paper": {
    "id": 1843,
    "title": "Predicting Student Enrolments and Attrition Patterns in Higher Educational Institutions using Machine Learning",
    "abstract": "In higher educational institutions, student enrollment management and increasing student retention are fundamental performance metrics to academic and financial sustainability. In many educational institutions, high student attrition rates are due to a variety of circumstances, including demographic and personal factors such as age, gender, academic background, financial abilities, and academic degree of choice. In this study, we will make use of machine learning approaches to develop prediction models that can predict student enrollment behavior and the students who have a high risk of dropping out. This can help higher education institutions develop proper intervention plans to reduce attrition rates and increase the probability of student academic success. In this study, real data is taken from Abu Dhabi School of Management (ADSM) in the UAE. This data is used in developing the student enrollment model and identifying the student's characteristics who are willing to enroll in a specific program, in addition to that, this research managed to find out the characteristics of the students who are under the risk of dropout.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "447da235adca40015b7bff06e88075c6",
    "relevant_keywords": [
      "machine learning",
      "classification",
      "regression",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T02:08:03.965132"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究使用机器学习预测学生入学和辍学行为，应用于教育管理领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究使用机器学习预测学生入学和辍学行为，应用于教育管理领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:45:53.772909"
}