{
  "paper": {
    "id": 4019,
    "title": "Solvency prediction for small and medium enterprises in banking",
    "abstract": "This paper describes novel approaches to predict default for SMEs. Multivariate outlier detection techniques based on Local Outlier Factor are proposed to improve the out of sample performance of parametric and non-parametric models for credit risk estimation. The models are tested on a real data set provided by UniCredit Bank. The results at hand confirm that our proposal improves the results in terms of predictive capability and support financial institutions to make decision. Single and ensemble models are compared and in particular, inside parametric models, the generalized extreme value regression model is proposed as a suitable competitor of the logistic regression. (C) 2017 Elsevier B.V. All rights reserved.",
    "year": 2017,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "0db7584a588e0889327410f78c6092a3",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "regression",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T02:32:27.433886"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on predicting default for SMEs using machine learning techniques, which is directly related to credit risk assessment—a key aspect of financial risk management. The study's application to banking and financial decision-making further supports this classification.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on predicting default for SMEs using machine learning techniques, which is directly related to credit risk assessment—a key aspect of financial risk management. The study's application to banking and financial decision-making further supports this classification.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:34:41.674774"
}