{
  "paper": {
    "id": 2259,
    "title": "SF-Transformer: A Mutual Information-Enhanced Transformer Model with Spot-Forward Parity for Forecasting Long-Term Chinese Stock Index Futures Prices",
    "abstract": "The complexity in stock index futures markets, influenced by the intricate interplay of human behavior, is characterized as nonlinearity and dynamism, contributing to significant uncertainty in long-term price forecasting. While machine learning models have demonstrated their efficacy in stock price forecasting, they rely solely on historical price data, which, given the inherent volatility and dynamic nature of financial markets, are insufficient to address the complexity and uncertainty in long-term forecasting due to the limited connection between historical and forecasting prices. This paper introduces a pioneering approach that integrates financial theory with advanced deep learning methods to enhance predictive accuracy and risk management in China's stock index futures market. The SF-Transformer model, combining spot-forward parity and the Transformer model, is proposed to improve forecasting accuracy across short and long-term horizons. Formulated upon the arbitrage-free futures pricing model, the spot-forward parity model offers variables such as stock index price, risk-free rate, and stock index dividend yield for forecasting. Our insight is that the mutual information generated by these variables has the potential to significantly reduce uncertainty in long-term forecasting. A case study on predicting major stock index futures prices in China demonstrates the superiority of the SF-Transformer model over models based on LSTM, MLP, and the stock index futures arbitrage-free pricing model, covering both short and long-term forecasting up to 28 days. Unlike existing machine learning models, the Transformer processes entire time series concurrently, leveraging its attention mechanism to discern intricate dependencies and capture long-range relationships, thereby offering a holistic understanding of time series data. An enhancement of mutual information is observed after introducing spot-forward parity in the forecasting. The variation of mutual information and ablation study results highlights the significant contributions of spot-forward parity, particularly to the long-term forecasting. Overall, these findings highlight the SF-Transformer model's efficacy in leveraging spot-forward parity for reducing uncertainty and advancing robust and comprehensive approaches in long-term stock index futures price forecasting.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "b9fbfd8b3097410b5d075ae34d28e163",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "neural network",
      "long short-term memory",
      "LSTM",
      "attention mechanism",
      "Transformer"
    ],
    "stage1_timestamp": "2025-05-15T02:12:51.098333"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Derivatives Pricing"
    ],
    "justification": "该论文的核心技术SF-Transformer模型结合了spot-forward parity和Transformer模型，主要用于预测中国股指期货的长期价格。股指期货是金融衍生品的一种，而论文中提到的arbitrage-free futures pricing model和spot-forward parity模型都是衍生品定价的理论基础。因此，该论文的主要应用领域是衍生品定价。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"衍生品定价\"],\n  \"justification\": \"该论文的核心技术SF-Transformer模型结合了spot-forward parity和Transformer模型，主要用于预测中国股指期货的长期价格。股指期货是金融衍生品的一种，而论文中提到的arbitrage-free futures pricing model和spot-forward parity模型都是衍生品定价的理论基础。因此，该论文的主要应用领域是衍生品定价。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:43:39.568072"
}