{
  "paper": {
    "id": 973,
    "title": "Evolution of Credit Risk Management Models for Business Loans: A Systematic Literature Review",
    "abstract": "A robust Credit Risk Management (CRM) framework is a pre-requisite for success of banics. The recent focus on recognition and management of Non Performing Assets has necessitated the use of sophisticated credit risk analysis models for banks. CRM models adequately capture and quantify the credit risk inherent in a loan proposal. This paper studies the evolution of such CRM models using a systematic literature review approach. It intends to present effective and time tested CRM models for the use by banks for managing their credit risk. The study is primarily divided into three important time horizons. In the pre 1800 era, subjective methods were used, as banking mostly remained in close circles. From late 1800s till 1950s, CRM models used univariate models to assess credit risk. These models used standalone figures such as past and projected figures of Sales, Profit and Cash Flow to assess credit nik. From late 1950s to early 2000s, CRM models based on multivariate models were developed and used. These models used key financial and industry ratios, regression, logit and probit models etc. to quantify the credit risk and estimate probability of default. Altman's Z score, Emerging Market Scoring Model, Wilcox's risk of ruin were some of the prominent multivariate models developed and used during this period. From the year 2000 onwards the focus shifted to Artificial Intelligence, Machine Learning and Neural Network based models. These models acquired the capacity to process voluminous data to arrive at predictions about default Parallel to these financial models, the regulatory evolution part of this paper traces the evolution of regulations from late 1970s in the form of BASEL accords and Reserve Bank of India's Master Circulars and Guidance Notes issued from time to time. Using systematic literature review, this paper delves into the evolution of the models and practices adopted by lenders for containment of credit risk. The literature referred and cited in this paper are mostly the seminal work of many pioneers of bankruptcy prediction such as Edward Altman and Wilcox etc. The major findings of this paper are that a combination. of multivariate and Al based models should be used by the banks in current times for identifying the risk inherent in a loan proposal and assessing the probability of default. This could save the banks from making adverse selection of borrowers and improve quality of credit.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "4d6ab08609875babe9733005d672be70",
    "relevant_keywords": [
      "machine learning",
      "neural network",
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T01:57:29.821702"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on the evolution of Credit Risk Management (CRM) models for business loans, which is a core aspect of financial risk management. It discusses various models and techniques used to assess and quantify credit risk, including machine learning and neural networks, with the primary goal of managing and mitigating credit risk in banking.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on the evolution of Credit Risk Management (CRM) models for business loans, which is a core aspect of financial risk management. It discusses various models and techniques used to assess and quantify credit risk, including machine learning and neural networks, with the primary goal of managing and mitigating credit risk in banking.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:53:04.924151"
}