{
  "paper": {
    "id": 1735,
    "title": "Financial distress and bankruptcy prediction among listed companies using accounting, market and macroeconomic variables",
    "abstract": "Using a sample of 23,218 company-year observations of listed companies during the period 1980-2011, the paper investigates empirically the utility of combining accounting, market-based and macro-economic data to explain corporate credit risk. The paper develops risk models for listed companies that predict financial distress and bankruptcy. The estimated models use a combination of accounting data, stock market information and proxies for changes in the macro-economic environment. The purpose is to produce models with predictive accuracy, practical value and macro dependent dynamics that have relevance for stress testing. The results show the utility of combining accounting, market and macro-economic data in financial distress prediction models for listed companies. The performance of the estimated models is benchmarked against models built using a neural network (MLP) and against Altman's (1968) original Z-score specification. (C) 2013 Elsevier Inc. All rights reserved.",
    "year": 2013,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "af6a818ab3b26d6e1fa91a7b236b3b87",
    "relevant_keywords": [
      "neural network",
      "classification"
    ],
    "stage1_timestamp": "2025-05-15T02:06:52.684208"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on developing models to predict financial distress and bankruptcy, which are key aspects of credit risk management, a subfield of financial risk management. The use of accounting, market, and macroeconomic variables to build predictive models aligns with risk assessment practices in financial institutions.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on developing models to predict financial distress and bankruptcy, which are key aspects of credit risk management, a subfield of financial risk management. The use of accounting, market, and macroeconomic variables to build predictive models aligns with risk assessment practices in financial institutions.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:46:56.305649"
}