{
  "paper": {
    "id": 4149,
    "title": "Applying Utility Theory to Improve Performance of Fuzzy Decision Support Systems for Personal Financial Planning",
    "abstract": "Personal financial planning has conventionally been done by the human experts following modern portfolio theory and its variants. Recent studies have tested fuzzy systems to mimic this complex and ambiguous process, using the investor's demographic and financial information as inputs. In parallel, there has been behavioral finance studies to assess risk tolerance of individuals based on similar inputs. However, there have been limited attempts to synergize these paradigms. This study focused on combining the two approaches to improve investment allocation performance over modern portfolio theory-based benchmarks. Specifically, Utility theory of money was applied to create risk tolerance profiles using risk scores. Two fuzzy systems using two approaches of risk scoring were developed for investment allocation across four asset classes. Expert recommended allocations, collected through a survey, formed the gold standard for system performance validation. Both systems outperformed the benchmark. The hybrid system with a regression-based convergence module and 4 fuzzy subsystems performed the best. It had a mean absolute deviation of 7.7% and an average rank correlation of 0.52 with expert recommendations. However, the system was more conservative than human experts in most cases. Future studies should test the effect of optimized ruleset selection in addressing this issue.",
    "year": 2019,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "a654223448bfc56633b3741614e25d02",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:33:42.100729"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文主要研究如何结合效用理论和模糊决策支持系统来改进个人财务规划中的投资分配性能，这直接涉及投资组合管理的核心问题。论文明确提到使用现代投资组合理论作为基准，并开发了模糊系统来进行资产类别间的投资分配，这些都是投资组合管理的典型应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文主要研究如何结合效用理论和模糊决策支持系统来改进个人财务规划中的投资分配性能，这直接涉及投资组合管理的核心问题。论文明确提到使用现代投资组合理论作为基准，并开发了模糊系统来进行资产类别间的投资分配，这些都是投资组合管理的典型应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:33:53.597640"
}