{
  "paper": {
    "id": 913,
    "title": "A Hybrid Model of AdaBoost and Back-Propagation Neural Network for Credit Scoring",
    "abstract": "Owing to the development of internet finance in China, credit scoring is growing into one of the most important issues in the field of financial risk management. Quantitative credit scoring models are widely used tools for credit risk assessment in financial institutions. In this study, an AdaBoost algorithm model based on back-propagation neural network for credit scoring with high accuracy and efficiency is proposed. We first illustrate the basic concepts of back-propagation neural network and AdaBoost algorithm and propose a hybrid model of AdaBoost and back-propagation neural network, then two real-world credit data sets are selected to demonstrate the effectiveness and feasibility of the proposed model. The results show that the proposed model can get higher accuracy compared to other classifiers listed in this study.",
    "year": 2018,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "66fb8dbbb6e3f2e819d281e195ec1ca1",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "neural network",
      "backpropagation",
      "BP",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T01:56:49.532105"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on developing a hybrid model for credit scoring, which is a critical tool in assessing credit risk, a key aspect of financial risk management. The study explicitly mentions its relevance to financial risk management in the context of internet finance in China.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on developing a hybrid model for credit scoring, which is a critical tool in assessing credit risk, a key aspect of financial risk management. The study explicitly mentions its relevance to financial risk management in the context of internet finance in China.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:53:52.767248"
}