{
  "paper": {
    "id": 712,
    "title": "Machine Learning Based Stock Market Analysis: A Short Survey",
    "abstract": "Finance is one of the pioneering industries that started using Machine Learning (ML), a subset of Artificial Intelligence (AI) in the early 80s for market prediction. Since then, major firms and hedge funds have adopted machine learning for stock prediction, portfolio optimization, credit lending, stock betting, etc. In this paper, we survey all the different approaches of machine learning that can be incorporated in applied finance. The major motivation behind ML is to draw out the specifics from the available data from different sources and to forecast from it. Different machine learning algorithms has their abilities for predictions and are heavily depended on the number and quality of parameters as input features. This work attempts to provide an extensive and objective walkthrough in the direction of applicability of the machine learning algorithms for financial or stock market prediction.",
    "year": 2020,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "defb46903a8f3e4faa7c5545b23cc5e7",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "unsupervised learning",
      "reinforcement learning",
      "classification",
      "regression",
      "support vector machine",
      "SVM",
      "decision tree",
      "clustering",
      "principal components analysis",
      "feature learning",
      "feature representation",
      "neural network",
      "deep learning",
      "representation learning",
      "backpropagation",
      "BP",
      "rectified linear unit",
      "ReLU",
      "sigmoid",
      "tanh",
      "hidden layer",
      "convolutional neural network",
      "CNN",
      "recurrent neural network",
      "long short-term memory",
      "LSTM",
      "autoencoder",
      "denoising autoencoder",
      "dropout regularization"
    ],
    "stage1_timestamp": "2025-05-15T00:47:18.526612"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的摘要明确提到了机器学习在股票预测和投资组合优化中的应用，这属于投资组合管理的范畴。虽然论文也提到了其他金融应用，但投资组合管理是其核心技术应用的主要领域之一。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的摘要明确提到了机器学习在股票预测和投资组合优化中的应用，这属于投资组合管理的范畴。虽然论文也提到了其他金融应用，但投资组合管理是其核心技术应用的主要领域之一。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:28:25.553168"
}