{
  "paper": {
    "id": 3446,
    "title": "Where to go? Visualization of cryptocurrency research trends based on scientometrics",
    "abstract": "This study presents an in-depth analysis of the progression, focal points, and emerging areas in cryptocurrency research spanning from 2014 to 2022. By utilizing the JCR-based classification map within CiteSpace software, we charted the evolutionary trajectory of knowledge in the realm of cryptocurrency research. The nucleus of fundamental knowledge emerged predominantly within the domains of mathematics and economics. To further discern the prevailing research trends, we conducted a comprehensive analysis of keyword co-occurrences utilizing the same software. This analysis spotlighted six key research hotspots: safe haven, blockchain, market efficiency, deep learning, portfolio management, and financial regulation. Additionally, to gauge the research frontiers, we scrutinized the strength of keyword bursts. This exploration identified 23 evolving keywords, segregated into two distinct phases: the initial phase (2014-2017) characterized by keywords tied to Bitcoin, followed by the subsequent phase (2017-2022) marked by keywords linked to blockchain technology and financial regulation. In sum, this investigation furnishes invaluable insights into the trajectories and trajectories of cryptocurrency research, thereby serving as a compass to steer future explorations in this dynamic field.",
    "year": 2023,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "fd6f2edf02fbf666254a6a50e6cd8a74",
    "relevant_keywords": [
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T01:17:25.417174"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "论文摘要中明确提到'portfolio management'作为研究热点之一，表明该论文的核心技术或研究成果主要应用于投资组合管理领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"论文摘要中明确提到'portfolio management'作为研究热点之一，表明该论文的核心技术或研究成果主要应用于投资组合管理领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:09:43.517168"
}