{
  "paper": {
    "id": 1416,
    "title": "Why has the equal weight portfolio underperformed and what can we do about it?",
    "abstract": "It is widely noted that market capitalisation weighted portfolios are inefficient and underperform an equal weighted portfolio over the long-term. However, at least since 2016, an equal weighted portfolio of stocks in the S&P500 has significantly underperformed the market capitalisation weighted portfolio. In this paper, we analyse this underperformance using stochastic portfolio theory. We show that the equal weighted portfolio does appear to outperform the market capitalisation weighted portfolio over the long-term but with periods of significant short-term underperformance. In addition, we find that concentration in the market capitalisation weighted portfolio has increased in recent years and has contributed to the recent underperformance together with a significantly lower level of diversification benefits. Furthermore, we highlight an approach to improve the performance of a portfolio by dynamically selecting a market cap or an equal weighting using a rudimentary linear regression model.",
    "year": 2021,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "cac8cb0c89659369dd1d3a071660d933",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T00:55:28.493083"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "The paper focuses on analyzing the performance of equal weighted versus market capitalisation weighted portfolios, and proposes a method to dynamically select between these weighting schemes to improve portfolio performance. This directly pertains to the field of Portfolio Management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Portfolio Management\"],\n  \"justification\": \"The paper focuses on analyzing the performance of equal weighted versus market capitalisation weighted portfolios, and proposes a method to dynamically select between these weighting schemes to improve portfolio performance. This directly pertains to the field of Portfolio Management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:21:09.220410"
}