{
  "paper": {
    "id": 1851,
    "title": "The effect of internationalisation on modelling credit risk for SMEs: Evidence from UK market",
    "abstract": "This study considers domestic and international small and medium-sized enterprises (SMEs) of the United Kingdom separately while modelling their default risk. To establish the empirical validation, separate one-year default prediction models are developed using dynamic logistic regression technique that encapsulates significant financial information over an analysis period of 2000 to 2009. Almost an identical set of explanatory variables affect the default probability of domestic and international SMEs, which contradicts the need for separate default risk models. However, the lower predictive accuracy measures of the model developed for international SMEs motivate us to compare the weights of regression coefficients of the models developed for domestic and international firms. Test results confirm that four out of the nine common predictors display significant statistical differences in their weights. However, these differences do not contribute to the discriminatory performance of the default prediction models, given that we report very little difference in each model's classification performance. (C) 2014 Elsevier B.V. All rights reserved.",
    "year": 2014,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "6c5ab56f1fdecaeee9acb4a452cf3692",
    "relevant_keywords": [
      "classification",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:08:03.996120"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on modeling default risk for SMEs using dynamic logistic regression, which is a core aspect of credit risk management, a subfield of Financial Risk Management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on modeling default risk for SMEs using dynamic logistic regression, which is a core aspect of credit risk management, a subfield of Financial Risk Management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:45:52.769263"
}