{
  "paper": {
    "id": 2211,
    "title": "Stock Price Crash Warning in the Chinese Security Market Using a Machine Learning-Based Method and Financial Indicators",
    "abstract": "Stock price crashes have occurred frequently in the Chinese security market during the last three decades. They have not only caused substantial economic losses to market investors but also seriously threatened the stability and financial safety of the security market. To protect against the price crash risk of individual stocks, a prediction and explanation approach has been proposed by combining eXtreme Gradient Boosting (XGBoost), the Non-dominated Sorting Genetic Algorithm II (NSGA-II), and SHapley Additive exPlanations (SHAP). We assume that financial indicators can be adopted for stock crash risk prediction, and they are utilized as prediction variables. In the proposed method, XGBoost is used to classify the stock crash and non-crash samples, while NSGA-II is employed to optimize the hyperparameters of XGBoost. To obtain the essential features for stock crash prediction, the importance of each financial indicator is calculated, and the outputs of the prediction model are explained by SHAP. Compared with the results of benchmarks using traditional machine learning methods, we found that the proposed method performed best in terms of both prediction accuracy and efficiency. Especially for the small market capitalization samples, the accuracy of classifying all samples reached 78.41%, and the accuracy of identifying the crash samples was up to 81.31%. In summary, the performance of the proposed method demonstrates that it could be employed as a valuable reference for market regulators engaged in the Chinese security market.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "9c56c62d462864e2d317cbd6e012f2fa",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "decision tree",
      "feature learning",
      "feature representation"
    ],
    "stage1_timestamp": "2025-05-15T02:12:17.477796"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用机器学习方法（XGBoost和NSGA-II）结合金融指标来预测股票价格崩盘风险，这直接涉及金融风险管理中的市场风险预测和防范。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是使用机器学习方法（XGBoost和NSGA-II）结合金融指标来预测股票价格崩盘风险，这直接涉及金融风险管理中的市场风险预测和防范。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:43:41.996131"
}