{
  "paper": {
    "id": 1046,
    "title": "Intelligent Anti-Money Laundering Fraud Control Using Graph-Based Machine Learning Model for the Financial Domain",
    "abstract": "Financial domains are suffering from organized fraudulent activities that are inflicting the world on a larger scale. Basel Anti-Money Laundering (AML) index enlists 146 countries, which are impacted by criminal acts like money laundering, and represents the country's risk level with a notable deteriorating trend over the last five years. Despite AML being a substantially focused area, only a fraction of such activities has been prevented. Because financial data related to this field is concealed, access is limited and protected by regulatory authorities. This paper aims to study a graph-based machine-learning model to identify fraudulent transactions using the financial domain's synthetic dataset (100K nodes, 5.3M edges). Graph-based machine learning with financial datasets resulted in promising 77-79% accuracy with a limited feature set. Even better results can be achieved by enriching the feature vector. This exploration further leads to pattern detection in the graph, which is a step toward AML detection.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "e52f766626d6aebbdb12cf3333797bf9",
    "relevant_keywords": [
      "machine learning",
      "classification",
      "feature learning",
      "feature representation",
      "neural network",
      "deep learning",
      "representation learning"
    ],
    "stage1_timestamp": "2025-05-15T01:58:08.573466"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用图机器学习模型来识别欺诈交易，这属于金融风险管理中的反洗钱（AML）领域，旨在控制和减少金融犯罪风险。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是使用图机器学习模型来识别欺诈交易，这属于金融风险管理中的反洗钱（AML）领域，旨在控制和减少金融犯罪风险。\"\n}\n```"
  },
  "timestamp": "2025-05-20T14:24:23.698273"
}