{
  "paper": {
    "id": 548,
    "title": "A Framework of Hierarchical Deep Q-Network for Portfolio Management",
    "abstract": "Reinforcement Learning algorithms and Neural Networks have diverse applications in many domains, e.g., stock market prediction, facial recognition and automatic machine translation. The concept of modeling the portfolio management through a reinforcement learning formulation is novel, and the Deep Q-Network has been successfully applied to portfolio management recently. However, the model does not take into account of commission fee for transaction. This paper introduces a framework, based on the hierarchical Deep Q-Network, that addresses the issue of zero commission fee by reducing the number of assets assigned to each Deep Q-Network and dividing the total portfolio value into smaller parts. Furthermore, this framework is flexible enough to handle an arbitrary number of assets. In our experiments, the time series of four stocks for three different time periods are used to assess the efficacy of our model. It is found that our hierarchical Deep Q-Network based strategy outperforms ten other strategies, including nine traditional strategies and one reinforcement learning strategy, in profitability as measured by the Cumulative Rate of Return. Moreover, the Sharpe ratio and Max Drawdown metrics both demonstrate that the risk of policy associated with hierarchical Deep Q-Network is the lowest among all ten strategies.",
    "year": 2021,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "9f81d06700fa0a27b483a403fd114736",
    "relevant_keywords": [
      "machine learning",
      "reinforcement learning",
      "neural network",
      "deep learning",
      "representation learning",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T00:45:01.259599"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是基于分层深度Q网络的框架，专门用于优化投资组合管理，包括处理交易费用和资产分配问题，并通过实验验证了其在投资组合管理中的优越性能。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是基于分层深度Q网络的框架，专门用于优化投资组合管理，包括处理交易费用和资产分配问题，并通过实验验证了其在投资组合管理中的优越性能。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:29:58.590065"
}