{
  "paper": {
    "id": 2070,
    "title": "An improved SMO algorithm for financial credit risk assessment - Evidence from China's banking",
    "abstract": "With rapid development of financial services and products, credit risk assessment has recently gained considerable attention in the field of financial risk management. In this paper, an improved credit risk assessment approach is presented. Based on the credit data from China Banking Regulatory Commission (CBRC), a multi-dimensional and multi-level credit risk indicator system is constructed. In particular, we present an improved sequential minimal optimization (SMO) learning algorithm, named four-variable SMO (FV-SMO), for credit risk classification model. At each iteration, it jointly selects four variables into the working set and an theorem is proposed to guarantee the analytical solution of sub-problem. The assessment is made on China credit dataset and two benchmark credit datasets from UCI database and CD-ROM database. Experimental results demonstrate FV-SMO is competitive in saving the computational cost and outperforms other five state-of-the-art classification methods in credit risk assessment accuracy. (C) 2017 Elsevier B.V. All rights reserved.",
    "year": 2018,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "deec6ba2551998619edca6e2ac32afd7",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM"
    ],
    "stage1_timestamp": "2025-05-15T02:10:58.944061"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是改进的SMO算法，用于信用风险评估，这直接属于金融风险管理中的信用风险管理范畴。论文明确提到信用风险评估在金融风险管理领域的重要性，并通过实验验证了算法在该领域的应用效果。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是改进的SMO算法，用于信用风险评估，这直接属于金融风险管理中的信用风险管理范畴。论文明确提到信用风险评估在金融风险管理领域的重要性，并通过实验验证了算法在该领域的应用效果。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:44:26.485279"
}