{
  "paper": {
    "id": 3938,
    "title": "Self-Organising Map Based Framework for Investigating Accounts Suspected of Money Laundering",
    "abstract": "There has been an emerging interest by financial institutions to develop advanced systems that can help enhance their anti-money laundering (AML) programmes. In this study, we present a self-organising map (SOM) based approach to predict which bank accounts are possibly involved in money laundering cases, given their financial transaction histories. Our method takes advantage of the competitive and adaptive properties of SOM to represent the accounts in a lower-dimensional space. Subsequently, categorising the SOM and the accounts into money laundering risk levels and proposing investigative strategies enables us to measure the classification performance. Our results indicate that our framework is well capable of identifying suspicious accounts already investigated by our partner bank, using both proposed investigation strategies. We further validate our model by analysing the performance when modifying different parameters in our dataset.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "a90b643d24b0f7e14224f15848a86128",
    "relevant_keywords": [
      "machine learning",
      "unsupervised learning",
      "classification",
      "clustering",
      "neural network",
      "representation learning"
    ],
    "stage1_timestamp": "2025-05-15T02:31:28.430389"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on using self-organising maps to identify bank accounts suspected of money laundering, which is a specific application within financial risk management, particularly in the context of operational risk and compliance.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on using self-organising maps to identify bank accounts suspected of money laundering, which is a specific application within financial risk management, particularly in the context of operational risk and compliance.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:34:44.209142"
}