{
  "paper": {
    "id": 976,
    "title": "Take Bitcoin into your portfolio: a novel ensemble portfolio optimization framework for broad commodity assets",
    "abstract": "The emergence and growing popularity of Bitcoins have attracted the attention of the financial world. However, few empirical studies have considered the inclusion of the newly emerged commodity asset in the global commodity market. It is of great importance for investors and policymakers to take advantage of this asset and its potential benefits by incorporating it as a part of the broad commodity trading portfolio. In this study, we propose a novel ensemble portfolio optimization (NEPO) framework utilized for broad commodity assets, which integrates a hybrid variational mode decomposition-bidirectional long short-term memory deep learning model for future returns forecast and a reinforcement learning-based model for optimizing the asset weight allocation. Our empirical results indicate that the NEPO framework could effectively improve the prediction accuracy and trend prediction ability across various commodity assets from different sectors. In addition, it could effectively incorporate Bitcoins into the asset pool and achieve better financial performance compared to traditional asset allocation strategies, commodity funds, and indices.",
    "year": 2021,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "09e7e94022ef54c03b48f34caeb4e4e1",
    "relevant_keywords": [
      "machine learning",
      "reinforcement learning",
      "deep learning",
      "neural network",
      "long short-term memory",
      "LSTM"
    ],
    "stage1_timestamp": "2025-05-15T00:50:08.785240"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文提出了一种新的集成投资组合优化框架，旨在通过深度学习和强化学习技术优化资产权重分配，并特别关注将比特币纳入商品资产组合。这直接涉及投资组合管理的核心问题，即资产选择和权重分配，以提高财务绩效。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文提出了一种新的集成投资组合优化框架，旨在通过深度学习和强化学习技术优化资产权重分配，并特别关注将比特币纳入商品资产组合。这直接涉及投资组合管理的核心问题，即资产选择和权重分配，以提高财务绩效。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:25:47.176202"
}