{
  "paper": {
    "id": 3082,
    "title": "Along short-term memory enhanced realized conditional heteroskedasticity model",
    "abstract": "This paper examines the potential of using realized volatility measures for capturing financial markets' uncertainty. Earlier studies show the usefulness of the high-frequency data based Generalized AutoRegressive Conditional Heteroskedasticity (RealGARCH) model for enhancing volatility forecasting accuracy; however, this model focuses only on linear and short-term dependencies of realized volatility measures on the underlying volatility. Recognizing the critical economic implications of this limitation, the long short-term memory neural network is integrated into RealGARCH, aiming to explore the full impact of realized volatility on volatility modeling and forecasting via capturing the nonlinear and long-term effects. A comprehensive empirical study using 31 indices from 2004 to 2021 is conducted. The results demonstrate that our proposed framework achieves superior in-sample and out-of-sample performance compared to several benchmark models. Importantly, it retains interpretability and effectively adapts to the stylized facts observed in volatility, emphasizing its significant potential for enhancing economic decision-making and risk management.",
    "year": 2025,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "425dd1060ea29df8b54ec97304935bbe",
    "relevant_keywords": [
      "neural network",
      "deep learning",
      "long short-term memory",
      "LSTM"
    ],
    "stage1_timestamp": "2025-05-15T02:22:25.098649"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on enhancing volatility forecasting accuracy using a neural network integrated into the RealGARCH model, which is primarily used for financial risk management. The study emphasizes its potential for improving economic decision-making and risk management, directly aligning with the financial risk management domain.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on enhancing volatility forecasting accuracy using a neural network integrated into the RealGARCH model, which is primarily used for financial risk management. The study emphasizes its potential for improving economic decision-making and risk management, directly aligning with the financial risk management domain.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:38:30.703806"
}