{
  "paper": {
    "id": 3198,
    "title": "Impact of Audit Committee and Financial Performance on Financial Distress Prediction: An Empirical Study of The Listed Companies in The Market for Alternative Investment (Mai)",
    "abstract": "Businesses risk financial difficulties due to the current environment. Predicting financial distress is vital. Good company governance, like the Audit Committee, can reduce financial strain. Financial performance also affects economic suffering. A model for predicting the financial difficulty of enterprises based on the characteristics above is developed in this research. From 2017 through 2020, the model's sample includes all MAI listed companies, save those in the finance industry. The data are analyzed using logistic regression, and the robustness test is performed using the hold-out sample technique. The results reveal that audit committee meeting frequency and total liabilities to total assets are linked to financial distress. The findings demonstrated a negative association between financial distress and audit committee expertise, price-to-earnings ratio, return on assets, and revenue to total assets. The model's prediction accuracy for identifying one year, two years, and three years before the financial difficulty was 94.9 %, 96.6 %, and 96.1 %, respectively. The model's hold-out sample accuracy is between 89.0 and 98.0 %.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "7d6e90d56377e62d3756712948c585b8",
    "relevant_keywords": [
      "classification",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:23:33.583282"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要研究财务困境预测模型，通过审计委员会和财务绩效等特征来预测企业的财务困境，这属于金融风险管理中的信用风险或企业财务风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文主要研究财务困境预测模型，通过审计委员会和财务绩效等特征来预测企业的财务困境，这属于金融风险管理中的信用风险或企业财务风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:38:03.827530"
}