{
  "paper": {
    "id": 2329,
    "title": "Early Identification of River Blockage Disasters Caused by Debris Flows in the Bailong River Basin, China",
    "abstract": "The Bailong River Basin is one of the most developed regions for debris flow disasters worldwide, often causing severe secondary disasters by blocking rivers. Therefore, the early identification of potential debris flow disasters that may block the river in this region is of great significance for disaster risk prevention and reduction. However, it is quite challenging to identify potential debris flow disasters that may block rivers at a regional scale, as conducting numerical simulations for each debris flow catchment would require significant time and financial resources. The purpose of this article is to use public resource data and machine learning methods to establish a relationship model between debris flow-induced river blockage and key influencing factors, thereby economically predicting potential areas at risk for debris flow-induced river blockage disasters. Based on the field investigation, data collection, and remote sensing interpretation, this study selected 12 parameters, including the basin area, basin height difference, relief ratio, circularity ratio, landslide density, fault density, lithology index, annual average frequency of daily rainfall exceeding 40 mm, river width, river discharge, river gradient, and confluence angle, as critical factors to determine whether debris flows will cause river blockages. A relationship model between debris flow-induced river blockage and influencing factors was constructed based on machine learning algorithms. Several machine learning algorithms were compared, and the XGB model performed the best, with a prediction accuracy of 0.881 and an area under the ROC curve of 0.926. This study found that the river width is the determining factor for debris flow blocking rivers, followed by the annual average frequency of daily rainfall exceeding 40 mm, basin height difference, circularity ratio, basin area, and river discharge. The early identification method proposed in this study for river blockage disasters caused by debris flows can provide a reference for the quantitative assessment and pre-disaster prevention of debris flow-induced river blockage chain risks in similar high-mountain gorge areas.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "fc9ac7f0b1bd1458ee9944d1790b6a3f",
    "relevant_keywords": [
      "machine learning",
      "classification",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T02:14:19.575877"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究利用机器学习方法预测泥石流引发的河道堵塞灾害，属于自然灾害预防领域，与衍生品定价、金融风险管理和投资组合管理等金融领域无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究利用机器学习方法预测泥石流引发的河道堵塞灾害，属于自然灾害预防领域，与衍生品定价、金融风险管理和投资组合管理等金融领域无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:42:57.805302"
}