{
  "paper": {
    "id": 1822,
    "title": "Quantum Finance and Fuzzy Reinforcement Learning-Based Multi-agent Trading System",
    "abstract": "In a volatile stock market, an investor's long-term goal involves determining the most effective buying, selling strategies, and money management techniques in order to maximize profits. This paper introduces a multi-agent trading system to achieve this goal, termed QF-FRL, based on quantum finance and fuzzy reinforcement learning (QF-FRL). The system comprises two agents: (1) The trading agent, constructed using the Deep Deterministic Policy Gradient (DDPG) and Twin Delayed Deep Deterministic Policy Gradient (TD3). This agent employs a Denoising Auto Encoder (DAE) to extract stock representations from historical time series data. The trading agent initially employed the DDPG model, which was subsequently supplanted by the TD3 model. It integrates traditional financial technology indicators, like moving averages, with modern deep reinforcement learning technology to generate buying and selling signals for determining the optimal strategy. (2) The risk control agent, founded on quantum finance and an adaptive network-based fuzzy inference system. This agent merges the QPL indicator with a fuzzy risk control method to ascertain transaction amounts. Furthermore, a genetic algorithm is utilized to optimize the parameters of the fuzzy system, aiming to enhance profits and ensure accuracy in transactions at specific amounts. The experiments in this study involved selecting nine stocks and testing them against seven competing quantitative trading models. Upon comparing the profit rate, trading frequency, Sharpe ratio, and average return of each stock, eight stocks within the QF-FRL system achieved the highest returns and a greater number of transactions. Additionally, the QF-FRL system has also attained the highest average return and the second highest average Sharpe ratio. The results indicate that QF-FRL outperforms competing models, yielding higher profits and being particularly suitable for long-term investment. Moreover, it exhibits more favorable risk-adjusted returns and a notable degree of robustness.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "531dd31ef010ece629f0ee325163097e",
    "relevant_keywords": [
      "machine learning",
      "reinforcement learning",
      "deep learning",
      "representation learning",
      "autoencoder",
      "denoising autoencoder",
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T02:08:03.878515"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是开发一个多代理交易系统，旨在通过深度强化学习和量子金融技术优化买卖策略和资金管理，以最大化长期投资收益。这直接关联到投资组合管理的领域，因为它涉及选择最优的交易策略和资金分配，而不是衍生品定价或金融风险管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是开发一个多代理交易系统，旨在通过深度强化学习和量子金融技术优化买卖策略和资金管理，以最大化长期投资收益。这直接关联到投资组合管理的领域，因为它涉及选择最优的交易策略和资金分配，而不是衍生品定价或金融风险管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:45:55.852317"
}