{
  "paper": {
    "id": 423,
    "title": "An Effective Credit Scoring Model Implementation by Optimal Feature Selection Scheme",
    "abstract": "Mitigation of the risk associated with the credit is the utmost requirement for the NPA struck banking and other financial organizations, as it is not only helps to improve the financial health of the organization but also directing the resources toward the eligible transforms the society up to great extent. Often the research on the question of calculating risk is reduced to identification of the correct features out of numerous attribute present in the data set, which is an optimization problem. However, still there lies challenging issues in terms of overall performance and computational time of feature selection process. In this study, we combine two well-known feature selection techniques, i.e. Principal Component Analysis (PCA) and Genetic Algorithm (GA). PCA is used to perform feature transformation and then GA is applied to select the best feature subset. Finally, Random Forest (RF) and Support Vector Machine (SVM) are used as classifiers to build the model.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "94e2ee863dbdc3ea08fae2dd6f861c8c",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM",
      "decision tree",
      "principal components analysis",
      "feature learning"
    ],
    "stage1_timestamp": "2025-05-15T01:50:52.614317"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要研究信用评分模型的优化，通过特征选择技术来降低信用风险，这直接关联到金融风险管理中的信用风险管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"该论文主要研究信用评分模型的优化，通过特征选择技术来降低信用风险，这直接关联到金融风险管理中的信用风险管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:58:04.651569"
}