{
  "paper": {
    "id": 1905,
    "title": "Long-term wealth growth portfolio allocation under parameter uncertainty: A non-conservative robust approach",
    "abstract": "The Kelly portfolio, which is documented to have the highest wealth growth rate of any other portfolio in the long run, has highly risky and unstable performance in the short term. This paper offers a hybrid approach to address this problem by integrating the concept of ridge regression and shrinkage estimation into a robustly modified Kelly portfolio. The proposed approach is a two-stage optimization process that not only takes into account the effect of estimation error but also solves the notoriously conservative problem introduced by the robust optimization method. By extending the worst-case scenarios considered by the robust Kelly portfolio, our approach significantly improves its out-of-sample performance without compromising risk reduction. In an extensive out-of-sample analysis with simulated and empirical data sets, we also characterize the impacts of the robustness level and the length of the rolling window on the final result. Moreover, we conduct a comparative study to confirm the validity of the proposed approach, and our model allows the investor to have a better risk-return trade-off than other traditional models.",
    "year": 2021,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "e3622401557efa8c839736ae33a071de",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:01:06.083696"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文主要研究如何通过改进Kelly投资组合方法来优化长期财富增长，并解决短期风险和不稳定性的问题。其核心内容涉及投资组合的优化和风险管理，属于投资组合管理领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文主要研究如何通过改进Kelly投资组合方法来优化长期财富增长，并解决短期风险和不稳定性的问题。其核心内容涉及投资组合的优化和风险管理，属于投资组合管理领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:18:16.638038"
}