{
  "paper": {
    "id": 1248,
    "title": "BP neural network-based mobile payment risk prediction in cloud computing environment and its impact on e-commerce operation",
    "abstract": "The purpose is to improve the accuracy of e-commerce mobile payment risk prediction, and further analyze the characteristics of mobile payment users and their impact on e-commerce activities, to solve the problem of mobile payment in different business environments. Based on the preliminary exploration of cloud computing, first, the concept of mobile payment and related theories are elaborated, and the development and operation mode of e-commerce are discussed. Mobile payment based on financial technology, online shopping and social entertainment are analysed, respectively. Based on BP neural network and data mining technology, multi-dimensional e-commerce mobile payment risk time series are analyzed, and e-commerce mobile payment risk prediction model is constructed. The comparative experiment reveals that the risk prediction deviation of e-commerce mobile payment based on BP neural network is very small, which can track the change characteristics of e-commerce mobile payment risk with high precision, and the efficiency of e-commerce mobile payment risk prediction is very high. In the cloud computing environment, mobile payment can analyze financial products and improve transaction security. Moreover, it can carry out product research and analysis, solve the risk problem under the background of online shopping, and promote the diversified development of e-commerce under the background of social entertainment.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "e85b6e7914f32d64945825c2d4577d24",
    "relevant_keywords": [
      "neural network",
      "backpropagation",
      "BP"
    ],
    "stage1_timestamp": "2025-05-15T02:00:30.611220"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是基于BP神经网络构建电子商务移动支付风险预测模型，旨在提高风险预测的准确性并解决不同商业环境下的移动支付风险问题。这直接涉及金融风险管理领域，特别是支付风险的分析和预测。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是基于BP神经网络构建电子商务移动支付风险预测模型，旨在提高风险预测的准确性并解决不同商业环境下的移动支付风险问题。这直接涉及金融风险管理领域，特别是支付风险的分析和预测。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:50:34.489656"
}