{
  "paper": {
    "id": 3805,
    "title": "Seismic risk prioritisation schemes for reinforced concrete bridge portfolios",
    "abstract": "A significant portion of the existing bridge inventory in Italy is decades old, requiring continuous maintenance and safety assessment approaches. Recent collapses of existing reinforced concrete bridges have piqued public interest, placing pressure on management agencies to define methodologies with which to prioritise asset maintenance and to effectively utilise their limited resources. When looking for decision variables to perform this prioritisation, seismic risk assessment metrics, such as average annual losses (AAL), are an appealing choice. However, obtaining this metric for a large bridge inventory is technically challenging and requires large amounts of information that are seldom available, promoting the development of practical approaches that can predict the relative priority of assets within a portfolio, based on processing simple indicators with acceptable accuracy. In this research, a case study of 617 bridges from the Italian road network was assessed considering state-of-the-art approaches to calculate total losses. The results were explored with data science techniques, identifying the main features that drive the relative importance of bridges in terms of AAL and using them as guidance to calibrate a simplified methodology, based on the recent Italian Guidelines for Bridge Safety Assessment. The proposed AAL-based modifications demonstrate a notable improvement in the definition of bridge assessment priorities, as well as providing further resolution in the classification for more efficient decision making.",
    "year": 2025,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "4a9d2112c9e6260a905de004401dcd07",
    "relevant_keywords": [
      "classification",
      "feature representation"
    ],
    "stage1_timestamp": "2025-05-15T01:21:08.205783"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究桥梁的地震风险评估和优先级排序，属于土木工程和风险管理领域，但并未涉及金融领域的衍生品定价、金融风险管理或投资组合管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究桥梁的地震风险评估和优先级排序，属于土木工程和风险管理领域，但并未涉及金融领域的衍生品定价、金融风险管理或投资组合管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:08:48.472230"
}