{
  "paper": {
    "id": 2968,
    "title": "A Forecasting Model of Financial Risk in China Based on Corporate Governance",
    "abstract": "Corporate governance is a significant factor that would influence business operation and financial risk, and therefore an empirical study about the early forecasting model and its effect combining the corporate governance indexes is very necessary. The paper select some quantitative variables from ownership structure, corporate governance and the major transaction events to examine the relationship between corporate governance and financial risk, This paper selects the data of 175 ST listed companies in our country from 2002-2006 and also 175 pairing companies correspondingly, form a model by logistic regression equation. The results shows that state-owner shareholding proportion and ST probability are positive correlated; There is no positive correlation between the shareholding ratio of senior managers and the ST probability of the company; Scale of Board of directors and the ST probability of the company are positive correlated and etc.At last,the paper put forward some suggestions to keep away from financial risk.",
    "year": 2008,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "86bdaa5df9875878d27e2b8546fdd5cd",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:21:19.188070"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on developing a forecasting model for financial risk using corporate governance indicators, which is directly related to identifying and managing financial risks in companies, thus falling under the Financial Risk Management domain.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on developing a forecasting model for financial risk using corporate governance indicators, which is directly related to identifying and managing financial risks in companies, thus falling under the Financial Risk Management domain.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:39:18.240162"
}