{
  "paper": {
    "id": 1526,
    "title": "Transparent Neural based Expert System for Credit Risk (TNESCR): An Automated Credit Risk Evaluation System",
    "abstract": "Nowadays credit risk evaluation is very crucial in financial domain. Whenever it is processed by an individual, it becomes controversial as the assessment may be prone to human error. Recently, to overcome this issue, some automated systems have been developed for credit risk evaluation. Most of the developed systems focused on the credit decision only and neglected the transparency of the systems; however, many cases require transparency of the credit decision to benefit financial organization as well as the potential customers. Therefore, this paper proposes an expert system named Transparent Neural based Expert System for Credit Risk (TNESCR) evaluation which uses a white box neural model Rule Extraction from Neural Network using Classified and Misclassified data (RxNCM) to generate rules from financial data. The generated rules are so transparent to justify the explanations for why applications are granted/rejected with a significant predictive accuracy. The proposed TNESCR is validated using 10 fold cross validation with 3 credit risk datasets. The experimental results show the proposed TNESCR can perform significantly with great transparency and accuracy.",
    "year": 2020,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "3acf67527b498d6fb4cc8f2b260b2d8f",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "neural network",
      "deep learning",
      "representation learning",
      "backpropagation",
      "BP",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T02:04:20.043986"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on developing an automated system for credit risk evaluation, which is a key aspect of financial risk management. The proposed system aims to improve transparency and accuracy in assessing credit risk, directly addressing issues in risk management practices.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on developing an automated system for credit risk evaluation, which is a key aspect of financial risk management. The proposed system aims to improve transparency and accuracy in assessing credit risk, directly addressing issues in risk management practices.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:48:22.426099"
}