{
  "paper": {
    "id": 240,
    "title": "RETRACTED: Digital Industry Financial Risk Early Warning System Based on Improved K-Means Clustering Algorithm (Retracted Article)",
    "abstract": "Corporate financial risks not only endanger the financial stability of digital industry but also cause huge losses to the macro-economy and social wealth. In order to detect and warn digital industry financial risks in time, this paper proposes an early warning system of digital industry financial risks based on improved K-means clustering algorithm. Aiming to speed up the K-means calculation and find the optimal clustering subspace, a specific transformation matrix is used to project the data. The feature space is divided into clustering space and noise space. The former contains all spatial structure information; the latter does not contain any information. Each iteration of K-means is carried out in the clustering space, and the effect of dimensionality screening is achieved in the iteration process. At the same time, the retained dimensions are fed back to the next iteration. The dimensional information of the cluster space is discovered automatically, so no additional parameters are introduced. Experimental results show that the accuracy of the proposed algorithm is higher than other algorithms in financial risk detection.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "360e7b40bfd73b36ddac9d8fe908d290",
    "relevant_keywords": [
      "unsupervised learning",
      "clustering",
      "feature representation"
    ],
    "stage1_timestamp": "2025-05-15T01:48:30.751284"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文提出了一种基于改进K-means聚类算法的数字产业金融风险预警系统，旨在及时检测和预警金融风险，这直接属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文提出了一种基于改进K-means聚类算法的数字产业金融风险预警系统，旨在及时检测和预警金融风险，这直接属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:59:52.737225"
}