{
  "paper": {
    "id": 872,
    "title": "Financial applications of machine learning: A literature review",
    "abstract": "This systematic literature review analyses the recent advances of machine learning and deep learning in finance. The study considers six financial domains: stock markets, portfolio management, cryptocurrency, forex markets, financial crisis, bankruptcy and insolvency. We provide an overview of previously proposed techniques in these areas by examining 126 selected articles across 44 reputed journals. The main contributions of this review include an extensive examination of data characteristics and features used for model training, evaluation of validation approaches, and model performance addressing each financial problem. A systematic literature review methodology, PRISMA, is used to carry out this comprehensive review. The study also analyses bibliometric information to understand the current status of research focused on machine learning in finance. The study finally points out possible research directions which might lead to new inquiries in machine learning and finance.",
    "year": 2023,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "ce93cac7991ee20983e2277b51909216",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "neural network",
      "representation learning",
      "backpropagation",
      "BP",
      "rectified linear unit",
      "ReLU",
      "sigmoid",
      "tanh",
      "hidden layer",
      "convolutional neural network",
      "CNN",
      "recurrent neural network",
      "long short-term memory",
      "LSTM",
      "autoencoder",
      "dropout regularization"
    ],
    "stage1_timestamp": "2025-05-15T00:49:03.171859"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "论文摘要明确提到投资组合管理是研究的六个金融领域之一，并且对相关技术进行了综述。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"论文摘要明确提到投资组合管理是研究的六个金融领域之一，并且对相关技术进行了综述。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:26:48.383740"
}