{
  "paper": {
    "id": 721,
    "title": "Empirical Test of Credit Risk Assessment of Microfinance Companies Based on BP Neural Network",
    "abstract": "In recent years, the chaos of internet finance has occurred frequently, especially P2P, with high risks. As a kind of financial innovation, small loan companies are challenging to avoid alone, and the issue of credit risk is also highly valued. This study selects the loan records of a small loan company (a daily loan record from September 1, 2016 to July 1, 2021 has seven indicators, each of which has 21299 data). It uses MATLAB programming to test the correctness of risk indicator selection and the accuracy of BP neural network classification and identification results. This study obtains the corresponding risk value. According to the corresponding risk value, the newly applied loans are classified, that is, rated, to verify the effectiveness and applicability of this method. Therefore, BP neural network has strong applicability, generalization ability, and portability and is an effective method for small loan companies to guide credit risk assessment.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "288c9287054e8673f0dcd7d12206e981",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "neural network",
      "backpropagation",
      "BP",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T01:54:33.996922"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on using BP neural networks to assess credit risk for microfinance companies, which is a specific application within financial risk management, particularly in credit risk evaluation.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on using BP neural networks to assess credit risk for microfinance companies, which is a specific application within financial risk management, particularly in credit risk evaluation.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:55:27.746828"
}