{
  "paper": {
    "id": 1247,
    "title": "Assessment of Carbon-Aware Flexibility Measures From Data Centres Using Machine Learning",
    "abstract": "Potential solutions for unlocking operational flexibility from data centres are investigated. Two types of data centres, in terms of their cooling facilities, are modelled in order to provide an in-depth assessment of potential variations in data centre performance based on their energy consumption and server temperatures. Using synthetic datasets generated from year-long building dynamic simulations under distinct system conditions, four machine learning (ML) models are designed and trained to predict data centre energy consumption and server temperatures. Three different ML algorithms are considered, including random forest, XGBOOST, and multiple linear regression, which all achieve high accuracy ranging from 93.8% to 98.1% for the mean absolute percentage error. The resulting ML models are then utilised to represent a system-wide fleet of data centres, which are integrated within a power system unit scheduling framework for potential demand shifting based on (system) carbon intensity. Five alternative flexibility scenarios are introduced and compared, with the objective of determining the achievable flexibility from a system-wide portfolio of data centres, focusing on concerns relating to server temperatures. On average, a 6.5% load reduction is seen to be achievable for a winter day during periods of high CO2 intensity.",
    "year": 2023,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "1c87ef80910b13c34455ae13e7afd2c3",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "regression",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T00:53:42.047879"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究数据中心的能源消耗和服务器温度预测，以及基于碳强度的需求转移策略，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究数据中心的能源消耗和服务器温度预测，以及基于碳强度的需求转移策略，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:22:14.142408"
}