{
  "paper": {
    "id": 1464,
    "title": "An Empirical Comparison of Different Optimization Models in Enhanced Index Tracking Problem",
    "abstract": "Enhanced index tracking is a popular type of investment nowadays. Enhanced index tracking is a portfolio management which aims to track and outperform the benchmark stock market index with few stocks. The investors can generate higher portfolio mean return than the benchmark index return at minimum tracking error without purchasing all stocks from the benchmark index components. This purpose can be achieved by using the optimization model to construct an optimal portfolio which maximizes the mean return and minimizes the tracking error of the portfolio against the benchmark index. The objective of this paper is to construct an optimal portfolio by using two optimization models with different approach which are sum weighted and regression approach. Besides that, the optimal portfolio performance of both models are determined and compared in terms of mean return, tracking error and information ratio. In this study, the data consists of weekly price of 23 components stocks in Malaysia main market index which is FTSE Bursa Malaysia Kuala Lumpur Composite Index from January 2010 until December 2013. The result of this study indicates that the optimal portfolios for both models are able to track and outperform the benchmark index with only selecting 33% from the benchmark index components. Besides that, the optimal portfolio performance for the optimization model with sum weighted approach is higher than the optimization model with regression approach. Therefore, the optimization model with sum weighted approach is more suitable for the investors in Malaysia. The significance of this study is to identify the most suitable optimization model in determining the portfolio selection to track and outperform Malaysia market index without purchasing all stocks from the benchmark index.",
    "year": 2015,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "92c6415a77422d6a07dd18dd34cbe4b3",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T00:56:08.323064"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心研究内容是使用优化模型构建最优投资组合，以跟踪并超越基准指数，这直接属于投资组合管理的范畴。论文详细讨论了如何通过不同的优化方法（如加权和回归方法）来最小化跟踪误差并最大化回报，这些都是投资组合管理的典型研究内容。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心研究内容是使用优化模型构建最优投资组合，以跟踪并超越基准指数，这直接属于投资组合管理的范畴。论文详细讨论了如何通过不同的优化方法（如加权和回归方法）来最小化跟踪误差并最大化回报，这些都是投资组合管理的典型研究内容。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:20:44.321195"
}