{
  "paper": {
    "id": 200,
    "title": "Identifying Fintech risk through machine learning: analyzing the Q&A text of an online loan investment platform",
    "abstract": "Financial risks associated with Fintech have been increasing with its significant growth in recent years. Aiming at addressing the problem of identifying risks in online lending investment under a financial technology platform, we develop a Q&A text risk recognition model based on attention mechanism and Bi-directional Long Short-Term Memory. First, the Q&A pairing on the text data set is carried out, and the matching data set is selected for the next analysis. Secondly, the online loan investment platform is assessed by the named entity recognition of the question text. Finally, the risk level of the corresponding investment platform is evaluated based on the answer text. The experimental results show that the proposed model has achieved improved precision, recall, F1-score, and accuracy compared with other models. Our proposed model can be applied to identify the risks from the text posted on online loan investment platforms and can be used to guide investors' investment and improve the management of financial technology platforms.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "deep learning",
    "cache_key": "3aeb05dec6398eaf07424048ec460d20",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "neural network",
      "long short-term memory",
      "LSTM",
      "attention mechanism"
    ],
    "stage1_timestamp": "2025-05-15T01:35:04.487487"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是开发一个基于注意力机制和双向LSTM的Q&A文本风险识别模型，用于识别在线贷款投资平台的风险，这直接属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是开发一个基于注意力机制和双向LSTM的Q&A文本风险识别模型，用于识别在线贷款投资平台的风险，这直接属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:04:03.863408"
}