{
  "paper": {
    "id": 1289,
    "title": "Unsupervised Classification Model Using Environmental and Financial Performance Attributes: Case Applied in Latin American Countries",
    "abstract": "This research aims to determine the optimal clustering based on the classification of environmental and financial performance variables. The study was conducted using a dataset spanning from 2010 to 2017, consisting of 102 listed companies from the Mexican, Brazilian, Colombian, and Chilean capital markets. As a result, the number of companies included in each classification varied. Using profitability-based metrics, our findings indicate that there are no discernible advantages to being classified as NC company. Additionally, the mean and return values of both groups are highly similar. By employing risk metrics, the algorithm classifies the data according to countries, leading to a natural classification. Conversely, when considering eco-efficiency metrics, we observed the formation of two distinct groups. Therefore, it can be concluded that the algorithm effectively identifies a specific category of controversial companies by incorporating environmental performance variables.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "17de178ab5663596a1b9e7c1917bd9d1",
    "relevant_keywords": [
      "unsupervised learning",
      "classification",
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T02:01:11.864624"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是基于环境与财务绩效变量的无监督分类模型，并将其应用于拉丁美洲国家的上市公司。虽然涉及财务绩效和风险指标，但核心研究目标是分类和聚类分析，并未明确指出其在衍生品定价、金融风险管理或投资组合管理等特定金融领域的应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是基于环境与财务绩效变量的无监督分类模型，并将其应用于拉丁美洲国家的上市公司。虽然涉及财务绩效和风险指标，但核心研究目标是分类和聚类分析，并未明确指出其在衍生品定价、金融风险管理或投资组合管理等特定金融领域的应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:50:30.868160"
}