{
  "paper": {
    "id": 1099,
    "title": "A Strong Classifier Model Oriented to the Financial Risk Warning of Listed Company",
    "abstract": "A strong classifier model oriented to the financial risk warning of listed company has played an important role in the risk analysis of enterprise finance. Based on the BP_Adaboost composed of BP neural network and Adaboost algorithm, a strong classifier model of enterprise finance is designed and established, and is verified with the actual data. In the first, the evaluation index has the largest correlation to the warning result of enterprise finance has been filtered through the significance analysis and factor analysis of typical data. After that, the data item corresponding to the evaluation index is taken into the strong BP_Adaboost classifier model, in order to compute the classification results. Finally, the classification result of the weak BP classifier is computed and compared with the one of the strong BP_Adaboost classifier model. The experimental results show that the accuracy of strong BP_Adaboost classifier is higher than the one of weak BP classifier, and the strong BP_Adaboost classifier has better stability and higher reliability.",
    "year": 2015,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "36f815a49410a511479b24a92330df4e",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "neural network",
      "backpropagation",
      "BP"
    ],
    "stage1_timestamp": "2025-05-15T01:58:43.487261"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是设计并建立一个强分类器模型，用于上市公司的财务风险预警。这直接涉及金融风险管理领域，特别是企业财务风险的分析和预警。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"该论文的核心技术是设计并建立一个强分类器模型，用于上市公司的财务风险预警。这直接涉及金融风险管理领域，特别是企业财务风险的分析和预警。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:52:01.173471"
}