{
  "paper": {
    "id": 277,
    "title": "The Research of the Regional Financial Risk Early-Warning Model Integrating the Regression of Lagging Factors",
    "abstract": "This paper make the explained variables our financial stress index consist of the synchronous variables financial systemic risk, and make the explanatory variables the macroeconomic variable, currency credit variable, asset price variable and the macroeconomic variable of correlative economic powers, then use stepwise regression method to establish the financial systemic risk best predict equation, thus set up the reasonable and practical financial systemic risk early-warning index system; besides, use the best prediction equations predicts the financial systemic risk status in 2011. The predicted results show that Chinese financial systemic risk is on the rise in the first three quarters and higher than the peak of 2008; financial systemic risk start to decline since the fourth quarter. 2012 Published by Elsevier B.V. Selection and/or peer review under responsibility of American Applied Science Research Institute",
    "year": 2012,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "8c6f2d70f74b4bac1d2d38b87b0b4b5e",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:49:04.545001"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on establishing a financial systemic risk early-warning index system and predicting financial systemic risk status, which are core aspects of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on establishing a financial systemic risk early-warning index system and predicting financial systemic risk status, which are core aspects of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:59:29.921297"
}