{
  "paper": {
    "id": 554,
    "title": "Research of BP-SOM evaluation model and its application",
    "abstract": "Various neural network models have proven useful in evaluation or prediction. Neural classification ability is just beginning to be deployed in financial application. And it is very important to study credit evaluation model when create a credit risk prediction system. This paper analyses the disadvantage of traditional model based on statistical analysis, and proposed a hybrid system to combine the backpropagation (BP) learning with Kohonen's Self-Organizing Map (SOM) Neural Network, for the application of credit risk evaluation. BP Neural Network has been successfully used in several domains of artificial intelligence. In order to enhance its generalization performance, we connected the SOM method to deal with overfitting problem of BP. After discussing the structure and arithmetic of the model, we train the model with financial ratios for a credit risk early warning experiment The preliminary experimental results demonstrate that the BP-SOM model outperforms some traditional ones in rates of prediction precision and efficiency, and improves generalization performance.",
    "year": 2008,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "84ce959d7b6a479350832ec2cea25cee",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "unsupervised learning",
      "classification",
      "neural network",
      "backpropagation",
      "BP",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T01:52:12.309501"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文提出了一种结合BP和SOM神经网络的混合系统，专门用于信用风险评估，这是金融风险管理中的一个重要应用领域。论文明确提到该模型用于信用风险早期预警实验，并比较了其与传统模型在预测精度和效率上的表现。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文提出了一种结合BP和SOM神经网络的混合系统，专门用于信用风险评估，这是金融风险管理中的一个重要应用领域。论文明确提到该模型用于信用风险早期预警实验，并比较了其与传统模型在预测精度和效率上的表现。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:57:02.810073"
}