{
  "paper": {
    "id": 42,
    "title": "Risk spillover in financial markets based on support vector quantile regression",
    "abstract": "In terms of financial market risk research, with the rapid popularization of non-linear perspectives and the improvement of theoretical reasoning, scholars have slowly broken through the cage of linear ideas and derived new and more practical methods from non-linear perspectives to make up for the shortcomings of traditional research. Based on the support vector classification regression algorithm, this research combines the typical facts and characteristics of financial markets, from the perspective of quantile regression and SVR intelligent technology in computer science, to explore the research method of financial market risk spillover effects from a nonlinear perspective. Moreover, this research integrates statistical research, machine learning and other related research methods, and applies them to the measurement of financial risk spillover effects. The empirical analysis shows that the method proposed in this paper has certain effects, and financial risk analysis can be performed based on the risk spillover effect measurement model constructed in this paper.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "42d6f6d375f02f1ec7345ba98c76bfcf",
    "relevant_keywords": [
      "machine learning",
      "regression",
      "support vector machine",
      "SVM"
    ],
    "stage1_timestamp": "2025-05-15T01:46:03.865298"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on exploring financial market risk spillover effects using support vector quantile regression and machine learning techniques, which are directly applied to the measurement of financial risk spillover effects. This clearly falls under the domain of Financial Risk Management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on exploring financial market risk spillover effects using support vector quantile regression and machine learning techniques, which are directly applied to the measurement of financial risk spillover effects. This clearly falls under the domain of Financial Risk Management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:01:31.035841"
}