{
  "paper": {
    "id": 2250,
    "title": "Linking mineral deposit models to quantitative risk analysis and decision-making in exploration",
    "abstract": "This paper describes a methodology of translating mineral deposit models into flexible probabilistic structures based on (1) extraction of ore components (fluids, metals, and ligands) from crustal or mantle sources or both, (2) fluid- or melt-assisted transport of ore components from source to trap zones, (3) formation of trap zones (i.e., effective melt or fluid channels) that can focus melt or fluid migration and accommodate large amounts of metal, and (4) operation of the physicochemical processes that promote and sustain the deposition of metal from fluids or melts passing through a particular trap site. Our approach integrates these critical mineralization processes and conditions with concepts of probability theory, decision analysis, and financial modeling. The principal objective is to make mineral deposit models amenable to financial risk and value analysis and suitable for communication of value-creating geologic concepts to financial stakeholders in economic terms. A case study, based on an actual porphyry copper project, illustrates how the resulting probabilistic mineral systems model can generate a measure of the probability of ore occurrence as an input for exploration decision trees and simulations to calculate the expected value of an exploration project and the probability distribution of all possible surrounding net present values (NPVs) within a minimum and maximum range. Formulation of the probabilistic model closely follows and combines principles of the well -established petroleum and mineral systems approaches and makes use of Excel (TM)-based model templates with decision tree and simulation add-in software packages.",
    "year": 2008,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "41c190d229bffed7437cb362e1cb7347",
    "relevant_keywords": [
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T02:12:51.067052"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是将矿床模型转化为概率结构，用于矿产勘探的风险和价值分析，虽然涉及金融建模和风险分析，但其核心应用领域是矿产勘探而非特定的金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是将矿床模型转化为概率结构，用于矿产勘探的风险和价值分析，虽然涉及金融建模和风险分析，但其核心应用领域是矿产勘探而非特定的金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:43:39.871799"
}