{
  "paper": {
    "id": 1759,
    "title": "Time-varying tail dependence networks of financial institutions",
    "abstract": "In this study we characterize systemic risk by the way that financial institutions are interconnected. We construct time-varying tail dependence networks to investigate the complex interdependencies in the financial system. Time-varying lower-tail dependence networks covering the 2008-17 period are constructed for 48 Chinese financial institutions based on the time-varying Clayton copula model and the minimum spanning tree algorithm. We find that tail dependence among financial institutions increases during crises, with clear peaks during the global financial crisis as well as the Chinese interbank market money shortage in 2013 and China's stock market crash in 2015. From the structures of time-varying lower-tail dependence networks, we observe strong clustering, both within and across sectors. Securities companies are found to play an important role in cross-sectoral tail risk transfer. We also identify seven systemically important financial institutions for the Chinese financial system using topological properties.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "0d989b4ce8f590c7615e6a7d9fea1d04",
    "relevant_keywords": [
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T02:06:52.789889"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on characterizing systemic risk through time-varying tail dependence networks among financial institutions, which is a key aspect of financial risk management, particularly in understanding and mitigating systemic risks during crises.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on characterizing systemic risk through time-varying tail dependence networks among financial institutions, which is a key aspect of financial risk management, particularly in understanding and mitigating systemic risks during crises.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:46:36.487602"
}