{
  "paper": {
    "id": 1058,
    "title": "Factor Investment or Feature Selection Analysis?",
    "abstract": "This study has made significant findings in A-share market data processing and portfolio management. Firstly, by adopting the Lasso method and CPCA framework, we effectively addressed the problem of multicollinearity among feature indicators, with the Lasso method demonstrating superior performance in handling this issue, thus providing a new method for financial data processing. Secondly, Deep Feedforward Neural Networks (DFN) exhibited exceptional performance in portfolio management, significantly outperforming other evaluated machine learning methods, and achieving high levels of out-of-sample performance and Sharpe ratios. Additionally, we consistently identified price changes, earnings per share, net assets per share, and excess returns as key factors influencing predictive signals. Finally, this study combined the Lasso method with DFN, providing a new perspective and methodological support for asset pricing measurement in the financial field.",
    "year": 2025,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "74af7a0bdecd2458fa60dc29483ac230",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "neural network",
      "feature learning",
      "feature representation",
      "representation learning",
      "backpropagation",
      "BP",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T00:51:25.878537"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文明确提到使用Deep Feedforward Neural Networks (DFN)在投资组合管理中表现出色，并且讨论了资产定价测量，这些都是投资组合管理的核心内容。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文明确提到使用Deep Feedforward Neural Networks (DFN)在投资组合管理中表现出色，并且讨论了资产定价测量，这些都是投资组合管理的核心内容。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:24:49.543737"
}