{
  "paper": {
    "id": 4483,
    "title": "Volatility forecasting with hybrid neural networks methods for Risk Parity investment strategies",
    "abstract": "We present a hybrid method for computing volatility forecasts that can be used to implement a risk-controlled strategy for a multi-asset portfolio consisting of both US and international equities. Recent years have been characterized by extremely low yields, with 2022 marked by rising interest rates and an increasing inflation rate. These factors produced new challenges for both private and institutional investors, including the need for robust forecast methods for financial assets' volatilities. Addressing such task, our research focuses on a hybrid solution that combines classical statistical models with specific classes of Recurrent Neural Networks (RNNs). In particular, we first use the Generalized Autoregressive Conditional Heteroscedasticity (GARCH) approach within the preprocessing phase to capture volatility clustering, striking an efficient balance between computational effort and accuracy, to then apply RNN architectures, namely GRU, LSTM, and a mixed model with both units, as to maximize performances of volatility forecasts later used as input factors for risk-controlled investment strategies. In terms of portfolio allocation, we focus on a simplified version of the Risk Parity method that was first proposed by the Research division of S&P Global. This version ignores the contribution of cross-correlations among assets, nevertheless providing encouraging results. Indeed, we show the effectiveness of the chosen approach by providing forward-looking risk parity portfolio strategies that outperform standard risk/return portfolio structures.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "a59cfd186b76591f8c309a5038e70a7a",
    "relevant_keywords": [
      "machine learning",
      "neural network",
      "deep learning",
      "recurrent neural network",
      "long short-term memory",
      "LSTM"
    ],
    "stage1_timestamp": "2025-05-15T02:37:47.509648"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk",
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是使用混合神经网络方法进行波动率预测，并将其应用于风险平价投资策略。波动率预测直接关联到金融风险管理，而风险平价策略的实施则属于投资组合管理的范畴。论文明确提到这些技术用于多资产组合的风险控制和资产配置，因此涉及这两个领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\", \"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是使用混合神经网络方法进行波动率预测，并将其应用于风险平价投资策略。波动率预测直接关联到金融风险管理，而风险平价策略的实施则属于投资组合管理的范畴。论文明确提到这些技术用于多资产组合的风险控制和资产配置，因此涉及这两个领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:32:55.359306"
}