{
  "paper": {
    "id": 699,
    "title": "Modeling hydraulic fracture fluid efficiency in tight gas reservoirs using non-linear regression and a back-propagation neural network",
    "abstract": "This study introduces a back-propagation (BP) neural network model and a regression model for estimating the fracture fluid efficiency based on a data set consisting of 1261 staged and ramped simulation runs of tight gas reservoirs subjected to hydraulic fracturing treatment. Data were generated using a 3-D commercial simulator which is a versatile software portfolio that models many well configurations, proppant placement, and fracture geometries. The BP network inputs consist of shear rate/fracture conductivity ratio, the injection rate, reservoir permeability, formation closure stress, reservoir thickness, effective viscosity, and fracture height. The neural network model was able to generate satisfactory estimates of the fracture fluid efficiency for the training dataset, and for the blind testing data. An average error of approximately 2.5% was obtained for the training set, and an average error of 3% was obtained for the testing set. An empirical non-linear regression model has been constructed based on dimensionless groups derived by applying dimensional analysis to a set of variables consisting of the maximum fracture width, fracture length, fracture height, effective viscosity, shear rate/fracture conductivity ratio, reservoir thickness, injection rate, reservoir permeability, and formation closure stress. The average error for estimating the fluid efficiency using the non-linear regression empirical model was approximately 6.17%. Since the non-linear regression model has an explicit formulation, it is easier to apply than the neural network model. The empirical regression model estimates of the fluid efficiency appeared to be unbiased and were more precise than those estimates obtained using either the KGD or the PKN 2-D models. The introduced BP model and the non-linear regression model offer fast and inexpensive alternatives to the application of three-dimensional simulators for estimating the fluid efficiency.",
    "year": 2023,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "da3fd964b684b424c745846d9fae7bbc",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "regression",
      "neural network",
      "backpropagation",
      "BP"
    ],
    "stage1_timestamp": "2025-05-15T00:47:18.468093"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究水力压裂流体效率的建模，应用于天然气储层工程领域，并未涉及任何金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究水力压裂流体效率的建模，应用于天然气储层工程领域，并未涉及任何金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:28:27.930701"
}