{
  "paper": {
    "id": 68,
    "title": "Risk Analysis of Textile Industry Foreign Investment Based on Deep Learning",
    "abstract": "With the decline of China's economic growth rate and the uproar of antiglobalization, the textile industry, one of the business cards of China's globalization, is facing a huge impact. When the economic model is undergoing transformation, it is more important to prevent enterprises from falling into financial distress. So, the financial risk early warning is one of the important means to prevent enterprises from falling into financial distress. Aiming at the risk analysis of the textile industry's foreign investment, this paper proposes an analysis method based on deep learning. This method combines residual network (ResNet) and long short-term memory (LSTM) risk prediction model. This method first establishes a risk indicator system for the textile industry and then uses ResNet to complete deep feature extraction, which are further used for LSTM training and testing. The performance of the proposed method is tested based on part of the measured data, and the results show the effectiveness of the proposed method.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "deep learning",
    "cache_key": "fbc59346e7521e6aa01ede434d698579",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "neural network",
      "long short-term memory",
      "LSTM",
      "feature learning",
      "representation learning"
    ],
    "stage1_timestamp": "2025-05-15T01:33:48.982703"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on financial risk early warning for the textile industry's foreign investment using deep learning techniques, which falls under the domain of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on financial risk early warning for the textile industry's foreign investment using deep learning techniques, which falls under the domain of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:04:46.071044"
}