{
  "paper": {
    "id": 2655,
    "title": "A rule extraction based approach in predicting derivative use for financial risk hedging by construction companies",
    "abstract": "Prevention of financial risk is one of the major tasks that construction companies have to pay attention to. Using derivatives to avoid such risks is a practical strategy, but is heavily dependent on the traders' skills and accuracy of predictions. The purpose of this study is to develop an automatic expert model using a rule extraction based approach that provides practitioners with a prediction tool for the hedging of financial risks through the use of derivatives. Data for the study include 780 quarterly financial statements collected from 2002 to 2006, based on public information from 39 listed construction companies in Taiwan. Statements with incomplete and missing data are eliminated, leaving 672 with which to construct the rule extraction based model, the Hyper Rectangular Composite Neural Networks (HRCNNs). After factor dimension reduction, only 16 financial ratios out of all revealed ratios are left to be used as input variables. The HRCNNs yield an 80.6% successful classification rate. With these 16 financial ratios and the proposed model, derivative use to hedge financial risk can be established for the benefit of the construction practitioners. (C) 2010 Elsevier Ltd. All rights reserved.",
    "year": 2010,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "b2e3afd855d7f850ded4bc56806b8cf6",
    "relevant_keywords": [
      "machine learning",
      "classification",
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T02:17:32.289198"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是开发一个基于规则提取的自动专家模型，用于预测建筑公司使用衍生品对冲金融风险的行为。这直接涉及金融风险管理的应用，旨在帮助公司更有效地预防金融风险。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是开发一个基于规则提取的自动专家模型，用于预测建筑公司使用衍生品对冲金融风险的行为。这直接涉及金融风险管理的应用，旨在帮助公司更有效地预防金融风险。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:40:40.763401"
}