{
  "paper": {
    "id": 838,
    "title": "Carbon price forecasting based on news text mining considering investor attention",
    "abstract": "The carbon market relies on market-oriented financial means to solve the problem of carbon emissions. An effective carbon pricing mechanism can improve market efficiency and better serve the implementation of carbon emission reduction. The limited attention of investors increases the uncertainty of carbon market volatility and is an important exogenous factor affecting the price of carbon assets. This study innovatively mines keywords of investor attention on the carbon market through online news texts and eliminates those that have no causal link to carbon price forecasting in order to reduce noise. The results show that the keyword extraction method based on news text mining is better than that of nontext mining. Meanwhile, a carbon price forecasting model based on a particle-swarm-optimization LSTM model structure is constructed, and the forecasting accuracy is improved. The results show that carbon market investors pay more attention to carbon quota supply and demand, carbon prices, environmental change, and the energy market. The results have important implications for the development of effective carbon market policies and risk management.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "deep learning",
    "cache_key": "df0721dc0af3cbcea94790a8831043db",
    "relevant_keywords": [
      "deep learning",
      "long short-term memory",
      "LSTM"
    ],
    "stage1_timestamp": "2025-05-15T01:43:20.602151"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用LSTM模型预测碳价格，并分析了投资者关注对碳市场波动的影响，这直接关联到金融风险管理中的价格波动和不确定性管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是使用LSTM模型预测碳价格，并分析了投资者关注对碳市场波动的影响，这直接关联到金融风险管理中的价格波动和不确定性管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:02:02.211373"
}