{
  "paper": {
    "id": 1968,
    "title": "Network analysis for financial crime risk assessment: the case study of the gambling division in Malta",
    "abstract": "The present study aims to support existing risk assessment tools by proposing an innovative network-oriented methodology based on ownership information. The approach involves calculating company-level indicators that are then transformed into red flags and used to rate risk. To this end, we collect data on companies active in the division of gambling and betting activities in Malta, and further combine them with information on enforcement actions imposed on Maltese companies, their beneficial owners, intermediate shareholders and subsidiaries. Correlation analysis and statistical testing were performed to assess the individual relevance of company-level indicators, while machine learning methods were employed to validate the usefulness of the indicators when used collectively. We conclude that the intelligent use of ownership information and proper analysis of ownership networks greatly supports the detection of firms involved in financial crime, hence the recommendation to adopt akin approaches to improve risk assessment strategies.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "92490a29b99f119629b246e94967b71e",
    "relevant_keywords": [
      "machine learning",
      "classification",
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T02:09:48.270656"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文提出了一种基于所有权信息的网络导向方法，用于评估金融犯罪风险，并通过机器学习和统计分析验证了该方法的有效性。这直接应用于金融风险管理领域，特别是针对金融犯罪的风险评估。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"该论文提出了一种基于所有权信息的网络导向方法，用于评估金融犯罪风险，并通过机器学习和统计分析验证了该方法的有效性。这直接应用于金融风险管理领域，特别是针对金融犯罪的风险评估。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:45:09.421036"
}