{
  "paper": {
    "id": 1862,
    "title": "Predictive Modeling for Decision Support in the Tasks of Selecting the Drug for Obesity Treatment",
    "abstract": "Obesity is a serious and dangerous problem in the modern world. Since 1975, the number of obese people worldwide has tripled. Obesity is a major risk factor for noncommunicable diseases such as cardiovascular diseases, type 2 diabetes, musculoskeletal disorders (especially osteoarthritis), some cancers and the risk for these diseases increases, with increases in BMI. One of the methods of treating obesity is drug therapy, however, many anti-obesity drugs are expensive, so doctors and patients need to understand in advance whether the drug will have a positive effect. This information will help optimize the use of hospital and patient time and financial resources. In this article, we propose the method of using predictive machine learning regression models for selecting drug treatment for obese patients as part of the creating the Decision Support System (DSS). The proposed models have peaty high accuracy, which allows to use it by medical experts in practical problems of choosing a therapy for obese patients. Moreover, we evaluated the efficiency of our method by conducting a virtual experiment, which is described below. The algorithm selected the more effective drug for 33 out of 41 patients. The average effectiveness was 2.1% of body weight. Validation result of the best model: Root Mean Squared Error (RMSE) is 1.69, Mean Absolute Error (MAE) is 1.34. (C) 2021 The Authors. Published by ELSEVIER B.V.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "9d7efa3b8aa38ad866ad1d10ada3fda0",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "regression",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T02:08:04.069028"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究使用机器学习模型预测肥胖症药物治疗效果，属于医疗决策支持系统领域，与金融研究领域无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究使用机器学习模型预测肥胖症药物治疗效果，属于医疗决策支持系统领域，与金融研究领域无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:45:31.978986"
}