{
  "paper": {
    "id": 2345,
    "title": "ESTIMATING EXPECTED AND UNEXPECTED LOSSES FOR AGRICULTURAL MORTGAGE PORTFOLIOS",
    "abstract": "The financial crisis that began in 2008 placed renewed emphasis and responsibility on financial institutions to assess financial risks and provide evidence of adequate capital to accommodate those risks. Financial regulators in the United States are now requiring financial institutions with mortgage portfolios to show they have set aside sufficient capital reserves to meet expected and unexpected losses caused by credit defaults. Various methods exist to estimate the loss risk of agricultural loan portfolios, and those methods were used to estimate the economic capital necessary to cover loan losses for a financial institution. Combining estimates of probability of delinquency, probability of loss, loss given default, and exposure at default from various models, one-year-ahead expected loss estimates were derived. Value-at-Risk and expected shortfall estimates were obtained from loss distributions to arrive at unexpected loss estimates. Previous empirical studies reported in the literature often only measured the probability of default, but the other components are essential to determine the necessary economic capital to meet expected and unexpected loan losses. Results show that measures of liquidity, solvency, profitability, and controls for unobserved heterogeneity are important when modeling delinquency, while measures of leverage, state-level economic output, and controls for unobserved heterogeneity are important when modeling loss given default. Predicted portfolio expected losses were greatest for the regression model combination that included the loss given default linear regression static variable models, and least for the regression model combination using static and time-varying variables. These results should prove useful in determining and assessing capital reserve requirements for financial institutions with mortgage portfolios.",
    "year": 2016,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "f9c378da404436a5a3ed2d38a9f3b5dd",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:14:19.638922"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on estimating expected and unexpected losses for agricultural mortgage portfolios, which involves assessing financial risks and determining capital reserves to cover these risks. The use of Value-at-Risk and expected shortfall estimates to measure unexpected losses clearly falls under the domain of Financial Risk Management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on estimating expected and unexpected losses for agricultural mortgage portfolios, which involves assessing financial risks and determining capital reserves to cover these risks. The use of Value-at-Risk and expected shortfall estimates to measure unexpected losses clearly falls under the domain of Financial Risk Management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:42:56.540259"
}