{
  "paper": {
    "id": 1521,
    "title": "An approach to predicting patient experience through machine learning and social network analysis",
    "abstract": "Objective: Improving the patient experience has become an essential component of any healthcare system's performance metrics portfolio. In this study, we developed a machine learning model to predict a patient's response to the Hospital Consumer Assessment of Healthcare Providers and Systems survey's Doctor Communications domain questions while simultaneously identifying most impactful providers in a network. Materials and Methods: This is an observational study of patients admitted to a single tertiary care hospital between 2016 and 2020. Using machine learning algorithms, electronic health record data were used to predict patient responses to Hospital Consumer Assessment of Healthcare Providers and Systems survey questions in the doctor domain, and patients who are at risk for responding negatively were identified. Model performance was assessed by area under receiver-operating characteristic curve. Social network analysis metrics were also used to identify providers most impactful to patient experience. Results: Using a random forest algorithm, patients' responses to the following 3 questions were predicted: During this hospital stay how often did doctors. 1) treat you with courtesy and respect? 2) explain things in a way that you could understand? 3) listen carefully to you? with areas under the receiver-operating characteristic curve of 0.876, 0.819, and 0.819, respectively. Social network analysis found that doctors with higher centrality appear to have an outsized influence on patient experience, as measured by rank in the random forest model in the doctor domain. Conclusions: A machine learning algorithm identified patients at risk of a negative experience. Furthermore, a doctor social network framework provides metrics for identifying those providers that are most influential on the patient experience.",
    "year": 2020,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "09ccb05d752a93ad0352dc46269d73f3",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "decision tree",
      "random forest"
    ],
    "stage1_timestamp": "2025-05-15T00:56:39.062833"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究使用机器学习和社会网络分析来预测和改善患者体验，属于医疗健康领域，与衍生品定价、金融风险管理和投资组合管理等金融领域无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究使用机器学习和社会网络分析来预测和改善患者体验，属于医疗健康领域，与衍生品定价、金融风险管理和投资组合管理等金融领域无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:20:36.637983"
}