{
  "paper": {
    "id": 1085,
    "title": "Quantifying systemic risk in US industries using neural network quantile regression",
    "abstract": "The study quantified the systemic risk spillovers between top 10 US industries using conditional value-at-risk in a network context by calibrating the marginal effects of a quantile regression process and coving period from January 3, 2007-May 28, 2021 and found significant variations in the risk measured using a nonlinear process. Neural networks identified the manufacturing industry as the center of risk spillovers with the disconnected telecommunication industry in a system-wide neural network portraying its diversification potential. The systematic fragility index, which ranks industries with a high exposure to tail risk in a system, revealed the utilities industry as being the most vulnerable to economically fragile periods. By contrast, the systematic hazard index, which measures the risk contribution of an industry, showed the manufacturing industry as the principal risk contributor. With this tail risk assessment, particularly during distress periods, we stipulate several implications for policymakers, regulators, investors, and financial market participants.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "3b7c4f4c38ab787c5e366779626b291a",
    "relevant_keywords": [
      "neural network",
      "regression",
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T01:58:43.396116"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on quantifying systemic risk spillovers between industries using neural network quantile regression, which is a method for assessing financial risk. The study specifically addresses risk measurement and implications for policymakers and regulators, which are central to financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on quantifying systemic risk spillovers between industries using neural network quantile regression, which is a method for assessing financial risk. The study specifically addresses risk measurement and implications for policymakers and regulators, which are central to financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:52:18.360417"
}