{
  "paper": {
    "id": 4061,
    "title": "Prevalence and clustering of health behaviours and the association with socio-demographics and mental well-being in Dutch university students",
    "abstract": "The college years represent a vulnerable period for developing health-risk behaviours (e.g., physical inactivity/ unhealthy eating habits/substance use/problematic internet use/insufficient sleep). This study examined current health behaviour levels (RQ1), health behaviour classes (RQ2) and between-class differences in socio-demographics (RQ3) and mental well-being (RQ4) among Dutch university students (n = 3771). Participants (Mage = 22.7 (SD = 4.3); 71.2% female/27.3% male/1.5% other) completed an online survey (Oct-Nov 2021). Descriptive statistics (RQ1), Latent Class Analysis (RQ2), and Kruskal-Wallis/Chi-square tests (RQ3-4) were used. RQ1: Prevalence rates suggest that a subsequent proportion of the student sample engages in health-risk behaviours. RQ2: Four classes were identified: class 1 (n = 862) Licit substance use health-risk group, class 2 (n = 435) Illicit and licit substance use health-risk group, class 3 (n = 1876) Health-protective group and class 4 (n = 598) Non-substance use health-risk group. RQ3: Class 1 represents relatively more international students and students in a steady relationship. Class 2 represents relatively more older/male/(pre-)master students and students living with roommates/in a steady relationship/with more financial difficulty. Class 3 represents relatively more younger/ female students and students living with family/with lower Body Mass Index (BMI)/less financial difficulty. Class 4 represents relatively more younger/non-Western/international/bachelor students and students living with chil-dren/single/part of LGBTIQ+ community/with higher BMI. RQ4: Class 3 has significantly higher mental well-being while class 4 has significantly lower mental well-being, relative to the other classes. Above findings provide new insights which can help educational institutes and governments better understand the clustering of students' health behaviours and between-class differences in socio-demographics and mental well-being.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "c289a912f93edaa4f40b0978a08fac2f",
    "relevant_keywords": [
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T02:32:27.643928"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究大学生健康行为的聚类及其与社会人口统计学和心理健康的关系，并未涉及任何金融领域的技术或应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究大学生健康行为的聚类及其与社会人口统计学和心理健康的关系，并未涉及任何金融领域的技术或应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:34:19.014765"
}