{
  "paper": {
    "id": 3202,
    "title": "A return spillover network perspective analysis of Chinese financial institutions' systemic importance",
    "abstract": "The objective of this study is to analyze systemic importance of Chinese financial institutions and its influential factors based on return spillover network. We first investigate the return spillover effects among financial institutions and construct the return spillover networks by Granger causality in vector autoregressive (VAR) models. Then we calculate six network centralities (degree centrality, closeness centrality, betweenness centrality, modified Katz centrality, eccentricity centrality and information centrality) to measure systemic importance of financial institutions. Because different centrality measures are correlated with each other, we use the principal component analysis method to obtain comprehensive information about systemic importance of financial institutions. Finally, we identify the major factors, including market and accounting variables, which affect systemic importance of the financial institutions with panel data regression analysis. We find that financial institutions with larger tail risk of stock return, higher return on equity, lower turnover rate and lower assets growth rate tend to be associated with greater systemic importance. (C) 2018 Elsevier B.V. All rights reserved.",
    "year": 2018,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "7a0a35291cf1124df37b9e14977e7b79",
    "relevant_keywords": [
      "principal components analysis"
    ],
    "stage1_timestamp": "2025-05-15T02:23:33.595348"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要研究金融机构的系统性重要性及其影响因素，通过构建回报溢出网络和计算网络中心性来评估系统性风险，这属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文主要研究金融机构的系统性重要性及其影响因素，通过构建回报溢出网络和计算网络中心性来评估系统性风险，这属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:38:03.616566"
}