{
  "paper": {
    "id": 532,
    "title": "A Denoising Autoencoder Approach for Credit Risk Analysis",
    "abstract": "Credit risk evaluation is a key consideration in financial activities. Financial institutions such as banks rely on credit risk analysis for determining the potential risk involved in financial activities and then decide the degree of involvement in such activities as well as the appropriate interest rate and the amount of capital that should be reserved. The recent development of machine learning has provided powerful tools for computer-aided credit risk analysis, and neural networks are one of the most promising approaches. However, conventional artificial neural networks involve multiple layers of neurons which then become a universal function that can approximate any function. Therefore, it will learn from not only the information in the training data set but also from the noise in it. It is critical to remove the noise in order to improve the accuracy and efficiency of such algorithms. In this paper, a denoising autoencoder approach is proposed for the training process for neural networks. The denoising-autoencoder-based neural network model is then applied to credit risk analysis, and the performance is evaluated.",
    "year": 2018,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "17a7694a6fc8314b491f6ff36263929a",
    "relevant_keywords": [
      "machine learning",
      "neural network",
      "deep learning",
      "representation learning",
      "autoencoder",
      "denoising autoencoder"
    ],
    "stage1_timestamp": "2025-05-15T01:52:12.240172"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on credit risk analysis, which is a key component of financial risk management, particularly for banks and financial institutions assessing the risk of financial activities.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on credit risk analysis, which is a key component of financial risk management, particularly for banks and financial institutions assessing the risk of financial activities.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:57:05.660998"
}