{
  "paper": {
    "id": 1064,
    "title": "Microcredit Pricing Model for Microfinance Institutions under Basel III Banking Regulations",
    "abstract": "Purpose. The purpose of this research is to propose a tool for designing a microcredit risk pricing strategy for borrowers of microfinance institutions (MFIs). Design/methodology/approach. Considering the specific characteristics of microcredit borrowers, we first estimate and measure microcredit risk through the default probability, applying a parametric technique such as logistic regression and a non-parametric technique based on an artificial neural network, looking for the model with the highest predictive power. Secondly, based on the Basel III internal ratings-based (IRB) approach, we use the credit risk measurement for each borrower to design a pricing model that sets microcredit interest rates according to default risk. Findings. The paper demonstrates that the probability of default for each borrower is more accurately adjusted using the artificial neural network. Furthermore, our results suggest that, given a profitability target for the MFI, the microcredit interest rate for clients with a lower level of credit risk should be lower than a standard, fixed rate to achieve the profitability target. Practical implications. This tool allows us, on the one hand, to measure and assess credit risk and minimize default losses in MFIs and, secondly, to promote their competitiveness by reducing interest rates, capital requirements, and credit losses, favoring the financial self-sustainability of these institutions. Social implications. Our findings have the potential to make microfinance institutions fairer and more equitable in their lending practices by providing microcredit with risk-adjusted pricing. Furthermore, our findings can contribute to the design of government policies aimed at promoting the financial and social inclusion of vulnerable people. Originality. The personal characteristics of microcredit clients, mainly reputation and moral solvency, are crucial to the default behavior of microfinance borrowers. These factors should have an impact on the pricing of microcredit.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "89ff0f7456cc7688e262b8c3c52a1225",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "regression",
      "neural network",
      "artificial neural network"
    ],
    "stage1_timestamp": "2025-05-15T01:58:43.341178"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on measuring and assessing credit risk through default probability estimation using machine learning techniques, and designing a pricing model based on the Basel III IRB approach. This directly addresses credit risk management, a key aspect of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on measuring and assessing credit risk through default probability estimation using machine learning techniques, and designing a pricing model based on the Basel III IRB approach. This directly addresses credit risk management, a key aspect of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:52:19.974296"
}