{
  "paper": {
    "id": 6980,
    "title": "NON-FINANCIAL DETERMINANTS OF SMES' GROWTH POTENTIAL",
    "abstract": "Fast growing small and medium-sized enterprises (SMEs) are of great importance to every national economy due to their ability to create jobs, increase competitiveness, generate revenues and boost innovation. As such, they have attracted attention of many scholars and researchers who direct their efforts toward identifying factors or predictors of growth. Most of them have developed their studies at national and institutional level (searching for policy recommendations that will lead to an environment favorable for fast growing SMEs to achieve their full potential), and at enterprise level (looking at specific strategic actions and managerial decisions that can be derived from an analysis of predominantly financial data). This paper builds upon previous studies and introduces a new set of prospective predictor variables related to the entrepreneur's experience (in the context of industry, specific enterprise and entrepreneurial career in general), expertise (e.g. formal and informal education) and personality (e.g. risk tolerance, locus of control, goal orientation). The aim of the study is to explore the relationship and influence of entrepreneur-related variables on the growth potential of small and medium-sized enterprises. The sample consists of 199 SMEs and the prediction model is developed using logistic regression. The results demonstrate an importance of entrepreneur-related variables (experience, risk-taking propensity and locus of control), organizational practices and technology in achieving high-growth potential.",
    "year": 2018,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "9d79d94c948ec69c4fbb5f3b403d649a",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T03:03:55.694882"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究中小企业的增长潜力与非财务因素（如企业家经验、风险承受能力等）之间的关系，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究中小企业的增长潜力与非财务因素（如企业家经验、风险承受能力等）之间的关系，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:27:06.502329"
}