{
  "paper": {
    "id": 2252,
    "title": "Smooth Transition Quantile Capital Asset Pricing Models with Heteroscedasticity",
    "abstract": "Capital asset pricing model (CAPM) has become a fundamental tool in finance for assessing the cost of capital, risk management, portfolio diversification and other financial assets. It is generally believed that the market risks of the assets, often denoted by a beta coefficient, should change over time. In this paper, we model timevarying market betas in CAPM by a smooth transition regime switching CAPM with heteroscedasticity, which provides flexible nonlinear representation of market betas as well as flexible asymmetry and clustering in volatility. We also employ the quantile regression to investigate the nonlinear behavior in the market betas and volatility under various market conditions represented by different quantile levels. Parameter estimation is done by a Bayesian approach. Finally, we analyze some Dow Jones Industrial stocks to demonstrate our proposed models. The model selection method shows that the proposed smooth transition quantile CAPM-GARCH model is strongly preferred over a sharp threshold transition and a symmetric CAPM-GARCH model.",
    "year": 2012,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "7d6236593aa73357251d13dcfdab24d0",
    "relevant_keywords": [
      "regression",
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T02:12:51.071553"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management",
      "Financial Risk"
    ],
    "justification": "该论文主要研究资本资产定价模型（CAPM）中的时变市场贝塔系数，通过平滑过渡机制和分位数回归来捕捉市场贝塔和波动率的非线性行为。这些技术直接应用于投资组合管理中的资产定价和风险分散，同时也涉及金融风险管理中的波动率建模和风险评估。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\", \"金融风险管理\"],\n  \"justification\": \"该论文主要研究资本资产定价模型（CAPM）中的时变市场贝塔系数，通过平滑过渡机制和分位数回归来捕捉市场贝塔和波动率的非线性行为。这些技术直接应用于投资组合管理中的资产定价和风险分散，同时也涉及金融风险管理中的波动率建模和风险评估。\"\n}\n```"
  },
  "timestamp": "2025-05-20T14:23:36.265949"
}