{
  "paper": {
    "id": 950,
    "title": "A generalised regression neural network model of financing imbalance: Shari'ah compliance as the roadmap for sustainability of capital markets",
    "abstract": "The current study looks at the impact of compliance to Shari'ah principles on the capital structure for Malaysian firms. Examination of impact of compliance is based on the classification by the Securities Commission of Malaysia. Given that the literature on adjustment tends to ignore non-linear models, the current study utilises Generalised Regression Neural Network (GRNNs). Results are compared to conventional panel data regression models via performing a hold-out sample. Initial results confirm stability of the data allowing predictive ability. The results indicate that compliant firms tend to finance a greater portion of their financing imbalance via equities relative to non-compliant firms. This provides a strong indication towards compliant firms reducing overall risk taking where the financing pattern incorporates a greater aspect of risk sharing which is in-line with Shari'ah principles. In addition, two more factors are ranked as important in deciding compliant firms issue choice to resolve financial imbalance: profitability and size. The rest of the determinants have low impact on explaining net debt issues. Diagnostics for results provide evidence of lower RMSE and MSE for GRNNs for the training, testing and overall datasets. The potential benefit of this research allows managers and investors of Islamic capital markets to understand potential risk exposure and financing costs of compliant firms. Findings also provide a roadmap for development of a sustainable capital market model which has wider implications on a global scale.",
    "year": 2020,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "f6ac794d78af021ae3ca67aa22f0b0df",
    "relevant_keywords": [
      "neural network",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:56:49.729343"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究Shari'ah合规性对马来西亚公司资本结构的影响，并利用广义回归神经网络（GRNNs）进行分析。虽然提到了风险暴露和融资成本，但核心研究并不直接涉及衍生品定价、金融风险管理或投资组合管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究Shari'ah合规性对马来西亚公司资本结构的影响，并利用广义回归神经网络（GRNNs）进行分析。虽然提到了风险暴露和融资成本，但核心研究并不直接涉及衍生品定价、金融风险管理或投资组合管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:53:07.815430"
}