{
  "paper": {
    "id": 1326,
    "title": "Computer simulation of investment efficiency function model based on GMM method and artificial intelligence",
    "abstract": "Traditional investment efficiency evaluation methods mostly focus on single-stage investment portfolio evaluation, and there is no comprehensive theoretical analysis method in multi-stage investment evaluation. Therefore, the construction of a scientific and reasonable multi-stage investment portfolio evaluation system is an urgent need for the theoretical and practical industries. In order to improve the efficiency of investment efficiency model evaluation, based on the GMM method and machine learning algorithm, this paper constructs an investment efficiency model based on the GMM method, and uses the characteristics of multi-scale Gaussian convolution to establish the MGCGMM model corresponding to the GMM model. The experimental results provided in this paper show that the MGC algorithm and the MGC-EM algorithm have higher estimation accuracy than the traditional algorithm EM algorithm. The intuitive meaning of this model can be understood as the mathematical expectation of the random variable function induced by the kernel function, which provides a way to directly estimate the GMM model using sample data. According to the case analysis, the model constructed in this paper has certain effects.",
    "year": 2021,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "901b7b043ae798a1053f313938d89eab",
    "relevant_keywords": [
      "machine learning",
      "unsupervised learning",
      "clustering",
      "neural network",
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T00:54:24.677702"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是基于GMM方法和人工智能构建多阶段投资组合效率评估模型，其研究目标明确指向投资组合管理的领域，旨在提高投资效率模型的评估效果。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是基于GMM方法和人工智能构建多阶段投资组合效率评估模型，其研究目标明确指向投资组合管理的领域，旨在提高投资效率模型的评估效果。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:21:42.380741"
}