{
  "paper": {
    "id": 3118,
    "title": "Conditional quantile change test for time series based on support vector regression",
    "abstract": "The task of detecting a structural change in conditional quantiles of time series with time-varying volatilities is vital in the field of financial time series, especially risk management. Therefore, in this study, we aim to construct a change point test to detect a quantile change by hybridizing the cumulative sum of squares test with the support vector quantile regression. Compared to the test employing the standard quantile regression, this approach not only provides more robust property against a high degree of nonlinearity of time series but also exhibits better performance for the datasets contaminated with high-frequency noises, as demonstrated in our simulation study. It also has merits to provide more diverse interpretations and a deeper understanding of financial time series than the volatility change point test, as illustrated in a real data analysis of three financial indices, namely, S&P500, Nasdaq composite index, and the stock price of Apple Inc.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "952c6f5f151281731400296663d76011",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "regression",
      "support vector machine",
      "SVM"
    ],
    "stage1_timestamp": "2025-05-15T02:22:56.653747"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on detecting structural changes in conditional quantiles of financial time series, which is crucial for risk management. The methodology is demonstrated using financial indices, indicating its application in assessing and managing financial risks.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on detecting structural changes in conditional quantiles of financial time series, which is crucial for risk management. The methodology is demonstrated using financial indices, indicating its application in assessing and managing financial risks.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:38:06.274709"
}