{
  "paper": {
    "id": 2213,
    "title": "Data-driven Urban Energy Simulation (DUE-S): Integrating machine learning into an urban building energy simulation workflow",
    "abstract": "Urban building energy models are emerging tools meant to analyze and understand the energy performance of multiple buildings within a dense urban area. However, accurate performance prediction of these models remains a challenge because of their inability to account for the inter-building energy dynamics and interdependencies in an urban area. This paper analyzes the literature to highlight the limitations of current urban scale energy simulation models and proposes a new Data-driven Urban Energy Simulation (DUE-S) workflow capable of capturing inter-building effects on a building's energy usage. Specifically, DUE-S combines a data-driven machine learning model with a traditional physics-based energy simulation to enable more accurate simulation results on multiple scales (single building, community, urban). More accurate and robust energy performance characterization and simulations of urban buildings could provide valuable insight on early-stage building design, building conservation and portfolio management, and urban energy efficiency policy-making crucial to helping our cities transition to a more sustainable energy future. (C) 2017 The Authors. Published by Elsevier Ltd. Peer-review under responsibility of the scientific committee of the 9th International Conference on Applied Energy.",
    "year": 2017,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "d82fc25543c73504acf386e7f5ecd413",
    "relevant_keywords": [
      "machine learning",
      "neural network",
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T01:04:27.437985"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究城市建筑能源模拟，结合机器学习提高模拟准确性，其应用领域集中在建筑能源效率、设计和政策制定，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究城市建筑能源模拟，结合机器学习提高模拟准确性，其应用领域集中在建筑能源效率、设计和政策制定，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:16:41.851193"
}