{
  "paper": {
    "id": 2172,
    "title": "Interval fuzzy rule-based modeling approach for financial time series forecasting",
    "abstract": "Financial interval time series (ITS) describe the evolution of the maximum and minimum prices of an asset throughout time, which can be related to the concept of volatility. Hence, their accurate forecasts play a key role in risk management, derivatives pricing and asset allocation, as well as supplements the information extracted by the time series of the closing price values. This paper proposes an interval fuzzy rule-based model (iFRB) for ITS forecasting. iFRB consists in a fuzzy rule-based approach with affine consequents, which provides a nonlinear method that processes interval-valued data. It is suggested as empirical application the prediction of the main index of the Brazilian stock market, the IBOVESPA. One-step-ahead interval forecasts are compared against traditional univariate and multivariate time series benchmarks and with an interval multilayer perceptron neural network in terms of accuracy metrics and statistical tests. The results indicate that iFRB provides accurate forecasts and appears as a potential tool for financial ITS forecasting.",
    "year": 2017,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "9eb5850355fb3cea392dc1cca7518956",
    "relevant_keywords": [
      "neural network",
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T02:12:17.355984"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk",
      "Derivatives Pricing",
      "Portfolio Management"
    ],
    "justification": "论文摘要明确指出，金融区间时间序列（ITS）的准确预测在风险管理、衍生品定价和资产配置中起着关键作用。论文提出的区间模糊规则模型（iFRB）用于预测巴西股票市场的主要指数IBOVESPA，这些应用直接关联到金融风险管理、衍生品定价和投资组合管理领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\", \"衍生品定价\", \"投资组合管理\"],\n  \"justification\": \"论文摘要明确指出，金融区间时间序列（ITS）的准确预测在风险管理、衍生品定价和资产配置中起着关键作用。论文提出的区间模糊规则模型（iFRB）用于预测巴西股票市场的主要指数IBOVESPA，这些应用直接关联到金融风险管理、衍生品定价和投资组合管理领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:44:03.677577"
}