{
  "paper": {
    "id": 1331,
    "title": "Can machine learning identify sector-level financial ratios that predict sector returns?",
    "abstract": "Academics and practitioners use fundamental ratios to evaluate an industry's financial and operating performance. WRDS has large firm-level and sector/industry-level databases that provide over 70 financial ratios that are applied in finance classes to compare and assess relative financial performance. However, there has been a lack of sophisticated econometric methods assessing these ratios' importance in predicting sector-level stock return performance. Using Elastic Net methods, we identify financial ratios that significantly forecast out-of-sample sector stock returns and find that these predictive ratios vary across sectors. We form long and longshort portfolios that consistently outperform the market over-time. Long portfolios generate significant alpha and large utility gains, boost the Sharpe and Sortino ratios, and a cumulative investment portfolio exceeds the market benchmark by five times. Long-short portfolios generate Fama-French 4-factor and 6-factor alphas between 4-9% and cumulative investment gains from six to fourteen times. Our research establishes that machine learning can identify financial ratios that significantly predict sector returns and generate profitable portfolio allocation.",
    "year": 2023,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "c4c1080c7ec9d8c3cb887c5036b99e05",
    "relevant_keywords": [
      "machine learning",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T00:54:24.695203"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是使用机器学习方法（Elastic Net）识别能够预测行业股票回报的财务比率，并基于这些预测构建长期和长期-短期投资组合。这些投资组合的表现显著优于市场基准，并产生了显著的alpha和效用增益。因此，论文的主要应用领域是投资组合管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是使用机器学习方法（Elastic Net）识别能够预测行业股票回报的财务比率，并基于这些预测构建长期和长期-短期投资组合。这些投资组合的表现显著优于市场基准，并产生了显著的alpha和效用增益。因此，论文的主要应用领域是投资组合管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:21:41.765040"
}