{
  "paper": {
    "id": 352,
    "title": "A gradient-boosting decision-tree approach for firm failure prediction: an empirical model evaluation of Chinese listed companies",
    "abstract": "Firm failure prediction is playing an increasingly important role in financial decision making. Ensemble methods have recently shown better classification performance than a single classifier, but the tree-based ensemble method for firm failure prediction has not been fully studied and remains to be further validated. Compared with other machine learning methods, it is more easily interpreted and requires little data preprocessing. In this paper, we employ a gradient-boosting decision-tree (GBDT) method to improve firm failure prediction and explain how to better analyze the relative importance of each financial variable. Because the GBDT deliberately adds new trees in order to correct errors made in previous steps, it has the potential to improve firm failure predictive performance. The influences of different parameters on model performance are analyzed in detail. Moreover, our proposed model is compared with four other popular ensemble methods. Our experimental results show that the GBDT outperforms these other methods in accuracy, precision, F - score and area under the curve. We therefore provide a full validation of GBDT, and believe that it is useful in controlling risk in financial risk management.",
    "year": 2017,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "38a91b31b2529f51146e9c8b8398acd5",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T01:49:41.094275"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用梯度提升决策树（GBDT）方法来改进企业失败预测，并分析财务变量的相对重要性。论文明确指出这种方法有助于控制金融风险管理中的风险，因此属于金融风险管理领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"该论文的核心技术是使用梯度提升决策树（GBDT）方法来改进企业失败预测，并分析财务变量的相对重要性。论文明确指出这种方法有助于控制金融风险管理中的风险，因此属于金融风险管理领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:59:00.611540"
}