{
  "paper": {
    "id": 3048,
    "title": "Risk governance and cybercrime: the hierarchical regression approach",
    "abstract": "This study examines the impact of risk governance on cybercrime of selected listed firms in the Nigerian financial institutions. To achieve this, a sample size of 50 listed companies from the Nigerian financial sector was selected for the years 2013-2017, resulting in 250 observations. The study employed the use of hierarchical regression analysis to test the impact of risk governance variables (Chief Risk Officer_centrality, Enterprise Risk Management_index, Chief Risk Officer_presence, Board Risk Committee_size, Board Risk Committee_activism, and Board Risk Committee_independence) and other control variables such as corporate governance variables (Board Size and Board of Directors_independence) and firm characteristics variables (Firm size and firm age) on cybercrime. The study observed from the findings that almost all the explanatory variables present a positive and significant relationship with cybercrime, except the Chief Risk Officer_presence, firm age and Board Risk Committee_size which revealed an insignificant relationship with cybercrime. The study concludes that risk governance variables and other variables are likely to reduce and minimize the impact of cybercrime on the sampled firms used in this study.",
    "year": 2020,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "e69641c746c6dd5c2eb1ba6457218edb",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:21:52.272540"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文研究了风险治理对网络犯罪的影响，并使用了风险治理变量和企业特征变量来分析其对网络犯罪的影响。这属于金融风险管理的范畴，因为网络犯罪是金融机构面临的一种重要风险。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文研究了风险治理对网络犯罪的影响，并使用了风险治理变量和企业特征变量来分析其对网络犯罪的影响。这属于金融风险管理的范畴，因为网络犯罪是金融机构面临的一种重要风险。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:38:31.907442"
}