{
  "paper": {
    "id": 1173,
    "title": "Actions in words: How entrepreneurs use diversified and changing speech acts to achieve funding success",
    "abstract": "Linguistic attributes in entrepreneurs' funding campaign descriptions play an important role in attracting resources. Going beyond examining the effect of individual linguistic attributes, this study takes a portfolio approach by viewing a narrative as a portfolio or collection of linguistic attributes. Specifically, we posit a narrative as a portfolio of speech acts and examine the combined effects of select speech acts based on their variation within a narrative. Speech acts are actions that a communicator performs with their words, such as making an assertion, establishing a commitment, expressing feelings, and directing listeners to evoke certain behaviors. Drawing on the stimuli variation perspective and speech acts theory, we examine how the diversity of and changes in speech acts in a narrative can influence funding outcomes. Using a sample of 28,000 crowdfunding campaigns and a supervised machine-learning approach, we find that entrepre-neurs who adopt a variety of speech acts and frequently change from one speech act to another in a narrative are more likely to achieve funding success. Results also support inverted U-shaped relationships of individual speech acts with funding success. This study contributes to both the entrepreneurial narratives and resource acquisition literatures.",
    "year": 2023,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "63961fca13e5fe08860e7da02605d672",
    "relevant_keywords": [
      "machine learning",
      "supervised learning"
    ],
    "stage1_timestamp": "2025-05-15T00:52:33.874825"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究企业家在众筹活动中如何使用多样化和变化的言语行为来吸引资金，其核心技术是监督机器学习方法用于分析言语行为的效果。虽然涉及资金筹集，但并不直接涉及衍生品定价、金融风险管理或投资组合管理等金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究企业家在众筹活动中如何使用多样化和变化的言语行为来吸引资金，其核心技术是监督机器学习方法用于分析言语行为的效果。虽然涉及资金筹集，但并不直接涉及衍生品定价、金融风险管理或投资组合管理等金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:23:51.535351"
}