{
  "paper": {
    "id": 6757,
    "title": "Reduction in fall risk markers following CPAP treatment of obstructive sleep apnoea in people over 65 years",
    "abstract": "Objectives: Falls in older people can lead to serious injury and significant societal health and financial burden. Obstructive sleep apnoea (OSA) is associated with impaired gait/balance and may increase fall risk, yet few studies examined whether treating OSA reduces fall risk. This study examined the effect of continuous positive airway pressure (CPAP) on fall risk markers in people over 65yrs diagnosed with OSA. Design: Single arm intervention study. Setting: University and tertiary care CPAP clinic. Participants: Individuals over 65 years diagnosed with OSA and recommended CPAP. Intervention: 3-6 months CPAP therapy. Measurements: 28 participants had a physiological profile assessment (PPA) at baseline and following 3 -6 months of CPAP. The PPA examines visual contrast sensitivity, lower limb proprioception, knee extension strength, reaction time and postural sway to generate a fall risk score (FRS). t-tests were used to determine difference between pre- and post-treatment FRS. Regression was used to examine the associations between CPAP use and daytime sleepiness with FRS. Results: CPAP significantly reduced the FRS ([Mean +/- SD] 0.59 +/- 1.0 vs 0.04 +/- 1.1, p = 0.016), contrast sensitivity and lower limb proprioception (P < 0.05). Increased CPAP use was associated with improvement in FRS in unadjusted analysis ( beta = -0.213, 95%CI -0.371 to -0.056, p = 0.01). Reduction in Epworth sleepiness score was associated with a reduction in FRS in unadjusted (p = 0.023) and adjusted analysis (adjusted for AHI p = 0.027 or O2Nadir p = 0.015). Conclusions: CPAP may reduce fall risk in people over 65yrs, possibly related to better CPAP adherence and reduced daytime sleepiness. Future controlled trials and mechanistic studies are needed to elucidate how CPAP may reduce fall risk. (c) 2022 Elsevier B.V. All rights reserved.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "73d307a314962a510e04c220d4ace7c0",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T03:01:03.688297"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是通过CPAP治疗降低老年人跌倒风险，属于医学和健康领域，与金融研究领域无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是通过CPAP治疗降低老年人跌倒风险，属于医学和健康领域，与金融研究领域无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:27:30.649864"
}