{
  "paper": {
    "id": 142,
    "title": "CVaR Prediction Model of the Investment Portfolio Based on the Convolutional Neural Network Facilitates the Risk Management of the Financial Market",
    "abstract": "In summary, firstly, a method for establishing a portfolio model is proposed based on the risk management theory of the financial market. Then, a prediction model for CVaR is established based on the convolutional neural network, and the improved particle swarm algorithm is employed to solve the model. The actual data analysis is implemented to prove the feasibility of CVaR prediction model based on deep learning and particle swarm optimization algorithm in financial market risk management. The test results show that the investment portfolio CVaR prediction model based on the convolutional neural network can obtain the optimal solution in the 18th generation at the fastest after using the improved particle swarm algorithm, which is more effective than the traditional algorithm. The CVaR prediction model of the investment portfolio based on the convolutional neural network facilitates the risk management of the financial market.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "4313ed3b7b746ee2557e0dc60c6527a7",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "neural network",
      "convolutional neural network",
      "CNN"
    ],
    "stage1_timestamp": "2025-05-15T01:47:14.116539"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk",
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是基于卷积神经网络（CNN）和改进的粒子群算法建立的投资组合CVaR预测模型，旨在优化金融市场的风险管理。论文明确提到投资组合模型的建立和CVaR预测，这直接关联到投资组合管理和金融风险管理两个领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\", \"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是基于卷积神经网络（CNN）和改进的粒子群算法建立的投资组合CVaR预测模型，旨在优化金融市场的风险管理。论文明确提到投资组合模型的建立和CVaR预测，这直接关联到投资组合管理和金融风险管理两个领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:00:44.931685"
}