{
  "paper": {
    "id": 658,
    "title": "Surveying Stock Market Portfolio Optimization Techniques",
    "abstract": "Optimizing a stock market portfolio requires decision making at two distinct stages, first is to select the stocks and second is to assign distribution of investment amount among these selected stocks. Given the historical data of stocks, the role of optimization models is to select stocks and assign portfolio proportion to the selected stocks. Selection and weight assignment to stocks are co-occurring activities. Investors prime motive is to maximize the return and minimize the risk of portfolio. Stock market is uncertain and volatile and therefore, Artificial Intelligence, Machine Learning and Soft Computing techniques are viable candidates which can help in optimization and making decisions using such data. This paper surveys the research carried out in the domain of stock market portfolio optimization. Paper compares research efforts in the domain on the basis of techniques used, risk models and stock markets considered. It is observed from the surveyed papers that Artificial Intelligence, Machine Learning and Soft Computing techniques are widely accepted for studying and evaluating stock market behavior and optimizing portfolios.",
    "year": 2015,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "08ce831016e531eadf580163d1cf12b7",
    "relevant_keywords": [
      "machine learning",
      "neural network",
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T00:46:24.423858"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "The paper explicitly focuses on surveying techniques for optimizing stock market portfolios, including stock selection and investment distribution, which are core activities in portfolio management. The discussion on maximizing returns and minimizing risk further confirms its application in this domain.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Portfolio Management\"],\n  \"justification\": \"The paper explicitly focuses on surveying techniques for optimizing stock market portfolios, including stock selection and investment distribution, which are core activities in portfolio management. The discussion on maximizing returns and minimizing risk further confirms its application in this domain.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:28:55.344366"
}