{
  "paper": {
    "id": 5019,
    "title": "Not just a matter of size: a hospital-level risk factor analysis of MRSA bacteraemia in Scotland",
    "abstract": "Background: Worldwide, there is a wealth of literature examining patient-level risk factors for methicillin-resistant Staphylococcus aureus (MRSA) bacteraemia. At the hospital-level it is generally accepted that MRSA bacteraemia is more common in larger hospitals. In Scotland, size does not fully explain all the observed variation among hospitals. The aim of this study was to identify risk factors for the presence and rate of MRSA bacteraemia cases in Scottish mainland hospitals. Specific hypotheses regarding hospital size, type and connectivity were examined. Methods: Data from 198 mainland Scottish hospitals (defined as having at least one inpatient per year) were analysed for financial year 2007-08 using logistic regression (Model 1: presence/absence of MRSA bacteraemia) and Poisson regression (Model 2: rate of MRSA bacteraemia). The significance of risk factors representing various measures of hospital size, type and connectivity were investigated. Results: In Scotland, size was not the only significant risk factor identified for the presence and rate of MRSA bacteraemia. The probability of a hospital having at least one case of MRSA bacteraemia increased with hospital size only if the hospital exceeded a certain level of connectivity. Higher levels of MRSA bacteraemia were associated with the large, highly connected teaching hospitals with high ratios of patients to domestic staff. Conclusions: A hospital's level of connectedness within a network may be a better measure of a hospital's risk of MRSA bacteraemia than size. This result could be used to identify high risk hospitals which would benefit from intensified infection control measures.",
    "year": 2016,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "3ef97a5c593b406122b8f7b3cf047009",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:43:40.098120"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究医院级别的MRSA菌血症风险因素分析，使用了回归分析方法，但其应用领域是医疗健康而非金融。论文内容未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究医院级别的MRSA菌血症风险因素分析，使用了回归分析方法，但其应用领域是医疗健康而非金融。论文内容未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:31:30.872000"
}