{
  "paper": {
    "id": 3276,
    "title": "Financial Distress Prediction for Small and Medium Enterprises Using Machine Learning Techniques",
    "abstract": "Financial disfress prediction is a key challenge every financing provider faces when determining borrower creditworthiness. Inherent opaqueness of Small and Medium Enterprise business complicates credit decision making process, therefore increasing cost to finance and lowering probability of receiving funds. This paper used data on 12.000 SMEs to estimate binomial classifiers for financial distress prediction using Logistic Regression, Artificial Neural Networks and Random Forest techniques. Classical financial ratios were used to estimate initial single period predictors, which were later enhanced with time, credit history and age factors to retrieve multi-period models. Contrary to other studies, financial distress is understood as a significant challenge to company's ability to cover liabilities rather than probability to go bankrupt. Highest prediction accuracy was reached using Random Forest algorithm with additional factors. It was concluded that period-at-risk adjustment is necessary to ensure highest financial disfress prediction accuracy.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "420c0b90a4a271fa83588091bdc0cac0",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "neural network",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T02:24:39.592054"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on predicting financial distress for SMEs using machine learning techniques, which is directly related to assessing credit risk—a key component of financial risk management. The study does not address derivatives pricing or portfolio management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on predicting financial distress for SMEs using machine learning techniques, which is directly related to assessing credit risk—a key component of financial risk management. The study does not address derivatives pricing or portfolio management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:37:19.592379"
}