{
  "paper": {
    "id": 3943,
    "title": "Environmental effects on the experimental modal parameters of masonry buildings: experiences from the Italian Seismic Observatory of Structures (OSS) network",
    "abstract": "The paper presents an in-depth analysis of the ambient dynamic behavior of nine masonry buildings monitored by the Italian Seismic Observatory of Structures (OSS). Addressing a significant knowledge gap affecting this structural type, the study reveals how daily and seasonal fluctuations in environmental factors have a notable influence on its experimental modal parameters. A robust frequency-domain tracking algorithm is first developed to identify and follow the evolution of modal parameters over time, exploiting ambient vibration recordings acquired at sub-daily intervals on the structures. The procedure is systematically applied to the entire portfolio of case-study buildings and, in the first year of training, integrated with measurements of environmental parameters provided by nearby weather stations. The multivariate regression analysis indicates that temperature variation is the primary driver of the observed wandering of natural frequencies. The frequency-temperature relationship shows a positive correlation above zero degrees and, in several cases, a significant degree of nonlinearity already present in low-frequency global modes. Simple predictive models are proposed to address such nonlinear behavior, including freezing conditions and accounting for internal heating during winter. Leveraging these novel insights, the work develops strategies to improve the efficiency of data acquisition protocols and training periods, enabling the near-future extension of real-time condition assessment methodologies to the entire OSS network.",
    "year": 2025,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "d1fdc9a2ba6479de9f7405708dd8ba71",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:22:39.300334"
  },
  "domain_result": {
    "success": false,
    "error": "Client error '429 Too Many Requests' for url 'https://api.deepseek.com/v1/chat/completions'\nFor more information check: https://developer.mozilla.org/en-US/docs/Web/HTTP/Status/429",
    "application_domains": [
      "None"
    ],
    "justification": "API调用失败: Client error '429 Too Many Requests' for url 'https://api.deepseek.com/v1/chat/completions'\nFor more information check: https://developer.mozilla.org/en-US/docs/Web/HTTP/Status/429",
    "raw_response": null
  },
  "timestamp": "2025-05-20T16:08:24.695840"
}