{
  "paper": {
    "id": 774,
    "title": "A hybrid portfolio theory model based on genetic algorithm and vector quantization",
    "abstract": "Portfolio theor, considers a sequential portfolio selection procedure for investing in some investment media such as stock market, etc, with the goal of best analyzing and predicting the performance of the future market. The performance of a portfolio theory model is directly linked to the portfolio prediction. Previous work on portfolio prediction was mainly on technical analysis, statistics analysis, pattern matching and pattern re-occurrence. The portfolio models based on these traditional approaches perform poorly due to the memoryless prediction and non-quantitative natures of stock market behaviors. Applying artificial neural network, genetic algorithm and fuzzy logic for the stock market prediction has attracted much attention recently, which has better correlated the non-quantitative factors with the stock market performance. However these approaches perform less satisfactorily due to the memoryless nature of the stock market performance.",
    "year": 1998,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "89cee5bebd91ad55f89280ba6cc11e22",
    "relevant_keywords": [
      "neural network",
      "genetic algorithm"
    ],
    "stage1_timestamp": "2025-05-15T00:47:50.402269"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "The paper focuses on developing a hybrid portfolio theory model using genetic algorithms and vector quantization for portfolio selection and prediction in the stock market, which directly aligns with the domain of Portfolio Management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Portfolio Management\"],\n  \"justification\": \"The paper focuses on developing a hybrid portfolio theory model using genetic algorithms and vector quantization for portfolio selection and prediction in the stock market, which directly aligns with the domain of Portfolio Management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:27:53.547195"
}