{
  "paper": {
    "id": 6538,
    "title": "Credit Card Fraud Detection Using Synthetic Minority Oversampling Technique and Deep Learning Technique",
    "abstract": "recently, credit card frauds are raised to huge figures due to the reliance on online shopping by users. E-commerce and many other online sites have increased online payment modes which increased the risk of online fraud. There are many techniques have been used by researchers to protect against and detect credit card fraud. Different machine-learning algorithms were used to detect and analyze fraud in online transactions. However, existing solutions suffer from two main issues: class imbalance and insufficient feature extraction methods. Furthermore, extracting relevant features for fraud detection need human-based features engineering which time-consuming and complex problem. The aim of this study is to design and develop an effective credit card fraud detection model. The class imbalance problem has been addressed using a synthetic minority oversampling algorithm. Then, using the sequential deep learning techniques, a credit card detection model was designed and developed to utilize the data generated from SMOTE to improve the feature extraction and representation to solve the problem of insufficient features. The performance of the proposed model has been evaluated by comparing it with the related work in terms of accuracy, detection rate, and f-measure. Results show that the proposed model outperforms the existing state of the arts related models. It achieves a 0.99924 Accuracy, and 0.75976 F-measure. The proposed credit card fraud detection model, which addresses the class imbalance problem using synthetic minority oversampling and utilizes sequential deep learning techniques for improved feature extraction and representation, has shown to outperform existing models in terms of accuracy, detection rate, and f-measure. This could potentially have a significant impact on online markets as it may lead to a decrease in credit card fraud, which would increase consumer trust and confidence in online transactions. Additionally, the proposed model's improved feature extraction and representation may also lead to more efficient and effective fraud detection, potentially reducing costs for businesses and financial institutions.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "0edb140099ab2adfb97718f689161802",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "classification",
      "feature learning",
      "feature representation",
      "neural network",
      "representation learning",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T02:59:07.520533"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用合成少数类过采样技术和深度学习技术来检测信用卡欺诈，这直接涉及金融风险管理中的欺诈风险识别和防范。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是使用合成少数类过采样技术和深度学习技术来检测信用卡欺诈，这直接涉及金融风险管理中的欺诈风险识别和防范。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:27:52.382730"
}