{
  "paper": {
    "id": 272,
    "title": "An enhanced ride sharing model based on human characteristics, machine learning recommender system, and user threshold time",
    "abstract": "The ubiquitous availability of the Internet and advanced computing systems has resulted in the rapid development of smart cities. From connected devices to live vehicle tracking, technology is taking the field of transportation to a new level. An essential part of the transportation domain in mart cities is to share vehicles. Sharing vehicles is an impeccable solution to issues like vehicle congestion, pollution, and the rapid consumption of fuel. Even though carpooling has several benefits, currently, the usage is significantly low due to social barriers, long rider waiting time, and unfair pricing models. Considering these issues, we have designed an enhanced vehicle-sharing model with two matching layers. The first layer matches riders based on similar characteristics, and the second layer provides matching options to riders and drivers to restrict the waiting time by using personalized threshold time. At the end of trips, feedback is collected from users according to five characteristics. Then, the two main characteristics that are the most important to riders are determined based on the collected feedback. The characteristics and classifiers are fed to our machine-learning classification module. For new users, the module predicts riders' characteristics, which allows riders to be matched to riders with similar characteristics. We have carried out an extensive simulation and measured the efficiency of the matching model while comparing the results with and without machine learning algorithms. In the simulation, we have used real-time New York City Cab traffic data with real-traffic conditions by using Google Maps APIs. Results indicate that the proposed model is feasible and efficient as the number of riders increases while maintaining threshold time for riders. Our proposed model and obtained results will help service providers to increase the usage of carpooling, and implicitly preserve natural resources and improve environmental conditions.",
    "year": 2021,
    "source": "WOS",
    "area": "derivatives_pricing",
    "method": "machine learning",
    "cache_key": "393eac3847e133cc9ecb30e6be2aac63",
    "relevant_keywords": [
      "machine learning",
      "classification"
    ],
    "stage1_timestamp": "2025-05-15T01:30:19.089590"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是基于机器学习的车辆共享模型，其核心应用场景是智能交通和城市共享出行，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是基于机器学习的车辆共享模型，其核心应用场景是智能交通和城市共享出行，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:05:40.895855"
}