{
  "paper": {
    "id": 1359,
    "title": "Financial warning for coal mining investments: Evidence from the fruit fly optimisation algorithm with backpropagation neural networks",
    "abstract": "Venture capital firms may be unable to withstand the high investments and risks associated with coal mining exploration due to limitations in the funding scale. Risk control capability is also a challenge for venture capital companies. Finding a balance between high-risk and high-return coal mining exploration projects is a problem that venture capital companies must face. We propose a financial risk-warning model for coal mining investment enterprises based on the fruit fly optimisation algorithm (FOA) with the backpropagation neural network (BPNN). The fusion of standardised and dimensionless sample data through factor analysis reduces the input dimension of the BPNN and improves its stability. The financial warning algorithm of the model has been effectively validated through experiments. The research results indicate that its accuracy has reached a high level of financial warning, reaching a level of 95%.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "f92ee077ff12fed9d480538ba08904cd",
    "relevant_keywords": [
      "neural network",
      "backpropagation",
      "BP"
    ],
    "stage1_timestamp": "2025-05-15T02:01:44.877131"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper proposes a financial risk-warning model for coal mining investment enterprises, which is aimed at improving risk control capabilities for venture capital firms. This directly addresses the need for financial risk management in high-risk investment scenarios.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper proposes a financial risk-warning model for coal mining investment enterprises, which is aimed at improving risk control capabilities for venture capital firms. This directly addresses the need for financial risk management in high-risk investment scenarios.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:49:27.470284"
}