{
  "paper": {
    "id": 3004,
    "title": "Mapping of computational biology research inventions through quantitative patent analysis",
    "abstract": "Computational biology is relatively a young branch of science, which has experienced tremendous growth in the last two decades. The seeds of this inter-discipline were sown at the end of the seventies, when computers became simpler to use, some biology laboratories decided to adopt them, mainly for storing and managing genomic data. As a result, there was quick completion of projects that would have otherwise taken several years. With a snowballing effect, genome sequencing projects generated large amounts of data whose management required more powerful computers. The advent of the internet has allowed all the research laboratories to share their data, and make them available worldwide through some new genomic and proteomic data banks, such as Gene-Bank, European Molecular Biology Laboratory Data Library and many more. A patent portfolio shows the state of the art of research and development in a specific discipline. Patenting an invention is still tough in many countries, especially when the major part of the claim invention involves mathematical formulae, algorithms and computer programs. These per se are not patentable in many countries; however, they can be protected under copyrights as literary works or trade secrets. It is well known that mathematical formulae, algorithms and computer programs mainly form the core of computational biology. Till date, no study has been made to measure inventive progress in this new inter-discipline. The study shows the research and invention have occurred in a wide range of inter-disciplines, including functional genomics, molecular structure, sequence comparison, molecular simulations, machine learning, data visualization, database development and inventive activity confined to a handful of industrially developed and developing nations, of which majority are privately owned.",
    "year": 2016,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "0b7ca6b671eaf3f71fd101215ac04c19",
    "relevant_keywords": [
      "machine learning"
    ],
    "stage1_timestamp": "2025-05-15T01:12:43.005760"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要关注计算生物学领域的专利分析和技术发展，包括基因组学、分子结构、机器学习等，并未提及任何与衍生品定价、金融风险管理或投资组合管理相关的应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要关注计算生物学领域的专利分析和技术发展，包括基因组学、分子结构、机器学习等，并未提及任何与衍生品定价、金融风险管理或投资组合管理相关的应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:11:55.893328"
}