{
  "paper": {
    "id": 1854,
    "title": "Predicting Credit Risk in Peer-to-Peer Lending: A Neural Network Approach",
    "abstract": "Emergence of peer-to-peer lending has opened an appealing option for micro-financing and is growing rapidly as an option in the financial industry. However, peer-to-peer lending possesses a high risk of investment failure due to the lack of expertise on the borrowers' creditworthiness. In addition, information asymmetry, the unsecured nature of loans as well as lack of rigid rules and regulations increase the credit risk in peer-to-peer lending. This paper proposes a credit scoring model using artificial neural networks in classifying peer-to-peer loan applications into default and non-default groups. The results indicate that the neural network-based credit scoring model performs effectively in screening default applications.",
    "year": 2015,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "5b29bd882ff05c31e036da00f33e358b",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "neural network",
      "deep learning",
      "backpropagation",
      "BP",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T02:08:04.018340"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on developing a neural network-based credit scoring model to classify loan applications into default and non-default groups, which is a direct application in credit risk assessment—a key aspect of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on developing a neural network-based credit scoring model to classify loan applications into default and non-default groups, which is a direct application in credit risk assessment—a key aspect of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:45:32.570523"
}