{
  "paper": {
    "id": 5798,
    "title": "PAPER Does medical insurance type (private vs public) influence the physician's decision to perform Caesarean delivery?",
    "abstract": "Introduction US data reveal a Caesarean rate discrepancy between insured and uninsured patients, with the C-section rate highest among the privately insured. The data have prompted concern that financial incentives associated with insurance status might influence American physicians' decisions to perform Caesarean deliveries. Objective To determine whether differences in medical risk factors account for the apparent Caesarean rate discrepancy between Medicaid and privately insured patients in Michigan, USA. Method A retrospective review was performed of 617 269 live birth deliveries in Michigan hospitals during 2004-8. All live birth records that were able to be linked to their mothers' hospital discharge records were utilised. Diagnosis-related group codes from the hospitalisation records were used to identify Caesarean deliveries. Regression models determined Caesarean probability for the time period under study, adjusted for insurance type, maternal age, race, maternal medical conditions, multiple births, prematurity and birth weight. Results From 2004 to 2008, Caesarean rates were 33% for privately insured patients and 29% for Medicaid patients. The probability of Caesarean delivery was significantly greater for privately insured than Medicaid patients on univariate analysis (OR 1.2, 95% CI 1.19 to 1.22) but not on multivariate analysis (adjusted OR 1.01, 95% CI 0.99 to 1.02). Conclusion No significant disparity was found in the odds of Caesarean delivery between privately insured and Medicaid patients in Michigan after adjusting for other Caesarean risk factors. A positive disparity would have provided de facto evidence that financial incentives play a role in physician decision-making regarding Caesarean delivery.",
    "year": 2012,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "86856a1248d5019d29dce9a26ac96ba9",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:51:30.089358"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究医疗保险类型对医生决策的影响，属于医疗健康领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究医疗保险类型对医生决策的影响，属于医疗健康领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:29:36.851927"
}