{
  "paper": {
    "id": 1562,
    "title": "A hybrid fuzzy rule-based multi-criteria framework for sustainable project portfolio selection",
    "abstract": "Project selection is a complex decision making process that is influenced by multiple and often conflicting objectives. The complexity of the project selection problem is due to the high number of projects from which a subset (portfolio) has to be chosen. We present a hybrid fuzzy rule-based multi-objective framework for sustainable project portfolio selection. The multiple and conflicting objectives are considered as the input variables in a Fuzzy Rule-Based (FRB) system developed to estimate the overall fitness (suitability) of the potential project portfolios. A hybrid multi-objective framework integrates and synthesizes the results from a data mining model with the results from a Data Envelope Analysis (DEA) model and an Evolutionary Algorithm (EA) to design the structure of the proposed FRB system. The proposed framework simultaneously considers the accuracy maximization and the complexity minimization objectives. A Genetic Based Machine Learning (GBML) method is utilized to design an alternative FRB system for comparison purposes. The proposed framework and the GBML method are used to assess the alternative project portfolios in a real-world financial services institution. The statistical analysis shows the performance dominance of the proposed hybrid framework over the GBML method based on selected accuracy and interoperability measures. (C) 2012 Elsevier Inc. All rights reserved.",
    "year": 2013,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "df6ee173e527ee2e64b2bf55276c7af3",
    "relevant_keywords": [
      "machine learning",
      "evolutionary algorithm",
      "genetic based machine learning"
    ],
    "stage1_timestamp": "2025-05-15T00:57:12.645023"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是开发一个混合模糊规则的多目标框架，用于可持续项目组合选择。虽然论文中提到的项目组合选择与金融投资组合管理有所不同，但其核心问题（从多个候选项目中选择最优子集）与投资组合管理的核心问题（从多个金融资产中选择最优组合）在方法论上是相似的。论文还提到该方法在一个金融服务机构中进行了实际应用，进一步支持了其在金融领域的相关性。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是开发一个混合模糊规则的多目标框架，用于可持续项目组合选择。虽然论文中提到的项目组合选择与金融投资组合管理有所不同，但其核心问题（从多个候选项目中选择最优子集）与投资组合管理的核心问题（从多个金融资产中选择最优组合）在方法论上是相似的。论文还提到该方法在一个金融服务机构中进行了实际应用，进一步支持了其在金融领域的相关性。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:20:11.167769"
}