{
  "paper": {
    "id": 531,
    "title": "Artificial Intelligence for ETF Market Prediction and Portfolio Optimization",
    "abstract": "In asset allocation and time-series forecasting studies, few have shed light on using the different machine learning and deep learning models to verify the difference in the result of investment returns and optimal asset allocation. To fill this research gap, we develop a robo-advisor with different machine learning and deep learning forecasting methodologies and utilize the forecasting result of the portfolio optimization model to support our investors in making decisions. This research integrated several dimensions of technologies, which contain machine learning, data analytics, and portfolio optimization. We focused on developing robo-advisor framework and utilized algorithms by integrating machine learning and deep learning approaches with the portfolio optimization algorithm by using our predicted trends and results to replace the historical data and investor views. We eliminate the extreme fluctuation to maintain our trading within the acceptable risk coefficient. Accordingly, we can minimize the investment risk and reach a relatively stable return. We compared different algorithms and found that the F1 score of the model prediction significantly affects the result of the optimized portfolio. We used our deep learning model with the highest winning rate and leveraged the prediction result with the portfolio optimization algorithm to reach 12% of annual return, which outperform our benchmark index 0050.TW and the optimized portfolio with the integration of historical data.",
    "year": 2019,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "bf165064bf6cf1ae6b68c435097a6cd3",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "neural network",
      "representation learning",
      "backpropagation",
      "BP",
      "hidden layer",
      "recurrent neural network",
      "long short-term memory",
      "LSTM"
    ],
    "stage1_timestamp": "2025-05-15T00:44:21.114150"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是使用机器学习和深度学习模型进行ETF市场预测，并将预测结果应用于投资组合优化算法，以实现稳定的投资回报。这直接涉及投资组合管理的领域，而不涉及衍生品定价或金融风险管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是使用机器学习和深度学习模型进行ETF市场预测，并将预测结果应用于投资组合优化算法，以实现稳定的投资回报。这直接涉及投资组合管理的领域，而不涉及衍生品定价或金融风险管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:30:01.592367"
}