{
  "paper": {
    "id": 903,
    "title": "Banking Credit Risk Analysis using Artificial Neural Network",
    "abstract": "Banking credit risk analysis is a form of evaluation conducted by financial institutions to determine applicants' ability to repay their debt obligation. Financial institutions, such as banks, set objectives to offer credit to creditworthy customers, after spending time trying to evaluate their repaying capacity. In this paper, we propose a credit risk analysis system based on an artificial neural network (ANN) to identify customers who will default. A feedforward propagation algorithm is used to train the model consisting of three layers. Data pre-processing is performed to clean the datasets and check for missing variables. The datasets were normalized using min-max normalization to get the correlation among the variables. The datasets are applied to the proposed model and logistic regression models, and the comparison shows the proposed model which has a better performance.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "2e1512e904cc0536269bf1bcf41e444f",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "neural network",
      "backpropagation",
      "BP",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T01:56:17.606128"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on using an artificial neural network to analyze banking credit risk, specifically to identify customers who will default. This is a direct application in the field of financial risk management, as it deals with assessing and mitigating credit risk for financial institutions.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on using an artificial neural network to analyze banking credit risk, specifically to identify customers who will default. This is a direct application in the field of financial risk management, as it deals with assessing and mitigating credit risk for financial institutions.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:53:53.885958"
}