{
  "paper": {
    "id": 2535,
    "title": "A semiparametric nonlinear quantile regression model for financial returns",
    "abstract": "Accurately measuring and forecasting value-at-risk (VaR) remains a challenging task at the heart of financial economic theory. Recently, quantile regression models have been used successfully to capture the conditional quantiles of returns and to forecast VaR accurately. In this paper, we further explore nonlinearities in data and propose to couple realized measures with the nonlinear quantile regression framework to explain and forecast the conditional quantiles of financial returns. The nonlinear quantile regression models are implied by the copula specifications and allow us to capture possible nonlinearities, tail dependence, and asymmetries in the conditional quantiles of financial returns. Using high frequency data that covers most liquid US stocks in seven sectors, we provide ample evidence of asymmetric conditional dependence with different levels of dependence, which are characteristic for each industry. The backtesting results of estimated VaR favour our approach.",
    "year": 2017,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "97aea849a8d6d35ec76d52cf95165a6c",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:16:32.656666"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on measuring and forecasting value-at-risk (VaR), which is a core task in financial risk management. The proposed nonlinear quantile regression model is specifically designed to capture conditional quantiles of financial returns for VaR estimation, a key risk management tool.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on measuring and forecasting value-at-risk (VaR), which is a core task in financial risk management. The proposed nonlinear quantile regression model is specifically designed to capture conditional quantiles of financial returns for VaR estimation, a key risk management tool.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:41:33.703864"
}