{
  "paper": {
    "id": 3188,
    "title": "Current and Future Applications of Artificial Intelligence in Coronary Artery Disease",
    "abstract": "Cardiovascular diseases (CVDs) carry significant morbidity and mortality and are associated with substantial economic burden on healthcare systems around the world. Coronary artery disease, as one disease entity under the CVDs umbrella, had a prevalence of 7.2% among adults in the United States and incurred a financial burden of 360 billion US dollars in the years 2016-2017. The introduction of artificial intelligence (AI) and machine learning over the last two decades has unlocked new dimensions in the field of cardiovascular medicine. From automatic interpretations of heart rhythm disorders via smartwatches, to assisting in complex decision-making, AI has quickly expanded its realms in medicine and has demonstrated itself as a promising tool in helping clinicians guide treatment decisions. Understanding complex genetic interactions and developing clinical risk prediction models, advanced cardiac imaging, and improving mortality outcomes are just a few areas where AI has been applied in the domain of coronary artery disease. Through this review, we sought to summarize the advances in AI relating to coronary artery disease, current limitations, and future perspectives.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "fb1c28e442e5ce8e9fbd98f3292eb33e",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T02:23:33.539067"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要讨论人工智能在冠状动脉疾病领域的应用，包括临床决策支持、风险预测模型和心脏影像分析等，并未涉及任何金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要讨论人工智能在冠状动脉疾病领域的应用，包括临床决策支持、风险预测模型和心脏影像分析等，并未涉及任何金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:38:04.356114"
}