{
  "paper": {
    "id": 490,
    "title": "Machine Learning Techniques for Credit Scoring in Banking with Management, HR, and Organizational Key Components",
    "abstract": "Credit rating is crucial in the fast-changing 21st-century banking industry to determine creditworthiness. Traditional credit score systems may not be able to handle today's complex money habits because they are focused on statistics and prior data. This research advises adding management, human resources, and organizational factors to machine learning credit evaluations in addition to financial data. Structure of the research describes different machine learning types. Logistic regression, decision trees, random forests, gradient boosting, and neural networks. The algorithms are trained using this dataset's financial metrics, management practices, HR indicators, and organizational procedures. Feature engineering strategies pull data from various sources to get a full picture of someone's reputation. The research argues that machine learning models should be transparent, especially in the highly regulated banking business. Using LIME and SHAP values helps make credit scoring determinations more dependable and understandable. Credit scoring will be more precise, and financial institutions will understand credit risk aspects better. Banks can improve loan selections, portfolio performance, and risk by adding management, human resources, and organizational data to financial data. This research helps financial organizations analyze credit risk in the age of machine learning and big data, resulting in more accurate credit score models.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "c893a2163b3611a95b7fb48aa21ec860",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "regression",
      "decision tree",
      "neural network",
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T01:51:31.292473"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要研究使用机器学习技术改进信用评分系统，这直接关联到金融机构对信用风险的管理和评估，属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文主要研究使用机器学习技术改进信用评分系统，这直接关联到金融机构对信用风险的管理和评估，属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:57:37.523310"
}