{
  "paper": {
    "id": 359,
    "title": "NEURAL NETWORKS AND THEIR APPLICATION IN CREDIT RISK ASSESSMENT. EVIDENCE FROM THE ROMANIAN MARKET",
    "abstract": "The purpose of this article is to see how neural networks are used in credit risk assessment problems. For this, we firstly introduce the main theoretical concepts of the neural calculus, as well as the fundaments for the main training algorithm: the error back-propagation algorithm. We review the specialty literature and find that the neural networks yield better results than other classification techniques, like multivariate discriminant analysis or logistic regression, when applying them in credit risk assessment problems. We focus on a few types of networks: feed-forward networks with multiple layers, fuzzy adaptive networks, support vector machines. We develop an analysis on Romanian Small and Medium Enterprises (financial ratios) and the results are in line with the findings from the literature: the neural networks give better results than the logistic regression. The study can be developed by analyzing a support vector machine or a fuzzy adaptive network.",
    "year": 2011,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "7feb33e08335b3583c8f860fb5435cc5",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM",
      "neural network",
      "backpropagation",
      "BP",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T01:49:41.107600"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是神经网络及其在信用风险评估中的应用，这直接属于金融风险管理的范畴。论文明确讨论了信用风险问题，并通过实证分析验证了神经网络在信用风险评估中的有效性。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"该论文的核心技术是神经网络及其在信用风险评估中的应用，这直接属于金融风险管理的范畴。论文明确讨论了信用风险问题，并通过实证分析验证了神经网络在信用风险评估中的有效性。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:58:31.423380"
}