{
  "paper": {
    "id": 5238,
    "title": "Quantile-based detecting the day of the week effect on market risk in Chinese stock markets",
    "abstract": "In past decades calendric effects on the mean and volatility of stock returns have been studied by many scholars. The paper takes a new insight into the day of the week effect on market risk and finds its significant existence in Chinese stock markets. A conditional quantile regression model with dummy week explanatory variables is constructed to estimate value-at-risk of return time series in order to measure market risk. For both Shanghai and Shenzhen stock markets, it is found that the dummy week variables from Monday to Friday cause various quantities of impact on VaR(the biggest impacts come from Friday in Shanghai market, and from Wednesday in Shenzhen market), however in the same market the patterns of calendric impact on VaR at different confidence levels are similar. It is also indicated that market risk reaches the peak on Friday in Shanghai market and on Wednesday in Shenzhen market, whereas arrives at the bottom on Wednesday in Shanghai market and on Friday in Shenzhen market in average. The week anomaly of market risk in Chinese stock markets firstly found in the paper will benefit Chinese financial institutions and investors by adjusting the positions of asset portfolios to disperse risk and strengthen risk supervision in future.",
    "year": 2007,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "d7be9c9f269ea9bf6cbd4aeff875a093",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:45:47.410439"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要研究市场风险（market risk）的日历效应，并使用条件分位数回归模型估计风险价值（VaR），这直接属于金融风险管理的范畴。论文还提到这些发现有助于金融机构和投资者调整资产组合以分散风险，进一步强调了其在风险管理中的应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文主要研究市场风险（market risk）的日历效应，并使用条件分位数回归模型估计风险价值（VaR），这直接属于金融风险管理的范畴。论文还提到这些发现有助于金融机构和投资者调整资产组合以分散风险，进一步强调了其在风险管理中的应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:31:06.707461"
}