{
  "paper": {
    "id": 3289,
    "title": "An optimization model for poverty Alleviation fund audit mode based on BP neural network",
    "abstract": "Tracking audit of poverty alleviation policy is an important guarantee to win the battle against poverty. Effective prevention and control of audit risk in tracking audit of poverty alleviation policy is the key to ensure the improvement of audit quality. According to the characteristics of financial audit, this paper analyzes the main factors affecting the operation of loan enterprises, puts forward a neural network model for financial audit, and gives the solution of the model. This paper takes poverty alleviation audit as an example, centering on the goal of full coverage of the audit, and based on poverty alleviation data, integrating relevant data in relevant fields to build poverty alleviation fund audit, so as to achieve full coverage of poverty alleviation audit. Utilize emerging technologies, give full play to the role of full coverage of audit supervision and supervision on precision poverty alleviation, and participate in project consulting and auditing in advance, real-time online tracking audit, and post-performance performance evaluation audit. We will promote the construction of accurate poverty alleviation information, strengthen economic responsibility audits, and more effectively monitor the authenticity of poverty alleviation funds, effectively implement poverty alleviation projects, and achieve accurate poverty alleviation efficiently. The model can better help the auditors to accurately determine the basic status of the audit object and provide a strong guarantee for quickly determining the audit focus.",
    "year": 2019,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "9269e0b178619f2e06d2bc0fbdd4bdc0",
    "relevant_keywords": [
      "neural network",
      "BP",
      "backpropagation"
    ],
    "stage1_timestamp": "2025-05-15T02:24:39.689508"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是基于BP神经网络的扶贫资金审计模式优化，其应用场景是扶贫政策的跟踪审计和资金监管，并未涉及衍生品定价、金融风险管理或投资组合管理等金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是基于BP神经网络的扶贫资金审计模式优化，其应用场景是扶贫政策的跟踪审计和资金监管，并未涉及衍生品定价、金融风险管理或投资组合管理等金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:37:18.986465"
}