{
  "paper": {
    "id": 589,
    "title": "Application of regression function model based on panel data in financial risk management of bank resource allocation",
    "abstract": "This paper studies the financial risk management of resource allocation of listed commercial banks in my country, starting from the fundamental influence of lender credit rating in the internal rating system of commercial banks, and analyzes the influence of a large number of subjective factors contained in the bank's credit rating system on the rating effect. Influence. A sort-response panel regression function model with random effects (including random intercept terms and random coefficients) is proposed, and the rationality of the existing bank credit rating system is tested and analyzed. The experimental results show that the model's prediction accuracy rate is 48.27%, and the percentage of prediction level error within two levels reaches 86.8%. The application of this model can find the redundant indicators of the existing system, which are highly fitted with the actual situation and can achieve quite ideal forecasting results, and provide a forecasting reference for the weight setting, which provides a basis for the revision of the bank's credit rating system.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "ee4214a8ba4c638699f7802b2d3c4741",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:52:49.472006"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on analyzing and improving the credit rating system of commercial banks to manage financial risks, specifically through a regression function model to test the rationality of the existing system and provide forecasting references for weight setting. This directly addresses issues in financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on analyzing and improving the credit rating system of commercial banks to manage financial risks, specifically through a regression function model to test the rationality of the existing system and provide forecasting references for weight setting. This directly addresses issues in financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:56:40.087592"
}