{
  "paper": {
    "id": 2161,
    "title": "Portfolio Optimization Considering Behavioral Stocks with Return Scenario Generation",
    "abstract": "This study extends the application of behavioral portfolio optimization by estimating the return of behavioral stocks (B-stocks). With the cause-and-effect relationships of the respective irrational behaviors on the stock price movements and the unique information provided by B-stocks in terms of knowing with a calculated probability when (time duration) a specific effect (e.g., positive cumulative abnormal return) after a certain trigger point (cause of the irrational behavior) is spotted, regression analysis is applied on the information in the duration to have more accurate return estimates. To fit in the framework of behavioral portfolio optimization, the scenarios used for the optimization are generated utilizing regression analysis, based on which the safety-first scenario-based mixed-integer program is applied to obtain the optimal portfolios. This study also proposes two new types of B-stocks with corresponding operational definitions for herding and ostrich-effect, along with the previously identified over-reaction, under-reaction, and disposition-effect B-stocks. Back-test results show that the portfolios are profitable and can significantly outperform a benchmark and the market.",
    "year": 2022,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "b10dba62386d3255faa297dfdfbe4a5d",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:03:36.672893"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心研究内容是行为投资组合优化，通过回归分析生成情景并应用安全优先的情景混合整数规划来获得最优投资组合。这明确属于投资组合管理领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心研究内容是行为投资组合优化，通过回归分析生成情景并应用安全优先的情景混合整数规划来获得最优投资组合。这明确属于投资组合管理领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:16:46.880581"
}