{
  "paper": {
    "id": 18,
    "title": "A Study of the Internet Financial Interest Rate Risk Evaluation Index System in Context of Cloud Computing-Rough Set-Particle Swarm-based Support Vector Machine (SVM) Technology",
    "abstract": "Cloud computing is a product of computer technologies combined with network technologies and it has been widely applied in China. Experts and scholars in all fields begin to make many studies of cloud computing infrastructure construction and effective resource utilization. With the improvement of cloud computing technology (especially security technology), Internet finance will be deployed widely and will develop rapidly. ITFIN (Internet finance) is the results of finance comprehensively combined with network technology and also a new ecological finance fermenting in this Internet era. In ITFIN, it integrates online transaction data generating in various social network, studies and judges the credit standing of customers, and completes credit consumption, loan and other borrowing behavior by e-payment, so that people can enjoy financial services in dealing with various problems. However, one person can play different identities in network, which has posed a severe challenge to ITFIN network security and has largely intensified risk including operational risk, market selection risk and other business risks as well as network and information security risk. Therefore, it is an effective technological approach and operable measure to prevent or eliminate ITFIN risks by establishing a reliable, reasonable and effective ITFIN risk assessment model. This paper conducted theoretical and empirical analysis, then constructed an assessment model against China's ITFIN risk that integrates rough set and PSO-SVM (particle swarm optimization support vector machine, and finally used this model in China's ITFIN risk assessment. The empirical research results indicate that, through introducing rough set theory, it could effectively reduce redundant data information, guarantee a reliable, reasonable and scientific model, and enhance classification effect of model. The parameters of SVM model obtained by optimizing with PSO could effectively avoid local optimum, it objectively can improve the effect of the classification model, this model has good generalization ability and learning ability.",
    "year": 2017,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "fb262a70482483536bf68fa6233ebc12",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM"
    ],
    "stage1_timestamp": "2025-05-15T01:46:03.760992"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是构建一个互联网金融风险评估模型，结合了粗糙集和PSO-SVM技术，用于评估和分类互联网金融风险，这直接属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是构建一个互联网金融风险评估模型，结合了粗糙集和PSO-SVM技术，用于评估和分类互联网金融风险，这直接属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:01:34.634036"
}