{
  "paper": {
    "id": 4620,
    "title": "Application of statistics and artificial intelligence for corporate financial distress prediction models: a systematic literature review",
    "abstract": "Purpose This study aims to identify key financial and nonfinancial determinants, model trends and accuracy levels, which were analyzed and synthesized. Design/methodology/approach Financial distress prediction is vital for corporate risk management, investment decisions and economic stability. This study systematically reviews 41 SCOPUS-indexed articles from 2014 to 2024 using the PRISMA methodology. Findings The analysis highlights significant advancements in distress prediction models over the past decade, identifying seven financial and three nonfinancial determinants. Research limitations/implications Traditional statistical models, such as Multiple Discriminant Analysis and Logit Regression, remain widely used due to their interpretability, with 66.7% achieving over 85% accuracy. However, hybrid AI-statistical models, like Altman Z-Score with MLP-ANN, demonstrate superior predictive performance, reaching 99.4% accuracy. Findings emphasize the importance of multi-year historical data for reliability. Future research should explore industry-specific applications and incorporate nonfinancial indicators, including corporate governance and macroeconomic factors, to enhance real-time financial distress detection and improve model generalizability across diverse economic environments. Practical implications This study presents a systematic literature review focused on the determinants and model development of corporate financial distress prediction model research. Social implications Through this review, the research aims to analyze determinants and models used in prediction research, to provide guidance for future studies. Originality/value Previous SLR-based research, such as that conducted by Alaka et al. (2015) and the article that synthesize limited until 2015 and Kuiziniene et al. (2022), has primarily focused on advancements in AI models without thoroughly analyzing both key financial determinants and various predictive modeling approaches. This oversight limits a comprehensive understanding of which financial variables consistently contribute to higher predictive accuracy and how different modeling techniques compare in financial distress prediction. Especially in Indonesia, traditional models are considered less effective, especially in the property and consumer sectors, where accuracy is only around 53-69%.",
    "year": 2025,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "7269bfa6679f9b44b57bb7ba587c3abe",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "neural network",
      "deep learning",
      "backpropagation",
      "BP",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T02:39:26.934098"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on predicting corporate financial distress, which is a critical aspect of financial risk management. It reviews various models and determinants used for this purpose, emphasizing their application in risk assessment and mitigation.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on predicting corporate financial distress, which is a critical aspect of financial risk management. It reviews various models and determinants used for this purpose, emphasizing their application in risk assessment and mitigation.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:32:21.807297"
}