{
  "paper": {
    "id": 5167,
    "title": "On Asymmetric Market Model with Heteroskedasticity and Quantile Regression",
    "abstract": "The capital asset pricing model is widely used in financial risk management due to its simplicity and utility in a variety of situations. Many of the constructs of this market model are widely used in investment, but the simple assumptions of a constant beta coefficient and variance in the original market model are not convincing from the empirical viewpoint. In this paper we propose a general asymmetric market model embedding both the leverage effect of market news and the previous return to express the instability of beta and the error with heteroskedasticity to capture the time-varying conditional variance. Because extreme values occur quite frequently in financial markets, the quantile regression is employed to explore the different behaviors in the market beta and lagged autoregressive effect for different quantile levels. We analyze fifteen stocks, which are heavily traded in the Dow Jones Industrial Average, to demonstrate the empirical performance of our methodology. The evidence indicates that each market beta and impact of negative news vary with different quantile levels, capturing different states of market conditions.",
    "year": 2017,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "09d48b05a2c7f5c5297b30a86e9d1e5d",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:45:17.002976"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk",
      "Portfolio Management"
    ],
    "justification": "The paper focuses on improving the capital asset pricing model by incorporating heteroskedasticity and quantile regression to better capture market behaviors and risk factors. This directly relates to financial risk management by addressing the instability of beta and variance, which are crucial for risk assessment. Additionally, the analysis of heavily traded stocks suggests applications in portfolio management, where understanding varying market conditions and beta behaviors is essential for asset allocation and investment strategies.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\", \"Portfolio Management\"],\n  \"justification\": \"The paper focuses on improving the capital asset pricing model by incorporating heteroskedasticity and quantile regression to better capture market behaviors and risk factors. This directly relates to financial risk management by addressing the instability of beta and variance, which are crucial for risk assessment. Additionally, the analysis of heavily traded stocks suggests applications in portfolio management, where understanding varying market conditions and beta behaviors is essential for asset allocation and investment strategies.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:31:07.919702"
}