{
  "paper": {
    "id": 6543,
    "title": "A Telephone Triage System for Patients Calling with Symptoms of a Posterior Vitreous Detachment",
    "abstract": "Purpose: The purpose of the study was to develop a simple telephone questionnaire, without physical ex-amination input, that predicts which patients calling with symptoms of a posterior vitreous detachment (PVD) have a retinal tear (RT) or rhegmatogenous retinal detachment (RD). Design: Prospective cohort (quality improvement) study. Participants: All patients with symptoms consistent with a PVD calling a major academic ophthalmology department over a 4-month period in 2020 and who were seen on follow-up within 1.5 months (211 screened and 193 included). Methods: A comprehensive telephone questionnaire assessing for RT/RD risk factors was administered by telephone triage staff to all patients calling with symptoms of flashes, floaters, or curtain/veil in their vision. Multivariable logistic regression was used to determine risk factors most predictive of having an RT/RD during the add-on visit. Risk factor odds ratios were used to develop an RT/RD risk score. Main Outcomes Measures: Development of a clinical risk score for having an RT/RD at the add-on visit after telephone triage. Results: Approximately 55% of patients were previously established in the retina clinic, 26% were new to the department, 19% were previously established in the comprehensive clinic, and 7% had an RT/RD at the add-on visit. Out of 23 questions and 70 prespecified possible answers from the telephone questionnaire, the final clinical risk score for RT/RDs was derived from 7 questions and 15 possible answers. The simplified questionnaire can be administered quickly by telephone operators without any reference to physical examination or the patient's chart. The receive-operator curve for our final multivariable logistic regression and clinical risk score models have an area under the curve of > 0.90. Using a conservative clinical risk score, approximately 50% of all patients without an RT/RD can be safely seen nonurgently. Progressively higher scores can be used to determine relative urgency of an appointment. Conclusions: To our knowledge, this is the first study to predict risk of an RT/RD in a patient calling with symptoms consistent with a PVD without reference to the patient's physical examination or chart. Our clinical risk scoring system can be used to determine urgency of an add-on appointment and increase the number of low-risk patients with symptomatic PVDs who are scheduled routinely. Financial Disclosure(s): The author(s) have no proprietary or commercial interest in any materials discussed in this article. Ophthalmology Retina 2023;7:516-526 & COPY; 2023 by the American Academy of Ophthalmology",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "a01c52bfe43ddfe6bdb2e448d1487292",
    "relevant_keywords": [
      "classification",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:59:07.534267"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是医疗领域的电话分诊系统，用于预测患者视网膜撕裂或脱离的风险，与金融领域无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是医疗领域的电话分诊系统，用于预测患者视网膜撕裂或脱离的风险，与金融领域无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:27:52.318498"
}