{
  "paper": {
    "id": 55,
    "title": "Do economic statistics contain information to predict stock indexes futures prices and returns? Evidence from Asian equity futures markets",
    "abstract": "This research examines the impact of local and international market factors on the pricing of stock indexes futures in East Asian countries. The purpose of this paper is to present a study of the significant factors that determine the major stock indexes futures' prices of Hong Kong, Malaysia, Singapore, South Korea and Taiwan. This study first investigates the relationships between Hang Seng Index Futures, KLCI Futures, SiMSCI Futures, KOSPI Futures, Taiwan Exchange Index Futures and local interest rates, dividend yields, local exchange rates, overnight S&P500 index and a newly constructed index, Asian Tigers Malaysia Index (ATMI). 11 years historical data of stock indexes futures and the economic statistics are studied; 10 years in-sample data are used for testing and developing the pricing models, and 1 year out-of-sample data is used for the purpose of verifying the predicted values of the stock indexes futures. Using simple linear regressions, local interest rates, dividend yields, exchange rates, overnight S&P500 and ATMI are found to have significant impact on these futures contracts. In this research, the next period close is predicted using simple linear regression and non-linear artificial neural network (ANN). An examination of the prediction results using nonlinear autoregressive ANN with exogenous inputs (NARX) shows significant abnormal returns above the passive threshold buy and hold market returns and also above the profits of simple linear regression (SLR). The empirical evidence of this research suggests that economic statistics contain information which can be extracted using a hybrid SLR and NARX trading model to predict futures prices with some degree of confidence for a year forward. This justifies further research and development of pricing models using fundamentally significant economic determinants to predict futures prices.",
    "year": 2021,
    "source": "WOS",
    "area": "derivatives_pricing",
    "method": "machine learning",
    "cache_key": "52881233a744036c4521b1163afdfb50",
    "relevant_keywords": [
      "neural network",
      "deep learning",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:28:03.814269"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Derivatives Pricing"
    ],
    "justification": "该论文的核心研究内容是使用线性回归和人工神经网络（ANN）预测股票指数期货的价格，并验证这些预测模型的准确性。这直接涉及衍生品（股票指数期货）的定价问题，属于衍生品定价领域。虽然论文也提到了异常收益，但主要焦点仍是期货价格的预测和定价模型的开发，而非风险管理或投资组合管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"衍生品定价\"],\n  \"justification\": \"该论文的核心研究内容是使用线性回归和人工神经网络（ANN）预测股票指数期货的价格，并验证这些预测模型的准确性。这直接涉及衍生品（股票指数期货）的定价问题，属于衍生品定价领域。虽然论文也提到了异常收益，但主要焦点仍是期货价格的预测和定价模型的开发，而非风险管理或投资组合管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:07:04.846620"
}