{
  "paper": {
    "id": 459,
    "title": "Enhancing climate resilience in businesses: The role of artificial intelligence",
    "abstract": "The abrupt rise in extreme weather events (floods, heat waves, droughts, etc.) due to changing climate in the last decades has increased the level of threats to various sectors (agriculture, energy, transportation, etc.) globally. The climate projections from global circulation models indicate even more intense and frequent extreme events in the future, which in turn pose more risks to socioeconomic infrastructure. The enhanced understanding of the climate-related financial risk associated with businesses has driven efforts to include critical information on probable risks associated with climate change in financial decision-making. In this study, we have presented a framework to assess the need of incorporating climate risk assessment as an integral part of business operations. We also reviewed revealed literature to understand the possible impacts of climate change on various sectors and presented key strategies to assess the climate risk associated with them. Also, a framework incorporating probable climate threats to business ecology with principles of robustness, resourcefulness, redundancy, and rapidity has been proposed to adapt and mitigate associated risks for a climate-resilient business ecosystem. The integration of Artificial Intelligence in managing risk could be a promising tool for enhancing business resilience to climate change and could be used as a tool. Robust and accurate predictions of climate and weather extremes from deep learning algorithms at a significant lead time can help in minimizing the associated risk with a business infrastructure. Atmospheric Rivers (ARs), a weather extreme cause huge socioeconomic risk by triggering floods and droughts in various continents of mid-latitude regions. We have presented a case study investigating the ability of deep learning algorithms to predict ARs. The results from the analysis advocate the application of deep learning algorithms to predict weather and climate extremes in decision support systems to enhance the climate resilience of a business ecosystem.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "deep learning",
    "cache_key": "180d14e421f4fef3c7bba3752e4023bb",
    "relevant_keywords": [
      "deep learning",
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T01:38:17.451819"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究利用人工智能（特别是深度学习）来增强企业对气候变化的适应能力，虽然提到了气候相关的金融风险，但其核心技术和应用场景集中在气候预测和业务韧性提升，并未直接涉及衍生品定价、金融风险管理或投资组合管理等具体金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究利用人工智能（特别是深度学习）来增强企业对气候变化的适应能力，虽然提到了气候相关的金融风险，但其核心技术和应用场景集中在气候预测和业务韧性提升，并未直接涉及衍生品定价、金融风险管理或投资组合管理等具体金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:03:36.092796"
}