{
  "paper": {
    "id": 310,
    "title": "RETRACTED: Prediction and Analysis of Corporate Financial Risk Assessment Using Logistic Regression Algorithm in Multiple Uncertainty Environment (Retracted Article)",
    "abstract": "Currently, the level of economic globalisation is expanding, which gives organizations more room to grow while also subjecting them to an increasing amount of pressure from the market. Companies are forced to deal with an increasing number of unclear aspects due to the unstable internal and external environments, which also increases the risks they confront. A management system for corporate financial risk is according to studies on early warning systems for financial risks. Its goals are to raise the standard of corporate financial management and boost economic advantages, identify concerns and potential hazards in the corporate financial management process, stop corporate financial crises in their tracks, and lessen the losses brought on by such crises. The financial risk management of the organization is predicted and examined in this research using the logistic regression model. The use of a logistic regression model allows for the simultaneous analysis of various risk factors, such as discrete and continuous variables, as well as the analysis of external variables' interactions and confounding. This method is suited for widespread usage in practice because it has shown exceptional outcomes in study that are 16.24% better than those of the conventional method.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "2ce458b8837450a9be16aacee6a5ca33",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:49:04.707699"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on predicting and analyzing corporate financial risk using a logistic regression model, which is a direct application in the field of financial risk management. The study aims to identify potential hazards in corporate financial management and prevent financial crises, aligning with the objectives of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on predicting and analyzing corporate financial risk using a logistic regression model, which is a direct application in the field of financial risk management. The study aims to identify potential hazards in corporate financial management and prevent financial crises, aligning with the objectives of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:59:06.389478"
}