{
  "paper": {
    "id": 4312,
    "title": "The 2020 magnetism roadmap",
    "abstract": "Andreas BergerCICnanoGUNE BRTA Following the success and relevance of the 2014 and 2017 Magnetism Roadmap articles, this 2020 Magnetism Roadmap edition takes yet another timely look at newly relevant and highly active areas in magnetism research. The overall layout of this article is unchanged, given that it has proved the most appropriate way to convey the most relevant aspects of today's magnetism research in a wide variety of sub-fields to a broad readership. A different group of experts has again been selected for this article, representing both the breadth of new research areas, and the desire to incorporate different voices and viewpoints. The latter is especially relevant for thistype of article, in which one's field of expertise has to be accommodated on two printed pages only, so that personal selection preferences are naturally rather more visible than in other types of articles. Most importantly, the very relevant advances in the field of magnetism research in recent years make the publication of yet another Magnetism Roadmap a very sensible and timely endeavour, allowing its authors and readers to take another broad-based, but concise look at the most significant developments in magnetism, their precise status, their challenges, and their anticipated future developments. While many of the contributions in this 2020 Magnetism Roadmap edition have significant associations with different aspects of magnetism, the general layout can nonetheless be classified in terms of three main themes: (i) phenomena, (ii) materials and characterization, and (iii) applications and devices. While these categories are unsurprisingly rather similar to the 2017 Roadmap, the order is different, in that the 2020 Roadmap considers phenomena first, even if their occurrences are naturally very difficult to separate from the materials exhibiting such phenomena. Nonetheless, the specifically selected topics seemed to be best displayed in the order presented here, in particular, because many of the phenomena or geometries discussed in (i) can be found or designed into a large variety of materials, so that the progression of the article embarks from more general concepts to more specific classes of materials in the selected order. Given that applications and devices are based on both phenomena and materials, it seemed most appropriate to close the article with the application and devices section (iii) once again. The 2020 Magnetism Roadmap article contains 14 sections, all of which were written by individual authors and experts, specifically addressing a subject in terms of its status, advances, challenges and perspectives in just two pages. Evidently, this two-page format limits the depth to which each subject can be described. Nonetheless, the most relevant and key aspects of each field are touched upon, which enables the Roadmap as whole to give its readership an initial overview of and outlook into a wide variety of topics and fields in a fairly condensed format. Correspondingly, the Roadmap pursues the goal of giving each reader a brief reference frame of relevant and current topics in modern applied magnetism research, even if not all sub-fields can be represented here. The first block of this 2020 Magnetism Roadmap, which is focussed on (i) phenomena, contains five contributions, which address the areas of interfacial Dzyaloshinskii-Moriya interactions, and two-dimensional and curvilinear magnetism, as well as spin-orbit torque phenomena and all optical magnetization reversal. All of these contributions describe cutting edge aspects of rather fundamental physical processes and properties, associated with new and improved magnetic materials' properties, together with potential developments in terms of future devices and technology. As such, they form part of a widening magnetism 'phenomena reservoir' for utilization in applied magnetism and related device technology. The final block (iii) of this article focuses on such applications and device-related fields in four contributions relating to currently active areas of research, which are of course utilizing magnetic phenomena to enable specific functions. These contributions highlight the role of magnetism or spintronics in the field of neuromorphic and reservoir computing, terahertz technology, and domain wall-based logic. One aspect common to all of these application-related contributions is that they are not yet being utilized in commercially available technology; it is currently still an open question, whether or not such technological applications will be magnetism-based at all in the future, or if other types of materials and phenomena will yet outperform magnetism. This last point is actually a very good indication of the vibrancy of applied magnetism research today, given that it demonstrates that magnetism research is able to venture into novel application fields, based upon its portfolio of phenomena, effects and materials. This materials portfolio in particular defines the central block (ii) of this article, with its five contributions interconnecting phenomena with devices, for which materials and the characterization of their properties is the decisive discriminator between purely academically interesting aspects and the true viability of real-life devices, because only available materials and their associated fabrication and characterization methods permit reliable technological implementation. These five contributions specifically address magnetic films and multiferroic heterostructures for the purpose of spin electronic utilization, multi-scale materials modelling, and magnetic materials design based upon machine-learning, as well as materials characterization via polarized neutron measurements. As such, these contributions illustrate the balanced relevance of research into experimental and modelling magnetic materials, as well the importance of sophisticated characterization methods that allow for an ever-more refined understanding of materials. As a combined and integrated article, this 2020 Magnetism Roadmap is intended to be a reference point for current, novel and emerging research directions in modern magnetism, just as its 2014 and 2017 predecessors have been in previous years.",
    "year": 2020,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "d444d98b0d1b11df83401d49e0a4c1fd",
    "relevant_keywords": [
      "machine learning"
    ],
    "stage1_timestamp": "2025-05-15T01:25:50.524514"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要讨论磁学研究的最新进展和应用，包括现象、材料和设备，并未提及任何与衍生品定价、金融风险管理或投资组合管理相关的应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要讨论磁学研究的最新进展和应用，包括现象、材料和设备，并未提及任何与衍生品定价、金融风险管理或投资组合管理相关的应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:07:56.459705"
}