{
  "paper": {
    "id": 309,
    "title": "Research and development project portfolio benefit prediction: an improved backpropagation neural network-based approach",
    "abstract": "PurposeEffectively predicting research and development project portfolio benefit (R&D PPB) could assist organizations in monitoring the execution of research and development project portfolio (R&D PP). However, due to the uncertainty and complexity of R&D PPB, current research remains lacking a valid R&D PPB prediction tool. Therefore, an R&D PPB prediction model is proposed via a backpropagation neural network (BPNN).Design/methodology/approachThe R&D PPB prediction model is constructed via a refined immune genetic algorithm coupling backpropagation neural network (RIGA-BPNN). Firstly, considering the characteristics of R&D PP, benefit evaluation criteria are identified. Secondly, the benefit criteria values are derived as input variables to the model via trapezoidal fuzzy numbers, and then the R&D PPB value is determined as the output variable through the CRITIC method. Thirdly, a refined immune genetic algorithm (RIGA) is designed to optimize BPNN by enhancing polyfitness, crossover and mutation probabilities. Lastly, the R&D PPB prediction model is constructed via the RIGA-BPNN, followed by training and testing.FindingsThe accuracy of the R&D PPB prediction model stands at 99.26%. In addition, the comparative experiment results indicate that the proposed model surpasses BPNN and the immune genetic algorithm coupling backpropagation neural network (IGA-BPNN) in both convergence speed and accuracy, showcasing superior performance in R&D PPB prediction. This study enriches the R&D PPB predicting methodology by providing managers with an effective benefits management tool.Research limitations/implicationsThe research implications of this study encompass three aspects. First, this study provides a profound insight into R&D PPB prediction and enriches the research in PP fields. Secondly, during the construction of the R&D PPB prediction model, the utilization of the composite system synergy model for quantifying synergy contributes to a comprehensive understanding of intricate interactions among benefits. Lastly, in this research, a RIGA is proposed for optimizing the BPNN to efficiently predict R&D PPB.Practical implicationsThis study carries threefold implications for the practice of R&D PPM. To begin with, the approach proposed serves as an effective tool for managers to predict R&D PPB. Then, the model excels in efficiency and flexibility. Furthermore, the proposed model could be used to tackle additional challenges in R&D PPM, such as gauging the potential risk level of R&D PP.Social implicationsEffective predicting of R&D PPB enables organizations to allocate their limited resources more strategically, ensuring optimal use of capital, manpower and time. By accurately predicting benefit, an organization can prioritize high-potential initiatives, thereby improving innovation efficiency and reducing the risk of failed investments. This approach not only strengthens market competitiveness but also positions organizations to adapt more effectively to changing market conditions, fostering long-term growth and sustainability in a competitive business environment.Originality/valueIncorporating the characteristics of R&D PP and quantifying the synergy between benefits, this study facilitates a more insightful R&D PPB prediction. Additionally, improvements to the polyfitness, crossover and mutation probabilities of IGA are made, and the aforementioned RIGA is applied to optimize the BPNN. It significantly enhances the prediction accuracy and convergence speed of the neural network, improving the effectiveness of the R&D PPB prediction model.",
    "year": 2024,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "8e043e890e3d1006893cd26f040204cb",
    "relevant_keywords": [
      "machine learning",
      "neural network",
      "backpropagation",
      "BP",
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T00:42:00.413444"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是研发项目组合效益预测，虽然使用了神经网络和优化算法，但其应用场景是研发项目管理，而非金融领域的衍生品定价、金融风险管理或投资组合管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是研发项目组合效益预测，虽然使用了神经网络和优化算法，但其应用场景是研发项目管理，而非金融领域的衍生品定价、金融风险管理或投资组合管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:31:47.399835"
}