{
  "paper": {
    "id": 74,
    "title": "Application of Support Vector Machines in debt to GDP ratio forecasting",
    "abstract": "This paper deals with the application of a novel neural network technique, Support Vector Machine (SVM), in financial time series forecasting. This study applies SVM to predict the debt to GDP ratio index. The objective of this paper is to examine the feasibility of SVM in foreign debt risk forecasting by comparing it with a back-propagation (BP) neural network. We choose Gaussian function as its Kernel function. The experiment shows that SVM outperforms the BP neural network based on the criteria of mean absolute error (MAE), mean absolute percent error (MAPE), mean squared error (MSE) and root mean square error (RMSE). Analysis of the experimental results proved that it is advantageous to apply SVMs to forecast debt to GDP ratio.",
    "year": 2006,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "041979c24942c5e61202cd3f15783ff0",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "regression",
      "support vector machine",
      "SVM",
      "neural network",
      "backpropagation",
      "BP"
    ],
    "stage1_timestamp": "2025-05-15T01:46:39.508950"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on applying Support Vector Machines to forecast the debt to GDP ratio, which is a key indicator for assessing sovereign debt risk. This directly relates to financial risk management, specifically in the area of foreign debt risk forecasting.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on applying Support Vector Machines to forecast the debt to GDP ratio, which is a key indicator for assessing sovereign debt risk. This directly relates to financial risk management, specifically in the area of foreign debt risk forecasting.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:01:10.528147"
}