{
  "paper": {
    "id": 558,
    "title": "Jump detection in financial time series usingmachine learning algorithms",
    "abstract": "In this paper, we develop a new Hybrid method based on machine learning algorithms for jump detection in financial time series. Jump is an important behavior in financial time series, since it implies a change in volatility. Ones can buy the volatility instrument if ones expect the volatility will bloom up in the future. A jump detection model attempts to detect short-term market instability, since it could be jumping up or down, instead of a directional prediction. The directional prediction can be considered as a momentum or trend following, which is not the focus of this paper. A jump detection model is commonly applied in a systematic fast-moving strategy, which reallocates the assets automatically. Also, a systematic opening position protection strategy can be driven by a jump detection model. For example, for a tail risk protection strategy, a pair of long call and put option order could be placed in the same time, in order to protect the open position given a huge change in volatility. One of the key differentiations of the proposed model with the classical methods of time-series anomaly detection is that, jump threshold parameters are not required to be predefined in our proposed model. Also the model is a combination of a Long short-term memory (LSTM) neural network model and a machine learning pattern recognition model. The LSTM model is applied for time series prediction, which predicts the next data point. The historical prediction errors sequence can be used as the information source or input of the jump detection model/module. The machine learning pattern recognition model is applied for jump detection. The combined model attempts to determine whether the current data point is a jump or not. LSTM neural network is a type of Recurrent Neural Networks (RNNs). LSTM records not only the recent market, but also the historical status. A stacked RNN is trained on a dataset which is mixed with normal and anomalous data. We compare the performance of the proposed Hybrid jump detection model and different pattern classification algorithms, such as k-nearest neighbors algorithm identifier, Hampel identifier, and Lee Mykland test. The model is trained and tested using real financial market data, including 11 global stock market in both developed and emerging markets in US, China, Hong Kong, Taiwan, Japan, UK, German, and Israel. The experiment result shows that the proposed Hybrid jump detection model is effective to detect jumps in terms of accuracy, comparing to the other classical jump detection methods.",
    "year": 2020,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "2fe0bf8352a9b2f42538a3ab44b64272",
    "relevant_keywords": [
      "machine learning",
      "classification",
      "neural network",
      "deep learning",
      "long short-term memory",
      "LSTM",
      "recurrent neural network"
    ],
    "stage1_timestamp": "2025-05-15T01:52:12.325507"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk",
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是开发一种基于机器学习的跳跃检测模型，用于金融时间序列分析。跳跃检测在金融风险管理中用于识别市场不稳定性和波动性变化，有助于风险管理策略的实施，如尾部风险保护策略。此外，跳跃检测模型也应用于系统性快速移动策略和资产自动再分配，这属于投资组合管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\", \"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是开发一种基于机器学习的跳跃检测模型，用于金融时间序列分析。跳跃检测在金融风险管理中用于识别市场不稳定性和波动性变化，有助于风险管理策略的实施，如尾部风险保护策略。此外，跳跃检测模型也应用于系统性快速移动策略和资产自动再分配，这属于投资组合管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:57:02.228216"
}