{
  "paper": {
    "id": 2288,
    "title": "A Review of the Fractal Market Hypothesis for Trading and Market Price Prediction",
    "abstract": "This paper provides a review of the Fractal Market Hypothesis (FMH) focusing on financial times series analysis. In order to put the FMH into a broader perspective, the Random Walk and Efficient Market Hypotheses are considered together with the basic principles of fractal geometry. After exploring the historical developments associated with different financial hypotheses, an overview of the basic mathematical modelling is provided. The principal goal of this paper is to consider the intrinsic scaling properties that are characteristic for each hypothesis. In regard to the FMH, it is explained why a financial time series can be taken to be characterised by a 1/t(1-1/gamma) scaling law, where gamma > 0 is the Levy index, which is able to quantify the likelihood of extreme changes in price differences occurring (or otherwise). In this context, the paper explores how the Levy index, coupled with other metrics, such as the Lyapunov Exponent and the Volatility, can be combined to provide long-term forecasts. Using these forecasts as a quantification for risk assessment, short-term price predictions are considered using a machine learning approach to evolve a nonlinear formula that simulates price values. A short case study is presented which reports on the use of this approach to forecast Bitcoin exchange rate values.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "04fa668603bb65fc34e1feacf1f6e682",
    "relevant_keywords": [
      "machine learning",
      "regression",
      "neural network",
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T02:13:31.828612"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要探讨了Fractal Market Hypothesis及其在金融时间序列分析中的应用，特别是通过Levy指数、Lyapunov Exponent和Volatility等指标进行长期预测和风险评估。虽然论文也提到了短期价格预测，但其核心应用在于风险评估，这属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文主要探讨了Fractal Market Hypothesis及其在金融时间序列分析中的应用，特别是通过Levy指数、Lyapunov Exponent和Volatility等指标进行长期预测和风险评估。虽然论文也提到了短期价格预测，但其核心应用在于风险评估，这属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:43:20.268094"
}