{
  "paper": {
    "id": 225,
    "title": "Research on Fuzzy Multi-objective Multi-period Portfolio by Hybrid Genetic Algorithm with Wavelet Neural Network",
    "abstract": "This paper deals with fuzzy multi-objective multi-period portfolio selection problems. The portfolio selection is proposed by taking into account three criteria of final return, cumulative risk and entropy. In the model, the return level is quantified by the possibilistic mean value of return, and the risk is quantified by the possibilistic variance of return while fuzzy entropy is adopted to increase the risk dispersion degree to some extent. Then a fuzzy multi-objective multi-period portfolio model is presented in a more complex market environment. To solve the complex model, the multi-objective functions are transformed into a single objective and the risk preference parameter is introduced to balance the return and risk to meet with investors' preferences. To ensure the investor can obtain the optimal portfolio strategy, a hybrid intelligent algorithm is designed by combining both genetic algorithm and wavelet neural network algorithm, which not only utilizes the good localization property of wavelet transform but also utilizes the effective self-learning function of neural network. Finally, a numerical example is presented to illustrate this approach and the designed algorithm. The results show that the proposed model and the designed algorithm are practical and flexible, while they are meaningful for the study on portfolio selection and multi-objective programming.",
    "year": 2020,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "320590d4c6aa77dfa1d48258f9b59b6c",
    "relevant_keywords": [
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T00:40:34.204841"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心研究内容是模糊多目标多周期投资组合选择问题，涉及最终回报、累积风险和熵三个标准，并设计了混合智能算法来优化投资组合策略。这些内容明确属于投资组合管理领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心研究内容是模糊多目标多周期投资组合选择问题，涉及最终回报、累积风险和熵三个标准，并设计了混合智能算法来优化投资组合策略。这些内容明确属于投资组合管理领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:32:43.825483"
}