{
  "paper": {
    "id": 81,
    "title": "Financial Risk Assessment and Pre-warning of Port Enterprises Based on Neural Network Model",
    "abstract": "This paper designs a financial risk assessment model based on Principal Component Analysis (PCA) and RBF neural network in order to help port enterprises effectively identify and prevent from the financial risks. Here first refines assessment indicators at all levels by the factor analysis, thereby reducing the RBF neural network training data, streamlining the network structure. Then refined data from some commercial banks will be chosen for training with RBF neural network. In the end, The RBF-ANN system that has already trained is tested based on data from a few port enterprises. This paper provides new ideas and methodologies for the port enterprise to effective make financial risk assessment, watchdog and control.",
    "year": 2020,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "2e22fe76e920ca4d80b2d437fb6cf91b",
    "relevant_keywords": [
      "machine learning",
      "neural network",
      "principal components analysis",
      "classification"
    ],
    "stage1_timestamp": "2025-05-15T01:46:39.565822"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on designing a financial risk assessment model for port enterprises using PCA and RBF neural network, which is directly related to identifying and preventing financial risks, a core aspect of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on designing a financial risk assessment model for port enterprises using PCA and RBF neural network, which is directly related to identifying and preventing financial risks, a core aspect of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:01:09.715901"
}