{
  "paper": {
    "id": 5733,
    "title": "A multicriteria approach to manage credit risk under strict uncertainty",
    "abstract": "Assessing the ability of applicants to repay their loans is generally recognized as a critical task in credit risk management. Credit managers rely on financial and market information, usually in the form of ratios, to estimate the quality of credit applicants. However, there is no guarantee that a given set of ratios contains the information needed for credit classification. Decision rules under strict uncertainty aim to mitigate this drawback. In this paper, we propose the use of a moderate pessimism decision rule combined with dimensionality reduction techniques and compromise programming. Moderate pessimism ensures that neither extreme optimistic nor pessimistic decisions are taken. Dimensionality reduction from a set of ratios facilitates the extraction of the relevant information. Compromise programming allows to find a balance between quality of debt and risk concentration. Our model produces two critical outputs: a quality assessment and the optimum allocation of funds. To illustrate our multicriteria approach, we include a case study on 29 firms listed in the Spanish stock market. Our results show that dimensionality reduction contributes to avoid redundancy and that quality-diversification optimization is able to produce budget allocations with a reduced number of firms.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "4a6021e971b24fd691c481a81306ed7e",
    "relevant_keywords": [
      "classification",
      "principal components analysis"
    ],
    "stage1_timestamp": "2025-05-15T02:50:53.897096"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk",
      "Portfolio Management"
    ],
    "justification": "该论文主要研究信用风险评估和资金分配优化，这直接涉及金融风险管理中的信用风险管理和投资组合管理中的资金分配策略。论文提出的多标准方法旨在平衡债务质量和风险集中度，并优化资金分配，这些都属于金融风险管理和投资组合管理的核心内容。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\", \"投资组合管理\"],\n  \"justification\": \"该论文主要研究信用风险评估和资金分配优化，这直接涉及金融风险管理中的信用风险管理和投资组合管理中的资金分配策略。论文提出的多标准方法旨在平衡债务质量和风险集中度，并优化资金分配，这些都属于金融风险管理和投资组合管理的核心内容。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:29:37.629385"
}