{
  "paper": {
    "id": 1224,
    "title": "A Novel RMS-Driven Deep Reinforcement Learning for Optimized Portfolio Management in Stock Trading",
    "abstract": "Algorithmic stock trading has improved tremendously, with Reinforcement Learning (RL) algorithms being more adaptable than classic approaches like mean reversion and momentum. However, challenges remain in adequately depicting market events and generating suitable rewards to influence the trading decisions of an agent in a dynamic environment. This study proposed an improved stock market trading framework termed the RMS-Driven Deep Reinforcement Learning (DRL) model for optimal portfolio management. The research attempts to give a more comprehensive view of the market and, as a result, enhance trading decisions by including consumer information and incorporating news sentiments into the model, in addition to data from typical earnings reports. More specifically, three kinds of DRL models are presented, combined with data from stock earnings reports, Max Drawdown rewards, and sentiment indicators (RMS), known as PPO_RMS, A2C_RMS, and DDPG_RMS, respectively. The findings of this research indicate that the integrated model, mainly the DDPG_RMS effectively outperforms the baseline <^>DJI index in many risk-return analyses in ratios showing better risk management, and profitability. The proposed stock trading model generates a maximum cumulative return of 27% with a Sharpe ratio of 0.66, showing an appropriate trade-off between risk and return. This approach, which incorporates sentiment analysis and Max Drawdown rewards, significantly enhances the model's performance in adapting to changing market conditions. Therefore, the results emphasize the appropriateness of integrating sentiment indices with traditional financial data to enhance a trader's performance while also offering essential information to aid in the development of improved trading tactics in continuously changing financial markets.",
    "year": 2025,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "014343a5b6ac654f21eaf1b83a545851",
    "relevant_keywords": [
      "machine learning",
      "reinforcement learning",
      "deep learning",
      "neural network",
      "representation learning"
    ],
    "stage1_timestamp": "2025-05-15T02:00:30.494894"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是提出了一种改进的深度强化学习模型（RMS-Driven DRL），用于优化股票交易中的投资组合管理。论文明确提到该模型旨在通过整合消费者信息、新闻情绪和传统财务数据来增强交易决策，并在风险回报分析中表现出色，这直接关联到投资组合管理的领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是提出了一种改进的深度强化学习模型（RMS-Driven DRL），用于优化股票交易中的投资组合管理。论文明确提到该模型旨在通过整合消费者信息、新闻情绪和传统财务数据来增强交易决策，并在风险回报分析中表现出色，这直接关联到投资组合管理的领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:50:54.894337"
}