{
  "paper": {
    "id": 895,
    "title": "Service Deployment Strategy for Predictive Analysis of FinTech IoT Applications in Edge Networks",
    "abstract": "The seamless integration of sensors and smart communication technologies has led to the development of various supporting systems for financial technology (FinTech). The emergence of the next-generation Internet of Things (Nx-IoT) for FinTech applications enhances the customer satisfaction ratio. The main research challenge for FinTech applications is to analyze the incoming tasks at the edge of the networks with minimum delay and power consumption while increasing the prediction accuracy. Motivated by the above-mentioned challenge, in this article, we develop a ranked-based service deployment strategy and an artificial intelligence technique for financial data analysis at edge networks. Initially, a risk-based task classification strategy has been developed for classifying the incoming financial tasks and providing the importance to the risk-based task for meeting users' satisfaction ratio. Besides that, an efficient service deployment strategy is developed using $Hall's$ theorem to assign the ranked-based financial data to the suitable edge or cloud servers with minimum delay and power consumption. Finally, the standard support vector machines (SVMs) algorithm is used at edge networks for analyzing the financial data with higher accuracy. The experimental results demonstrate the effectiveness of the proposed strategy and SVM model at edge networks over the baseline algorithms and classification models, respectively.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "7df7ba1b4217df09d7312d39ad3f361a",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM"
    ],
    "stage1_timestamp": "2025-05-15T01:56:17.587032"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是在边缘网络中部署服务策略以优化金融科技（FinTech）物联网应用的预测分析，重点在于任务分类、服务部署和延迟/功耗优化，并未明确指出其核心技术应用于衍生品定价、金融风险管理或投资组合管理等特定金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是在边缘网络中部署服务策略以优化金融科技（FinTech）物联网应用的预测分析，重点在于任务分类、服务部署和延迟/功耗优化，并未明确指出其核心技术应用于衍生品定价、金融风险管理或投资组合管理等特定金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:53:54.802248"
}