{
  "paper": {
    "id": 1354,
    "title": "Cluster analysis for informing vulnerability assessment of masonry churches to natural hazards",
    "abstract": "According to a census by the Catholic Church, Italy's territory hosts more than sixty thousand buildings of worship. Most of these buildings were built between the first and the nineteenth century A.D., with a load-bearing masonry structure that proved to be particularly prone to damage due to natural hazards. This investigation explores the use of clustering algorithms to identify and cluster typologies of buildings and archetypes. The aim is to define statistical models for the geometric and mechanical properties, to delineate a set of reference structures representative of the whole building stock, and finally select 'indicator attributes' that can be used in developing seismic and landslide vulnerability indicators. The proposed methodology is applied to a specific portfolio of seventy-one churches in the north-western area of the Tuscany region (Italy). The main geometric and mechanical features of the churches included in the portfolio are gathered using a new simplified Rapid Visual Survey form. A procedure is then proposed to define representative archetypes using three well-known clustering algorithms (K-Means, Gaussian Mixture Models, and Kernel-density). When analysed together, the identified archetypes can portray the variability of the geometric and mechanical properties in the selected portfolio, constituting a basis for developing new vulnerability models.",
    "year": 2025,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "566c7df50aab8a0c8e5d77eb4049f900",
    "relevant_keywords": [
      "unsupervised learning",
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T00:54:56.379993"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要探讨了使用聚类算法对教堂建筑进行脆弱性评估，研究重点在于自然灾害风险下的建筑结构分析，并未涉及任何金融领域的应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要探讨了使用聚类算法对教堂建筑进行脆弱性评估，研究重点在于自然灾害风险下的建筑结构分析，并未涉及任何金融领域的应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:21:37.984380"
}