{
  "paper": {
    "id": 6892,
    "title": "ROMANIAN CONSUMERS' BEHAVIOUR TOWARDS COUNTERFEIT PRODUCTS",
    "abstract": "Counterfeiting and piracy have emerged as a not inconsiderable phenomenon on the world market because it presents a major peril to the national security, the legal businesses, and even to the economic development and the advancement of society. The scourge of counterfeiting represents today an impending danger because it affects consumers' health and safety, violates the principles of fair competition, fosters illicit trade, illegal migration and employment, discourages investments in new products and technologies and brings about significant loss to intellectual property holders and to the budgets of the states concerned. Being aware of the impact of counterfeit and pirated products on the Romanian consumers, the authors set to investigate their behaviour towards the phenomenon of counterfeiting and emphasize the product categories that Romanians are prone to buy illicitly. The regression analyses conducted on a sample of about 3,000 questionnaires reveal that there are various reasons behind the purchase of counterfeit goods, such as the saving in financial resources, people's desire to achieve a particular social status and receive their fellows' recognition or their being unaware of the risk they take.",
    "year": 2014,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "c44a39a201fc903904fe2fba17106960",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T03:02:41.278918"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究罗马尼亚消费者对假冒产品的行为，涉及消费者行为分析和回归分析，但并未提及任何与衍生品定价、金融风险管理或投资组合管理相关的应用或技术。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究罗马尼亚消费者对假冒产品的行为，涉及消费者行为分析和回归分析，但并未提及任何与衍生品定价、金融风险管理或投资组合管理相关的应用或技术。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:27:07.338583"
}