{
  "paper": {
    "id": 3253,
    "title": "Not all that glitters is RMT in the forecasting of risk of portfolios in the Brazilian stock market",
    "abstract": "Using stocks of the Brazilian stock exchange (BM&F-Bovespa), we build portfolios of stocks based on Markowitz's theory and test the predicted and realized risks. This is done using the correlation matrices between stocks, and also using Random Matrix Theory in order to clean such correlation matrices from noise. We also calculate correlation matrices using a regression model in order to remove the effect of common market movements and their cleaned versions using Random Matrix Theory. This is done for years of both low and high volatility of the Brazilian stock market, from 2004 to 2012. The results show that the use of regression to subtract the market effect on returns greatly increases the accuracy of the prediction of risk, and that, although the cleaning of the correlation matrix often leads to portfolios that better predict risks, in periods of high volatility of the market this procedure may fail to do so. The results may be used in the assessment of the true risks when one builds a portfolio of stocks during periods of crisis. (C) 2014 Elsevier B.V. All rights reserved.",
    "year": 2014,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "23c2a3e4be12d8dee42e3f1bf33ea202",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:15:26.072970"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk",
      "Portfolio Management"
    ],
    "justification": "该论文主要研究基于Markowitz理论构建股票投资组合，并测试预测和实现的风险，这属于投资组合管理的范畴。同时，论文还讨论了在危机期间评估真实风险的方法，这属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\", \"投资组合管理\"],\n  \"justification\": \"该论文主要研究基于Markowitz理论构建股票投资组合，并测试预测和实现的风险，这属于投资组合管理的范畴。同时，论文还讨论了在危机期间评估真实风险的方法，这属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:10:30.951641"
}