{
  "paper": {
    "id": 4058,
    "title": "Key Financial Indicators Analysis and Stock Trend Forecasting Based on a Wrapper Feature Selection Method",
    "abstract": "Predicting stock price trends is a challenging puzzle. The immediate price of a stock is affected by an uncountable number of factors. Thus there is essentially no way to accurately predict short-term stock price due to dynamic, incomplete, erratic, and chaotic data. However, by analyzing key financial indicators, it is possible to gain an accurate understanding of a company's operations, make a quantitative assessment of its value, and thus make a reasonable prediction of the long-term trend of its stock price. In this FedCSIS 2024 Data Science Challenge, participants are asked to predict the trends of the stocks which are chosen from the Standard & Poor's 500 index. In this paper, we apply a wrapper feature selection method that tightly combines the steps of feature selection and model building to result in better prediction models, and provide insight into the indicators. After selecting the best set of features, we train two kinds of gradient boost machine: multi-classification model and regression model for class and risk-return performance prediction respectively. Finally a high confidence voting strategy is used to determine the kind of trading action (buy, sell, or hold). Experimental and competition results demonstrate the effectiveness of the methodology in this paper.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "f7122030c60a018b483b0207c19c549c",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "regression",
      "feature learning"
    ],
    "stage1_timestamp": "2025-05-15T02:32:27.637970"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究基于特征选择方法的股票趋势预测，虽然涉及金融领域，但并未明确指出其核心技术应用于衍生品定价、金融风险管理或投资组合管理等特定领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究基于特征选择方法的股票趋势预测，虽然涉及金融领域，但并未明确指出其核心技术应用于衍生品定价、金融风险管理或投资组合管理等特定领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:34:19.077045"
}