{
  "paper": {
    "id": 673,
    "title": "Integrated Artificial Intelligence and Visualization Technique for Enhanced Management Decision in Today's Turbulent Business Environments",
    "abstract": "The dramatic deterioration in a corporate's profitability not only threatens its own interests, employees, and investors, but can also impact external entities and people through financial losses and high risk exposure. Thus, in today's turbulent market environments an essential issue arises as to how to set up an effective pre-warning model that provides managers with specific avenues to avoid financial troubles from getting worse and offers investors useful directions to adjust their investment portfolios. However, extant forecasting models are not yet capable of fully explaining the relationships between past and future performances, which may be due to the omission of some critical information. To capture the multidimensional nature of performance assessment, this study extends a singular data envelopment analysis (DEA) specification to multiple DEA specifications and further incorporates them with a risk-adjusted metric so as to present an overarching reflection of corporates' operations. To make the outcome much more accessible to non-specialists, we utilize a visualization technique to represent the data's main structure and then feed the analyzed data into a twin parametric-margin support vector machine (TPSVM) to construct the forecasting model. Due to the obscure nature of the SVM-based model, this study executes the multiple instances learning (MIL) algorithm to extract the inherent decision logics and to represent them in human readable way. After examining it with real cases, the proposed model is a promising alternative for performance assessment and forecasting.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "10b47effb99ac57cbff4f718cae803e3",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "support vector machine",
      "SVM"
    ],
    "stage1_timestamp": "2025-05-15T01:53:59.304882"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk",
      "Portfolio Management"
    ],
    "justification": "该论文的主要目标是建立一个有效的预警模型，帮助管理者和投资者避免财务困境并调整投资组合。这涉及到金融风险管理（通过预测和避免财务困境）和投资组合管理（通过提供投资方向调整的建议）。论文中提到的风险调整指标和投资组合调整方向进一步支持了这一判断。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\", \"投资组合管理\"],\n  \"justification\": \"该论文的主要目标是建立一个有效的预警模型，帮助管理者和投资者避免财务困境并调整投资组合。这涉及到金融风险管理（通过预测和避免财务困境）和投资组合管理（通过提供投资方向调整的建议）。论文中提到的风险调整指标和投资组合调整方向进一步支持了这一判断。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:55:52.521544"
}