{
  "paper": {
    "id": 2312,
    "title": "A retail investor in a cobweb of social networks",
    "abstract": "In this study, using AI, we empirically examine the irrational behaviour, specifically attentiondriven trading and emotion-driven trading such as consensus trading, of retail investors in an emerging stock market. We used a neural network to assess the tone of messages on social media platforms and proposed a novel Hype indicator that integrates metrics of investor attention and sentiment. The sample of messages, which are written in Russian with slang expressions, was retrieved from a unique dataset of social network communication of investors in the Russian stock market. Applying different portfolio designs, we evaluated the effectiveness of the new Hype indicator against the factors of momentum, volatility, and trading volume. We found the possibility of building a profitable trading strategy based on the Hype indicator over a 6-month time horizon. Over short periods, the Hype indicator allows investors to earn more by buying stocks of large companies, and over << longer >> periods, this indicator tends to perform better for illiquid stocks of small companies. As consensus trading tends to produce negative returns, the investment strategy of `Go against the crowd' proves rewarding in the medium term of 3 months.",
    "year": 2022,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "6915b8a930896a228b79f7741a31af86",
    "relevant_keywords": [
      "neural network",
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T01:05:39.627331"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是使用神经网络分析社交媒体情绪和投资者注意力，构建了一个新的Hype指标，并评估了其在投资组合设计中的有效性。研究目标是开发一个基于该指标的盈利交易策略，这直接属于投资组合管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是使用神经网络分析社交媒体情绪和投资者注意力，构建了一个新的Hype指标，并评估了其在投资组合设计中的有效性。研究目标是开发一个基于该指标的盈利交易策略，这直接属于投资组合管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:15:53.421884"
}