{
  "paper": {
    "id": 9386,
    "title": "Medical costs of managed care in patients with type 2 diabetes mellitus",
    "abstract": "The main objective of this study was to analyze the principal treatment cost drivers in patients with type 2 diabetes mellitus in a managed care setting. The study used retrospective integrated (linked) medical and pharmacy claims data for the calender year 1995. The data were obtained from, and in cooperation with, the Hawaii Medical Service Association, Honolulu, Hawaii. The medical claims data included paid claims for services and procedures for diabetes and commonly associated comorbidities. Claims and associated costs for pharmacotherapy administered to the patient population were recorded in the pharmacy data. Patients aged greater than or equal to 65 years were excluded because Medicare claims were unavailable for the type 2 diabetic population. The sample used in this study included 5171 patients. An ordinary least squares regression model was employed to identify principal cost drivers among the identified cohort to the managed care system. Independent variables in the analysis consisted of the presence or absence of a number of commonly observed comorbidities associated with diabetes mellitus (hypertension, hyperlipidemia, cardiovascular diseases, congestive heart failure, renal disorders, retinopathy, neurologic disorders, and any cardiac or noncardiac comorbidity combinations), pharmacologic therapy variables (insulin, oral medication, or both), a number of significant events (hospitalization, dialysis, hemoglobin A,, testing, and eye examination), patient enrollment category (fee-for-service vs a capitated system), and patient age and sex. The dependent variable was the natural logarithm of total medical costs of treatment for diabetes and commonly observed comorbidities. Results showed that among comorbidity variables, the 3 largest treatment cost drivers for patients with type 2 diabetes were the presence of neurologic disorders, renal disorders, and any comorbidity combination (cardiac or noncardiac or both), in decreasing order of significance. Similarly, higher costs of treatment were associated with episodes of hospitalization, use of antidiabetic medication, dialysis services, and hemoglobin A,, testing. Whether the patient was being treated under a capitated provider payment system or a fee-for-service system did not have any significant impact on the medical costs of diabetes-related treatment. Age was positively associated with these costs, indicating that older patients were more likely to incur higher costs to the system. The overall explanatory power of the model was 40%. In summary, unless diabetes is properly managed and glucose levels monitored, some component of an integrated health system (hospital vs pharmacy) necessarily bears financial risk. An understanding of the underlying cost distribution for a chronic disease could help in targeting interventions, integrating disease-management services, and managing the formal structure of the health plan being considered.",
    "year": 1999,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "4834e5084750fce12cb3995ff119cf17",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T03:28:17.588068"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是2型糖尿病患者的医疗成本驱动因素，使用了回归模型来分析医疗数据。虽然提到了财务风险，但这属于医疗保健管理领域，而非金融研究领域中的衍生品定价、金融风险管理或投资组合管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是2型糖尿病患者的医疗成本驱动因素，使用了回归模型来分析医疗数据。虽然提到了财务风险，但这属于医疗保健管理领域，而非金融研究领域中的衍生品定价、金融风险管理或投资组合管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:25:11.953157"
}