{
  "paper": {
    "id": 491,
    "title": "Hybrid Machine Learning Approach for Predicting E-wallet Adoption Among Higher Education Students in Malaysia",
    "abstract": "In today's digitised world, e -wallets have been sprouting thick and fast in Malaysia as they contribute significantly to expediting online transactions. The E -wallet system is not only a mechanism for businesses to acquire profit but is also one of the most secure payment options for customers, particularly during the COVID-19 pandemic. However, the adoption of e -wallets among higher education students remains unfavourable, eliciting only minimal response. This study aims to analyse higher education students' adoption of e -wallets using a hybrid machine learning method, combining clustering and decision trees. This approach provides deep insights into user behaviour, improving prediction accuracy and enabling personalised strategies for enhanced user experiences. It profiles and classifies students based on demographics and traits such as age, year of study, gender, frequency of use, future use intention, lifestyle compatibility, perceived trust, risk perception, convenience, and security factors. The analysis reveals the segmentation of the dataset into four distinct clusters, each characterised by shared attributes. These clusters are subsequently labelled descriptively and incorporated into the dataset. The dataset, now enriched with cluster information, serves as the foundation for constructing a decision tree model. The outcome of the decision tree indicates that Cluster 2 and Cluster 3 are hesitant towards e -payment. In contrast, Cluster 1 and Cluster 4 are more receptive despite security concerns, as e -wallets offer convenience despite lacking full trust, with security being a prominent concern amidst rising cyber threats. This study helps the Malaysian government and service providers promote cashless transactions and shape students' financial independence based on their traits.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "e315c6708377e47af3b8dda1df798479",
    "relevant_keywords": [
      "machine learning",
      "unsupervised learning",
      "classification",
      "decision tree",
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T01:51:31.293467"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究电子钱包在高等教育学生中的采用情况，使用机器学习方法进行用户行为分析和预测。虽然涉及金融支付工具，但其核心研究并不属于衍生品定价、金融风险管理或投资组合管理中的任何一个领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究电子钱包在高等教育学生中的采用情况，使用机器学习方法进行用户行为分析和预测。虽然涉及金融支付工具，但其核心研究并不属于衍生品定价、金融风险管理或投资组合管理中的任何一个领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:57:37.400642"
}