{
  "paper": {
    "id": 786,
    "title": "RETRACTED: Using a back propagation network combined with grey clustering to forecast policyholder decision to purchase investment-inked insurance (Retracted Article)",
    "abstract": "For life insurance companies, identifying potential buyers of investment-linked insurance from among their existing policyholders may be an effective marketing strategy. The purchase decision, i.e. our dependent variable, is a binary variable. In the current study, we apply artificial neural networks to predict policyholder purchase decision of investment-linked insurance and compare the results with that of logistic regression. Because policyholders of investment-linked insurance bear the investment risk, their risk attitude should have a great impact on their purchase decision. We take financial risk attitude and general risk attitude into account simultaneously. Grey clustering statistic offers an alternative for classifying policyholder risk attitudes. We find that grey clustering is better suited to back propagation neural networks; while the average-and-standard-deviation method is better in combination with logistic regression. Further, financial risk attitudes rather than general risk attitudes may be major influences on policyholders' purchase decisions. (C) 2010 Elsevier Ltd. All rights reserved.",
    "year": 2011,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "30b7d47e9e38e62d149eeb3e8dc59a90",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "regression",
      "clustering",
      "neural network",
      "backpropagation",
      "BP"
    ],
    "stage1_timestamp": "2025-05-15T01:55:08.018325"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是使用人工神经网络和灰色聚类来预测投保人购买投资连结保险的决策，这属于保险营销和消费者行为分析的范畴，并未直接涉及衍生品定价、金融风险管理或投资组合管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是使用人工神经网络和灰色聚类来预测投保人购买投资连结保险的决策，这属于保险营销和消费者行为分析的范畴，并未直接涉及衍生品定价、金融风险管理或投资组合管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:54:40.458295"
}