{
  "paper": {
    "id": 419,
    "title": "Option Volatility Investment Strategy: The Combination of Neural Network and Classical Volatility Prediction Model",
    "abstract": "This study focuses on the volatility prediction and option volatility investment. By investigating the traditional Volatility Prediction Model and machine learning algorithms, this study tries to merge these two aspects together. This work setup a bridge of previous financial studies and machine learning studies by proposing an algorithm integrating neural network and three traditional volatility models, called Quantile based neural network and model integration combination algorithm. The algorithm effectively lowers the volatility prediction error (measured by root of mean square error, shorted for RMSE: 0.319724) and beat the Wavenet (RMSE: 0.44) which is the benchmark and surpasses integrated model (RMSE: 0.348346) in test set. In terms of option investment strategy, this paper constructs a CSI 300 index option portfolio which hedges the underlying asset price risk and exposes the volatility risk. Then propose the Option strategy of volatility prediction with dynamic thresholds. With the new algorithm above, the strategy improves the return-risk ratio in test set (measured by Sharpe ratio: 1.99-2.07).",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "0f0ecb48645c7162b55909d8b8edeea0",
    "relevant_keywords": [
      "machine learning",
      "neural network",
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T01:50:52.608341"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Derivatives Pricing",
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是结合神经网络和传统波动率预测模型来改进波动率预测，并应用于期权投资策略。波动率预测直接关联到期权定价（衍生品定价），而构建CSI 300指数期权组合以对冲基础资产价格风险并暴露波动率风险，属于投资组合管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"衍生品定价\", \"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是结合神经网络和传统波动率预测模型来改进波动率预测，并应用于期权投资策略。波动率预测直接关联到期权定价（衍生品定价），而构建CSI 300指数期权组合以对冲基础资产价格风险并暴露波动率风险，属于投资组合管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:58:05.232881"
}