{
  "paper": {
    "id": 907,
    "title": "Early Warning System for Financially Distressed Hospitals Via Data Mining Application",
    "abstract": "The aim of this study is to develop a Financial Early Warning System (FEWS) for hospitals by using data mining. A data mining method, Chi-Square Automatic Interaction Detector (CHAID) decision tree algorithm, was used in the study for financial profiling and developing FEWS. The study was conducted in Turkish Ministry of Health's public hospitals which were in financial distress and in need of urgent solutions for financial issues. 839 hospitals were covered and financial data of the year 2008 was obtained from Ministry of Health. As a result of the study, it was determined that 28 hospitals (3.34%) had good financial performance, and 811 hospitals (96.66%) had poor financial performance. According to FEWS, the covered hospitals were categorized into 11 different financial risk profiles, and it was found that 6 variables affected financial risk of hospitals. According to the profiles of hospitals in financial distress, one early warning signal was detected and financial road map was developed for risk mitigation.",
    "year": 2012,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "5f4b1adbf49901abf98828c8a0ffb729",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T01:56:17.609131"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用数据挖掘方法（CHAID决策树算法）开发财务早期预警系统（FEWS），用于评估医院的财务风险状况并制定风险缓解策略。这属于金融风险管理的范畴，因为它专注于识别和管理财务风险。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是使用数据挖掘方法（CHAID决策树算法）开发财务早期预警系统（FEWS），用于评估医院的财务风险状况并制定风险缓解策略。这属于金融风险管理的范畴，因为它专注于识别和管理财务风险。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:53:53.428674"
}