{
  "paper": {
    "id": 546,
    "title": "TweetSmart: Hedging In Markets Through Twitter",
    "abstract": "Application of pattern recognition and machine learning in highly dynamic and data intensive financial markets is a popular research area amongst researchers and financial analysts. With evolving social dynamics of millions across the globe, it provides opportunity to make use of patterns in investor sentiment comprising of large scale microblog discussions to understand market movements and make an effective application in making hedging decisions. We apply sentiment analysis and machine learning principles to study causation between public collective sentiment and market movements. In this work we have used 0.6 million tweets for a period of November 2010 to June 2011, to run a practical simulation of hedging model for Dow Jones Industrial Average-DJIA Index. We have elaborated on how a simple hedging strategy like married-put can exercise use of weekly directional forecasts for DJIA to make portfolio adjustments from risky to high market conditions and vice versa. We have found the maximum of 91% SVM based binary classifier accuracy, towards direction (up and down prediction) estimations of DJIA.",
    "year": 2012,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "00b4c13f2fe56f93272251fd0be3ca2f",
    "relevant_keywords": [
      "machine learning",
      "classification",
      "support vector machine",
      "SVM"
    ],
    "stage1_timestamp": "2025-05-15T00:45:01.252123"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk",
      "Portfolio Management"
    ],
    "justification": "该论文应用情感分析和机器学习技术来研究公众情绪与市场波动之间的因果关系，并具体讨论了如何利用这些预测来调整投资组合（如married-put策略）以应对市场风险，这涉及到金融风险管理和投资组合管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\", \"投资组合管理\"],\n  \"justification\": \"该论文应用情感分析和机器学习技术来研究公众情绪与市场波动之间的因果关系，并具体讨论了如何利用这些预测来调整投资组合（如married-put策略）以应对市场风险，这涉及到金融风险管理和投资组合管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:29:58.893423"
}