{
  "paper": {
    "id": 2300,
    "title": "Credit risk assessment of small and micro enterprise based on machine learning",
    "abstract": "Small and micro enterprises are pivotal in national economic and social development. To foster their growth, managing their credit risks scientifically is crucial. This study starts by examining the credit information of these enterprises. We use imbalanced sample processing algorithms to ensure a balanced representation of minority-class samples. Then, a machine learning classifier is employed to identify key factors contributing to these enterprises' low credibility. Based on these factors, an XGBoost scoring card model is developed. The study reveals: firstly, the integration of the SMOTE algorithm with the XGBoost model exhibits certain performance advantages in handling imbalanced datasets; secondly, trustworthy financial information remains at the heart of crucial risk determinants; thirdly, the XGBoost scoring card model based on significant features effectively enhances the accuracy of credit risk assessment. These insights provide both theoretical references and practical tools for enhancing the robustness of small and micro enterprises, facilitating early warnings on credit risks, and refining financing efficiency.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "a2443e97d71791208be5e006f921e28f",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "decision tree",
      "feature learning",
      "feature representation"
    ],
    "stage1_timestamp": "2025-05-15T02:13:31.884516"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on using machine learning techniques to assess and manage credit risks for small and micro enterprises, which is a core aspect of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on using machine learning techniques to assess and manage credit risks for small and micro enterprises, which is a core aspect of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:43:19.542543"
}