{
  "paper": {
    "id": 47,
    "title": "Predicting Financial Health of Banks for Investor Guidance Using Machine Learning Algorithms",
    "abstract": "While earlier studies have focused excessively on bankruptcy prediction of banks, this study classifies banks based on their financial strength from the perspective of retail depositors who currently do not have an authentic guiding framework that helps them identify banks with higher risk profiles. Using machine learning techniques, we classify 44 Indian banks into distinct categories of financial health based on 12-year data from 2005 to 2017. We first use unsupervised learning to identify a pattern leading to logical groups in terms of financial health and then move to supervised learning for prediction. Using linear discriminant analysis (LDA), Classification and Regression Tree (CART) and Random Forest methods, we predict the cluster membership with the associated explanatory power alongside. We also compare our classification with the credit ratings awarded by rating agencies and highlight certain discrepancies that exist between what is predicted by our models and the credit rating awards. JEL Codes: C53; M10",
    "year": 2020,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "1b32d82b946f01a85a0341d36588464e",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "unsupervised learning",
      "classification",
      "decision tree",
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T01:46:03.883294"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用机器学习方法对银行的财务健康状况进行分类，旨在帮助零售储户识别高风险银行，这属于金融风险管理中的信用风险评估范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是使用机器学习方法对银行的财务健康状况进行分类，旨在帮助零售储户识别高风险银行，这属于金融风险管理中的信用风险评估范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:01:14.310520"
}