{
  "paper": {
    "id": 1418,
    "title": "A Robust Human-Machine Framework for Project Portfolio Selection",
    "abstract": "Based on the project portfolio selection and scheduling problem (PPSS), the development of a systematic and scientific project scheduling plan necessitates comprehensive consideration of individual preferences and multiple realistic constraints, rendering it an NP-hard problem. Simultaneously, accurately and swiftly evaluating the value of projects as a complex entity poses a challenging issue that requires urgent attention. This paper introduces a novel qualitative evaluation-based project value assessment process that significantly reduces the cost and complexity of project value assessment, upon which a preference-based deep reinforcement learning method is presented for computing and solving project subsets and time scheduling plans. This paper first determines the key parameter values of the algorithm through specific examples. Then, using the method of controlling variables, it explores the sensitivity of the algorithm to changes in problem size and dimensionality. Finally, the proposed algorithm is compared with two classical algorithms and two heuristic algorithms across different instances. The experimental results demonstrate that the proposed algorithm exhibits higher effectiveness and accuracy.",
    "year": 2024,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "a39a517c6dba2b4a64df9f45c7a70793",
    "relevant_keywords": [
      "reinforcement learning",
      "deep learning",
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T00:55:28.504582"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文主要研究项目组合选择与调度问题（PPSS），并提出了基于偏好的深度强化学习方法来解决项目子集和时间调度计划的计算问题。这与投资组合管理中的资产选择和优化问题在方法论和应用场景上高度相似，尽管研究对象是项目而非金融资产，但核心技术和研究目标与投资组合管理领域高度相关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文主要研究项目组合选择与调度问题（PPSS），并提出了基于偏好的深度强化学习方法来解决项目子集和时间调度计划的计算问题。这与投资组合管理中的资产选择和优化问题在方法论和应用场景上高度相似，尽管研究对象是项目而非金融资产，但核心技术和研究目标与投资组合管理领域高度相关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:21:08.783542"
}