{
  "paper": {
    "id": 716,
    "title": "Reconstructing seismic response demands across multiple tall buildings using kernel-based machine learning methods",
    "abstract": "An approach to reconstructing full-profile seismic response demands across multiple tall buildings, using kernel-based machine learning methods, is introduced. Nonlinear response history analyses are used to generate a dataset of peak floor accelerations and peak story drift ratios for a portfolio of tall buildings, using spatially explicit ground motions from the Northridge earthquake. Structural dissimilarities are incorporated by including a range of building heights and differences in the type and combination of lateral force resisting systems. Using measurements from limited locations within a subset of buildings, the full-profile response demands for all buildings in a portfolio are reconstructed. A rigorous evaluation procedure is used to demonstrate the ability of the kernel-based methods to accurately capture the highly nonlinear response demand patterns within and across buildings. For a scenario where the first floor, mid-height, and roof level responses are known for 40% of the buildings, the kernel-based machine learning methods are able to estimate the full-profile demands of the entire portfolio with a median error that is approximately 30% of the measured demands.",
    "year": 2019,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "0f05df756d6ae975157c469d46a8390d",
    "relevant_keywords": [
      "machine learning",
      "regression",
      "support vector machine",
      "SVM"
    ],
    "stage1_timestamp": "2025-05-15T00:47:18.560468"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究使用基于核的机器学习方法来重建多个高层建筑的地震响应需求，其应用领域是结构工程和地震工程，与金融领域的衍生品定价、金融风险管理和投资组合管理无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究使用基于核的机器学习方法来重建多个高层建筑的地震响应需求，其应用领域是结构工程和地震工程，与金融领域的衍生品定价、金融风险管理和投资组合管理无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:28:24.736490"
}