{
  "paper": {
    "id": 4323,
    "title": "A novel approach to flood risk zonation: integrating deep learning models with APG in the Aji Chay catchment",
    "abstract": "Each year, floods, as one of the natural calamities, lead to significant destruction in various regions globally. Consequently, precise flood prediction becomes crucial in mitigating human and financial losses and effectively managing water resources. To achieve this, Convolutional Neural Network and Long Short-Term Memory (LSTM) models were utilized in this study to map flood hazards in the Aji Chay watershed. Flood data points were collected from the study area and subsequently divided into two groups using the Absence Point Generation technique. The first group, comprising 70% of the data, served as the training dataset for model construction, while the remaining 30% formed the testing dataset for validation. Seven key factors influencing floods, namely, precipitation, land use, Normalized Difference Vegetation Index, drainage density, flow direction, topographic wetness index, and terrain ruggedness index, were identified through Leave-One-Feature-Out approach and employed in the modeling process. The LSTM model with a Kolmogorov-Smirnov (KS) statistic value of 88.14 was chosen as the best model based on the KS plot. The results revealed that approximately 37% of the study area fell into high and very high flood risk classes. These research findings can be valuable in the effective management of flood-prone areas and the reduction of flood damages.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "61c4f1a3ca796b18f807fc563b85cc5f",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "deep learning",
      "neural network",
      "convolutional neural network",
      "CNN",
      "long short-term memory",
      "LSTM",
      "feature learning"
    ],
    "stage1_timestamp": "2025-05-15T02:36:05.157180"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究洪水风险分区，利用深度学习模型进行洪水预测和灾害管理，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究洪水风险分区，利用深度学习模型进行洪水预测和灾害管理，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:33:21.449013"
}