{
  "paper": {
    "id": 246,
    "title": "Hybrid Classifier for Predicting Financial Distress",
    "abstract": "The challenges and competition in the investment world recently became a great focus to be studied as it is greatly linked to profitability. Business sustainability has become a great issue to ensure the profit generated and keep the operation going, reducing the risk of financial distress of a firm. Model to predict the financially distressed firm has been developed over decades, using conventional statistical and recent data mining methods. A combination of clustering and classification methods called hybrid classifier, used in this paper. Cluster analysis, using k-means, conduct as the pre-classification. The clustering result used to construct the classification model into two clusters. From the cluster analysis, 17% of overall data clustered into cluster 1, meanwhile, 83% into cluster 2. The clustering results later used as the output label to the classification phase. The result shows a great overall accuracy of 98.6111% from the logistic regression and C4.5 decision tree completed with boosting, with an AUC value of 0.996 and 0.990 classified as excellent classification.",
    "year": 2019,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "49725b0fa1b8a53aa608f026d93d4b6f",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "unsupervised learning",
      "classification",
      "decision tree",
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T01:48:30.781719"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用混合分类器（结合聚类和分类方法）来预测企业的财务困境，这直接关系到企业的财务健康状况和风险水平，属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是使用混合分类器（结合聚类和分类方法）来预测企业的财务困境，这直接关系到企业的财务健康状况和风险水平，属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:59:51.893734"
}