{
  "paper": {
    "id": 1661,
    "title": "Students Dropout Prediction for Intelligent System from Tertiary Level in Developing Country",
    "abstract": "Students dropout prediction is an indispensable for numerous intelligent systems to measure the national and international loss for developing countries as well as for developed country throughout the world. The main purpose of this research is to develop a dynamic dropout prediction model for universities, institutes and colleges. In this work, We first apply chi square test to separate factors such as gender, financial condition and dropping year to classify the successful from unsuccessful students. The main purpose of applying it is feature selection to data. Degree of freedom is used to P-value (Probability value) for best predicators of dependent variable. After being separation of factors we have had examined by using data mining techniques Classification and Regression Tree (CART) and CHAID tree. Among classification tree, growing methods Classification and Regression Tree (CART) was the most successful in growing the tree with an overall percentage of correct classification than CHAID tree. A maximum tree depth has been reached: 3 levels for the CHAID tree and 4 levels for the CART tree. After generating, the classification matrix rules for CART and CHAID tree (Study outcome) have generated. Both the risk estimated by the cross-validation and the gain diagram suggests that all trees based only enrolment data are not quite good in separating successful from unsuccessful students. Here we have considered most important factors to classify the successful students over unsuccessful students are gender, financial condition and dropping year as well as age, gender, ethnicity, education, work status, and disability and study environment that may in-flounce persistence or dropout of students at university level.",
    "year": 2012,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "4377e46056f0790694de11f66057f914",
    "relevant_keywords": [
      "classification",
      "decision tree",
      "feature representation"
    ],
    "stage1_timestamp": "2025-05-15T02:05:42.635968"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究学生辍学预测模型，应用场景是教育领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究学生辍学预测模型，应用场景是教育领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:47:17.944548"
}