{
  "paper": {
    "id": 5315,
    "title": "Improving trend reversal estimation in forex markets under a directional changes paradigm with classification algorithms",
    "abstract": "The majority of forecasting methods use a physical time scale for studying price fluctuations of financial markets. Using physical time scales can make companies oblivious to significant activities in the market as the flow of time is discontinuous, which could translate to missed profitable opportunities or risk exposure. Directional changes (DC) has gained attention in the recent years by translating physical time series to event-based series. Under this framework, trend reversals can be predicted by using the length of events. Having this knowledge allows traders to take an action before such reversals happen and thus increase their profitability. In this paper, we investigate how classification algorithms can be incorporated in the process of predicting trend reversals to create DC-based trading strategies. The effect of the proposed trend reversal estimation is measured on 20 foreign exchange markets over a 10-month period in a total of 1000 data sets. We compare our results across 16 algorithms, both DC and non-DC based, such as technical analysis and buy-and-hold. Our findings show that the introduction of classification leads to return higher profit and statistically outperform all other trading strategies.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "24ea332be324319b435b6250d238ea27",
    "relevant_keywords": [
      "classification",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T02:46:44.846982"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究使用分类算法预测外汇市场的趋势反转，并开发基于方向变化的交易策略。虽然涉及金融市场，但其核心技术并未直接应用于衍生品定价、金融风险管理或投资组合管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究使用分类算法预测外汇市场的趋势反转，并开发基于方向变化的交易策略。虽然涉及金融市场，但其核心技术并未直接应用于衍生品定价、金融风险管理或投资组合管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:30:33.221044"
}