{
  "paper": {
    "id": 510,
    "title": "Machine learning techniques for cross-sectional equity returns' prediction",
    "abstract": "We compare the performance of the linear regression model, which is the current standard in science and practice for cross-sectional stock return forecasting, with that of machine learning methods, i.e., penalized linear models, support vector regression, random forests, gradient boosted trees and neural networks. Our analysis is based on monthly data on nearly 12,000 individual stocks from 16 European economies over almost 30 years from 1990 to 2019. We find that the prediction of stock returns can be decisively improved through machine learning methods. The outperformance of individual (combined) machine learning models over the benchmark model is approximately 0.6% (0.7%) per month for the full cross-section of stocks. Furthermore, we find no model breakdowns, which suggests that investors do not incur additional risk from using machine learning methods compared to the traditional benchmark approach. Additionally, the superior performance of machine learning models is not due to substantially higher portfolio turnover. Further analyses suggest that machine learning models generate their added value particularly in bear markets when the average investor tends to lose money. Our results indicate that future research and practice should make more intensive use of machine learning techniques with respect to stock return prediction.",
    "year": 2023,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "ddca92ca21884652be0b67e1e4a9f4a2",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "regression",
      "support vector machine",
      "SVM",
      "decision tree",
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T00:44:20.977753"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是使用机器学习方法预测股票横截面收益，其研究目标是改进股票收益预测，从而为投资组合管理提供更优的决策依据。论文明确提到投资者可以利用这些预测结果，并且讨论了组合换手率等投资组合管理相关指标。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是使用机器学习方法预测股票横截面收益，其研究目标是改进股票收益预测，从而为投资组合管理提供更优的决策依据。论文明确提到投资者可以利用这些预测结果，并且讨论了组合换手率等投资组合管理相关指标。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:30:06.619558"
}