{
  "paper": {
    "id": 2805,
    "title": "A Homomorphic-encryption-based Vertical Federated Learning Scheme for Rick Management",
    "abstract": "With continuous improvements of computing power, great progresses in algorithms and massive growth of data, artificial intelligence technologies have entered the third rapid development era. However, With the great improvements in artificial intelligence and the arrival of the era of big data, contradictions between data sharing and user data privacy have become increasingly prominent. Federated learning is a technology that can ensure the user privacy and train a better model from different data providers. In this paper, we design a vertical federated learning system for the for Bayesian machine learning with the homomorphic encryption. During the training progress, raw data are leaving locally, and encrypted model information is exchanged. The model trained by this system is comparable (up to 90%) to those models trained by a single union server under the consideration of privacy. This system can be widely used in risk control, medical, financial, education and other fields. It is of great significance to solve data islands problem and protect users' privacy.",
    "year": 2020,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "dba32030298a569d8f2c40e29c30760a",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T02:19:08.503770"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文设计了一种基于同态加密的垂直联邦学习系统，并明确指出该系统可以广泛应用于风险控制、金融等领域。虽然论文没有具体说明在金融风险管理中的具体应用场景，但风险控制是金融风险管理的核心内容之一，因此可以判断其主要应用于金融风险管理领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文设计了一种基于同态加密的垂直联邦学习系统，并明确指出该系统可以广泛应用于风险控制、金融等领域。虽然论文没有具体说明在金融风险管理中的具体应用场景，但风险控制是金融风险管理的核心内容之一，因此可以判断其主要应用于金融风险管理领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T14:24:01.579846"
}