{
  "paper": {
    "id": 3850,
    "title": "End-to-end, decision-based, cardinality-constrained portfolio optimization",
    "abstract": "Portfolios employing a (factor) risk model are usually constructed using a two step process: first, the risk model parameters are estimated, then the portfolio is constructed. Recent works have shown that this decoupled approach may be improved using an integrated framework that takes the downstream portfolio optimization into account during parameter estimation. In this work we implement an integrated, end-to-end, predict&-optimize framework to the cardinality-constrained portfolio optimization problem. To the best of our knowledge, we are the first to implement the framework to a nonlinear mixed integer programming problem. Since the feasible region of the problem is discontinuous, we are unable to directly differentiate through it. Thus, we compare three different continuous relaxations of increasing tightness to the problem which are placed as an implicit layers in a neural network. The parameters of the factor model governing the problem's covariance matrix structure are learned using a loss function that directly corresponds to the decision quality made based on the factor model's predictions. Using real world financial data, our proposed end-to-end, decision based model is compared to two decoupled alternatives. Results show significant improvements over the traditional decoupled approaches across all cardinality sizes and model variations while highlighting the need of additional research into the interplay between experimental design, problem size and structure, and relaxation tightness in a combinatorial setting.",
    "year": 2025,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "5d65b48b1998290d979d436f7dea3be4",
    "relevant_keywords": [
      "neural network",
      "deep learning",
      "backpropagation",
      "BP"
    ],
    "stage1_timestamp": "2025-05-15T02:30:28.769579"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是开发一个端到端的预测与优化框架，专门用于解决基数约束的投资组合优化问题。论文明确提到使用真实世界的金融数据来比较其提出的模型与传统解耦方法，并展示了在投资组合管理中的显著改进。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是开发一个端到端的预测与优化框架，专门用于解决基数约束的投资组合优化问题。论文明确提到使用真实世界的金融数据来比较其提出的模型与传统解耦方法，并展示了在投资组合管理中的显著改进。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:35:07.057981"
}