{
  "paper": {
    "id": 784,
    "title": "Cryptocurrency returns prediction using candlestick patterns analysis and multi-layer deep LSTM neural networks",
    "abstract": "Financial markets are characterised by their dynamic, non-linear, and fluctuating nature. Analysing financial time series in these contexts is a complex and challenging task. Candlestick patterns are recognised as among the most widely used financial tools and offer invaluable insights into market sentiment and psychology. However, manual analysis of these patterns presents significant challenges. Therefore, leveraging machine learning methods becomes a necessity for overcoming these challenges. In this study, a four-step framework was introduced in which the data preparation process is executed on the price data of the 20 cryptocurrencies. Forty-eight candlestick patterns were extracted alongside returns. Employing the long shortterm memory (LSTM) neural network, structured with multiple layers, each specialising in a specific cryptocurrency, enables individualised prediction of market returns. Evaluation of model accuracy and sensitivity is conducted via the confusion matrix, and two distinct trading strategies assess the capital portfolio. The research findings underscore the profitability of the proposed model across all scenarios. Candlestick patterns serve as powerful tools for understanding market sentiments and identifying shifts in market trends. However, their standalone efficacy is limited. Integrating them with other technical analysis tools facilitates more informed decision-making and fosters a deeper understanding of market dynamics.",
    "year": 2024,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "bbdf29a83b39247fc92eb71074d82305",
    "relevant_keywords": [
      "machine learning",
      "neural network",
      "deep learning",
      "long short-term memory",
      "LSTM"
    ],
    "stage1_timestamp": "2025-05-15T00:47:50.437930"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是使用LSTM神经网络分析加密货币的蜡烛图模式以预测市场回报，并评估了两种交易策略对资本组合的影响。这直接关联到投资组合管理的领域，因为其研究目标是优化投资决策和评估投资组合的表现。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是使用LSTM神经网络分析加密货币的蜡烛图模式以预测市场回报，并评估了两种交易策略对资本组合的影响。这直接关联到投资组合管理的领域，因为其研究目标是优化投资决策和评估投资组合的表现。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:27:51.194647"
}