{
  "paper": {
    "id": 142,
    "title": "UNLOCKING THE POWER OF VOICE FOR FINANCIAL RISK PREDICTION: A THEORY-DRIVEN DEEP LEARNING DESIGN APPROACH",
    "abstract": "Unstructured multimedia data (text and audio) provides unprecedented opportunities to derive actionable decision-making in the financial industry, in areas such as portfolio and risk management. However, due to formidable methodological challenges, the promise of business value from unstructured multimedia data has not materialized. In this study, we use a design science approach to develop DeepVoice, a novel nonverbal predictive analysis system for financial risk prediction, in the setting of quarterly earnings conference calls. DeepVoice forecasts financial risk by leveraging not only what managers say (verbal linguistic cues) but also how managers say it (vocal cues) during the earnings conference calls. The design of DeepVoice addresses several challenges associated with the analysis of nonverbal communication. We also propose a two-stage deep learning model to effectively integrate managers' sequential vocal and verbal cues. Using a unique dataset of 6,047 earnings call samples (audio recordings and textual transcripts) of S&P 500 firms across four years, we show that DeepVoice yields remarkably lower risk forecast errors than that achieved by previous efforts. The improvement can also translate into nontrivial economic gains in options trading. The theoretical and practical implications of analyzing vocal cues are discussed.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "deep learning",
    "cache_key": "fdb61391428c0a5a25fd84ee95633da0",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "neural network",
      "representation learning",
      "hidden layer",
      "recurrent neural network",
      "long short-term memory",
      "LSTM",
      "sequence-to-sequence learning",
      "seq2seq",
      "encoder-decoder",
      "attention mechanism"
    ],
    "stage1_timestamp": "2025-05-15T01:34:25.423297"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术DeepVoice专注于通过分析季度收益电话会议中的非语言线索来预测金融风险，并展示了在期权交易中的经济收益，这直接属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术DeepVoice专注于通过分析季度收益电话会议中的非语言线索来预测金融风险，并展示了在期权交易中的经济收益，这直接属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:04:07.799529"
}