{
  "paper": {
    "id": 3218,
    "title": "The Role of Nonfinancial Indicators in the Process of Credit Risk Assessment",
    "abstract": "Credit risk management is closely related to the bankruptcy prediction and even it was intensively investigated by the banking industry it is still at the forefront of researchers. There is a pressure on financial institutions to still improve their credit risk management system to eliminate credit risk which is one of the most significant financial risks in the banking industry. Many research studies, scientific articles and publications are still trying to find the best method to predict bankruptcy through different bankruptcy models. The reviews from the last years show that using only financial data is not sufficient to predict bankruptcy precisely and some of the researchers also include nonfinancial indicators to their models. The aim of this article is to find which of the nonfinancial indicators have the most significant prediction power to predict failure of Czech small and middle enterprises (SMEs) based on the exclusive nonfinancial data from a bank. We have investigated around 1000 companies from the SMEs segment, of which 100 failed during the period 2010 - 2016. The most important nonfinancial indicators from the credit risk point of view were found by using logistic regression.",
    "year": 2018,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "fea16d9fb04517acbf04d2620e340600",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:24:05.012506"
  },
  "domain_result": {
    "success": false,
    "error": "Client error '429 Too Many Requests' for url 'https://api.deepseek.com/v1/chat/completions'\nFor more information check: https://developer.mozilla.org/en-US/docs/Web/HTTP/Status/429",
    "application_domains": [
      "None"
    ],
    "justification": "API调用失败: Client error '429 Too Many Requests' for url 'https://api.deepseek.com/v1/chat/completions'\nFor more information check: https://developer.mozilla.org/en-US/docs/Web/HTTP/Status/429",
    "raw_response": null
  },
  "timestamp": "2025-05-20T15:37:21.089640"
}