{
  "paper": {
    "id": 109,
    "title": "Machine learning models and cost-sensitive decision trees for bond rating prediction",
    "abstract": "Since the outbreak of the financial crisis, the major global credit rating agencies have implemented significant changes to their methodologies to assess the sovereign credit risk. Therefore, bond rating prediction has become an interesting potential for investors and financial institutions. Previous research studies in this field have applied traditional statistical methods to develop models which provide prediction accuracy. However, no overall distinguished methods have been used in predicting bond ratings. Moreover, recent studies have suggested ensembles of classifiers that may be used in bond rating prediction. This article proposes an improved machine learning aimed to predict the rating of financial bonds. We empirically compare the classifiers ranging from logistic regression and discriminant analysis to nonparametric classifiers, such as support vector machine, neural networks, the cost-sensitive decision tree algorithm and deep neural networks. Three real-world bond rating data sets were selected to check the effectiveness and the viability of the set of the classifiers. The experimental results confirm that data mining methods can represent an alternative to the traditional prediction models of bond rating.",
    "year": 2020,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "d68aba1902482b78964ac94c3b1bd9dc",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM",
      "decision tree",
      "neural network",
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T01:46:39.637186"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用机器学习模型预测债券评级，这直接关系到信用风险的评估和管理，属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是使用机器学习模型预测债券评级，这直接关系到信用风险的评估和管理，属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:00:49.691574"
}