{
  "paper": {
    "id": 519,
    "title": "Credit risk assessment based on rough set theory and fuzzy support vector machine",
    "abstract": "In this paper, a hybrid intelligent system, combining rough set approach and fuzzy support vector machine (FSVM), is applied to the study of credit risk assessment in commercial banks. We can get reduced information table, which implies that the number of evaluation criteria such as financial ratios and qualitative variables is reduced with no information loss through rough set approach. And then, this reduced information table is used to develop classification rules and train FSVM. The rationale of our hybrid system is using rules developed by rough sets for an object that matches any of the rules and FSVM for an object that does not match any of them.",
    "year": 2007,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "2051c62719fca52668e4819ed51b4587",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM"
    ],
    "stage1_timestamp": "2025-05-15T01:52:12.198636"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on credit risk assessment in commercial banks, which is a key aspect of financial risk management. The hybrid intelligent system combining rough set theory and fuzzy support vector machine is specifically applied to evaluate credit risk, a core concern in risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on credit risk assessment in commercial banks, which is a key aspect of financial risk management. The hybrid intelligent system combining rough set theory and fuzzy support vector machine is specifically applied to evaluate credit risk, a core concern in risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:57:07.484568"
}