{
  "paper": {
    "id": 163,
    "title": "Analysis of risk factors in financial supply chain based on machine learning and IoT technology",
    "abstract": "The financial supply chain is affected by many factors, so an artificial intelligence model is needed to identify supply chain risk factors. This article combines the actual situation of the financial supply chain, improves the traditional machine learning algorithm, and takes the actual company as an example to build a corresponding risk factor recognition model. From the perspective of optimizing the supply chain financial model, this paper combines the functions of the Internet of Things technology and the characteristics of the supply chain financial inventory pledge financing model to design a new type of inventory pledge financing model. The new model makes up for the defects of the original model through the functions of intelligent identification, visual tracking and cloud computing big data processing of the Internet of Things technology. In addition, this study verifies the performance of the system, uses a large amount of data in Internet finance as an object, and obtains the corresponding results through mathematical statistical analysis. The research results show that the model proposed in this paper has a certain effect on the identification and analysis of financial supply chain risk factors.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "a82edf81feaaf9e3fc81a2b2a7b9a869",
    "relevant_keywords": [
      "machine learning",
      "neural network",
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T01:47:52.903030"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要研究金融供应链中的风险因素识别，并设计了一个新型库存质押融资模型来优化供应链金融模型，这属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文主要研究金融供应链中的风险因素识别，并设计了一个新型库存质押融资模型来优化供应链金融模型，这属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:00:24.402849"
}