{
  "paper": {
    "id": 1401,
    "title": "Risk spillovers of critical metals firms",
    "abstract": "We study risk transmission among stock returns of companies involved in the production and distribution of critical metals, in the sectors of copper, lithium, nickel, and cobalt. The four sectors are fundamental to achieve the energy transition. Our analysis of connectedness is carried out for each sector, separately, and then, by the means of principal components analysis and dynamic connectedness statistics, we compute risk spillovers between sectors. Our findings depict a very heterogeneous dynamics across sectors: we estimate a high level of connectedness in copper and lithium and a considerably lower one in cobalt and nickel. In the case of lithium, greater risk spillovers are closely linked with periods of explosive dynamics in the price of the raw material. In terms of system connectedness among all sectors, we estimate a total connectedness index of 51.8%, which is high. As expected, we identify copper and nickel sectors as the main shock transmitters. The existence of a high level of risk connectedness between stock returns of firms dedicated to the production and distribution of critical metals increases the likelihood of financial contagion and systemic risk materialization, in times of market distress. This could jeopardize the development and mass access to critical metals, and therefore, put at risk the energy transition. Our results provide a new dimension to the criticality of lithium and copper, highlighting their financial criticality.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "ba91394d267de2f6924225b798245795",
    "relevant_keywords": [
      "principal components analysis"
    ],
    "stage1_timestamp": "2025-05-15T02:02:22.762096"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on analyzing risk transmission and spillovers among stock returns of companies in critical metals sectors, which is directly related to understanding and managing financial risks, particularly systemic risk and financial contagion.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on analyzing risk transmission and spillovers among stock returns of companies in critical metals sectors, which is directly related to understanding and managing financial risks, particularly systemic risk and financial contagion.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:49:24.029864"
}