{
  "paper": {
    "id": 8266,
    "title": "Multifaceted risk for non-suicidal self-injury only versus suicide attempt in a population-based cohort of adults",
    "abstract": "Background: Non-suicidal self-injury and suicide attempt represent significant public health concerns. While these outcomes are related, there is prior evidence that their etiology does not entirely overlap. Efforts to directly differentiate risk across outcomes are uncommon, particularly among older, population-based cohorts.Methods: This research has been conducted using the UK Biobank. Data on individuals' self-reported history of non-suicidal self-injury only versus suicide attempt (maximum N = 6643) were analyzed. Applying LASSO and standard logistic regression, participants reporting one of these outcomes were assessed for differences across a range of sociodemographic, behavioral, and environmental features.Results: Sociodemographic features most strongly differentiated between the outcomes of non-suicidal self-injury only versus suicide attempt. Specifically, Black individuals were more likely to report a suicide attempt, as were those of mixed race, those endorsing higher levels of depressive symptoms or trauma history, and those who had experienced financial problems (odds ratios 1.02-3.92). Those more likely to engage in non-suicidal self-injury only were younger, female, had higher levels of education, those who resided with a partner, and those who had a recently injured relative.Limitations: Differences in timing across correlates and outcomes preclude the ability to establish causal pathways.Conclusions: The factors identified in the current study as differentially associated with non-suicidal self-injury only versus suicide attempt provide further evidence of at least partially distinct correlates, and warrant follow-up in independent samples to investigate causality.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "e508d4aed0b1ce8c59a0330ecf0e3519",
    "relevant_keywords": [
      "classification",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T03:17:21.431144"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究非自杀性自伤和自杀企图的风险因素，属于公共卫生和心理学领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究非自杀性自伤和自杀企图的风险因素，属于公共卫生和心理学领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:25:37.611694"
}