{
  "paper": {
    "id": 953,
    "title": "A new quantitative analysis method for financial risk early warning of unlisted small and medium enterprise",
    "abstract": "Although it is practical and significant to analyze the financial risk of the small and medium enterprise (SMEs), most scholars do research on unlisted small and medium enterprises' financial situation only with qualitative analysis methods, because it is difficult to get the financial data of unlisted small and medium enterprises. In this paper, a new data acquisition idea is put forward. Through this idea, quantitative analysis method could be taken to study on the financial risk early warning of unlisted SMEs. Data sets of financial risk analysis of unlisted SMEs are selected from listed SMEs' data sets. Those data sets are disclosed to public and easily obtained Then listed indicators are omit and decision tree model is made for financial risk early warning of unlisted SMEs'. 221 listed SMEs' financial data sets are chosen and models are built in the empirical analysis part Of this paper.30 unlisted SMEs' financial status(whether in crisis in 2007) have been analyzed by a financial company and the results are generally in line with what are predicted with 30 SMEs' financial data in 2006 through the models created in this paper. Thus feasibility of the financial risk early warning model is confirmed",
    "year": 2008,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "28c2f844eba4373fec06d0777885586e",
    "relevant_keywords": [
      "decision tree",
      "classification"
    ],
    "stage1_timestamp": "2025-05-15T01:56:49.744905"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on developing a quantitative analysis method for financial risk early warning in unlisted small and medium enterprises (SMEs), which directly addresses the identification and management of financial risks, a core aspect of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on developing a quantitative analysis method for financial risk early warning in unlisted small and medium enterprises (SMEs), which directly addresses the identification and management of financial risks, a core aspect of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:53:07.403502"
}