{
  "paper": {
    "id": 2256,
    "title": "Computational analysis of the behavior of stochastic volatility models with financial applications",
    "abstract": "Volatility estimation is an important issue in certain aspects of the financial community, such as risk management and asset pricing. It is known that stock returns often exhibit volatility clustering and the tails of the distributions of these series are fatter than the normal distribution. As a response to the need of these issues, the high unconditional volatility of assets encourages the users to predict their price in an ever changing market environment. Our main focus in this paper is to study the behavior of returns and volatility dynamics of some general stochastic economic models. First, we apply the local polynomial kernel smoothing method based on nonparametric regression to estimate the mean and the variance of the returns. We then implement and develop an empirical likelihood procedure in terms of conditional variance on daily log returns for inference on the nonparametric stochastic volatility as well as to construct a confidence interval for the volatility function. It appears that the proposed algorithm is applicable to some popular financial models and represents a good fit for the behavior observed in the stock and cryptocurrency markets. Some numerical results in connection to real data on the S & P 500 index and highly volatile Bitcoin dataset are also illustrated. (C)& nbsp;2022 Elsevier B.V. All rights reserved.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "dad2a74575fd065a8f0c3826ee1c776d",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:12:51.080261"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要研究波动率估计及其在风险管理和资产定价中的应用，特别是通过非参数回归和实证似然方法来分析波动率动态，这些技术直接应用于金融风险管理领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文主要研究波动率估计及其在风险管理和资产定价中的应用，特别是通过非参数回归和实证似然方法来分析波动率动态，这些技术直接应用于金融风险管理领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:43:39.655223"
}