{
  "paper": {
    "id": 1626,
    "title": "Development of a Hybrid Model for Risk Assessment and Management in Complex Road Infrastructure Projects",
    "abstract": "During the execution of road infrastructure projects, project managers face significant challenges, including financial, technical, regulatory, and operational risks. More than 90% of infrastructure projects have incurred costs exceeding initial estimates, impacting both completion timelines and the operational efficiency of road infrastructure. Effectively assessing and managing these risks is crucial for improving project outcomes and ensuring the sustainability of infrastructure investments. To address these challenges, this study developed a hybrid model for risk assessment and management in road infrastructure projects. The model quantifies risks across seven key categories: Design, External, Resource, Employer, Contractor, Engineer, and Project, based on three primary input factors: Environment coefficient, Contractual coefficient, and Design coefficient. Initially, various machine learning models, including linear regression, Random Forest, Gradient Boosting, Stacking Models, and neural networks, were applied to assess risk predictions. However, due to the specific nature of the dataset, these models did not achieve satisfactory predictive accuracy. As a result, fuzzy logic systems (Mamdani and Sugeno) were employed, demonstrating superior performance in modeling risk occurrence probabilities. Comparative analysis between these two fuzzy logic approaches revealed that the Sugeno model provided the most accurate predictions. The findings highlight the benefits of applying fuzzy logic for risk assessment in complex infrastructure projects, providing a structured framework for enhancing decision-making processes. This study provides a structured methodology for accurately predicting risks and enhancing project safety, efficiency, and long-term sustainability.",
    "year": 2025,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "db04f825d749dd0f2ce81d5a7a4076a5",
    "relevant_keywords": [
      "machine learning",
      "neural network",
      "regression",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T02:05:42.492024"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是复杂道路基础设施项目中的风险评估和管理，虽然涉及风险管理的概念，但其应用场景是基础设施项目而非金融领域。论文中提到的技术和方法并未应用于衍生品定价、金融风险管理或投资组合管理等金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是复杂道路基础设施项目中的风险评估和管理，虽然涉及风险管理的概念，但其应用场景是基础设施项目而非金融领域。论文中提到的技术和方法并未应用于衍生品定价、金融风险管理或投资组合管理等金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:47:20.448138"
}