{
  "paper": {
    "id": 3377,
    "title": "Can the correlation among Dow 30 stocks predict market declines? Evidence from 1950 to 2008",
    "abstract": "Purpose - This paper aims to examine the relationship between the correlation among the 30 stocks in the Dow Jones Industrial Average and overall returns on the broader market from 1950 to 2008. Design/methodology/approach - The paper computes historical correlation of the 30 stocks in the Dow Jones Industrial Average and future returns on the S&P 500 index over various windows and examines the relationship between these two items using linear regression analysis. In addition, the paper develops a trading strategy based on the results. Findings - The paper finds that increased equity correlation serves as a leading indicator of overall market decline. Regression analysis shows that equity correlations are a statistically significant predictor of market decline, as measured by subsequent returns of the S&P 500 index. The significance of the results increases as the time horizon of the calculation is increased. With the exception of the 1990s, the findings are robust within decades. Originality/value - This is the first study that examines the relationship between the historical correlations among the Dow 30 stocks with future returns for the S&P 500 index. In addition, the paper develops an original trading strategy that achieves superior returns to a buy- and-hold strategy. The paper's findings are useful to portfolio managers, practitioners, and policymakers.",
    "year": 2014,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "7128092b9dfa4b49c8470b058e34d264",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:16:22.211137"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文研究了股票相关性作为市场下跌的领先指标，并开发了一种基于此的交易策略，这直接应用于投资组合管理的领域，旨在优化投资决策和提升回报。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文研究了股票相关性作为市场下跌的领先指标，并开发了一种基于此的交易策略，这直接应用于投资组合管理的领域，旨在优化投资决策和提升回报。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:10:08.616740"
}