{
  "paper": {
    "id": 3599,
    "title": "Strategic insights: mapping the terrain of artificial intelligence (AI) in banking through mixed method approach",
    "abstract": "Purpose - The purpose of this paper is to supplement and update previously published articles about artificial intelligence (AI) instruments and operations in banking sectors with the following objectives in mind: to understand the role of AI in banking sectors; to explore the themes and context in this area based on keywords, co-citations and co-words; and to identify future research direction by evaluating the trend and direction of previous research. Design/methodology/approach - This study adopts a semi-inductive approach with the convolution of bibliometrics and literature review. This study used bibliometrics for the identification of literature across multiple databases and systematic literature review on identified articles to explore heterogeneous sectors within AI in banking and finance. Findings - This study contributes a literature-based model that accounts for both the broadly in AI application in banking and finance: predictive modeling in risk assessment and detection; financial decision-making; client service delivery; and emerging FinTech applications of AI and machine learning. Originality/value - This study is among the few to address the literature of tools and application of AI in banking through mixed-methods approach and produce a synthesized model for the same.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "2e11934c929a78a3ae16290763555ed2",
    "relevant_keywords": [
      "machine learning",
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T02:27:54.096902"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文讨论了AI在银行和金融领域的应用，特别提到了预测建模在风险评估和检测中的应用，这属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文讨论了AI在银行和金融领域的应用，特别提到了预测建模在风险评估和检测中的应用，这属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:35:58.783963"
}