{
  "paper": {
    "id": 996,
    "title": "Predicting Bank Failures: A Synthesis of Literature and Directions for Future Research",
    "abstract": "Risk management has been a topic of great interest to Michael McAleer. Even as recent as 2020, his paper on risk management for COVID-19 was published. In his memory, this article is focused on bankruptcy risk in financial firms. For financial institutions in particular, banks are considered special, given that they perform risk management functions that are unique. Risks in banking arise from both internal and external factors. The GFC underlined the need for comprehensive risk management, and researchers since then have been working towards fulfilling that need. Similarly, the central banks across the world have begun periodic stress-testing of banks' ability to withstand shocks. This paper investigates the machine-learning and statistical techniques used in the literature on bank failure prediction. The study finds that though considerable progress has been made using advanced statistical and computational techniques, given the complex nature of banking risk, the ability of statistical techniques to predict bank failures is limited. Machine-learning-based models are increasingly becoming popular due to their significant predictive ability. The paper also suggests the directions for future research.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "63c45b1af2e622977f34586c4c47036b",
    "relevant_keywords": [
      "machine learning",
      "classification",
      "regression",
      "support vector machine",
      "SVM",
      "decision tree",
      "neural network",
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T01:57:29.934420"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on predicting bank failures using machine-learning and statistical techniques, which is a key aspect of financial risk management, particularly in assessing and mitigating bankruptcy risk in financial institutions.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on predicting bank failures using machine-learning and statistical techniques, which is a key aspect of financial risk management, particularly in assessing and mitigating bankruptcy risk in financial institutions.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:52:44.287836"
}