{
  "paper": {
    "id": 481,
    "title": "Deep Learning in Model Risk Neutral Distribution for Option Pricing",
    "abstract": "Option pricing has been studied extensively in recent years. An important issue in option pricing is the estimation of the risk neutral distribution of an underlying asset. Better estimation of this distribution can lead to a more rational investment, enabling one to earn an equal return with lower risk. To price options precisely and correctly, traditional financial engineering methods make some assumptions for the risk neutral distribution. However, some assumptions of traditional methods have proved inappropriate and insufficient in empirical option pricing analysis. To address these problems in option pricing, this study adopts a data-driven approach. Owing to advances in hardware and software, studies have been using deep learning methods to price options; however, these have not adequately considered the risk neutral distribution. This may cause an uncontrollable risk, thereby preventing the real-world application of the model. To overcome these problems, this study proposes a deep learning method with a mixture distribution model. Further, it generates a rational risk neutral distribution with accurate empirical pricing analysis.",
    "year": 2019,
    "source": "WOS",
    "area": "financial_risk",
    "method": "deep learning",
    "cache_key": "d187b8309ee8a33b1be7c578f4e48cc1",
    "relevant_keywords": [
      "deep learning",
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T01:38:59.236246"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Derivatives Pricing"
    ],
    "justification": "该论文的核心研究内容是使用深度学习方法改进风险中性分布的估计，以更精确地进行期权定价。这直接属于衍生品定价领域，因为期权是一种重要的金融衍生品，而论文的主要目标是提高其定价的准确性和合理性。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"衍生品定价\"],\n  \"justification\": \"该论文的核心研究内容是使用深度学习方法改进风险中性分布的估计，以更精确地进行期权定价。这直接属于衍生品定价领域，因为期权是一种重要的金融衍生品，而论文的主要目标是提高其定价的准确性和合理性。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:02:52.894764"
}