{
  "paper": {
    "id": 2074,
    "title": "CREDIT RISK ASSESSMENT OF AGRICULTURAL ENTERPRISES IN THE REPUBLIC OF SERBIA: LOGISTIC REGRESSION VS DISCRIMINANT ANALYSIS",
    "abstract": "Credit risk assessment of agricultural enterprises in the Republic of Serbia was analyzed in this research by applying discriminant analysis and logistic regressions. The aim of the research is to determine the financial indicators which financial analysts consider when analyzing a loan application that have the most influence on the decision to approve or reject a loan application. The internal determinants of credit risk of agricultural enterprises are analyzed, i.e., indicators of financial leverage, profitability, liquidity, solvency, financial stability and effectiveness. The analyzed models gave different results in significance of the observed indicators. The indicators that stood out as significant in both models are only indicators of profitability and solvency. The model of discriminant analysis has successfully classified rate 81.0%, while the logistic regression model has successfully classifies rate 89.8%. In modeling the credit risk of agricultural enterprises in the Republic of Serbia, the logistic regression model gives better results. (C) 2021 EA. All rights reserved.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "2ea3a3229899a9c38e2d909b757ded1a",
    "relevant_keywords": [
      "classification",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:10:58.965271"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on credit risk assessment of agricultural enterprises using discriminant analysis and logistic regression, which is a key aspect of financial risk management, specifically in the area of credit risk evaluation.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on credit risk assessment of agricultural enterprises using discriminant analysis and logistic regression, which is a key aspect of financial risk management, specifically in the area of credit risk evaluation.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:44:26.088044"
}