{
  "paper": {
    "id": 873,
    "title": "Integration of incremental filter-wrapper selection strategy with artificial intelligence for enterprise risk management",
    "abstract": "The deterioration in enterprises' profitability not only threatens the interests of those firms, but also means related parties (investors, bankers, and stakeholders) could encounter tremendous financial losses, which could also impact the circulation of limited economic resources. Thus, an enterprise risk forecasting mechanism is urgently needed to assist decision-makers in adjusting their operating strategies so as to survive under any highly turbulent economic climate. This research introduces a novel hybrid model that incorporates an incremental filter-wrapper feature subset selection with the statistical examination and twin support vector machine (IFWTSVM) for enterprise operating performance forecasting. To promote a hybrid model's real-life application, the knowledge visualization extracted from IFWTSVM is represented in an easy-to-grasp style. The experimental results reveal that IFWTSVM's forecasting quality is very promising for financial risk mining, relative to other forecasting techniques examined in this study.",
    "year": 2018,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "8ac01f664c87d1f82ae6fc23149264e4",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM",
      "feature learning"
    ],
    "stage1_timestamp": "2025-05-15T01:56:17.481078"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on developing a hybrid model for enterprise operating performance forecasting to assist decision-makers in adjusting strategies under turbulent economic conditions, which is directly related to financial risk management. The study specifically mentions financial risk mining as a key application of the proposed model.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on developing a hybrid model for enterprise operating performance forecasting to assist decision-makers in adjusting strategies under turbulent economic conditions, which is directly related to financial risk management. The study specifically mentions financial risk mining as a key application of the proposed model.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:54:13.372079"
}