{
  "paper": {
    "id": 4100,
    "title": "Prediction of KLCI Index Through Economic LASSO Regression Model and Model Averaging",
    "abstract": "The Financial Times Stock Exchange (FTSE) Bursa Malaysia KLCI Index is a key component in the development of Malaysia's economic growth and the complexity in terms of identifying the factors that have a substantial impact on the Malaysian stock market has always been a contentious issue. In this study, the macroeconomic factors of exchange rate, interest rate, gold price, consumer price index, money supply M1, M2, and M3, industrial production, and oil price were discussed by using economic LASSO regression and Bayesian Model Averaging (BMA) with monthly average and monthly end time-series data spanning from January 2015 to June 2021, with a total of 78 observations by using the R Studio. The findings demonstrate that month-end data is better suited for stock market prediction than month-average data and that the BMA model is more suitable than the LASSO model, as seen by lower Mean Square Error of Prediction, MSE(P) and Residual Mean Square Error of Prediction, RMSE(P) values. The exchange rate, gold price, and money supply have a negative association with the dependent variables, while the consumer price index has a positive relationship associated with the dependent variables. The consumer price index is the most significant contributing factor, whereas gold price is the least significant. The result depicted that the KLCI index has no significant relationship with the variables interest rate, money supply M2, M1, industrial production index, and oil price. In conclusion, investors could specifically focus on the positive contributor and put lesser attention on improving their portfolio return.",
    "year": 2023,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "87cf736007bcfa74da297f8344204ae4",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:23:58.026686"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文研究了宏观经济因素对马来西亚KLCI指数的影响，并讨论了投资者如何利用这些因素来优化其投资组合回报。这直接关联到投资组合管理的领域，因为研究结果可以帮助投资者更好地分配资产和调整投资策略。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文研究了宏观经济因素对马来西亚KLCI指数的影响，并讨论了投资者如何利用这些因素来优化其投资组合回报。这直接关联到投资组合管理的领域，因为研究结果可以帮助投资者更好地分配资产和调整投资策略。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:08:01.040523"
}