{
  "paper": {
    "id": 1221,
    "title": "A New Discrete Learning-Based Logistic Regression Classifier for Bankruptcy Prediction",
    "abstract": "Credit scoring or predicting bankruptcy is among the most crucial techniques for identifying high-risk and low-risk credit situations. Accordingly, enhancing the accuracy of bankruptcy prediction methods decreases the risk of inappropriate financial decisions. Also, increasing the accuracy of credit scoring models brings significant benefits such as improved turnover, credit market growth, proper and efficient allocation of financial resources, and sustained improvement of the profits of banks, investors, funds, and governments. Various statistical classification methods have been developed in the literature with different features and characteristics for more accurate bankruptcy prediction. However, despite all appearance differences in statistical classification approaches, they all adhere to a common idea and concept in their training procedures. The basic operation logic in whole-developed statistical classification methods focuses on maximizing a continuous distance-based cost function to yield the highest performance. Despite it being a common and frequently used procedure for classification purposes, it is an unreasonable and inefficient manner to achieve maximum accuracy in a discrete classification field. In this paper, a new discrete direction-based Logistic Regression that is a common statistical classifier method for bankruptcy forecasting is proposed. In the proposed Logistic Regression, in contrast to all traditionally developed statistical classifiers, the compatibility of the cost function and the training procedure is considered. While it can be shown overall that the performance of the presented discrete direction-based classifier will not be inferior to its continuous counterpart, an evaluation of the suggested classifier is conducted to ascertain its superiority. For this purpose, three credit scoring datasets are considered to assess the classification rate of the presented classifier. Empirical outcomes demonstrate that, as pre-expected, in all cases, the model put forward can attain a superior performance compared to conventional alternatives. These findings clearly demonstrated the significant influence of the consistency between the cost function and the training process on the classification capability, a consideration absent in any of the traditional statistical classification procedures. Consequently, the presented Logistic Regression can be considered an efficient alternative for credit scoring purposes to achieve more accurate results.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "ac05e980553ceba9042d32fcedb93e19",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "regression",
      "sigmoid"
    ],
    "stage1_timestamp": "2025-05-15T02:00:30.483904"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是开发一种新的离散方向逻辑回归分类器，用于破产预测和信用评分。这直接关系到金融机构对信用风险的评估和管理，属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"该论文的核心技术是开发一种新的离散方向逻辑回归分类器，用于破产预测和信用评分。这直接关系到金融机构对信用风险的评估和管理，属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:50:55.200380"
}