{
  "paper": {
    "id": 3425,
    "title": "Non-linear impact of globalization on financial crimes: a case of developing economies",
    "abstract": "Purpose The Financial Action Task Force defines money laundering as processing of these criminal proceeds to disguise their illegal origin. This is the major portion of financial crime that has ties across borders and like all financial crimes which are well planned and camouflaged, this crime is difficult to detect and deter. Over the years, on one side, globalization has provided development opportunities, it has also become one reason for the pervasiveness of money laundering. This has led to a disturbance in the global financial system and social unrest as proceeds from money laundering are being used in terrorism. The purpose of this study is to explore the non linear effect of globalization on financial crime in the form of money laundering. Design/methodology/approach An investigation based on 119 developing countries from the time period of 1985 till 2015 is conducted in this study. The panel quantile regression model was used to estimate antecedents of money laundering. Findings The study confirmed that globalization follows an inverted U-shaped relationship with money laundering. Furthermore, indicators such as investment portfolio and socioeconomic conditions have a significant effect on money laundering. Originality/value The panel quantile regression model was used to estimate antecedents of money laundering.",
    "year": 2022,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "44a732eb09e47705151bad09691c071a",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:16:55.560834"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究全球化对洗钱等金融犯罪的影响，虽然涉及金融领域，但其核心内容不属于衍生品定价、金融风险管理或投资组合管理中的任何一个。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究全球化对洗钱等金融犯罪的影响，虽然涉及金融领域，但其核心内容不属于衍生品定价、金融风险管理或投资组合管理中的任何一个。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:09:45.906382"
}