{
  "paper": {
    "id": 2769,
    "title": "A practical approach to credit scoring",
    "abstract": "This paper proposes a DEA-based approach to credit scoring. Compared with conventional models such as multiple discriminant analysis, logistic regression analysis, and neural networks for business failure prediction, which require extra a priori information, this new approach solely requires ex-post information to calculate credit scores. For the empirical evidence, this methodology was applied to current financial data of external audited 1061 manufacturing firms comprising the credit portfolio of one of the largest credit guarantee organizations in Korea. Using financial ratios, the methodology could synthesize a firm's overall performance into a single financial credibility score. The empirical results were also validated by supporting analyses (regression analysis and discriminant analysis) and by testing the model's discriminatory power using actual bankruptcy cases of 103 firms. In addition, we propose a practical credit rating method using the predicted DEA scores.",
    "year": 2004,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "a0a6a42f8d0a755a897102bab0c30b69",
    "relevant_keywords": [
      "neural network",
      "classification",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:10:16.498926"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on developing a DEA-based approach for credit scoring, which is a critical component in assessing and managing credit risk, a key aspect of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on developing a DEA-based approach for credit scoring, which is a critical component in assessing and managing credit risk, a key aspect of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:13:11.396939"
}