{
  "paper": {
    "id": 434,
    "title": "How Institutional Actions Before Vaccine Affect Time Vaccination Intention Later: Prediction via Machine Learning",
    "abstract": "Effective vaccination is often the only way to eliminate a major pandemic, to the extent that people welcome the cure. In general, vaccination preferences are shaped before actual vaccines are found. Factors that accelerate/inhibit expected uptake must then be understood upfront if one hopes to nudge hesitants towards vaccination. We predict the portfolio of COVID-19 vaccination drivers through a large set of Machine Learning (ML) techniques for five European countries during the first wave of the COVID-19 and before vaccines were found and rolled out. We find better accuracy emerging from more sophisticated supervised ML techniques than regressions. While some factors are common to all ML tools, some only arise from the most accurate techniques: Gradient Boosting Machine and Support Vector Machine. In general, institutional trust (e.g. towards government actions) is a critical influencer of vaccine intent. How governments have reacted to the pandemic rise is a crucial filter as to how people will accept being vaccinated.",
    "year": 2023,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "037573866f46d356c87440871a6f4970",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "regression",
      "support vector machine",
      "SVM",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T00:43:10.606853"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究使用机器学习技术预测疫苗接种意愿，其应用场景属于公共卫生领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究使用机器学习技术预测疫苗接种意愿，其应用场景属于公共卫生领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:31:03.660869"
}