{
  "paper": {
    "id": 8036,
    "title": "Development of a clinical prediction model for high hospital cost in patients admitted for elective non-cardiac surgery to a private hospital in South Africa",
    "abstract": "Introduction: Clinicians may find early identification of patients at risk for high cost of care during and after surgery useful, to prepare for focused management that results in optimal clinical outcome. The aim of the study was to develop a clinical prediction model to identify high and low hospital cost outcome after elective non-cardiac surgery using predictors identified from a preoperative self-assessment questionnaire. Methods: Data to develop a clinical prediction model were collected for this purpose at a private hospital in South Africa. Predictors were defined from a preoperative questionnaire. Cost of hospital admission data were received from hospital administration, which reflected the financial risk the hospital carries and which could be reasonably attributed to a patient's individual clinical risk profile. The hospital cost excluded fees charged (by any healthcare provider), and cost of prosthesis and other consignment items that are related to the type of procedure. The cost outcome measure was described as cost per total Work Relative Value Units (Work RVUs) for the procedure, and dichotomised. Variables that were associated with the outcome during univariate analysis were subjected to a forward stepwise regression selection technique. The prediction model was evaluated for discrimination and calibration, and internally validated. Results: Data from 770 participants were used to develop the prediction model. The number of participants with the outcome of high cost were 142/770 (18.4%). The predictors included in the full prediction model were type of surgery, treatment for chronic pain with depression, and activity status. The area under the receiver operating curve (AUROC) for the prediction model was 0.83 (95% confidence interval [CI): 0.79 to 0.86). The Hosmer-Lemeshow indicated goodness-of-fit (p = 0.967). The prediction model was internally validated using bootstrap resampling from the development cohort, with a resultant AUROC of 0.86 (95% CI: 0.82 to 0.89). Conclusion: The study describes a clinical risk prediction model developed using easily collected patient-reported variables and readily available administrative information. The prediction model should be validated and updated using a larger dataset, and used to identify patients in which cost-effective care pathways can add value.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "848f8fdcc131c45acab4051650d8f134",
    "relevant_keywords": [
      "classification",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T03:14:37.337492"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是临床预测模型，用于识别高成本手术患者，属于医疗健康领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是临床预测模型，用于识别高成本手术患者，属于医疗健康领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:25:54.539573"
}