{
  "paper": {
    "id": 3912,
    "title": "FACEBOOK AND SECRET IDENTITIES, SKYPE, E-PORTFOLIO AND VIDEO EDITING: HOW THE INTENSIVE USE OF TECHNOLOGY CREATES REAL AND VIRTUAL WORLDS WHERE STUDENTS OF FOREIGN LANGUAGES LEARN BETTER AND MORE",
    "abstract": "During my presentation I will be discussing the project that I worked on over the past two years in my Intermediate Italian classes (third and fourth semesters). I will begin by explaining how students in the third semester used Facebook to create famous and secret Italian identities in order to learn more about the cultural features of Italy and Italians; features that would be impossible to learn if one were studying the usual textbooks. The same semester I also set up Skype exchanges between my students of Italian and students in Italy. The purpose was for students to practice and share the language and culture they were learning. The following semester I asked students to work on a blog and an e-Portfolio that would later become a way for me to assess their learning; it was also a means of self-assessment in which students collected the experiences they had been accumulating over the entire semester of Italian. At the same time, during that semester I also asked them to work in groups and to use video-editing to create a movie in which they would present a novel that I had assigned them. Over the course of the year students were offered, through these technology projects, a new experience on language learning in and outside the classroom. The peer-to-peer active learning process was creative and more entertaining than other activities because it was more related to real and contemporary Italy. I first want to present the Facebook project in which students selected a secret Italian identity and posted video, articles, music and comments on their page and on the page of the other Italians of their network. I will show how this made students more enthusiastic and created interested among them. I will also include a discussion of how I managed the project during the semester and how I set about assessing it. Next I turn to some of the Skype exchanges that students had with their Italian partners as well as the written reflections they wrote in Italian about how they employed the guided culture topics they talked about during the exchanges. Third I will say something about how student blogs and e-Portfolio allowed the students to gain a picture of what they were learning during the semester, while creating connections to other students and the teacher outside the classroom. It was an imaginative way for them to assemble the experiences they had on Facebook and Skype to learn to think critically and to reflect more on what precisely they were learning. I continue my discussion with the last project, the video-editing, in which students were required to work in small groups to construct their own interpretation of an Italian novel. After reading five Italian books and watching five movies Italian films adapted from the story they had read, I asked students to read a novel from Pirandello and to put together a video that represented the novel as well as their interpretation of it. I end by discussing the implications of intensive use of technology in a language class. I ask what worked well and what ought to be changed in order to gain a better response from students. Is this generation of students really a digitally native one? Student feedback will be presented so as to offer a more comprehensive sense of the technology project in the language classroom.",
    "year": 2013,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "fb57ce14bb8534b5e2cf2dd57b4c1602",
    "relevant_keywords": [
      "active learning"
    ],
    "stage1_timestamp": "2025-05-15T01:22:11.844041"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要讨论的是在语言学习中使用技术工具（如Facebook、Skype、e-Portfolio和视频编辑）来增强学习体验，并未涉及任何金融领域的研究或应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要讨论的是在语言学习中使用技术工具（如Facebook、Skype、e-Portfolio和视频编辑）来增强学习体验，并未涉及任何金融领域的研究或应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:08:26.857023"
}