{
  "paper": {
    "id": 4272,
    "title": "Forecasting VaR and ES using the joint regression combined forecasting model in the Chinese stock market",
    "abstract": "PurposeThis paper aims to better jointly estimate Value at Risk (VaR) and expected shortfall (ES) by using the joint regression combined forecasting (JRCF) model.Design/methodology/approachCombining different forecasting models in financial risk measurement can improve their prediction accuracy by integrating the individual models' information. This paper applies the JRCF model to measure VaR and ES at 5%, 2.5% and 1% probability levels in the Chinese stock market. While ES is not elicitable on its own, the joint elicitability property of VaR and ES is established by the joint consistent scoring functions, which further refines the ES's backtest. In addition, a variety of backtesting and evaluation methods are used to analyze and compare the alternative risk measurement models.FindingsThe empirical results show that the JRCF model outperforms the competing models. Based on the evaluation results of the joint scoring functions, the proposed model obtains the minimum scoring function value compared to the individual forecasting models and the average combined forecasting model overall. Moreover, Murphy diagrams' results further reveal that this model has consistent comparative advantages among all considered models.Originality/valueThe JRCF model of risk measures is proposed, and the application of the joint scoring functions of VaR and ES is expanded. Additionally, this paper comprehensively backtests and evaluates the competing risk models and examines the characteristics of Chinese financial market risks.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "32d02b0d63ae8068573e5bc8feac7fa1",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:35:26.242982"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on forecasting Value at Risk (VaR) and Expected Shortfall (ES) using a joint regression combined forecasting model, which are key metrics in financial risk management. The study specifically targets improving prediction accuracy for these risk measures in the Chinese stock market, indicating a clear application in financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on forecasting Value at Risk (VaR) and Expected Shortfall (ES) using a joint regression combined forecasting model, which are key metrics in financial risk management. The study specifically targets improving prediction accuracy for these risk measures in the Chinese stock market, indicating a clear application in financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T14:24:44.400528"
}