{
  "paper": {
    "id": 1623,
    "title": "Application of data mining and machine learning in management accounting information system",
    "abstract": "In the traditional management accounting information processing method, the method used to solve the problem is often fixed due to excessive assumptions. In order to improve its operating efficiency, combined with artificial intelligence information technology, this paper uses data mining algorithms to conduct data acquisition and rule exploration. Moreover, this paper uses statistics, machine learning and other techniques to analyze the correlation between attribute values and transform data into knowledge needed for decision-making. In addition, this paper combines machine learning algorithms to build an intelligent management accounting information system and realizes the close connection between corporate finance and business, which helps to form a closed-loop management between financial analysis, risk management, performance management, and decision-making. Finally, this paper designs experiments to verify the performance of the model. The research results show that the system constructed in this paper satisfies the intelligent demand of accounting information.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "210b4f75158b7b42438027b93811b2e0",
    "relevant_keywords": [
      "machine learning",
      "classification",
      "regression",
      "decision tree",
      "clustering",
      "feature learning",
      "feature representation",
      "neural network",
      "deep learning",
      "representation learning"
    ],
    "stage1_timestamp": "2025-05-15T02:05:42.487040"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是管理会计信息系统的智能化，虽然提到了风险管理和财务分析，但其核心技术（数据挖掘和机器学习）主要应用于会计信息的处理和决策支持，而非特定的金融研究领域如衍生品定价、金融风险管理或投资组合管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是管理会计信息系统的智能化，虽然提到了风险管理和财务分析，但其核心技术（数据挖掘和机器学习）主要应用于会计信息的处理和决策支持，而非特定的金融研究领域如衍生品定价、金融风险管理或投资组合管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:47:20.724834"
}