{
  "paper": {
    "id": 4796,
    "title": "A data science approach to climate change risk assessment applied to pluvial flood occurrences for the United States and Canada",
    "abstract": "There is mounting pressure on (re)insurers to quantify the impacts of climate change, notably on the frequency and severity of claims due to weather events such as flooding. This is however a very challenging task for (re)insurers as it requires modeling at the scale of a portfolio and at a high enough spatial resolution to incorporate local climate change effects. In this paper, we introduce a data science approach to climate change risk assessment of pluvial flooding for insurance portfolios over Canada and the United States (US). The underlying flood occurrence model quantifies the financial impacts of short-term (12-48 h) precipitation dynamics over the present (2010-2030) and future climate (2040-2060) by leveraging statistical/machine learning and regional climate models. The flood occurrence model is designed for applications that do not require street-level precision as is often the case for scenario and trend analyses. It is applied at the full scale of Canada and the US over 10-25 km grids. Our analyses show that climate change and urbanization will typically increase losses over Canada and the US, while impacts are strongly heterogeneous from one state or province to another, or even within a territory. Portfolio applications highlight the importance for a (re)insurer to differentiate between future changes in hazard and exposure, as the latter may magnify or attenuate the impacts of climate change on losses.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "61d821b6763f118a990e05baf02be493",
    "relevant_keywords": [
      "machine learning"
    ],
    "stage1_timestamp": "2025-05-15T02:41:00.894648"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要研究气候变化对保险组合的风险评估，特别是通过数据科学方法量化洪水发生的频率和严重性对保险损失的影响，这属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文主要研究气候变化对保险组合的风险评估，特别是通过数据科学方法量化洪水发生的频率和严重性对保险损失的影响，这属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:31:56.634093"
}