{
  "paper": {
    "id": 24,
    "title": "Optimized stock market prediction using ensemble learning",
    "abstract": "Researchers of various fields have always been interested in devising a fault-proof method for the prediction of stock market. Extensive research has been done using Machine Learning Algorithms like SVM, to successfully predict the stock activity in the market using machine learning algorithms mainly Support Vector Machine (SVM). In this paper a scenario in which a portfolio trading strategy is formulated using machine learning algorithms. The strategy will be considered profitable by judging its ability to identify stock indices accurately and consistently, proposing positive or negative returns and in the end it should use a learned model to produce a preferred portfolio allocation. Some of the Technical Indicators like Multiple Regression Analysis (MRA) and different data clustering techniques are used as input to train the system. The learned model is constructed as weighted support vector machine (SVM) classifier, Relevance Vector Machine, random forest classifiers and Multiple Layer Perceptron (MPL). The decision value would be chosen using a majority voting mechanism. The ensemble learning is augmented by a boosting meta-algorithm and feature selection is performed by a supervised Relief algorithm. Stocks listed in Istanbul Stock Exchange (ISE) in Turkey are used to evaluate the performance of the system. A comparison of results obtained using ensemble committee and those using other approaches would show that the ensemble approach has a lower error rate and generates fewer but compact rules.",
    "year": 2015,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "8a31952aed52754105783dc0d3635362",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM",
      "decision tree",
      "clustering",
      "feature learning",
      "neural network",
      "deep learning",
      "representation learning"
    ],
    "stage1_timestamp": "2025-05-15T00:38:16.282108"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是使用机器学习算法（如SVM、随机森林等）来预测股票市场活动，并基于这些预测制定投资组合交易策略。论文明确提到目标是产生一个优选的投资组合分配，这直接指向投资组合管理领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是使用机器学习算法（如SVM、随机森林等）来预测股票市场活动，并基于这些预测制定投资组合交易策略。论文明确提到目标是产生一个优选的投资组合分配，这直接指向投资组合管理领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:34:24.338461"
}