{
  "paper": {
    "id": 445,
    "title": "Research on the decision-making system of venture capital investment based on Support Vector Machine (ID: 6-126)",
    "abstract": "The accurate evaluation of a venture capital investment project is the basis and key to the success of it. In this paper, the theories and methods of Support Vector Machine (SVM) are applied to the venture capital investment decisions, and an evaluation index system is constructed. This index system is a comprehensive system which is composed of five subsystems including seventeen indexes, that is entrepreneurs and management teams (the indexes included are entrepreneurship, reactibility, innovation ability, management ability, and marketing skill); technology and products (the indexes included are market prospective of technology, technology advancement level, product difference, and product imitation); market (the. indexed included are market capacity, growth ability of market, and market competitiveness); risk (the indexes included are technology risk, market risk, and financial risk); environment (the indexes included are maturity and stability of relative laws and policies, industry prospective) and etc. The decision-making system of a venture capital investment based on SVM is also built in this paper, which not only can simulate experts to make a comprehensive evaluation on venture projects, but also can diminish subjective influence in the process of evaluation, so as to offer a scientific method of venture capital investment decision-making.",
    "year": 2006,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "5e3f409ac4bdac30bf7176da9a1a6d1f",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM"
    ],
    "stage1_timestamp": "2025-05-15T01:50:52.674102"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究基于支持向量机的风险投资决策系统，虽然涉及金融风险（如技术风险、市场风险、财务风险）的评估，但其核心应用是风险投资项目的评估和决策，而非衍生品定价、金融风险管理或投资组合管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究基于支持向量机的风险投资决策系统，虽然涉及金融风险（如技术风险、市场风险、财务风险）的评估，但其核心应用是风险投资项目的评估和决策，而非衍生品定价、金融风险管理或投资组合管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:58:01.813489"
}