{
  "paper": {
    "id": 1962,
    "title": "Combining Clustering and Genetic Algorithms for Portfolio Optimization: A Case Study with B3 Companies",
    "abstract": "Portfolio optimization has been addressed by optimization algorithms and due to the numerous local maxima, genetic algorithms have shown promise. Recent studies use these algorithms to optimize stock portfolios, whether as a multi-objective problem that maximize return and minimize risk or just as one objective problem, such as maximizing the Sharpe Ratio. In order to adapt these algorithms to the financial market, a new approach was developed that includes penalty and cardinality constraints. This study proposes an algorithm with two models of clustering of B3 companies with penalties and cardinality constraints. One model uses the clustering of companies by economic sector and the other model uses the clustering generated by the Kmeans-DTW time series clustering technique. Then the algorithm selects one asset per cluster of companies with the aim of diversifying the portfolio and reducing the correlation between assets, thus reducing the risk. Finally, the generated portfolios went through an optimization stage using a memetic genetic algorithm, which finds the best possible distribution that maximizes return and reduces risk.",
    "year": 2025,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "3bfffdef063cafc4c05b089c96fc8782",
    "relevant_keywords": [
      "clustering",
      "unsupervised learning"
    ],
    "stage1_timestamp": "2025-05-15T02:09:14.440727"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是结合聚类和遗传算法进行投资组合优化，旨在通过多样化投资组合和减少资产间的相关性来降低风险并最大化回报，这直接属于投资组合管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是结合聚类和遗传算法进行投资组合优化，旨在通过多样化投资组合和减少资产间的相关性来降低风险并最大化回报，这直接属于投资组合管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:45:09.892220"
}