{
  "paper": {
    "id": 691,
    "title": "Analyzing the Internet financial market risk management using data mining and deep learning methods",
    "abstract": "Purpose To identify and analyze the occurrence of Internet financial market risk, data mining technology is combined with deep learning to process and analyze. The market risk management of the Internet is to improve the management level of Internet financial risk, improve the policy of Internet financial supervision and promote the healthy development of Internet finance. Design/methodology/approach In this exploration, data mining technology is combined with deep learning to mine the Internet financial data, warn the potential risks in the market and provide targeted risk management measures. Therefore, in this article, to improve the application ability of data mining in dealing with Internet financial risk management, the radial basis function (RBF) neural network algorithm optimized by ant colony optimization (ACO) is proposed. Findings The results show that the actual error of the ACO optimized RBF neural network is 0.249, which is 0.149 different from the target error, indicating that the optimized algorithm can make the calculation results more accurate. The fitting results of the RBF neural network and ACO optimized RBF neural network for nonlinear function are compared. Compared with the performance of other algorithms, the error of ACO optimized RBF neural network is 0.249, the running time is 2.212 s, and the number of iterations is 36, which is far less than the actual results of the other two algorithms. Originality/value The optimized algorithm has a better spatial mapping and generalization ability and can get higher accuracy in short-term training. Therefore, the ACO optimized RBF neural network algorithm designed in this exploration has a high accuracy for the prediction of Internet financial market risk.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "7ceea0da904e03f07d67dd9105499270",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "neural network",
      "representation learning",
      "backpropagation",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T01:53:59.376252"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on using data mining and deep learning methods to analyze and manage risks in the Internet financial market, which directly falls under the domain of financial risk management. The study aims to improve risk management measures and enhance the accuracy of risk prediction, which are core aspects of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on using data mining and deep learning methods to analyze and manage risks in the Internet financial market, which directly falls under the domain of financial risk management. The study aims to improve risk management measures and enhance the accuracy of risk prediction, which are core aspects of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:55:50.215867"
}