{
  "paper": {
    "id": 572,
    "title": "TraderNet-CR: Cryptocurrency Trading with Deep Reinforcement Learning",
    "abstract": "The predominant method of developing trading strategies is technical analysis on historical market data. Other financial analysts monitor the public activity towards cryptocurrencies, in order to forecast upcoming trends in the market. Until now, the best cryptocurrency trading models rely solely on one of the two methodologies and attempt to maximize their profits, while disregarding the trading risk. In this paper, we present a new machine learning approach, named TraderNetCR, which is based on deep reinforcement learning. TraderNet-CR combines both methodologies in order to detect profitable round trips in the cryptocurrency market and maximize a trader's profits. Additionally, we have added an extension method, named N-Consecutive Actions, which examines the model's previous actions, before suggesting a new action. This method is complementary to the model's training and can be fruitfully combined, in order to further decrease the trading risk. Our experiments show that our model can properly forecast profitable round trips, despite high market commission fees.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "8d5ba5116a39a65b3967fc2637f8fecf",
    "relevant_keywords": [
      "machine learning",
      "reinforcement learning",
      "deep learning",
      "neural network",
      "representation learning"
    ],
    "stage1_timestamp": "2025-05-15T01:52:49.401210"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是基于深度强化学习的加密货币交易策略，旨在通过结合技术分析和市场情绪分析来最大化交易利润并降低交易风险。这属于投资组合管理的范畴，因为它涉及资产选择和交易策略的优化。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是基于深度强化学习的加密货币交易策略，旨在通过结合技术分析和市场情绪分析来最大化交易利润并降低交易风险。这属于投资组合管理的范畴，因为它涉及资产选择和交易策略的优化。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:56:42.125145"
}