{
  "paper": {
    "id": 2638,
    "title": "Default Clustering in Large Pools: Large Deviations",
    "abstract": "We study large deviations and rare default clustering events in a dynamic large heterogeneous portfolio of interconnected components. Defaults come as Poisson events and the default intensities of the different components in the system interact through the empirical default rate and via systematic effects that are common to all components. We establish the large deviations principle for the empirical default rate for such an interacting particle system. The rate function is derived in an explicit form that is amenable to numerical computations and derivation of the most likely path to failure for the system itself. Numerical studies illustrate the theoretical findings. An understanding of the role of the preferred paths to large default rates and the most likely ways in which contagion and systematic risk combine to lead to large default rates would give useful insights into how to optimally safeguard against such events.",
    "year": 2015,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "0d73d48ca8830aff4e78e725d4be28b5",
    "relevant_keywords": [
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T01:08:42.057710"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on studying large deviations and rare default clustering events in a dynamic large heterogeneous portfolio, which is directly related to understanding and managing systemic risk and contagion effects in financial systems. This falls under the domain of Financial Risk Management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on studying large deviations and rare default clustering events in a dynamic large heterogeneous portfolio, which is directly related to understanding and managing systemic risk and contagion effects in financial systems. This falls under the domain of Financial Risk Management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:13:39.750201"
}