{
  "paper": {
    "id": 4791,
    "title": "AI trading and the limits of EU law enforcement in deterring market manipulation",
    "abstract": "As in many other sectors of EU economies, 'Artificial Intelligence' (AI) has entered the scene of the financial services industry as a game-changer. A growing number of investment firms have been adopting AI, and particularly 'Machine Learning' (ML) methods, within the ramification of algorithmic trading. While AI/ML trading is expected to deliver several efficiency gains for capital markets, it also brings unprecedented risks for their safety and integrity due to some of its technical specificities and related additional uncertainties. With a focus on new and emerging risks of AI-driven market manipulation, this study critically assesses the ability of the EU anti-manipulation law and enforcement regime to achieve credible deterrence. It argues that AI trading is currently left operating within a (quasi-)lawless market environment with the ultimate risk of jeopardising EU capital markets' integrity and stability. It shows how 'deterrence theory', as a normative framework, can allow us to think of innovative solutions to fix the many shortcomings of the EU legal framework in the fight against AI-driven market manipulation. In concluding, this study suggests improving the existing EU anti-manipulation law and enforcement regime with a number of policy proposals. Namely, (i) an improved, 'harm-centric' definition of manipulation; (ii) an improved, 'multi-layered' liability regime for AI-driven manipulation; and (iii) a novel, 'hybrid' public private enforcement institutional architecture through the introduction of market manipulation 'bounty-hunters'. (c) 2022 A. Noida. Published by Elsevier Ltd. All rights reserved.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "eb189debb5d0195e58eb40130bd14949",
    "relevant_keywords": [
      "machine learning"
    ],
    "stage1_timestamp": "2025-05-15T02:41:00.878652"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要讨论AI交易对市场操纵的影响及欧盟法律的执行问题，并未涉及衍生品定价、金融风险管理或投资组合管理等具体金融技术应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要讨论AI交易对市场操纵的影响及欧盟法律的执行问题，并未涉及衍生品定价、金融风险管理或投资组合管理等具体金融技术应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:31:56.691132"
}