{
  "paper": {
    "id": 197,
    "title": "Integrating Weak Aggregating Algorithm and Reinforcement Learning for Online Portfolio Selection: The WARL Strategy",
    "abstract": "Online portfolio selection is an open and fundamental problem that has been attracting the attention of numerous researchers. Our aim is to address the challenges posed by the dynamic and complex financial market environment, where single investment strategies often face difficulties in adapting to rapid changes and unexpected events. Thus, we introduced the WARL strategy for online portfolio selection, which aggregated a heterogeneous expert set using a meta-learning approach called the weak aggregating algorithm (WAA). We replaced the online decision-makers in WAA with a reinforcement learning (RL) agent and proposed a novel reward function accounting for multiple objectives and event-triggering mechanisms. Based on real-world data numerical experiments, the WARL strategy outperforms the comparison strategies in a multi-metric evaluation. The comprehensive analysis conducted in this study supports the conclusion that the WARL strategy serves as a dependable and adaptive investment option, offering investors an effective means to optimize portfolio returns while effectively managing risks.",
    "year": 2024,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "1d3367d77bc635ec21da888f212233d3",
    "relevant_keywords": [
      "reinforcement learning",
      "neural network",
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T00:40:34.089510"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是结合弱聚合算法和强化学习来优化在线投资组合选择，其研究目标和实验设计都集中在投资组合管理领域，旨在优化投资回报并管理风险。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是结合弱聚合算法和强化学习来优化在线投资组合选择，其研究目标和实验设计都集中在投资组合管理领域，旨在优化投资回报并管理风险。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:32:50.518958"
}