{
  "paper": {
    "id": 298,
    "title": "Application of eXtreme gradient boosting trees in the construction of credit risk assessment models for financial institutions",
    "abstract": "The majority of the studies on credit risk assessment models for financial institutions during recent years focus on the improvement of imbalanced data or on the enhancement of classification accuracy with multistage modeling. Whilst multistage modeling and data pre-processing can boost accuracy somewhat, the heterogeneous nature of data may affects the classification accuracy of classifiers. This paper intends to use the classifier, eXtreme gradient boosting tree (XGBoost), to construct a credit risk assessment model for financial institutions. Cluster-based under-sampling is deployed to process imbalanced data. Finally, the area under the receiver operative curve and the accuracy of classifications are the assessment indicators, in the comparison with other frequently used single-stage classifiers such as logistic regression, self-organizing algorithms and support vector machine. The results indicate that the XGBoost classifier used by this paper achieve better results than the other three and can serve as a superior tool for the development of credit risk models for financial institutions. (C) 2018 Elsevier B.V. All rights reserved.",
    "year": 2018,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "ca347cf5f60835b11f0bd414fdae1eaa",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM",
      "decision tree",
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T01:49:04.667144"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用XGBoost构建信用风险评估模型，这直接应用于金融机构的信用风险管理，属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是使用XGBoost构建信用风险评估模型，这直接应用于金融机构的信用风险管理，属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:59:27.192492"
}