{
  "paper": {
    "id": 162,
    "title": "Credit Risk Assessment Using Machine Learning Algorithms",
    "abstract": "Financial institutions suffer from risk of losing money from bad customers. Specifically banking sectors where the risk of losing money is higher, due to bad loans. This causes economic slowdown of the nation. Hence credit risk assessment is an important research area. In this paper research methodology based framework using diagnostic and cross sectional study is used for risk analysis. Empirical approach is used to build models for credit risk assessment with supervised machine learning algorithms. The Logistic Regression and Neural Network classification models are implemented and evaluated using are evaluated using chi square statistical test. This study infers the significance of using machine learning algorithms to predict bad customers. Logistic Regression has shown better performance for the data set and parameters which are considered for this work.",
    "year": 2017,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "bf10d7a02e162457975e46e9070d0553",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "regression",
      "neural network",
      "sigmoid"
    ],
    "stage1_timestamp": "2025-05-15T01:47:14.219700"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on using machine learning algorithms for credit risk assessment, which is a key aspect of financial risk management, specifically in identifying and mitigating the risk of bad loans.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on using machine learning algorithms for credit risk assessment, which is a key aspect of financial risk management, specifically in identifying and mitigating the risk of bad loans.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:00:24.514585"
}