{
  "paper": {
    "id": 1855,
    "title": "Determinants of risk in the banking sector during the European Financial Crisis",
    "abstract": "Risk assessment in the banking sector has been a prominent topic in the banking literature and has gained attention especially since the recent financial crises. In particular, the European crisis, which was the first since the formation of the Eurozone, underlined a number of significant problems and increased concerns on the tail or crash risk of banks. In the present study, we seek to examine whether information asymmetry, the importance of banks in the financial system and systemic risk play significant roles in the evolution of stock crashes in the banking sector. Information asymmetry is proxied by opacity, the importance of a bank in a financial network is proxied by network centrality, and systemic risk is proxied by clustering. The research framework considers a number of regulatory, reporting and financial market factors that have also been determined to relate to stock crashes and shows that all of the above factors are related to (idiosyncratic) stock crash risk under specific conditions. (C) 2017 Elsevier B.V. All rights reserved.",
    "year": 2017,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "a085389f522df938e874190f333078f0",
    "relevant_keywords": [
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T02:08:04.027865"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on assessing risk factors in the banking sector, specifically examining stock crash risks related to information asymmetry, systemic risk, and network centrality. These are core aspects of financial risk management, particularly in the context of banking stability and systemic risk analysis.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on assessing risk factors in the banking sector, specifically examining stock crash risks related to information asymmetry, systemic risk, and network centrality. These are core aspects of financial risk management, particularly in the context of banking stability and systemic risk analysis.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:45:32.442683"
}