{
  "paper": {
    "id": 4,
    "title": "APPLICATION OF MACHINE LEARNING: AN ANALYSIS OF ASIAN OPTIONS PRICING USING NEURAL NETWORK",
    "abstract": "Pricing Asian Option is imperative to researchers, analysts, traders and any other related experts involved in the option trading markets and the academic field. Not only trading highly affected by the accuracy of the price of Asian options but also portfolios that involve hedging of commodity. Several attempts have been made to model the Asian option prices with closed-form over the past twenty years such as the Kemna-Vorst Model and Levy Approximation. Although today the two closed-form models are still widely used, their accuracy and reliability are called into question. The reason is simple; the Kemna-Vorst model is derived with an assumption of geometric mean of the stocks. In practice, Average Priced Options are mostly arithmetic and thus always have a volatility high than the volatility of a geometric mean making the Asian options always underpriced. On the other hand, the Levy Approximation using Monte Carlo Simulation as a benchmark, do not perform well when the product of the sigma (volatility) and square root maturity of the underlying is larger than 0.2. When the maturity of the option enlarges, the performance of the Levy Approximation largely deteriorates. If the closed-form models could be improved, higher frequency trading of Asian option will become possible. Moreover, building neural networks for different contracts of Asian Options allows reuse of computed prices and large-scale portfolio management that involves many contracts. In this thesis, we use Neural Network to fill the gap between the price of a closed-form model and that of an Asian option. The significance of this method answers two interesting questions. First, could an Asian option trader with a systematic behavior in pricing learned from previous quotes improve his pricing or trading performance in the future? Second, will a training set of previous data help to improve the performance of a financial model? We perform two simulation experiments and show that the performance of the closed-form model is significantly improved. Moreover, we extend the learning process to real data quote. The use of Neural Network highly improves the accuracy of the traditional closed-form model. The model's original price is not so much accurate as what we estimate using Neural network and could not capture the high volatility effectively; still, it provides a relative reasonable fit to the problem (Especially the Levy Model). The analysis shows that the Neural Network Algorithms we used affect the results significantly.",
    "year": 2017,
    "source": "WOS",
    "area": "derivatives_pricing",
    "method": "machine learning",
    "cache_key": "e8d2e1ed841bb4157906fa42b4a495da",
    "relevant_keywords": [
      "machine learning",
      "neural network",
      "deep learning",
      "backpropagation",
      "BP",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T01:27:29.392267"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Derivatives Pricing"
    ],
    "justification": "该论文的核心技术是使用神经网络来改进亚洲期权的定价模型，这直接属于衍生品定价的范畴。论文详细讨论了现有封闭式模型的不足，并展示了神经网络如何提高定价的准确性，这是衍生品定价领域的关键问题。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"衍生品定价\"],\n  \"justification\": \"该论文的核心技术是使用神经网络来改进亚洲期权的定价模型，这直接属于衍生品定价的范畴。论文详细讨论了现有封闭式模型的不足，并展示了神经网络如何提高定价的准确性，这是衍生品定价领域的关键问题。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:07:33.000765"
}