{
  "paper": {
    "id": 3905,
    "title": "Long Short-Term Memory in Intelligent Buildings",
    "abstract": "This paper presents Long Short-Term Memory (LSTM) in iBuilding: Artificial Intelligence in Intelligent Buildings. LSTM networks are widely used in time series data as their learning algorithm does not present exploding and vanishing gradient descent issues as traditional recurrent neural networks with back propagation learning algorithms. This paper proposes the use of LSTM networks to predict the values of the different iBuilding variables, such as environmental conditions, energy consumption or occupancy. Intelligent Buildings are used as an investment portfolio, Technology and Artificial Intelligence plays a critical role to make a successful Return on Investment (ROI). The business case and main driver to use Artificial Intelligence in Intelligent Buildings is to predict the future value of iBuilding variables therefore preventive action can be taken in the present to reduce OPEX costs such as decreasing overnight heating due low predicted low occupancy or preventive maintenance on mechanical and electrical assets such as lifts with fault detection and diagnosis. The predictions of the proposed LSTM in iBuilding has been validated with several public datasets against other predictors. The obtained results demonstrate that LSTM networks are more accurate than the Linear Regression (LR) model, typically used within the embedded predictors found on common spreadsheet software.",
    "year": 2020,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "98b232f5893ab533b480d720c95eb91a",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "neural network",
      "deep learning",
      "backpropagation",
      "BP",
      "recurrent neural network",
      "long short-term memory",
      "LSTM"
    ],
    "stage1_timestamp": "2025-05-15T01:22:11.827010"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究LSTM网络在智能建筑中的应用，如预测环境条件、能源消耗或占用率等，虽然提到了智能建筑作为投资组合的一部分，但其核心技术并未直接应用于衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究LSTM网络在智能建筑中的应用，如预测环境条件、能源消耗或占用率等，虽然提到了智能建筑作为投资组合的一部分，但其核心技术并未直接应用于衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:08:44.396662"
}