{
  "paper": {
    "id": 851,
    "title": "Application of CNN-based financial risk identification and management convolutional neural networks in financial risk",
    "abstract": "The application of intelligent financial analysis model to the research of enterprise financial risk prediction can improve the adaptability of the model, effectively capture complex patterns and adapt to large-scale data, but there are some problems such as insufficient accuracy and low recall rate. In order to improve the effect of enterprise financial risk management, this research applies convolutional neural network to enterprise financial risk management, and proposes a binary classification prediction model of financial risk dilemma based on onedimensional convolution and sparse attention mechanism. Then, combined with experimental research, this research verifies that the synergy of multiple modules enables the model proposed in this research to understand and classify the input data more comprehensively and accurately, and then achieve significant improvements in various indicators. Moreover, compared with the comparison model of a single module, it shows superior performance. After training, the accuracy of the model is 75.98 % in the training set and 82.34 % in the test set, which shows the ideal training results, and proves that the model has good generalization ability The model has the best performance in precision, recall and F1, which is due to the comprehensive use of CNN module, LSTM module, encoder module and AR module. After training, the accuracy of the model is 75.98 % in the training set and 82.34 % in the test set, which shows the ideal training results, and proves that the model has good generalization ability. The model has the best performance in precision, recall and F1, which is due to the comprehensive use of CNN module, LSTM module, encoder module and AR module. The experimental results show that the model proposed in this research can realize the accurate classification of binary classification prediction of financial risk dilemma, help enterprises to rationally allocate resources, control the government's unnecessary financial support to enterprises that are on the verge of bankruptcy and have no prospect, and prevent the loss of enterprises' assets.",
    "year": 2025,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "5dd59e899bd8a188e2bffc64927c5902",
    "relevant_keywords": [
      "machine learning",
      "classification",
      "neural network",
      "deep learning",
      "convolutional neural network",
      "CNN",
      "long short-term memory",
      "LSTM",
      "encoder-decoder",
      "attention mechanism"
    ],
    "stage1_timestamp": "2025-05-15T01:55:41.673212"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是应用卷积神经网络（CNN）和长短期记忆网络（LSTM）等深度学习模型进行企业财务风险的二元分类预测，旨在提高财务风险管理的效果。这明确属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"该论文的核心技术是应用卷积神经网络（CNN）和长短期记忆网络（LSTM）等深度学习模型进行企业财务风险的二元分类预测，旨在提高财务风险管理的效果。这明确属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:54:15.881106"
}