{
  "paper": {
    "id": 151,
    "title": "A Deep-Reinforcement-Learning-Based Multi-Source Information Fusion Portfolio Management Approach via Sector Rotation",
    "abstract": "As a research objective in quantitative trading, the aim of portfolio management is to find the optimal allocation of funds by following the dynamic changes in stock prices. The principal issue with current portfolio management methods is their narrow focus on a single data source, neglecting the changes or news arising from sectors. Methods for integrating news data frequently face challenges with regard to quantifying text data and embedding them into portfolio models; this process often necessitates considerable manual labeling. To address these issues, we proposed a sector rotation portfolio management approach based on deep reinforcement learning (DRL) via multi-source information. The multi-source information includes the temporal data of sector and stock features, as well as news data. In terms of structure, in this method, a dual-layer reinforcement learning structure is deployed, comprising a multi-agent sector layer and a graph convolution layer. The former learns the trend of sectors, while the latter learns the connections between stocks in sectors, and the impact of news on sectors is integrated through large language models without manual labeling or fusing output information of other modules to provide the final portfolio management scheme. The results of simulation experiments on the Chinese and US (United States) stock markets show that our method demonstrates significant improvements over multiple state-of-the-art approaches.",
    "year": 2025,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "d304f62c757f29ae90a08a8701213575",
    "relevant_keywords": [
      "machine learning",
      "reinforcement learning",
      "deep learning",
      "neural network",
      "representation learning",
      "deep belief network",
      "attention mechanism",
      "Large Language Model",
      "LLM"
    ],
    "stage1_timestamp": "2025-05-15T00:40:02.072468"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是基于深度强化学习的多源信息融合投资组合管理方法，旨在通过行业轮动策略优化资金分配，这直接属于投资组合管理领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是基于深度强化学习的多源信息融合投资组合管理方法，旨在通过行业轮动策略优化资金分配，这直接属于投资组合管理领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:33:19.516470"
}