{
  "paper": {
    "id": 1357,
    "title": "DO THE FAMA AND FRENCH FIVE-FACTOR MODEL FORECAST WELL USING ANN?",
    "abstract": "Forecasting the stock returns in the emerging markets is challenging due to their peculiar characteristics. These markets exhibit linear as well as nonlinear features and Conventional forecasting methods partially succeed in dealing with the nonlinear nature of stock returns. Contrarily, Artificial Neural Networks (ANN) is a flexible machine learning tool which caters both the linear and nonlinear markets. This paper investigates the forecasting ability of ANN by using Fama and French five-factor model. We construct ANN'S based on the composite factors of the FF5F model to predict portfolio returns in two stages; in stage one, the study identifies the best-fit combination of training, testing, and validation along with the number of neurons full sample period. In stage two, the study uses this best combination to forecast the model under 48-months rolling window analysis. In-sample and out-sample comparisons, regression, and goodness of fit test and actual and predicted values of the stock returns of our ANN model reveal that the proposed model accurately predicts the one-month ahead returns. Our findings reinforce the investment concept that the markets compensate the high-risk portfolios more than mid and low beta portfolios and the methodology will significantly improve the return on investment of the investors.",
    "year": 2019,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "62038faf5613bf1f8b4d52e2f3792eb7",
    "relevant_keywords": [
      "machine learning",
      "neural network",
      "backpropagation",
      "BP",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T00:54:56.407995"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是使用人工神经网络（ANN）结合Fama and French五因子模型来预测投资组合的回报，并探讨了如何通过优化模型参数来提高投资回报。这直接涉及到投资组合的构建和回报预测，属于投资组合管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是使用人工神经网络（ANN）结合Fama and French五因子模型来预测投资组合的回报，并探讨了如何通过优化模型参数来提高投资回报。这直接涉及到投资组合的构建和回报预测，属于投资组合管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:21:37.490477"
}