{
  "paper": {
    "id": 4903,
    "title": "Louvain community-based label assignment for reject inference in peer-to-peer lending",
    "abstract": "The digital transformation in the Financial Technology (FinTech) sector has significantly altered traditional banking and lending practices, giving rise to innovative models like peer-to-peer (P2P) lending. P2P lending platforms directly connect lenders and borrowers online, bypassing conventional financial intermediaries and democratizing access to finance. However, this innovation introduces new complexities in the risk assessment process, necessitating advanced analytical methods. This research presents Accept-Reject-Net framework, a three-step modeling approach designed to capture and evaluate the complex relationships of loans within the accept and reject dataset, a crucial aspect of P2P lending. Initially, the datasets are separated using two outlier detection methods that efficiently manage extensive datasets by distinguishing inliers (data points adhering to a specific pattern) from outliers (data points deviating from the anticipated pattern). We then generate four distinct merged datasets by applying two different ratios of accept and reject data. In the second stage, borrowers are systematically represented as nodes, with their Euclidean distances as edges, allowing us to extract graph features that effectively capture the structural attributes and similarities of the loans. These graph features are used to classify entries in the Reject dataset as either default or non-default. Two distinct approaches are introduced Louvain mode and Louvain threshold to facilitate label assignment within detected communities. The threshold is validated across multiple levels to assess its effectiveness in refining label assignment. In the third phase, these features are inputs for training five machine learning models, further enhanced with additional labeled data. To ensure the reliability and robustness of our findings, confidence intervals and permutation tests are used to assess the performance differences between different partitions. The 7:1 ratio of accept:reject with the threshold method of Louvain community detection for assigning labels to the rejected dataset improves the metrics, making the model much more effective for reject inference. This comprehensive approach addresses the biases inherent in traditional credit scoring models and enhances the predictive accuracy and fairness of loan evaluations.",
    "year": 2025,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "8d290250edda85f34d522bdf359dfcd3",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "clustering",
      "feature representation"
    ],
    "stage1_timestamp": "2025-05-15T02:42:04.923825"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on improving risk assessment in peer-to-peer lending through advanced machine learning techniques, specifically addressing credit risk by classifying borrowers as default or non-default. This directly pertains to financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on improving risk assessment in peer-to-peer lending through advanced machine learning techniques, specifically addressing credit risk by classifying borrowers as default or non-default. This directly pertains to financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:31:32.838503"
}