{
  "paper": {
    "id": 217,
    "title": "Machine Trading by Time Series Models and Portfolio Optimization",
    "abstract": "Machine learning algorithms such as Support Vector Machine (SVM) and Artificial Neural Network (ANN) are used for machine trading. The problem with SVM and ANN is that it is difficult to determine appropriated features for both models; moreover, it is also time consuming to perform backpropagation for ANN when a number of both features and data increase. However, machine trading is not confined only these two algorithms, but also time series models. In this study, we will employ time series models namely Autoregressive Integrated Moving Average (ARIMA) and Holt - Winters' Exponential Smoothing (HW) as the guidance for trading since time series models only require time series as an input. We will perform time series analysis to snatch the trading opportunity in the Stock Exchange of Thailand (SET). There are fifty companies on the list of SET50 index; we will choose five amongst them to invest measured by Sharpe Ratio; the top five from this measurement will be selected as invested assets in simulated portfolio. Furthermore, the well-known portfolio optimization framework by Harry Markowitz will be used to ensure that the combination of the invested assets is located on the efficient frontier; the result from this study is favorable as the return generated by these activities outperforms market return; furthermore, manipulating time series into different time lags yields higher return and as well as combining both ARIMA and HW models to help predict stock prices also improves power of prediction of time series models. This study will help retail investor who has limited resource overthrow bias and intuition throughout investment decision process ranging from finding the stocks for investment to capturing market movement for trading opportunity.",
    "year": 2019,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "cb18481dd00030543c0a00b6cb6333e6",
    "relevant_keywords": [
      "machine learning",
      "support vector machine",
      "SVM",
      "neural network",
      "backpropagation",
      "BP"
    ],
    "stage1_timestamp": "2025-05-15T00:40:34.184516"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文主要研究了使用时间序列模型（ARIMA和Holt-Winters）进行股票交易，并通过Sharpe Ratio选择股票，以及使用Markowitz的投资组合优化框架来构建有效前沿。这些内容明确指向投资组合管理领域，而非衍生品定价或金融风险管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文主要研究了使用时间序列模型（ARIMA和Holt-Winters）进行股票交易，并通过Sharpe Ratio选择股票，以及使用Markowitz的投资组合优化框架来构建有效前沿。这些内容明确指向投资组合管理领域，而非衍生品定价或金融风险管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:32:45.941693"
}