{
  "paper": {
    "id": 1991,
    "title": "A Text Mining and Ensemble Learning Based Approach for Credit Risk Prediction",
    "abstract": "Traditional credit risk prediction models mainly rely on financial data. However, technological innovation is the main driving force for the development of enterprises in strategic emerging industries, which is closely related to enterprise credit risk. In this paper, a novel prediction framework utilizing technological innovation text mining data and ensemble learning is proposed. The empirical data from China listed enterprises in strategic emerging industries were applied to construct prediction models using the classification and regression tree model, the random forest model and extreme gradient boosting model. The results show that the model uses the technological innovation text mining data proven to have significant predict ability, and top management team's attention to innovation variables offer the best prediction capacities. This work improves the application value of enterprise credit risk prediction models in strategic emerging industries by embedding the mining of technological innovation text information.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "41e34b450ac4153d3e7d0b740d11e903",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "regression",
      "decision tree",
      "feature learning",
      "feature representation"
    ],
    "stage1_timestamp": "2025-05-15T02:09:48.396370"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用文本挖掘和集成学习方法来预测企业信用风险，这直接属于金融风险管理领域。论文明确提到其目标是改进企业信用风险预测模型的应用价值，因此其主要应用领域是金融风险管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"该论文的核心技术是使用文本挖掘和集成学习方法来预测企业信用风险，这直接属于金融风险管理领域。论文明确提到其目标是改进企业信用风险预测模型的应用价值，因此其主要应用领域是金融风险管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:44:50.946575"
}