{
  "paper": {
    "id": 1174,
    "title": "Deep Learning-based Delinquent Taxpayer Prediction: A Scientific Administrative Approach",
    "abstract": "This study introduces an effective method for predicting individual local tax delinquencies using prevalent machine learning and deep learning algorithms. The evaluation of credit risk holds great significance in the financial realm, impacting both companies and individuals. While credit risk prediction has been explored using statistical and machine learning techniques, their application to tax arrears prediction remains underexplored. We forecast individual local tax defaults in Republic of Korea using machine and deep learning algorithms, including convolutional neural networks (CNN), long short-term memory (LSTM), and sequence -to -sequence (seq2seq). Our model incorporates diverse credit and public information like loan history, delinquency records, credit card usage, and public taxation data, offering richer insights than prior studies. The results highlight the superior predictive accuracy of the CNN model. Anticipating local tax arrears more effectively could lead to efficient allocation of administrative resources. By leveraging advanced machine learning, this research offers a promising avenue for refining tax collection strategies and resource management.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "68d7fceb7a5c7dab03302e02f13301f8",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "classification",
      "neural network",
      "convolutional neural network",
      "CNN",
      "long short-term memory",
      "LSTM",
      "sequence-to-sequence learning",
      "seq2seq"
    ],
    "stage1_timestamp": "2025-05-15T01:59:56.255523"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用机器学习和深度学习算法预测个体地方税拖欠情况，这属于信用风险评估的范畴，是金融风险管理的一个重要方面。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是使用机器学习和深度学习算法预测个体地方税拖欠情况，这属于信用风险评估的范畴，是金融风险管理的一个重要方面。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:51:38.250902"
}