{
  "paper": {
    "id": 5686,
    "title": "Conceptual Fundamentals of Organizational and Economic Mechanism Formation of Economic Sustainability Management of a Telecommunication Enterprise",
    "abstract": "Modern telecommunications companies operate in conditions of risk and uncertainty due to both external and internal factors. Due to the influence of various factors, companies may find themselves in a state of crisis due to the lack of a management mechanism, the main purpose of which is to ensure economic stability and efficiency based on sustainable capacity building. This article aims to identify the factors that affect the economic stability of telecommunications enterprises in Ukraine and study their impact on the integrated indicator to form an organizational and economic mechanism for managing economic stability. The study was carried out using the following methods: analysis, synthesis, generalization, systematization, correlation, and regression analysis. The main tendencies of Ukrainian telecommunication networks development are defined in this research. The key structural element of this mechanism is proposed to determine the assessment of economic stability based on the use of a set of balanced indicators. Based on correlation and regression analysis, a significant dependence of the overall integrated indicator of economic stability on the subscriber component, moderate-on the component of internal business processes and staff training and development, and a weak inverse dependence on the financial component. Using multicollinearity proved expediency to check the tightness of the relationship between the analyzed variables in the regression model. (C) CIKD Publishing",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "10dea86685de472cebccc8ffcf69d455",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:50:21.233043"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究电信企业的经济稳定性管理机制，虽然涉及风险因素，但其核心内容属于企业管理和经济稳定性评估，并未直接涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究电信企业的经济稳定性管理机制，虽然涉及风险因素，但其核心内容属于企业管理和经济稳定性评估，并未直接涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:29:38.486027"
}