{
  "paper": {
    "id": 1204,
    "title": "Artificial neural network (ANN)-based estimation of the influence of COVID-19 pandemic on dynamic and emerging financial markets",
    "abstract": "The COVID-19 pandemic is a serious global issue destroying financial markets awfully. The proper estimation effect of COVID-19 pandemic on dynamic emerging financial markets is a big challenge due to a complex multidimensional data. However, the present study proposes a Deep Neural Network (DNN)-based multivariate regression approach with backpropagation algorithm and structural learning-based Bayesian network with constraint-based algorithm to investigate the influence of COVID-19 pandemic on the currency and derivatives markets of an emerging economy. The output shows that the COVID-19 pandemic has negatively influenced the financial markets as indicated by sharply depreciating currency value around 10 % to 12 % and reducing short-position of futures derivatives around 3 % to 5 % for currency risk hedging. The robustness estimation shows that there have probabilistic distributed between Traded Futures Derivatives Contracts (TFDC), Currency Exchange Rate (CER), and Daily Covid Cases (DCC) and Daily Covid Deaths (DCD). Moreover, the output represents that the futures derivatives market conditionally depends on the currency market volatility given percentage of COVID-19 pandemic. This study may help to policymakers of financial markets in decision-making to control CER volatility that may promote currency market stability to enhance currency market activities and boost confidence of foreign investors in extreme financial crisis circumstances.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "d2acdf5353e7beb7ac2e5fde8b732961",
    "relevant_keywords": [
      "machine learning",
      "neural network",
      "deep learning",
      "backpropagation",
      "BP",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:59:56.377339"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要研究了COVID-19疫情对新兴金融市场的影响，特别是对货币和衍生品市场的影响，并使用了深度神经网络和贝叶斯网络来分析这些影响。研究重点在于理解疫情如何影响货币汇率和期货衍生品的短期头寸，以及这些因素之间的概率分布关系。这些内容主要涉及金融风险管理，特别是货币市场波动和衍生品市场在极端金融危机情况下的风险管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文主要研究了COVID-19疫情对新兴金融市场的影响，特别是对货币和衍生品市场的影响，并使用了深度神经网络和贝叶斯网络来分析这些影响。研究重点在于理解疫情如何影响货币汇率和期货衍生品的短期头寸，以及这些因素之间的概率分布关系。这些内容主要涉及金融风险管理，特别是货币市场波动和衍生品市场在极端金融危机情况下的风险管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:50:56.647048"
}