{
  "paper": {
    "id": 3190,
    "title": "Applications of artificial intelligence and machine learning in the financial services industry: A bibliometric review",
    "abstract": "This bibliometric review examines the research state of artificial intelligence (AI) and machine learning (ML) applications in the Banking, Financial Services, and Insurance (BFSI) sector. The study focuses on Scopus-indexed articles to identify key research clusters. Following the Preferred Reporting Items for Systematic Reviews and Meta-Analyses (PRISMA) protocol, 39,498 articles were screened, resulting in 1045 articles meeting the inclusion criteria. N-gram analysis identified 177 unique terms in the article titles and abstracts. Co-occurrence analysis revealed nine distinct clusters covering fintech, risk management, anti-money laundering, and actuarial science, among others. These clusters offer a comprehensive overview of the multifaceted research landscape. The identified clusters can guide future research and inform study design. Policymakers, researchers, and practitioners in the BFSI sector can benefit from the study's findings, which identify research gaps and opportunities. This study contributes to the growing literature on bibliometrics, providing insights into AI and ML applications in the BFSI sector. The findings have practical implications, advancing our understanding of AI and ML's role in benefiting academia and industry.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "22402989bb59d3f3b266bcf251c8a6af",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T02:23:33.544596"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的摘要中明确提到了风险管理和反洗钱等应用，这些属于金融风险管理的范畴。虽然论文涵盖了广泛的BFSI领域，但金融风险管理是其中一个明确的研究集群。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的摘要中明确提到了风险管理和反洗钱等应用，这些属于金融风险管理的范畴。虽然论文涵盖了广泛的BFSI领域，但金融风险管理是其中一个明确的研究集群。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:38:04.214338"
}