{
  "paper": {
    "id": 77,
    "title": "RETRACTED: Application of Multiobjective Particle Swarm Optimization in Rural Credit System (Retracted Article)",
    "abstract": "In China's rural credit system, the problem of credit constraints is prominent. Due to the imperfect credit market, a large number of rural residents have credit constraints. Rural credit constraint is a serious problem restricting China's rural economic development. Aimed at solving the rural credit constraints, this paper makes an optimization analysis on the rural credit system and loan decision-making. To more reasonably evaluate customers' borrowing ability, the credit risk based on farmers' data on the big data platform is evaluated in this paper. The stacked denoising autoencoder network is improved by adopting the deep learning framework to improve the accuracy of credit evaluation. For improving the loan decision-making ability of rural credit system, a loan optimization strategy based on multiobjective particle swarm optimization algorithm is proposed. The simulation results show that the optimization ability, speed, and stability of the proposed algorithm have achieved good results in dealing with the loan portfolio decision-making problem.",
    "year": 2021,
    "source": "WOS",
    "area": "portfolio",
    "method": "deep learning",
    "cache_key": "1099144f9d8914b096b10a1729e4032d",
    "relevant_keywords": [
      "deep learning",
      "neural network",
      "autoencoder",
      "denoising autoencoder"
    ],
    "stage1_timestamp": "2025-05-15T00:31:50.363705"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要研究农村信贷系统中的信用风险评估和贷款决策优化，使用了深度学习和多目标粒子群优化算法来提高信用评估的准确性和贷款决策能力，这属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文主要研究农村信贷系统中的信用风险评估和贷款决策优化，使用了深度学习和多目标粒子群优化算法来提高信用评估的准确性和贷款决策能力，这属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T14:24:44.758281"
}