{
  "paper": {
    "id": 7265,
    "title": "Analysis of Early Detection System of Banking Industry in Indonesia on Shock",
    "abstract": "The emergence of technology or digitalization of fintech amid tight liquidity pressures and a slowdown in the global economy, greatly affects the performance of banks as intermediary institutions that are vulnerable to risk. However, if risks are left uncontrolled and not treated soon, they will create systemic risks that can create substantial costs. For this reason, early detection needs to be done in the context of prevention before a crisis occurs. This study aims to determine the level vulnerability of banking industry to the shocks and the bank's resilience profile to shocks in the midst of FinTech developments. The analytical method used in this study is logit regression, which starts with calculating indexation to measure the level of bank vulnerability to shocks. The data used in this study includes banks financial statements and macroeconomic data. The results showed that exchange rate pressures and Non-Performing Loans had the largest contribution as the cause of bank vulnerability with a probability value of 2.363% and 2.006%. Bank Rakyat Indonesia Syariah is the most unstable and most vulnerable bank to the shocks during the 2016-2018 period.",
    "year": 2020,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "678a1a502002607d1e44d6e48a769d68",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T03:07:02.527346"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要研究银行在金融科技发展背景下对冲击的脆弱性和韧性，使用logit回归分析银行财务数据和宏观经济数据来评估风险，这属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文主要研究银行在金融科技发展背景下对冲击的脆弱性和韧性，使用logit回归分析银行财务数据和宏观经济数据来评估风险，这属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:26:38.970814"
}