{
  "paper": {
    "id": 2631,
    "title": "SIDVis: Designing Visual Interactive System for Analyzing Suicide Ideation Detection",
    "abstract": "Suicide is a critical global issue that demands a comprehensive examination of factors such as mental illness, substance abuse, financial stress, and trauma. Effectively identifying individuals at risk is vital for intervention and prevention efforts. However, distinguishing suicidal ideation (SID) from non-suicidal language poses challenges. Existing research has addressed this issue, but limited attention has been given to visually interpretable and interactive systems tailored for SID. This study contributes to responsible AI by leveraging deep learning and machine learning techniques to enhance SID detection, enabling proactive interventions and support. In this paper, we introduce SIDVis, an interactive visualization system that improves performance and interpretability at the same time. The rigorous evaluation demonstrates that SIDVis not only outperforms existing methods in terms of accuracy but also provides an explanation for the responsible use of the underlying AI approach, demonstrating its potential to improve SID detection and intervention strategies.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "ee8922c1185f6c75fa773b2d2c7a66a6",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "classification",
      "neural network",
      "representation learning"
    ],
    "stage1_timestamp": "2025-05-15T02:17:32.144934"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究自杀意念检测的可视化交互系统，虽然涉及金融压力作为潜在因素之一，但其核心技术（深度学习、机器学习、可视化系统）并未直接应用于衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究自杀意念检测的可视化交互系统，虽然涉及金融压力作为潜在因素之一，但其核心技术（深度学习、机器学习、可视化系统）并未直接应用于衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:41:06.294724"
}