{
  "paper": {
    "id": 2607,
    "title": "THE MODEL OF CHANGE AS THE BASIS OF THE KNOWLEDGE STRUCTURE IN THE NEXT GENERATION E-LMS",
    "abstract": "The enormous efforts made by the European Union countries to integrate refugees and migrants are based on the lack of effective tools for the rapid learning of adults for practical linguistic and labor skills. The existing system of education is conservative and not adapted for such tasks. In addition, the classical approach to explaining the structure of a language with the help of rules and attempts to teach how to plan and control speech activity with the help of linguistic means contradicts some basic scientific principles adopted in other sciences. Communicative method with the refusal to study theory is also not effective enough in this situation, since it requires huge resources and costs on both sides. Therefore, the creation of modern IT systems to simplify and accelerate the study of language is a very urgent topic and requires the search for new ways and solutions. This work is aimed at studying the basic structures describing the interaction of language, psyche and objective reality in order to ensure the development of a system for teaching new generation languages, and applying the resulting models to create algorithms for constructing applications, services and programs for Learning Management System (LMS) with continuous control of the learning curve. The research is interdisciplinary at the intersection of pedagogy, psychology and linguistics on the one hand, and tools of exact sciences, systems analysis and IT on the other hand. New results are obtained by applying the Structural Visual Method (SVM) both for studying high-level structures of abstraction, and studying specific linguistic phenomena and developing new ways of teaching their application. In this case, not verbal instructions and descriptions (grammatical rules) are used as a tool for planning, controlling and correcting speech activity, but visual schemes and diagrams with a wide use of color coding. The visual models obtained as a result of the analysis of basic scientific theories have already been partially published earlier. In this paper, new models are derived from the analysis of the most abstract structures. The model of change and the structure of primary dualities became the basis for a new classification of linguistic phenomena, grammatical structures and the development of another sequence of explanations for the grammar of the verb and the practice of constructing sentences. These results have already been implemented in the form of materials for printing and video lessons, which made it possible to obtain a qualitative evaluation of the approach's prospects. Now work is underway to create interactive computer simulators and systems for managing the learning process, as well as to obtain statistics on the change in the learning curve with a large number of students using them. The SVM has shown and made evident important regularities in the structure of the relationship of language, psychic sphere and physical reality. The application of these regularities in the educational process is of considerable interest. The first practical results were obtained from the application of SVM and the existing prototypes of applications and programs were developed. Work is underway to develop and improve them. The first steps have been taken to integrate them into an integrated system. The expansion of the development team and the search for new partners for cooperation and expansion of the language portfolio are being carried out.",
    "year": 2017,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "19e05dc99accf04b6656aa2871e9ec3e",
    "relevant_keywords": [
      "SVM"
    ],
    "stage1_timestamp": "2025-05-15T01:08:41.881027"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是语言学习和教育技术，特别是通过视觉模型和IT系统来改进语言学习过程。虽然提到了SVM（Structural Visual Method），但这与金融领域的衍生品定价、金融风险管理或投资组合管理无关。论文的核心应用领域是教育技术和语言学，而非金融。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是语言学习和教育技术，特别是通过视觉模型和IT系统来改进语言学习过程。虽然提到了SVM（Structural Visual Method），但这与金融领域的衍生品定价、金融风险管理或投资组合管理无关。论文的核心应用领域是教育技术和语言学，而非金融。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:13:41.930718"
}