{
  "paper": {
    "id": 1834,
    "title": "Credit Risk Evaluation with Extreme Learning Machine",
    "abstract": "Credit risk evaluation has become an increasingly important field in financial risk management for financial institutions, especially for banks and credit card companies. Many data mining and statistical methods have been applied to this field. Extreme learning machine (ELM) classifier as a type of generalized single hidden layer feed-forward networks has been used in many applications and achieve good classification accuracy. Thus, we use ELM (kernel based) as a classification tool to perform the credit risk evaluation in this paper. The simulations are done on two credit risk evaluation datasets with three different kernel functions. Simulation results show that the kernel based ELM is more suitable for credit risk evaluation than the popular used Support Vector Machines (SVMs) with consideration of overall, good and bad accuracies.",
    "year": 2012,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "22414e2f8f273d222b0e9dccb9e3dcb2",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM",
      "neural network",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T02:08:03.940061"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on credit risk evaluation using Extreme Learning Machine, which is a critical aspect of financial risk management, particularly for banks and credit card companies. The study aims to improve classification accuracy for credit risk, directly addressing risk assessment and mitigation.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on credit risk evaluation using Extreme Learning Machine, which is a critical aspect of financial risk management, particularly for banks and credit card companies. The study aims to improve classification accuracy for credit risk, directly addressing risk assessment and mitigation.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:45:54.769918"
}