{
  "paper": {
    "id": 945,
    "title": "Constructing Cybersecurity Stocks Portfolio Using AI",
    "abstract": "This study explores the application of artificial intelligence, specifically ChatGPT-4o, in constructing and managing a portfolio of cybersecurity stocks over the period from Q1 2018 to Q1 2024. Leveraging advanced machine learning models, fundamental analysis, sentiment analysis, and optimization techniques, the AI-driven portfolio significantly outperformed leading cybersecurity ETFs, as well as broader market indices such as the Nasdaq 100 (QQQ) and S&P 500 (SPY). The methodology employed included data collection, stock filtering, predictive modeling using Random Forests and Support Vector Machines (SVMs), sentiment analysis through natural language processing (NLP), and portfolio optimization using Mean-Variance Optimization (MVO), with quarterly rebalancing to ensure responsiveness to evolving market conditions. The AI-selected portfolio achieved a total return of 273%, with strong risk-adjusted performance as demonstrated by key metrics such as the Sharpe ratio, highlighting the effectiveness of an AI-based approach in navigating market complexities and generating superior returns. The results of this study indicate that AI-driven portfolio management can uncover investment opportunities that traditional methods may overlook, offering a competitive edge in the cybersecurity sector and promising enhanced predictive accuracy, efficiency, and overall investment success as AI technologies continue to evolve.",
    "year": 2024,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "271f478d9ecf9a639424e31985485b16",
    "relevant_keywords": [
      "machine learning",
      "support vector machine",
      "SVM",
      "Large Language Model",
      "LLM",
      "ChatGPT",
      "GPT-4"
    ],
    "stage1_timestamp": "2025-05-15T00:50:08.659071"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是应用人工智能（包括机器学习、自然语言处理和优化技术）来构建和管理一个网络安全股票的投资组合，并展示了其在投资组合管理中的优越表现。论文明确提到了使用Mean-Variance Optimization (MVO)进行投资组合优化，并通过季度再平衡来应对市场变化，这些都是投资组合管理的典型应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是应用人工智能（包括机器学习、自然语言处理和优化技术）来构建和管理一个网络安全股票的投资组合，并展示了其在投资组合管理中的优越表现。论文明确提到了使用Mean-Variance Optimization (MVO)进行投资组合优化，并通过季度再平衡来应对市场变化，这些都是投资组合管理的典型应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:25:53.780583"
}