{
  "paper": {
    "id": 3021,
    "title": "Forecasting future trends: a comprehensive analysis of korea composite stock price index using advanced predictive models",
    "abstract": "Stock markets play a vital role in the economy of any nation, providing capital to businesses and avenues for investors to share in the profits of corporations. Stock price prediction is a complex task due to the various factors affecting market fluctuations. The potential for substantial financial gain is an important motivator for accurate forecasting in the stock market. This study proposes a hybrid model for forecasting that combines Decision Trees (DTs), Wavelet Transform (WT), and Battle Royale Optimizer (BRO). The model is further improved by the inclusion of decomposition and optimization techniques with robust data preparation. The analysis, based on the Korea Composite Stock Price Index (KOSPI) from January 1st, 2015, to July 25th, 2023, reveals that the WT-BRO-DT model significantly outperforms other methods by achieving a coefficient of determination value of 0.992. This research addresses the existing gaps in stock market forecasting by integrating advanced machine learning techniques that improve the accuracy of the predictions. While previous models have shown limitations in handling complex data and achieving high accuracy, this work offers a more reliable solution to help investors and analysts make better-informed decisions, reduce risk, and optimize returns. These findings have practical implications for financial decision-making and contribute to the improvement in the accuracy of forecasts of stock markets.",
    "year": 2025,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "256bdd9055ec0caaaa378cdcfe3a313d",
    "relevant_keywords": [
      "machine learning",
      "decision tree",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:21:52.154714"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是使用混合模型（决策树、小波变换和Battle Royale优化器）来预测韩国综合股价指数（KOSPI）的未来趋势。这种预测技术主要用于帮助投资者和分析师做出更明智的投资决策，优化回报，并降低风险，这直接关联到投资组合管理的领域。论文并未涉及衍生品定价或金融风险管理的具体应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是使用混合模型（决策树、小波变换和Battle Royale优化器）来预测韩国综合股价指数（KOSPI）的未来趋势。这种预测技术主要用于帮助投资者和分析师做出更明智的投资决策，优化回报，并降低风险，这直接关联到投资组合管理的领域。论文并未涉及衍生品定价或金融风险管理的具体应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:38:32.598049"
}