{
  "paper": {
    "id": 700,
    "title": "Fuzzy convolutional deep-learning model to estimate the operational risk capital using multi-source risk events",
    "abstract": "Operational Risk (OR) is usually caused by losses due to human errors, inadequate or defective internal processes, system failures or external events that affect an organization. According to the Basel II agreement, OR is defined by seven risk events: internal fraud, external fraud, labor relations, clients, damage to fixed assets, technological failures and failures in the execution & administration of processes. However, due to the large amount of qualitative information, the uncertainty and the low frequency at which these risk events are generated in an organization, their modeling is still a technological challenge. This paper takes up this challenge and presents a fuzzy convolutional deep-learning model to estimate, based on the Basel III recommendations, the ORLoss Component (OR-LC) in an organization. The proposed model integrates qualitative information as linguistic random variables, as well as risk events data from different sources using multi-dimensional fuzzy credibility concepts. The results show the stability of the proposed model with respect to the OR-LC estimation from both structural and dimensional point of views, making it an ideal tool for modeling OR from the perspective of: (a) the regulators (Basel Committee on Banking Supervision) by allowing the integration of experts' criteria into the OR-LC; (b) the insurers by allowing the integration of risk events from different sources; and (c) organizations and financial entities by allowing the a priori evaluation of the OR-LC of new financial products based on technological platforms and electronic channels. (C) 2021 Elsevier B.V. All rights reserved.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "deep learning",
    "cache_key": "bdd66c268ad4bf22fbafa00b53428967",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "neural network",
      "convolutional neural network",
      "CNN"
    ],
    "stage1_timestamp": "2025-05-15T01:41:29.884495"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是开发一个模糊卷积深度学习模型，用于估计操作风险资本（OR-LC），这直接涉及金融机构在操作风险管理方面的应用，符合金融风险管理的范畴。论文明确提到了Basel II和Basel III框架，这些都是金融风险管理的重要标准。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是开发一个模糊卷积深度学习模型，用于估计操作风险资本（OR-LC），这直接涉及金融机构在操作风险管理方面的应用，符合金融风险管理的范畴。论文明确提到了Basel II和Basel III框架，这些都是金融风险管理的重要标准。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:02:26.944700"
}