{
  "paper": {
    "id": 3537,
    "title": "The dynamic network of industries in US stock market: Evidence of GFC, COVID-19 pandemic and Russia-Ukraine war",
    "abstract": "We investigate the topology of sectoral returns in the US stock market using minimum spanning tree (MST) analysis. We examine four distinct time periods: the full period, the Global Financial Crisis (GFC), the COVID-19 pandemic, and the Russia-Ukraine war period. By comparing the static results across these periods, we identify differences in the network structure. Additionally, a rolling window analysis is conducted to explore the time-varying nature of the MST. We employ a TVP-VAR based connectedness framework to ensure a robust analysis of the sectoral return linkages. Our main findings are summarized as follows: First, the structure of the MST varies in different periods, with distinct crisis period structures. During the GFC, the industrial sector dominated clustering, whereas COVID-19 affected the financial, IT, and industrial sectors. The Russia-Ukraine war period showed clustering centered on materials, except in the industrial sector. These varying structures may explain the different characteristics of each crisis. Second, both static and rolling window analyses highlight the significance of the industrial sector in the US stock market. Third, the utilities sector exhibits the lowest centrality measures, indicating its minimal importance and lack of relationships with other industries. These findings provide valuable insights into the interrelationships among industries in the US stock market. Market participants can leverage these findings to enhance their understanding and improve their portfolio management. By utilizing this information, investors can develop optimal diversification strategies to maximize returns and minimize risk.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "dd05075bba809c801de1eb131f4abf28",
    "relevant_keywords": [
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T02:27:19.103994"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文通过分析美国股票市场中不同行业间的网络结构及其在危机时期的变化，为投资者提供了优化投资组合和分散风险的策略，这直接关联到投资组合管理领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文通过分析美国股票市场中不同行业间的网络结构及其在危机时期的变化，为投资者提供了优化投资组合和分散风险的策略，这直接关联到投资组合管理领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:36:00.922964"
}