{
  "paper": {
    "id": 3421,
    "title": "Too much or less? The effect of financial literacy on resident fraud victimization",
    "abstract": "Fraud not only damages the wealth and reputation of individuals, but also poses a threat to social security. Although the relationship between financial literacy and resident fraud victimization has been discussed in recent studies, previous research has ignored the ways in which residents make psychological decisions when faced with fraud, and findings have not been agreed upon. The purpose of this study is whether and how financial literacy influences fraud victimization in the risky decision-making process. Under dual process theories, this study constructs regression models using the survey sample (N = 16352) from the China Household Finance Survey (CHFS). Our findings show that there is a U-shaped relationship between financial literacy and fraud victimization, and that this relationship is heterogeneous across gender. Further analysis found a moderating effect of Subjective Risk Attitudes (SRA) on this relationship, with risk preferences causing the U-shaped relationship between financial literacy and resident fraud victimization to gradually shift to a monotonic positive relationship. In addition, we consider the problem of endogeneity, which has been neglected in previous studies, and construct a new instrumental variable to address endogeneity. Our study provides some new insights into the behavioral analysis of residents' economic decisions.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "a4bc5d6cb4bf5025f7085f738100972e",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:26:09.126382"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究金融素养与居民欺诈受害之间的关系，涉及行为经济学和心理学决策过程，但并未直接涉及衍生品定价、金融风险管理或投资组合管理等金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究金融素养与居民欺诈受害之间的关系，涉及行为经济学和心理学决策过程，但并未直接涉及衍生品定价、金融风险管理或投资组合管理等金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:36:49.258170"
}