{
  "paper": {
    "id": 879,
    "title": "The Construction of Corporate Financial Management Risk Model Based on XGBoost Algorithm",
    "abstract": "Corporate financial management is a tedious task, and it is a complicated thing to rely solely on the human resources of financial personnel to manage. With the continuous development of intelligent algorithms and machine learning algorithms, new ideas have been brought to enterprise financial risk assessment. This method will not only save a lot of financial and material resources but also improve the accuracy of enterprise financial risk assessment. Compared with machine learning algorithms such as random forests and support vector machines, the extreme gradient boosting (XGBoost) algorithm is more widely used, and it has unique advantages in terms of speed and accuracy. This study selects the XGBoost learning algorithm to predict the risk assessment in corporate finance. In this study, the data preprocessing method is used to preprocess and classify the enterprise financial data source effectively, and then the XGBoost algorithm is used to assess the risk of enterprise financial data, and finally a set of enterprise financial risk assessment model is established. The research results show that the XGBoost model selected in this paper has high reliability in predicting the financial risk assessment of enterprises, and the prediction errors are all within 3%. The largest forecast error is only 2.68%, which comes from the profit and loss of the enterprise's financial situation. The smallest error is only 0.56%, which is a trustworthy enough error for corporate financial forecasting. There is a high correlation between the type of enterprise financial risk assessment and the actual type of risk. At the same time, this paper also has a good dependence on the preprocessing method of enterprise financial data.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "a733b767501ecac2a6d5806af26e07d4",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T01:56:17.508260"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要研究使用XGBoost算法构建企业财务风险评估模型，旨在提高企业财务风险预测的准确性，这直接属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"该论文主要研究使用XGBoost算法构建企业财务风险评估模型，旨在提高企业财务风险预测的准确性，这直接属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:53:56.239314"
}