{
  "paper": {
    "id": 2829,
    "title": "Nonlinear ARIMA Models with Feedback SVR in Financial Market Forecasting",
    "abstract": "In recent years, as global financial markets have become increasingly connected, the degree of correlation between financial assets has become closer, and technological advances have made the transmission of information faster and faster, and information networks have integrated capital markets into one, making it easier for single financial market risk problems to form systemic risk through a high degree of market linkage effects. Based on the characteristics of financial markets containing both linear and nonlinear components, this paper chooses to use Autoregressive Integrated Moving Average (ARIMA) model and feedback Support Vector Regression (SVR) models to effectively integrate the ARIMA model and the SVR model, taking into account their respective linear and nonlinear characteristics. The paper chooses to use the (Autoregressive Integrated Moving Average (ARIMA) model and feedback Support Vector Regression (SVR) models to effectively integrate the strengths of the ARIMA and SVR models in terms of linearity and nonlinearity to perform forecasting analysis of financial markets. One of the important functions of forecasting is to transform future uncertainty into measurable risk, so that we can base our plans and actions on it. In this paper, the combined ARIMA-SVR model is compared with the single ARIMA model and SVR model in terms of the mean absolute error (MAE), root mean square error (RMSE), and mean absolute percentage error (MAPE), where MAE and RMSE measure the absolute error between the predicted and true values, and MAPE measures the relative error between the predicted and true values. and the relative error between the true value. The results show that the combined ARIMA-SVR model has a better forecasting effect and higher forecasting accuracy than the single ARIMA model and SVR model, and the SVR model has higher forecasting accuracy than the ARIMA model in forecasting financial markets.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "a4a3a63da383806a6911bc50a9ad4c7f",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "regression",
      "support vector machine",
      "SVM"
    ],
    "stage1_timestamp": "2025-05-15T02:19:46.630835"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要研究金融市场的预测分析，目的是将未来的不确定性转化为可测量的风险，这直接关联到金融风险管理领域。论文中提到的模型比较和预测准确性评估都是为了更好地理解和控制金融市场的风险。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文主要研究金融市场的预测分析，目的是将未来的不确定性转化为可测量的风险，这直接关联到金融风险管理领域。论文中提到的模型比较和预测准确性评估都是为了更好地理解和控制金融市场的风险。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:39:45.784397"
}