{
  "paper": {
    "id": 8949,
    "title": "Determinants of depressive symptoms increase in older persons during the COVID-19 pandemic: evidence from Czech cohort study using repeated assessments",
    "abstract": "BackgroundNumerous studies reported higher levels of mental health issues during the COVID-19 pandemic but only a minority used repeated measurements. We investigated change in depressive symptoms in the Czech ageing cohort and the impact of pre-existing and COVID-19-related stressors. MethodsWe used data on 2853 participants (mean age 73.4 years) from the Czech part of the prospective Health, Alcohol and Psychosocial factors In Eastern Europe cohort that participated in postal questionnaire surveys before (September 2017-June 2018) and during the pandemic (October 2020-April 2021). Participants reported their depressive symptoms using the Centre for Epidemiological Studies-Depression Scale including 10 (CESD-10) tool. A principal component analysis (PCA) was used to create representative components of the pandemic-related stressors. The impact of the stressors on change in depressive symptoms was tested using multivariable linear regression, after adjustment for age and potential confounders. ResultsThree patterns of the pandemic-related stressors ('financial stressors', 'social and perception stressors' and 'death and hospitalisation stressors') were extracted from the PCA. The mean CESD-10 score increased from 4.90 to 5.37 (p<0.001). In fully adjusted models, significantly larger increases in depression score were reported by older people (beta=0.052; p=0.006), those with poor self-rated health (beta=0.170; p<0.001), those who experienced death or hospitalisation of a close person (beta=0.064; p<0.001), social deprivation (beta=0.057; p<0.001), delays in healthcare (beta=0.048; p=0.005) and those who suffered from COVID-19 (beta=0.045; p=0.008). ConclusionThis study confirms an increase in depressive symptoms in older persons during the pandemic and identified several pandemic-related risk factors suggesting that public health policies should address this vulnerable group by adopting the preventing strategies.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "d4a6dd6f816e4180f83b65093b348dfb",
    "relevant_keywords": [
      "principal components analysis"
    ],
    "stage1_timestamp": "2025-05-15T03:23:56.130735"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究老年人在COVID-19大流行期间抑郁症状增加的影响因素，使用了主成分分析（PCA）来识别与大流行相关的压力源。其研究内容属于心理健康和公共卫生领域，与衍生品定价、金融风险管理或投资组合管理无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究老年人在COVID-19大流行期间抑郁症状增加的影响因素，使用了主成分分析（PCA）来识别与大流行相关的压力源。其研究内容属于心理健康和公共卫生领域，与衍生品定价、金融风险管理或投资组合管理无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:25:13.395738"
}