{
  "paper": {
    "id": 481,
    "title": "A prediction model for the secure issuance scale of Chinese local government bonds",
    "abstract": "Purpose The purpose of this paper is to calculate the local guaranteed fiscal revenue with the local fiscal revenue of 31 provinces, and predict their guaranteed fiscal revenue in 2018 with the artificial neural network (ANN). Design/methodology/approach The principal components analysis (PCA), particle swarm optimization (PSO) and extreme learning machine (ELM) model was designed to produce the inputs of KMV model. Then the KMV model was used for obtaining the default probabilities under different issuance scales. Data were collected from Wind Database. MATLAB 2018b and SPSS 22 were used in the field of modeling and results analysis. Findings This study's findings show that PCA-PSO-ELM proposed in this research has the highest accuracy in terms of the prediction compared with ELM, back propagation neural network and auto regression. And PCA-PSO-ELM-KMV model can calculate the secure issuance scale of local government bonds effectively. Practical implications The sustainability forecast in this study can help local governments effectively control the scale of debt issuance, strengthen the budget management of local debt and establish the corresponding risk warning mechanism, which could make local governments maintain good credit ratings. Originality/value This study sheds new light on helping local governments avoid financial risks effectively, and it is conducive to establish a debt repayment reserve system for local governments and the proper arrangement for stock debt.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "556da6d7f2629b6e74311a32c17f7f86",
    "relevant_keywords": [
      "machine learning",
      "neural network",
      "backpropagation",
      "BP",
      "principal components analysis"
    ],
    "stage1_timestamp": "2025-05-15T01:51:31.246021"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on predicting the secure issuance scale of local government bonds and calculating default probabilities using the KMV model, which are key aspects of financial risk management aimed at controlling debt issuance and establishing risk warning mechanisms.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on predicting the secure issuance scale of local government bonds and calculating default probabilities using the KMV model, which are key aspects of financial risk management aimed at controlling debt issuance and establishing risk warning mechanisms.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:57:38.605183"
}