{
  "paper": {
    "id": 1210,
    "title": "Early warning model of credit risk for family farms and ranches in Inner Mongolia based on Probit regression-Kmeans clustering",
    "abstract": "Early warning models credit risk play a crucial role in helping the financial institutions to reasonably predict the credit status of family farms and ranches. An attempt is made in this paper to construct a new credit risk early warning model based on Probit regression and Kmeans clustering algorithm, and testing the model by using data from 246 family farms in 12 leagues and cities in Inner Mongolia. First, the credit risk evaluation indicators of family farms and ranches were screened out through a three-combination model with partial correlation analysis, tolerance analysis and Probit regression. Second, the ratios of the Z-squared statistic of a single indicator to the sum of the Z-squared statistics of all the selected indicators were used to measure the weights of the credit evaluation indicators. Finally, four warning levels containing heavy alert level I, medium alert level II, light alert level III and no alert level IV were classified by Kmeans clustering with large intra-cluster similarity and small inter-cluster similarity. The empirical evidence shows that the early warning model of credit risk for family farms and ranches is effective.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "a95277213835fbb9a14d99fa651e3737",
    "relevant_keywords": [
      "unsupervised learning",
      "classification",
      "regression",
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T01:59:56.420331"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是构建一个基于Probit回归和Kmeans聚类的信用风险预警模型，用于预测家庭农场和牧场的信用状况，这直接属于金融风险管理中的信用风险管理范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"该论文的核心技术是构建一个基于Probit回归和Kmeans聚类的信用风险预警模型，用于预测家庭农场和牧场的信用状况，这直接属于金融风险管理中的信用风险管理范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:50:56.137657"
}