{
  "paper": {
    "id": 4004,
    "title": "Sustainability risk in insurance companies: A machine learning analysis",
    "abstract": "Sustainable development constitutes a global challenge today, and the sustainable development goals (Agenda 2030) will probably set the course for the coming decades. This paper discusses sustainability in insurance companies by combining two aspects: a social approach (the environmental impact) and a business approach (the prediction of claims due to climate change). Our objective is to analyse the impact of physical risk in a home insurance portfolio and to measure in economic terms the effect of climate change in the future, by applying machine learning methodologies. Two data sources are used: a Spanish insurance portfolio with 31,998 policies and claims from 2017 to 2022, and daily meteorological variables from 290 Spanish weather stations from 2000 to 2022. Two climate scenarios are considered: RCP 4.5 (medium impact) and RCP 8.5 (high impact). On average for the period 2023-2052, the results reveal that claims will increase by 105% for the 4.5 scenario and by 129% for the 8.5 scenario. Our paper makes a clear contribution to sustainability by analysing climate risks and their impact on an insurance portfolio. It shows the grave consequences of climate change for the insurance sector's solvency and the political implications for the financial system in general.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "c20476b2e985377d36c8fc2f8fb05a8b",
    "relevant_keywords": [
      "machine learning",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:31:58.711194"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要研究气候变化对保险索赔的影响，并利用机器学习方法预测未来的索赔风险，这属于金融风险管理的范畴，特别是对保险公司面临的可持续性风险进行评估和管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文主要研究气候变化对保险索赔的影响，并利用机器学习方法预测未来的索赔风险，这属于金融风险管理的范畴，特别是对保险公司面临的可持续性风险进行评估和管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:34:42.279054"
}