{
  "paper": {
    "id": 3142,
    "title": "Volatility driven changes in stock return correlation dynamics",
    "abstract": "Purpose - The purpose of the paper is to study the relationship between stock return correlation and volatility. Design/methodology/approach - Utilizing a logit-type regression model, the paper analyzes the incremental effect of volatility on the level of correlation. The focus of the paper is set on the impact of the volatilities involved in the definition and calculation of the correlation as well as on the effects of external volatilities from other markets. Findings - In the paper, an explicit model was constructed to investigate the contribution of the level of volatility on mutual correlations of the markets. The empirical results strongly support the findings that high volatility tends to increase correlations between the markets (see for example). An analysis of the small Nordic markets further showed that the local volatilities may play a role in the change of the level of correlation. However, it is the general world-wide volatility level that mainly drives the changes in the correlations. Originality/value - Particularly, the results of the paper show that market correlations tend to be dependent on the general world-wide volatility rather than on local volatilities of single markets. This approach gives us important information about the behavior of the correlation with respect to the level of each market's risk as well as to the general global market-risk level. The results can be directly utilized by portfolio managers in planning portfolio diversification strategies in accordance with the expected future volatility.",
    "year": 2007,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "acfa6776967608a860c7c43e7df97a7c",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:14:16.124269"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文研究了股票回报相关性与波动率之间的关系，并明确指出其研究结果可直接用于投资组合经理在规划投资组合多样化策略时参考，这属于投资组合管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文研究了股票回报相关性与波动率之间的关系，并明确指出其研究结果可直接用于投资组合经理在规划投资组合多样化策略时参考，这属于投资组合管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:10:37.790015"
}