{
  "paper": {
    "id": 4940,
    "title": "Market Openness and Its Relationship to Connecting Markets Due to COVID-19",
    "abstract": "In this research, statistical models were formulated to study the effect of the health crisis arising from COVID-19 in economic markets. Economic markets experience economic crises irrespective of effects corresponding to financial contagion. This investigation was based on a mixed linear regression model that contains both fixed and random effects for the estimation of parameters and a mixed linear regression model corresponding to the generalisation of a linear model using the incorporation of random deviations and used data on the evolution of the international trade of a group of 42 countries, in order to quantify the effect that COVID-19 has had on their trade relationships and considering the average state of trade relationships before the global pandemic was declared and its subsequent effects. To measure, quantify and model the effect of COVID-19 on trade relationships, three main indicators were used: imports, exports and the sum of imports and exports, using six model specifications for the variation in foreign trade as response variables. The results suggest that trade openness, measured through the trade variable, should be modelled with a mixed model, while imports and exports can be modelled with an ordinary linear regression model. The trade relationship between countries with greater economic openness (using imports and exports as a trade variable) has a higher correlation with the country's health index and its effect on the financial market through its main trading index; the same is true for country risk. However, regarding the association with OECD membership, the relations are only with imports.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "ff1a06a8eb9e4160c38fef43cda07b77",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:42:36.181439"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究COVID-19对国际贸易关系的影响，使用了统计模型来分析贸易开放度与健康危机之间的关系。虽然涉及金融市场的一些指标，但核心研究并不专注于衍生品定价、金融风险管理或投资组合管理等特定金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究COVID-19对国际贸易关系的影响，使用了统计模型来分析贸易开放度与健康危机之间的关系。虽然涉及金融市场的一些指标，但核心研究并不专注于衍生品定价、金融风险管理或投资组合管理等特定金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:31:31.946221"
}