{
  "paper": {
    "id": 1440,
    "title": "Artificial Intelligence risk measurement",
    "abstract": "Financial institutions are increasingly leveraging on advanced technologies, facilitated by the availability of Machine Learning methods that are being integrated into several applications, such as credit scoring, anomaly detection, internal controls and regulatory compliance. Despite their high predictive accuracy, Machine Learning models may not provide sufficient explainability, robustness and/or fairness; therefore, they may not be trustworthy for the involved stakeholders, such as business users, auditors, regulators and end-customers. To measure the trustworthiness of AI applications, we propose the first Key AI Risk Indicators (KAIRI) framework for AI systems, considering financial services as a reference industry. To this aim, we map the recently proposed regulatory requirements proposed for Artificial Intelligence Act into a set of four measurable principles (Sustainability, Accuracy, Fairness, Explainability) and, for each of them, we propose a set of interrelated statistical metrics that can be employed to measure, manage and mitigate the risks that arise from artificial intelligence. We apply the proposed framework to a collection of case studies, that have been indicated as highly relevant by the European financial institutions we interviewed during our research activities. The results from data analysis indicate that the proposed framework can be employed to effectively measure AI risks, thereby promoting a safe and trustworthy AI in finance.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "62b70989c7b4b6a3d0feb5dd23e0ee9a",
    "relevant_keywords": [
      "machine learning"
    ],
    "stage1_timestamp": "2025-05-15T02:03:00.700456"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on measuring the trustworthiness of AI applications in financial services, specifically addressing risks related to AI systems such as explainability, robustness, and fairness. This aligns with the domain of Financial Risk Management, as it aims to manage and mitigate risks arising from AI in financial institutions.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on measuring the trustworthiness of AI applications in financial services, specifically addressing risks related to AI systems such as explainability, robustness, and fairness. This aligns with the domain of Financial Risk Management, as it aims to manage and mitigate risks arising from AI in financial institutions.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:49:02.642505"
}