{
  "paper": {
    "id": 1067,
    "title": "Identifying Students At-Risk with an Ensemble of Machine Learning Algorithms",
    "abstract": "Accurately predicting the academic performance of students is an important process for the long term sustainability of higher education institutions (HEIs). A reliable and timely identification of students at-risk will enable HEIs to take proactive measures to assist these students. Owing to large student numbers with varying backgrounds, identifying students at-risk is often primarily a manual process involving an analysis of students' prior academic results and little else. While prior academic results do play an important role in indentifying students at-risk, there could be several other factors that may be overlooked. The demographic and financial circumstances of the student for instance could play a key role in more accurately identifying students at-risk. It may be impractical to consider all of these factors when manually trying to identify students at-risk. We propose that classification models using an ensemble of machine learning algorithms (MLAs) have promising prospects to more effectively predict students at-risk by including several factors that may often not even be practical with manual methods.",
    "year": 2019,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "ad92a5ab140a82857b69335194d94bc6",
    "relevant_keywords": [
      "machine learning",
      "classification",
      "ensemble of machine learning algorithms"
    ],
    "stage1_timestamp": "2025-05-15T01:58:43.346350"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究使用机器学习算法预测学生的学术表现，属于教育技术领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究使用机器学习算法预测学生的学术表现，属于教育技术领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:52:19.893231"
}