{
  "paper": {
    "id": 1850,
    "title": "Sustainable Adaptation Planning for Cultural Heritage in Coastal Tourism Destinations Under Climate Change: A Mixed-Paradigm of Preservation and Conservation Optimization",
    "abstract": "Fragmented guidance and unbalanced climate adaptation efforts for tangible and intangible cultural heritage are challenging the long-term sustainability of coastal tourism destinations. Conceptualizing and quantifying adaptation paradigms that optimize cultural heritage preservation from multi-faceted perspectives under fiscal constraints is highly prioritized by coastal tourism destinations. Informed by the Modern Portfolio Theory, this study developed, tested, and evaluated four adaptation paradigms using machine-learning approaches to optimize the historical significance, tangible, and intangible values of multi-type cultural heritage in Gulf Island National Seashore across a 30-year planning horizon under varying fiscal constraints. Results indicated that adaptation paradigms can provide transformative and flexible preservation portfolios to preserve tangible and intangible uses when facing degradation or loss from inadequate funding and intensifying climate threats. The mixed-paradigm framework optimizes preservation efforts between tangible and intangible cultural heritage quantitatively and can be generalized to coastal tourism destinations globally as a sustainable climate adaptation decision support tool.",
    "year": 2024,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "78ecc3be7e86b2228eeaf425edc0d8b9",
    "relevant_keywords": [
      "machine learning"
    ],
    "stage1_timestamp": "2025-05-15T01:00:27.299745"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究文化遗产生态适应规划，虽然提到了现代投资组合理论（Modern Portfolio Theory），但其核心应用是优化文化遗产的保护和保存，而非金融领域的投资组合管理、衍生品定价或金融风险管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究文化遗产生态适应规划，虽然提到了现代投资组合理论（Modern Portfolio Theory），但其核心应用是优化文化遗产的保护和保存，而非金融领域的投资组合管理、衍生品定价或金融风险管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:18:41.592265"
}