{
  "paper": {
    "id": 84,
    "title": "Credit scoring by feature-weighted support vector machines",
    "abstract": "Recent finance and debt crises have made credit risk management one of the most important issues in financial research. Reliable credit scoring models are crucial for financial agencies to evaluate credit applications and have been widely studied in the field of machine learning and statistics. In this paper, a novel feature-weighted support vector machine (SVM) credit scoring model is presented for credit risk assessment, in which an F-score is adopted for feature importance ranking. Considering the mutual interaction among modeling features, random forest is further introduced for relative feature importance measurement. These two feature-weighted versions of SVM are tested against the traditional SVM on two real-world datasets and the research results reveal the validity of the proposed method.",
    "year": 2013,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "9e2cff17ad56489987b999dfa4040540",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM",
      "decision tree",
      "feature learning"
    ],
    "stage1_timestamp": "2025-05-15T01:46:39.571945"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on developing a credit scoring model using feature-weighted SVMs for credit risk assessment, which is a key component of financial risk management, specifically in evaluating credit applications and managing credit risk.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on developing a credit scoring model using feature-weighted SVMs for credit risk assessment, which is a key component of financial risk management, specifically in evaluating credit applications and managing credit risk.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:01:09.277133"
}