{
  "paper": {
    "id": 7725,
    "title": "Predicting Extreme Daily Regime Shifts in Financial Time Series Exchange/Johannesburg Stock Exchange-All Share Index",
    "abstract": "During the past decades, seasonal autoregressive integrated moving average (SARIMA) had become one of a prevalent linear models in time series and forecasting. Empirical research advocated that forecasting with non-linear models can be an encouraging alternative to traditional linear models. Linear models are often compared to non-linear models with mixed conclusions in terms of superiority in forecasting performance. Therefore, the aim of this study is to build an early warning system (EWS) model for extreme daily losses for financial stock markets. A logistic model tree (LMT) is used in collaboration with a seasonal autoregressive integrated moving average-Markov-Switching exponential generalised autoregressive conditional heteroscedasticity-generalised extreme value distribution (SARIMA-MS-EGARCH-GEVD) estimates. A time series of the study is a five-day financial time series exchange/Johannesburg stock exchange-all share index (FTSE/JSE-ALSI) for the period of 4 January 2010 to 31 July 2020. The study is set into a two-stage framework. Firstly, SARIMA model is fitted to stock returns in order to obtain independently and identically distributed (i.i.d) residuals and fit the MS(k)-EGARCH(p,q)-GEVD to i.i.d residuals; while, in the second stage, we set-up an EWS model. The results of the estimated MS(2)-EGARCH(1,1) -GEVD revealed that the conditional distribution of returns is highly volatile giving the expected duration to approximately 36 months and 4 days in regime one and 58 months and 2 days in regime two. We further found that any degree losses above 25% implies that there will be no further losses. Using the seven statistical loss functions, the estimated SARIMA(2,1,0) x (2,1,0)(240) - MS(2) - EGARCH(1,1) - GEVD proved to be the most appropriate model for predicting extreme regimes losses as it was ranked at 71%. Finally, the results of EWS model exhibit reasonably an overall performance of 98%, sensitivity of 79.89% and specificity of 98.40% respectively. The model further indicated a success classification rate of 89% and a prediction rate of 95%. This is a promising technique for EWS. The findings also confirmed 63% and 51% of extreme losses for both training sample and validation sample to be correctly classified. The findings of this study are useful for decision makers and financial sector for future use and planning. Furthermore, a base for future researchers for conducting studies on emerging markets, have been contributed. These results are also important to risk managers and and investors.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "2be343193b46417ca88f7b58807a10e7",
    "relevant_keywords": [
      "classification",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T03:11:38.441540"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on building an early warning system (EWS) model for extreme daily losses in financial stock markets, which is directly related to identifying and managing financial risks. The use of SARIMA-MS-EGARCH-GEVD models and logistic model trees (LMT) for predicting extreme regime shifts and losses aligns with the objectives of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on building an early warning system (EWS) model for extreme daily losses in financial stock markets, which is directly related to identifying and managing financial risks. The use of SARIMA-MS-EGARCH-GEVD models and logistic model trees (LMT) for predicting extreme regime shifts and losses aligns with the objectives of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:26:13.522389"
}