{
  "paper": {
    "id": 5835,
    "title": "Approval of an Arrangement in the Restructuring Proceedings and the Financial Condition of Companies Listed on the Stock Exchanges in Warsaw. Is There Any Relationship?",
    "abstract": "This paper attempts to identify the financial indicators differentiating companies that are insolvent or at risk of insolvency and have successfully entered into an arrangement with their creditors from those that have not. In addition, a two-factor model for predicting the odds of an arrangement has been proposed. The research was conducted using a population of companies listed on stock exchanges in Warsaw that initiated restructuring proceedings between October 2004 and 31 December 2020. Binary logistic regression was used as the research method. The research shows that the financial health of public companies in Poland, as measured by various financial indicators, has little impact on the effectiveness of a debtor-creditor arrangement. The main measure showing discriminatory features between groups of successful and unsuccessful entities is the share of short-term liabilities in total liabilities. A statistically significant influence was also recorded for the indicator showing the share of short-term receivables in the total assets. Furthermore, a statistically significant discriminatory power for both groups was recorded for the indicator showing the ratio of inventories to sales revenue. However, in this situation the selection of this measure was due to the industry diversity of the research population. The identification of these determinants and the proposed model may help courts and supervisors to divide insolvent companies into those that should be subject to liquidation or restructuring procedures at an early stage of the proceedings. Consequently, this can significantly reduce the direct and indirect costs of implementing bankruptcy proceedings.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "3e9178657da5c3874c28099d0a364d1f",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:51:58.582247"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究公司财务健康状况与债务重组成功之间的关系，并提出了一个预测模型。虽然涉及财务指标和风险管理的一些概念，但其核心研究并不直接涉及衍生品定价、金融风险管理或投资组合管理等特定金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究公司财务健康状况与债务重组成功之间的关系，并提出了一个预测模型。虽然涉及财务指标和风险管理的一些概念，但其核心研究并不直接涉及衍生品定价、金融风险管理或投资组合管理等特定金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:29:36.179620"
}