{
  "paper": {
    "id": 1405,
    "title": "A k-means plus plus -improved radial basis function neural network model for corporate financial crisis early warning: an empirical model validation for Chinese listed companies",
    "abstract": "An early warning of corporate financial crises has long been the focus of investors and enterprises. Integrated early warning models for financial crises perform better than normal models, but most integrated models are very complex, elusive and computationally time-consuming. This paper aims to simplify the early warning model for financial crises by collecting and analyzing the financial data of Chinese special treatment (ST) companies, normally listed companies and cancel special treatment (CST) companies. To further predict the financial risks of companies, we put forward a finance-predicting model based on the k-means++ algorithm and an improved radial basis function neural network (RBF NN), and we compare their respective statistics. We indicate by experiment that combining k-means++ with the improved RBF NN helps to better predict financial risks for companies, which is effective in the risk control of financial management.",
    "year": 2020,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "3a346a861e091ba7e5834e60fb01ccd8",
    "relevant_keywords": [
      "machine learning",
      "unsupervised learning",
      "classification",
      "clustering",
      "neural network",
      "radial basis function",
      "RBF"
    ],
    "stage1_timestamp": "2025-05-15T02:02:22.781333"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on developing an early warning model for corporate financial crises using machine learning techniques, specifically for predicting financial risks and aiding in risk control, which falls under the domain of Financial Risk Management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on developing an early warning model for corporate financial crises using machine learning techniques, specifically for predicting financial risks and aiding in risk control, which falls under the domain of Financial Risk Management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:49:05.642176"
}