{
  "paper": {
    "id": 618,
    "title": "The Global Organizational Behavior Analysis for Financial Risk Management Utilizing Artificial Intelligence",
    "abstract": "Enterprise financial risks are analyzed utilizing the theory of organizational behavior, and a financial risk management system is constructed to improve the design and algorithm of the enterprise risk management system. Based on the CCER (China Center for Economic Research) database, the early warning model for enterprise financial risk management containing five indices is proposed for enterprises. Through logistic regression analysis, the design principle of the financial risk management system based on AI (artificial intelligence) technology is explained. The proposed system innovatively introduces the AI-integrated learning method, optimizes objective function through XGBoost (extreme gradient boosting) algorithm, and trains the model through BP (backpropagation) NN (neural network). Finally, following comparative analysis, the effectiveness of the proposed method is verified.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "d735ab84a6be059bda25f6a85cb895eb",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "regression",
      "neural network",
      "deep learning",
      "backpropagation",
      "BP",
      "XGBoost"
    ],
    "stage1_timestamp": "2025-05-15T01:53:24.744956"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on constructing a financial risk management system for enterprises using AI techniques, specifically mentioning the development of an early warning model for financial risk management. The application of AI-integrated learning methods and optimization algorithms like XGBoost and BP neural networks is aimed at improving enterprise risk management, which clearly falls under the Financial Risk Management domain.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on constructing a financial risk management system for enterprises using AI techniques, specifically mentioning the development of an early warning model for financial risk management. The application of AI-integrated learning methods and optimization algorithms like XGBoost and BP neural networks is aimed at improving enterprise risk management, which clearly falls under the Financial Risk Management domain.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:56:18.518441"
}