{
  "paper": {
    "id": 2142,
    "title": "Incorporating machine learning and a risk-based strategy in an anti-money laundering multiagent system",
    "abstract": "Over the last decade, the international community has become more aware of the danger and harm caused by the practice of the crime of Money Laundering (ML). Organizations to combat this crime were created and the existing laws were expanded and tightened. Complex legislation, combined with the increase in the volume of financial transactions involved in money laundering schemes, motivated research targeting the improvement and automation of the critical processes of detecting, signaling and communicating suspicious clients. The Anti-Money Laundering (AML) activity is strongly impacted and dependent on this process, which has evolved slowly, in part due to its subjectivity and complexity. This article presents the characteristics of a multiagent system that incorporates machine learning and risk components to identify and flag suspicious bank clients. It also seeks to help human specialists in the analysis of suspicious behavior by these clients. The knowledge bases are obtained through data mining over a real database, obtaining for each client a transactional behavior pattern, enriched with specific rules based on legal aspects, and on the expertise of the AML analysts of the financial institution that funds this research. The adopted risk strategy seeks to identify and classify the ML risk level of each flagged client. To evaluate its results, the system analyzed six months of actual transactions. A set of candidate clients was produced and subsequently investigated by the financial institution's AML analysts, who proved a high degree of correctness in the indicated suspicions, including cases that were not flagged by the antecedent systems in execution for decades at the institution.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "258ba1b3518a866a925c7c228a10462e",
    "relevant_keywords": [
      "machine learning",
      "classification",
      "data mining"
    ],
    "stage1_timestamp": "2025-05-15T02:11:40.592916"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要研究利用机器学习和多智能体系统来识别和标记可疑的银行客户，以帮助反洗钱（AML）活动。这属于金融风险管理范畴，因为它涉及识别和管理与洗钱相关的金融风险。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文主要研究利用机器学习和多智能体系统来识别和标记可疑的银行客户，以帮助反洗钱（AML）活动。这属于金融风险管理范畴，因为它涉及识别和管理与洗钱相关的金融风险。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:44:05.059151"
}