{
  "paper": {
    "id": 546,
    "title": "P2P credit risk management with KG-GNN: a knowledge graph and graph neural network-based approach",
    "abstract": "Credit risk management is crucial for the credit loan decision-making process on P2P platforms, essential for mitigating credit defaults. The rapid decline of China's P2P platform market highlights the urgent need for Internet financial institutions to enhance their credit risk management strategies. Previous studies have applied machine learning to assess credit risk; however, their effectiveness is often hampered by a lack of consideration for semantic information and individual correlation. In response, we propose an innovative approach, KG-GNN, which integrates knowledge graph (KG) and graph neural network (GNN). KG-GNN leverages KG to encapsulate semantic information within complex categorical features and explore potential relationships between borrowers. Utilizing GNN, our framework extracts representation features from the KG to build comprehensive and accurate credit risk models. Our findings indicate that KG-GNN not only can predict credit risk more accurately than conventional machine learning models but also improves the stream model performance by over 20% through KG and GNN-based data augmentation techniques. By integrating KG with GNN, our approach enriches the methodologies for credit risk management and can be adapted to other data mining challenges that require processing complex semantic and relational information, thereby enhancing model learning capabilities.",
    "year": 2025,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "7453489a3a2c8a9b5760d1a99fc7e600",
    "relevant_keywords": [
      "machine learning",
      "classification",
      "neural network",
      "deep learning",
      "representation learning",
      "graph neural network",
      "GNN"
    ],
    "stage1_timestamp": "2025-05-15T01:52:12.269110"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on credit risk management for P2P lending platforms, which is a key aspect of financial risk management. The proposed KG-GNN model aims to enhance credit risk prediction by integrating knowledge graphs and graph neural networks, directly addressing the need for better risk assessment in financial institutions.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on credit risk management for P2P lending platforms, which is a key aspect of financial risk management. The proposed KG-GNN model aims to enhance credit risk prediction by integrating knowledge graphs and graph neural networks, directly addressing the need for better risk assessment in financial institutions.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:57:03.883967"
}