{
  "paper": {
    "id": 7769,
    "title": "Environmental, social and governance-type investing: a multi-stakeholder machine learning analysis",
    "abstract": "Purpose-This research delves into the determinants influencing the adoption of environmental, social and governance (ESG) investing through an analysis of social media dialogs using the uses and gratification theory. Design/methodology/approach-This study employs a mixed-methods approach, integrating sentiment analysis, topic modeling, clustering, causal loop analysis and ethnography to examine ESG-related content on social media. Analyzing social media data, study identified key themes and derived ten propositions about ESG investing. Industry professionals, financial advisors and investors further validated these findings through expert interviews. Combining data-driven analysis and qualitative insights provides a comprehensive understanding of how social media shapes investor preferences and decision-making in the ESG domain. Findings-Environmental aspects, such as conservation, preservation of natural resources, renewable and clean energy, biodiversity, restoration and eco-friendly products and technologies, shape attitudes toward ESG investing. Social considerations, including inclusivity, diversity, social justice, human rights, stakeholder engagement, transparency, community development and philanthropy, significantly influence ESG investing sentiments. Governance elements such as transparency, accountability, ethical governance, compliance, risk management, regulatory compliance and responsible leadership also play a pivotal role in shaping ESG investing opinions. Practical implications-This study presents actionable insights for policymakers and organizations by identifying key constructs in ESG investing and proposing an integrated framework that includes mediating factors like resource efficiency and stakeholder engagement alongside moderating elements such as regulatory environment and investor preferences. Policymakers should establish standardized ESG reporting frameworks, incentivize sustainable practices and use social media data for regulatory purposes. For businesses, integrating social media insights into decision-making can enhance ESG communication strategies and accountability. These measures will foster greater transparency, strengthen investor relations and contribute to a more sustainable and inclusive global economy. Originality/value-To the authors' best knowledge, this is the first study to investigate improving ESG investing preferences based on big data mined from social media platforms.",
    "year": 2025,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "fe67529d0e3268d18658a6842e13ae01",
    "relevant_keywords": [
      "machine learning",
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T03:12:11.487406"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文研究了环境、社会和治理（ESG）投资的影响因素，并利用机器学习技术分析社交媒体数据以理解投资者偏好。ESG投资通常与投资组合管理相关，因为它涉及如何选择和评估投资以符合特定的社会和环境标准。论文的研究目标和应用场景明确指向投资组合管理领域，而非衍生品定价或金融风险管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文研究了环境、社会和治理（ESG）投资的影响因素，并利用机器学习技术分析社交媒体数据以理解投资者偏好。ESG投资通常与投资组合管理相关，因为它涉及如何选择和评估投资以符合特定的社会和环境标准。论文的研究目标和应用场景明确指向投资组合管理领域，而非衍生品定价或金融风险管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:25:56.081999"
}