{
  "paper": {
    "id": 4301,
    "title": "Impacts of Ownership Structure on Systemic Risk of Listed Companies in Vietnam",
    "abstract": "The research objective of the paper is to clarify the factors influencing system risks of listed companies in Vietnam, with a focus on clarifying the relationship and quantifying the impacts of ownership structure on systemic risk of listed companies. The data used in this study included financial statements and stock price data of listed companies on the Ho Chi Minh City Stock Exchange and Hanoi Stock Exchange of Vietnam stock market in the period from 2010 to 2017. The paper used the method of estimation in establising the regression models to choose among three models: Random Effect Model, Fixed Effect Model or Pooled OLS for regression using Stata statistical software. The research results showed that state ownership and ownership by foreign investors were positively related to systemic risk, while ownership by domestic investors had a reverse relationship with systemic risk of listed companies in Vietnam. In addition, as a control variable, both company size and profitability had an effect on the systemic risk of listed companies in the research sample. Based on the research results, the authors interpreted some of the implications in order to minimize systemic risks in the operation of listed companies in Vietnam.",
    "year": 2020,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "0033822a638fe495c7f19623a57eab94",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:35:26.333683"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要研究所有权结构对上市公司系统性风险的影响，并量化了这种影响，这属于金融风险管理的范畴。论文使用了回归模型来分析风险因素，并提出了降低系统性风险的建议。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文主要研究所有权结构对上市公司系统性风险的影响，并量化了这种影响，这属于金融风险管理的范畴。论文使用了回归模型来分析风险因素，并提出了降低系统性风险的建议。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:33:50.337314"
}