{
  "paper": {
    "id": 1816,
    "title": "Distribution Estimation of Downturn LGD and Loan Portfolio Stress-Test",
    "abstract": "Macro stress-test of credit risk and estimation of downturn LGD are the main focuses in commercial bank risk management. Using Generalized Beta Regression (GBR) model, and based on LGD data of China's non-performing loans, this paper gives the estimation of LGD distribution under various macroeconomic conditions. Compared to point estimation, the distribution estimation of LGD obtained from the GBR model has the advantage of characterizing the uncertainty of the individual LGD and describing the LGD distribution, which brings more accurate estimate of portfolio credit risk. This paper proposes a macro stress test of a simulated loan portfolio. The result shows that, the fat-tail of credit loss distribution of loan portfolio is better characterized by using LGD distribution from GBR model.",
    "year": 2010,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "555bc609e54523ed7ac17ad6e3a5c755",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T00:59:53.231728"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on macro stress-testing of credit risk and estimation of downturn LGD (Loss Given Default) using Generalized Beta Regression (GBR) model, which are key components in financial risk management, particularly in assessing and managing credit risk in loan portfolios.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on macro stress-testing of credit risk and estimation of downturn LGD (Loss Given Default) using Generalized Beta Regression (GBR) model, which are key components in financial risk management, particularly in assessing and managing credit risk in loan portfolios.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:18:45.484626"
}