{
  "paper": {
    "id": 242,
    "title": "A kernel fuzzy twinSVMmodel for early warning systems of extreme financial risks",
    "abstract": "It is an important component of risk management in financial markets to develop an early warning systems (EWS) for extreme financial risk. In this paper, we establish a novel EWS called kernel fuzzy twin support vector machine (KFT-SVM). Unlike T-SVM, KFT-SVM can deal with the noises and outliners in dataset and the fuzzy dataset with a lot of potential uncertain but important factors in financial markets by introducing the fuzzy approach. More importantly, the introduced kernel method can aid the fuzzy approach to achieve more valuable fuzzy memberships by transporting dataset from the input space to the kernel space and further improve the generalization performance of T-SVM. Computational comparisons of KFT-SVM against SVM, T-SVM and FT-SVM indicate the significant superiority of our proposed KFT-SVM. Furthermore, we have investigated the favourable ability of KFT-SVM for overcoming the class imbalance problem by comparison with that combined with the resampling method of the synthetic minority over-sampling technique (SMOTE). The experimental result shows that our proposed KFT-SVM can effectively overcome the class imbalance problem.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "d2865cd99ef53ec829f5f9b31e80e951",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM"
    ],
    "stage1_timestamp": "2025-05-15T01:48:30.758286"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是开发一种用于极端金融风险早期预警系统（EWS）的核模糊孪生支持向量机（KFT-SVM），这直接应用于金融风险管理领域，旨在通过机器学习方法识别和预警潜在的金融风险。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是开发一种用于极端金融风险早期预警系统（EWS）的核模糊孪生支持向量机（KFT-SVM），这直接应用于金融风险管理领域，旨在通过机器学习方法识别和预警潜在的金融风险。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:59:52.394457"
}