{
  "paper": {
    "id": 10,
    "title": "Impact of EU non-financial reporting regulation on Spanish companies' environmental disclosure: a cutting-edge natural language processing approach",
    "abstract": "BackgroundA debate exists about the effects of environmental disclosure becoming mandatory on the quality and the actual commitment of such reporting. This study seeks to assess whether differences exist when comparing the disclosure quality and comprehensiveness of Spanish companies' non-financial reports under voluntary and mandatory reporting regimes spanning the period 2015-2022.MethodsWe present a novel approach by utilizing cutting-edge Natural Language Processing (NLP) techniques, chiefly ClimateBERT (a transformer-LLM-Large Language Model) and ClimateBERT fine-tuned on ClimaText (a public database for climate change topic detection), to scrutinize and compare 729 voluntary and mandatory non-financial corporate reports from 96 Spanish companies spanning multiple sectors. Since transformers can only be accurately estimated by organizations with lots of computing power, but not by small organizations, we have also fine-tuned the transformer, something cheaper in computational terms, thus making it affordable to all companies, investors, regulators, policymakers, and other stakeholders.ResultsOur results document interesting patterns and strong trends of enhancement in specificity and commitment, particularly in risk-related texts, spanning the period 2015-2022. We provide descriptive evidence and an explorative appeal that underscores the regulations' influence, among many other factors also identified by prior literature (other stakeholders' requirements and expectations from companies, aside from the regulatory stakeholders), in fostering a higher quality and more comprehensive approach to climate risk reporting by Spanish companies, with enhanced alignment to internationally recognized reporting guidelines. In addition, the comparative analysis between the transformer model and the fine-tuned transformer model revealed subtle yet insightful differences in how climate disclosures are interpreted. The fine-tuned model exhibited an increased sensitivity to elements of commitment, specificity, and neutrality in climate texts.ConclusionsOur findings highlight the potential of cutting-edge NLP techniques, like fine-tuned transformers, in the quantitative assessment of the evolution and quality of environmental disclosures, either mandatory or voluntary. It is the first paper applying a fine-tuned transformer-LLM to compare the currently in force European mandatory environmental disclosure regulation's impact on Spanish companies' environmental disclosure versus previous voluntary reporting.",
    "year": 2025,
    "source": "WOS",
    "area": "financial_risk",
    "method": "LLMs",
    "cache_key": "e54c451ad922a97bf24411b696118bfc",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "neural network",
      "Large Language Model",
      "LLM",
      "transformer"
    ],
    "stage1_timestamp": "2025-05-15T01:45:16.303485"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究使用自然语言处理技术分析西班牙公司在自愿和强制性报告制度下的非财务报告质量，特别是环境披露。虽然提到了风险相关的文本，但并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域的具体应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究使用自然语言处理技术分析西班牙公司在自愿和强制性报告制度下的非财务报告质量，特别是环境披露。虽然提到了风险相关的文本，但并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域的具体应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:01:58.042303"
}