{
  "paper": {
    "id": 560,
    "title": "Prediction-based portfolio selection model using support vector machines",
    "abstract": "In this paper, the rate of the returns is predicted using AR-MRNN and SVM and then the prediction-based portfolio selection model using SVM and the prediction-based portfolio selection model using AR-MRNN are proposed. Compared with the performance of the prediction of the AR-MRNN predictor and the SVM predictor, we found that the accuracy of the SVM is superior to the AR-MRNN. Compared with the performance of the prediction-based portfolio selection model using SVM and using AR-MRNN with the mean-variance portfolio selection model, we found that the former is superior to the latter. Meanwhile, we also proved that the more accuracy of the prediction achieved, the higher the rate of the returns.",
    "year": 2014,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "cd0ad708ad06b590a9b21eaccfe791c6",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "support vector machine",
      "SVM",
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T00:45:01.302162"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "The paper focuses on developing a prediction-based portfolio selection model using SVM and AR-MRNN, comparing its performance with traditional mean-variance models. This directly addresses the optimization of investment portfolios, which is a core aspect of Portfolio Management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Portfolio Management\"],\n  \"justification\": \"The paper focuses on developing a prediction-based portfolio selection model using SVM and AR-MRNN, comparing its performance with traditional mean-variance models. This directly addresses the optimization of investment portfolios, which is a core aspect of Portfolio Management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:29:36.862036"
}