{
  "paper": {
    "id": 982,
    "title": "An ensemble learning model based on SOM-SVM model for personal credit risk",
    "abstract": "Credit risk problem is an essential problem in financial management area. People usually employ personal credit scoring to avoid financial risk problem. Although many methods have been proposed for evaluating the personal credit scoring and obtained good effects, most of these methods were called single model types, which would be disturbed by model self-parameter, data noise and other external factors. In order to overcome the weakness of single model, we believe one of best ways is to construct an ensemble model. In this paper, we proposed a new style of ensemble model and employed two public credit datasets to certify the validity of our ensemble model. The experimental result shows that the ensemble SOM-SVM model can overcome the single model weakness and improve the accuracy of classification, which is good for constructing a better credit scoring system in future.",
    "year": 2011,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "e96e1caaebc57c0a87c7c6038cf81bdd",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM"
    ],
    "stage1_timestamp": "2025-05-15T01:57:29.877649"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on developing an ensemble learning model for personal credit risk assessment, which is a key aspect of financial risk management, specifically in the context of credit risk.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on developing an ensemble learning model for personal credit risk assessment, which is a key aspect of financial risk management, specifically in the context of credit risk.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:52:45.513980"
}