{
  "paper": {
    "id": 522,
    "title": "Evaluate the sustainable reuse strategy of the corporate financial management based on the big data model",
    "abstract": "Purpose The purposes are to explore corporate financial management optimization in the context of big data and provide a sustainable financial strategy for corporate development. Design/methodology/approach First, the shortcomings of the traditional financial management model are analyzed under the background of big data analysis. The big data analytic technology is employed to extract financial big data information and establish an efficient corporate financial management model. Second, the deep learning (DL) algorithm is applied to implement a corporate financial early-warning model to predict the potential risks in corporate finance, considering the predictability of corporate financial risks. Finally, a corporate value-centered development strategy based on sustainable growth is proposed for long-term development. Findings The experimental results demonstrate that the financial early-warning model based on DL has an accuracy of 90.7 and 88.9% for the two-year financial alert, which is far superior to the prediction effect of the traditional financial risk prediction models. Originality/value The obtained results can provide a reference for establishing a sustainable development pattern of corporate financial management under the background of big data.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "deep learning",
    "cache_key": "e6f04fc569f846050ee916886aa88173",
    "relevant_keywords": [
      "deep learning",
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T01:39:38.160430"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是应用深度学习算法建立企业财务预警模型，用于预测企业财务中的潜在风险，这直接属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是应用深度学习算法建立企业财务预警模型，用于预测企业财务中的潜在风险，这直接属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:02:50.286498"
}