{
  "paper": {
    "id": 2766,
    "title": "A qualitatively analyzable two-stage ensemble model based on machine learning for credit risk early warning: Evidence from Chinese manufacturing companies",
    "abstract": "Constructing ensemble models has become a common method for corporate credit risk early warning, while as to deep learning model with better predictive ability, there have been no fixed theoretical models formed in corporate credit risk early warning, as such models often fail to conduct further qualitative analysis of the results. Thus, this article builds a new two-stage ensemble model using a variety of machine learning methods represented by deep learning for corporate credit risk early warning, which can not only effectively improve the prediction per-formance of the model, but also qualitatively analyze the source of corporate credit risk from multiple angles according to the results. At first stage, the improved entropy method is used to re-assign the instance weight in correlation degree based on grey correlation analysis. At second stage, this study adopts Bagging method to integrate multiple one-dimensional convolutional neural networks, and borrows idea of N-fold cross validation to expand the difference of the base classifier. Empirically, this article selects listed companies in Chinese manufacturing industry between 2012 and 2021 as datasets, including 467 samples with 51 financial indicators. The new ensemble model has the highest F1-score (87.29%) and G-mean (89.47%) among comparative models, and qualitatively analyzes corporate risk sources. Further, it also analyzes how to in-crease early warning effect from the angles of indicator number and time span.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "c9dd3a023c1d9a6518cc7fa7bb89d4af",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "classification",
      "neural network",
      "convolutional neural network",
      "CNN"
    ],
    "stage1_timestamp": "2025-05-15T02:19:08.342969"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是构建一个两阶段集成模型用于企业信用风险早期预警，这直接属于金融风险管理中的信用风险管理范畴。论文明确提到使用机器学习和深度学习方法进行信用风险预测，并分析了企业风险来源，这些都是金融风险管理的关键应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"该论文的核心技术是构建一个两阶段集成模型用于企业信用风险早期预警，这直接属于金融风险管理中的信用风险管理范畴。论文明确提到使用机器学习和深度学习方法进行信用风险预测，并分析了企业风险来源，这些都是金融风险管理的关键应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:40:10.039139"
}