{
  "paper": {
    "id": 2303,
    "title": "Global minimum variance portfolio optimisation under some model risk: A robust regression-based approach",
    "abstract": "The global minimum variance portfolio computed using the sample covariance matrix is known to be negatively affected by parameter uncertainty, an important component of model risk. Using a robust approach, we introduce a portfolio rule for investors who wish to invest in the global minimum variance portfolio due to its strong historical track record, but seek a rule that is robust to parameter uncertainty. Our robust portfolio corresponds theoretically to the global minimum variance portfolio in the worst-case scenario, with respect to a set of plausible alternative estimators of the covariance matrix, in the neighbourhood of the sample covariance matrix. Hence, it provides protection against errors in the reference sample covariance matrix. Monte Carlo simulations illustrate the dominance of the robust portfolio over its non-robust counterpart, in terms of portfolio stability, variance and risk-adjusted returns. Empirically, we compare the out-of-sample performance of the robust portfolio to various competing minimum variance portfolio rules in the literature. We observe that the robust portfolio often has lower turnover and variance and higher Sharpe ratios than the competing minimum variance portfolios. (C) 2015 Elsevier B.V. All rights reserved.",
    "year": 2015,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "314c117c82b22031e5229cba978a46c9",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:05:39.606829"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是提出一种稳健的全球最小方差投资组合优化方法，旨在解决参数不确定性对投资组合表现的影响。论文的研究目标和实验设计均围绕投资组合的稳定性、方差和风险调整后收益展开，属于投资组合管理领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是提出一种稳健的全球最小方差投资组合优化方法，旨在解决参数不确定性对投资组合表现的影响。论文的研究目标和实验设计均围绕投资组合的稳定性、方差和风险调整后收益展开，属于投资组合管理领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:15:54.272291"
}