{
  "paper": {
    "id": 367,
    "title": "Global stock market investment strategies based on financial network indicators using machine learning techniques",
    "abstract": "This study presents financial network indicators that can be applied to global stock market investment strategies. We propose to design both undirected and directed volatility networks of global stock market based on simple pair-wise correlation and system-wide connectedness of national stock indices using a vector auto-regressive model. We examine the effect and usefulness of network indicators by applying them as inputs for determining strategies via several machine learning approaches (logistic regression, support vector machine, and random forest). Two strategies are constructed considering stock price indices: (1) global stock market prediction strategy and (2) regional allocation strategy for developed market/emerging market. According to the results of the performance analysis, network indicators were proven to be important supplementary indicators in predicting global stock market and regional relative directions (up/down). In particular, these indicators were more effective during market crisis periods. This study is the first attempt to construct strategies for global portfolio management using financial network indicators and to suggest how network indicators can be used in practical fields. (C) 2018 Elsevier Ltd. All rights reserved.",
    "year": 2019,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "cc636195ef35bdc6ba25544a35771b68",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "regression",
      "support vector machine",
      "SVM",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T00:42:32.531469"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是使用金融网络指标和机器学习方法来构建全球股票市场的投资策略，包括全球股票市场预测策略和区域分配策略，这直接应用于投资组合管理的领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是使用金融网络指标和机器学习方法来构建全球股票市场的投资策略，包括全球股票市场预测策略和区域分配策略，这直接应用于投资组合管理的领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:31:35.481550"
}