{
  "paper": {
    "id": 7143,
    "title": "Associations between a Novel Measure of Census Tract-Level Credit Insecurity and Frequent Mental Distress in US Urban Areas, 2020",
    "abstract": "Access to and utilization of consumer credit remains an understudied social determinant of health. We examined associations between a novel, small-area, multidimensional credit insecurity index (CII), and the prevalence of self-reported frequent mental distress across US cities in 2020. The census tract-level CII was developed by the Federal Reserve Bank of New York using Census population information and a nationally representative sample of anonymized Equifax credit report data. The CII was calculated for tracts in 766 cities displayed on the City Health Dashboard at the time of analysis, predominantly representing cities with over 50,000 residents. The CII combined data on tract-level participation in the formal credit economy with information on the percent of individuals without revolving credit, percent with high credit utilization, and percent with deep subprime credit scores. Tracts were classified as credit-assured, credit-likely, mid-tier, at-risk, or credit-insecure. We used linear regression to examine associations between the CII and a modeled tract-level measure of frequent mental distress, obtained from the CDC PLACES project. Regression models were adjusted for neighborhood economic and demographic characteristics. We examined effect modification by US region by including two-way interaction terms in regression models. In adjusted models, credit-insecure tracts had a modestly higher prevalence of frequent mental distress (prevalence difference = 0.38 percentage points; 95% CI = 0.32, 0.44), compared to credit-assured tracts. Associations were most pronounced in the Midwest. Local factors impacting credit access and utilization are often modifiable. The CII, a novel indicator of community financial well-being, may be an independent predictor of neighborhood health in US cities and could illuminate policy targets to improve access to desirable credit products and downstream health outcomes.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "e72b5c5038d9acfcc2316db5ec69e82c",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T03:05:32.074836"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究信用不安全指数与心理健康之间的关系，属于公共卫生和社会经济交叉领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究信用不安全指数与心理健康之间的关系，属于公共卫生和社会经济交叉领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:26:40.257454"
}