{
  "paper": {
    "id": 2509,
    "title": "Modelling corporate bond rating with the use of market-based indicators",
    "abstract": "The paper presents an estimation of corporate bond rating models based on both financial and market company indicators. The analysis will be carried out for companies in the oil and gas industry having a rating assessment from Moody's rating agency. The paper aims to offer a more detailed understanding of the relationship between company market indicators and bond rating classification. Bond rating models will be estimated by multivariate statistical methods such as discriminant analysis and logistic regression. The contribution of the paper is to identify variables with a significant impact on corporate bond rating in the selected industry. The models being derived allow classifying bond rating of companies with relatively high accuracy, even when a limited set of input variables is considered. The practical use of models lies in the area of management decision process and managing credit risk.",
    "year": 2012,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "01f1ed85f0ee32dc780b386209dc462a",
    "relevant_keywords": [
      "classification",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:15:59.928087"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on modeling corporate bond ratings using market-based indicators and statistical methods to manage credit risk, which is a key aspect of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on modeling corporate bond ratings using market-based indicators and statistical methods to manage credit risk, which is a key aspect of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:41:35.375772"
}