{
  "paper": {
    "id": 357,
    "title": "Financial Risk Early-warning Based on FDT-Fuzzy ID3 Algorithm",
    "abstract": "With the development of world economic globalization and integrating trends, international finance has been developed unprecedentedly in depth and breadth because of information technology, financial risks has become growing proliferation, more and more complex and diverse. In this case, to establish an effective early-warning financial security system becomes the academic focus. Due to fuzzy decision trees are powerful, top-down, hierarchical search methodology to extract human interpretable classification rules, they have become candidates for financial risk early-warming system. In this paper, Fuzzy ID3 algorithm is used, a popular and particularly efficient method, to construct fuzzy decision tree. We use weighted fuzzy production rules generated from fuzzy decision tree to establish early-warming system of financial risk. In addition, a new method is proposed, based on fuzzy rules and degree of confidence, to set the band of early-warming. Classification accuracy was used to examine results of the system. The results indicated that the system is very valid for financial risk.",
    "year": 2009,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "6d9c3aa185a9af905de374e133e905ae",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T01:49:41.104574"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用模糊决策树（Fuzzy ID3算法）建立金融风险早期预警系统，旨在通过分类规则识别和预警金融风险，这直接属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是使用模糊决策树（Fuzzy ID3算法）建立金融风险早期预警系统，旨在通过分类规则识别和预警金融风险，这直接属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:58:31.699336"
}