{
  "paper": {
    "id": 4923,
    "title": "Identifying Patterns of Social and Economic Hardship Among Structurally Vulnerable Women: A Latent Class Analysis of HIV/STI Risk",
    "abstract": "Women who are structurally vulnerable are at heightened risk for HIV/STIs. Identifying typologies of structural vulnerability that drive HIV/STI risk behavior is critical to understanding the nature of women's risk. Latent class analysis (LCA) was used to classify exotic dancers (n = 117) into subgroups based on response patterns of four vulnerability indicators. Latent class regression models tested whether sex- and drug-related risk behavior differed by vulnerability subgroup. Prevalence of vulnerability indicators varied across housing instability (39%), financial insecurity (39%), limited education (67%), and arrest history (36%). LCA yielded a two-class model solution, with 32% of participants expected to belong to a high vulnerability subgroup. Dancers in the high vulnerability subgroup were more likely to report sex exchange (OR = 8.1, 95% CI, 1.9-34.4), multiple sex partnerships (OR = 6.4, 95% CI, 1.9-21.5), and illicit drug use (OR = 17.4, 95% CI, 2.5-123.1). Findings underscore the importance of addressing inter-related structural factors contributing to HIV/STI risk.",
    "year": 2017,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "877589c0b75571ac1b1c4bfdb11c51d8",
    "relevant_keywords": [
      "unsupervised learning",
      "classification",
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T02:42:36.123807"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究社会和经济困难对女性HIV/STI风险的影响，使用了潜在类别分析（LCA）来分类和识别高风险群体。虽然涉及金融不安全等经济因素，但核心技术和研究目标并不属于衍生品定价、金融风险管理或投资组合管理中的任何一个领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究社会和经济困难对女性HIV/STI风险的影响，使用了潜在类别分析（LCA）来分类和识别高风险群体。虽然涉及金融不安全等经济因素，但核心技术和研究目标并不属于衍生品定价、金融风险管理或投资组合管理中的任何一个领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:31:32.339572"
}