{
  "paper": {
    "id": 1849,
    "title": "Designing and deploying insurance recommender systems using machine learning",
    "abstract": "Recommender systems have become extremely important to various types of industries where customer interaction and feedback is paramount to the success of the business. For companies that face changes that arise with ever-growing markets, providing product recommendations to new and existing customers is a challenge. Our goal is to give our customers personalized recommendations based on what other similar people with similar portfolios have, in order to make sure they are adequately covered for their needs. Our system uses customer characteristics in addition to customer portfolio data. Since the number of possible recommendable products is relatively small, compared to other recommender domains, and missing data is relatively frequent, we chose to use Bayesian Networks for modeling our systems. We also present a deep-learning-based approach to provide recommendations to prospects (potential customers) where only external marketing data is available at the time of prediction. This article is categorized under: Application Areas > Industry Specific Applications Algorithmic Development > Structure Discovery Algorithmic Development > Bayesian Models Technologies > Machine Learning",
    "year": 2020,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "0fdd2e33b9d7109ffb898259b303b8e6",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "Bayesian Models",
      "neural network",
      "representation learning"
    ],
    "stage1_timestamp": "2025-05-15T01:00:27.295246"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究保险推荐系统的设计和部署，虽然涉及金融产品推荐，但其核心技术（如贝叶斯网络和深度学习）并未应用于衍生品定价、金融风险管理或投资组合管理等特定金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究保险推荐系统的设计和部署，虽然涉及金融产品推荐，但其核心技术（如贝叶斯网络和深度学习）并未应用于衍生品定价、金融风险管理或投资组合管理等特定金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T14:24:44.880317"
}