{
  "paper": {
    "id": 1463,
    "title": "Predicting movie box-office revenues using deep neural networks",
    "abstract": "In the film industry, the ability to predict a movie's box-office revenues before its theatrical release can decrease its financial risk. However, accurate predictions are not easily obtained. The complex relationship between movie-related data and movie box-office revenues, plus the increasing volume of data in online movie databases, pose challenges for their effective analysis. In this paper, a multimodal deep neural network, incorporating input about movie poster features learned in a data-driven fashion, is proposed for movie box-office revenues prediction. A convolutional neural network (CNN) is built to extract features from movie posters. By pre-training the CNN, features that are relevant to movie box-office revenues can be learned. To evaluate the performance of the proposed multimodal deep neural network, comparative studies with other prediction techniques were carried out on an Internet Movie Database dataset, and visualization of movie poster features was also performed. Experimental results demonstrate the superiority of the proposed multimodal deep neural network for movie box-office revenues prediction.",
    "year": 2019,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "51fd20814f71b13c8686615405fe0542",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "regression",
      "neural network",
      "deep learning",
      "representation learning",
      "backpropagation",
      "BP",
      "convolutional neural network",
      "CNN",
      "unsupervised pre-train"
    ],
    "stage1_timestamp": "2025-05-15T02:03:39.658690"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究使用深度神经网络预测电影票房收入，虽然涉及风险降低，但其应用领域是电影产业而非金融领域。论文未提及衍生品定价、金融风险管理或投资组合管理等金融应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究使用深度神经网络预测电影票房收入，虽然涉及风险降低，但其应用领域是电影产业而非金融领域。论文未提及衍生品定价、金融风险管理或投资组合管理等金融应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:48:45.109111"
}