{
  "paper": {
    "id": 2925,
    "title": "Prediction of Prolonged Length of Stay for Stroke Patients on Admission for Inpatient Rehabilitation Based on the International Classification of Functioning, Disability, and Health (ICF) Generic Set: A Study from 50 Centers in China",
    "abstract": "Background: This study aimed to develop a risk prediction model for prolonged length of stay (LOS) in stroke patients in 50 inpatient rehabilitation centers in 20 provinces across mainland China based on the International Classification of Functioning, Disability, and Health (ICF) Generic Set case mix on admission. Material/Methods: In this cohort study, 383 stroke patients were included from inpatient rehabilitation settings of 50 hospitals across mainland China. Independent predictors of prolonged LOS were identified using multivariate logistic regression analysis. A prediction model was established and then evaluated by receiver operating characteristic (ROC) curve analysis and the Hosmer-Lemeshow test. Results: Multivariate logistic regression analysis showed that the type of medical insurance and the performance of daily activities (ICF, d230) were associated with prolonged LOS (P<0.05). Age and mobility level measured by the ICF Generic Set demonstrated no significant predictive value. The prediction model showed acceptable discrimination shown by an area under the curve (AUC) of 0.699 (95% CI, 0.646-0.752) and calibration (chi(2) =11.66; P= 0.308). Conclusions: The risk prediction model for prolonged LOS in stroke patients in 50 rehabilitation centers in China, based on the ICF Generic Set, showed that the scores for the type of medical insurance and the performance of daily activities (ICF, d230) on admission were independent predictors of prolonged LOS. This prediction model may allow stakeholders to estimate the risk of prolonged LOS on admission quantitatively, facilitate the financial planning, treatment regimens during hospitalization, referral after discharge, and reimbursement.",
    "year": 2020,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "f2a4d09748057a17699fef598afa1390",
    "relevant_keywords": [
      "classification",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:20:48.127463"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是基于国际功能、残疾和健康分类（ICF）通用集的卒中患者住院康复时间延长的风险预测模型，属于医疗健康领域的研究，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是基于国际功能、残疾和健康分类（ICF）通用集的卒中患者住院康复时间延长的风险预测模型，属于医疗健康领域的研究，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:39:19.702002"
}