{
  "paper": {
    "id": 998,
    "title": "Tracking customer portfolio composition: A factor analysis approach",
    "abstract": "In this paper, we address the changing composition of a customer portfolio taking into account actions undertaken by the company to adapt its service offer to market conditions and/or technological innovations. We present a specific methodology to identify clusters of customers in different periods and then compare them over time. The classification process takes into account both qualitative and quantitative aspects of the consumption levels of the services or products offered by the company. The possibility of period-to-period variation in the customer portfolio and the service or product offer is also considered, in order to achieve a more realistic scenario. The core of the proposed methodology is related to the family of exploratory factorial and cluster techniques. The customers are classified by using a bicriterial clustering methodology based on 'tandem' analysis (multiple factor analysis + cluster analysis of the main factors). The bicriterial approach allows for a compromise between customers' consumption levels (a quantitative criterion) and their consumption/non-consumption pattern (a qualitative criterion). The evolution of the customer portfolio composition is explored through multiple correspondence analysis. This technique allows visual comparison of the position of different clusters against time and the identification of key changes in customer consumption behavior. The methodology is tested on realistic customer portfolio scenarios for a major telecommunication company. We simulate various scenarios to show the strengths of our proposal. Copyright (C) 2009 John Wiley & Sons, Ltd.",
    "year": 2010,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "babc5cf4913ebcf28823bbd45fc36131",
    "relevant_keywords": [
      "clustering",
      "principal components analysis"
    ],
    "stage1_timestamp": "2025-05-15T00:50:40.741990"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究客户投资组合的分类和变化分析，应用于电信公司的客户管理，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究客户投资组合的分类和变化分析，应用于电信公司的客户管理，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:25:23.502115"
}