{
  "paper": {
    "id": 166,
    "title": "Optimal approximations for the free boundary problems of the space-time fractional Black-Scholes equations using a combined physics-informed neural network",
    "abstract": "The combined physics-informed neural network is employed to deal with the free boundary problems of fractional Black-Scholes equations. The solution assumption and the loss function are determined, the transfer learning is borrowed, the combined neural network with data enhancement layer is designed, then the classical Black-Scholes model is numerically solved and the comparative analysis of numerical results under different neural networks is made. For further insight into the long-term memory of fluctuation, the free boundary problems of the space-time Black-Scholes equations under Caputo, Caputo-Fabrizio and Atangana-Baleanu-Caputo fractional derivatives are studied. The corresponding empirical analyses are presented and the optimal exercise boundaries of American put option are simulated. The market analysis shows that introducing fractional calculus tools and neural network algorithms into American put option pricing can yield more realistic prediction results. The work provides a viable method for subsequent researchers to study American option pricing using fractional calculus and neural networks combined with true market data and to deal with the free boundary problems in other research fields.",
    "year": 2024,
    "source": "WOS",
    "area": "derivatives_pricing",
    "method": "machine learning",
    "cache_key": "3daf3fd4ec24d7c8bcdf804a32e895e0",
    "relevant_keywords": [
      "neural network",
      "deep learning",
      "representation learning",
      "backpropagation",
      "BP",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T01:29:09.036935"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Derivatives Pricing"
    ],
    "justification": "该论文的核心技术是使用物理信息神经网络（PINN）解决分数阶Black-Scholes方程的自由边界问题，并特别关注美式看跌期权的最优执行边界模拟。这些内容直接关联到衍生品定价领域，尤其是期权定价问题。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"衍生品定价\"],\n  \"justification\": \"该论文的核心技术是使用物理信息神经网络（PINN）解决分数阶Black-Scholes方程的自由边界问题，并特别关注美式看跌期权的最优执行边界模拟。这些内容直接关联到衍生品定价领域，尤其是期权定价问题。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:06:26.743182"
}