{
  "paper": {
    "id": 846,
    "title": "Generative Bayesian Computation for Maximum Expected Utility",
    "abstract": "Generative Bayesian Computation (GBC) methods are developed to provide an efficient computational solution for maximum expected utility (MEU). We propose a density-free generative method based on quantiles that naturally calculates expected utility as a marginal of posterior quantiles. Our approach uses a deep quantile neural estimator to directly simulate distributional utilities. Generative methods only assume the ability to simulate from the model and parameters and as such are likelihood-free. A large training dataset is generated from parameters, data and a base distribution. Then, a supervised learning problem is solved as a non-parametric regression of generative utilities on outputs and base distribution. We propose the use of deep quantile neural networks. Our method has a number of computational advantages, primarily being density-free and an efficient estimator of expected utility. A link with the dual theory of expected utility and risk taking is also described. To illustrate our methodology, we solve an optimal portfolio allocation problem with Bayesian learning and power utility (also known as the fractional Kelly criterion). Finally, we conclude with directions for future research.",
    "year": 2024,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "bc47ca9c76e1e16c368041cf2dcd13c5",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "regression",
      "neural network",
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T00:49:03.078759"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术Generative Bayesian Computation (GBC) 方法被应用于解决最优投资组合分配问题，具体提到了使用贝叶斯学习和幂效用函数（也称为分数凯利准则）来优化投资组合。这明确表明其主要应用领域是投资组合管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术Generative Bayesian Computation (GBC) 方法被应用于解决最优投资组合分配问题，具体提到了使用贝叶斯学习和幂效用函数（也称为分数凯利准则）来优化投资组合。这明确表明其主要应用领域是投资组合管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:27:20.480061"
}