{
  "paper": {
    "id": 909,
    "title": "RETRACTED: Risk assessment of logistics finance enterprises based on BP neural network and fuzzy mathematical model (Retracted Article)",
    "abstract": "Neural network is used to deal with the nonlinear relationship, usually there is a strong nonlinear relationship between input and output. Through the self-learning of neural network, the weight of data samples is determined after training, and the optimal solution is obtained according to the process steps. In this paper, the a authors analyze the risk assessment of logistics finance enterprises based on BP neural network and fuzzy mathematical model. For logistics companies, it is necessary to determine the ability of logistics companies to engage in logistics finance business, and then to make detailed and accurate grasp of relevant information. The difference between the actual output and the expected output of the training sample is small, so the fitting is completed well, and the parameters of the neural network are further adjusted. The results show that the model has a good ability of learning nonlinear function relations. To sum up, in order to reduce logistics financial risks, we must fully understand the factors that affect logistics financial risks, determine the proportion of risk factors, and then use the fuzzy evaluation method to analyze the financial business risks.",
    "year": 2020,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "bd7bd42787bccfa5e183813be36811ef",
    "relevant_keywords": [
      "neural network",
      "backpropagation",
      "BP"
    ],
    "stage1_timestamp": "2025-05-15T01:56:17.612703"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用BP神经网络和模糊数学模型对物流金融企业的风险进行评估，这直接属于金融风险管理的范畴。论文明确讨论了风险因素的确定和评估，以降低物流金融风险，符合金融风险管理的定义。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是使用BP神经网络和模糊数学模型对物流金融企业的风险进行评估，这直接属于金融风险管理的范畴。论文明确讨论了风险因素的确定和评估，以降低物流金融风险，符合金融风险管理的定义。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:53:53.214239"
}