{
  "paper": {
    "id": 3985,
    "title": "A model to improve management of banking customers",
    "abstract": "Purpose - The purpose of this paper is to provide a customer lifetime value (CLV) model to carefully assess and classify banking customers using individual measures and covering customers' relationships with a portfolio of products of the company. Design/methodology/approach - The proposed model comprises two sub-models: (sub-model 1) modelling and prediction of CLV in a multiproduct context using Hierarchical Bayesian models as input to (sub-model 2) a value-based segmentation specially designed to manage customers and products using the latent class regression. The model is tested using real transaction data of 1,357 customers of a bank. Findings - This research demonstrates which drivers of customer value better predict the contribution margin and product usage for each of the products considered in order to get the CLV measure. Using this measure, the model implements a value-based segmentation, which helps banks to facilitate the process of customer management. Originality/value - Previous CLV models are mostly conceptual, generalisation is one of their main concerns, are usually focussed on single product categories using aggregated customer data, and they are not design with a special emphasis on their application as support for managerial decisions. In response to these drawbacks, the proposed model will enable decision makers to improve the understanding of the value of each customer and their behaviour towards different financial products.",
    "year": 2017,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "9ef2d259fb5a26fb62dd4b1178f1342d",
    "relevant_keywords": [
      "classification",
      "regression",
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T01:22:39.429531"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究客户终身价值（CLV）模型和基于价值的客户细分，旨在改善银行客户管理。虽然涉及金融产品，但其核心技术应用于客户关系管理而非衍生品定价、金融风险管理或投资组合管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究客户终身价值（CLV）模型和基于价值的客户细分，旨在改善银行客户管理。虽然涉及金融产品，但其核心技术应用于客户关系管理而非衍生品定价、金融风险管理或投资组合管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:08:23.311784"
}