{
  "paper": {
    "id": 1637,
    "title": "An improved large-scale sparse multi-objective evolutionary algorithm using unsupervised neural network",
    "abstract": "Large-scale sparse multi-objective optimization problems (LSSMOPs) widely exist in the real world, such as portfolio optimization, neural network training problems, and so on. In recent years, a number of multi-objective optimization evolutionary algorithms (MOEAs) have been proposed to deal with LSSMOPs. To improve the search efficiency of the operator, using unsupervised neural networks to reduce the search space is one of the dimensionality reduction methods in sparse MOEAs. However, it is not efficient enough that existing algorithms using neural networks consume much time to train networks in each evolutionary generation. In addition, most sparse MOEAs ignore the relationship between binary vectors and real vectors, which determine the decision variables. Thus, this paper proposes an evolutionary algorithm for solving LSSMOPs. The proposed algorithm adopts an adaptive dimensionality reduction method to achieve a balance between convergence and efficiency. The algorithm groups the binary vectors and adaptively uses a restricted Boltzmann machine to reduce the search space of binary vectors. Then, the generation of real vectors is guided by binary vectors, which enhance the relationship between both parts of the decision variables. According to the experimental results on eight benchmark problems and neural network training problems, the proposed algorithm achieves better performance than existing state-of-the-art evolutionary algorithms for LSSMOPs.",
    "year": 2023,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "e03ba4269e2cf60dfc51013ec85c5a40",
    "relevant_keywords": [
      "unsupervised learning",
      "neural network",
      "deep learning",
      "restricted Boltzmann machine"
    ],
    "stage1_timestamp": "2025-05-15T00:57:46.929159"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "论文摘要中明确提到'portfolio optimization'作为大规模稀疏多目标优化问题的一个应用实例，表明该论文的核心技术可以应用于投资组合管理领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"论文摘要中明确提到'portfolio optimization'作为大规模稀疏多目标优化问题的一个应用实例，表明该论文的核心技术可以应用于投资组合管理领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:19:41.337688"
}