{
  "paper": {
    "id": 4187,
    "title": "Spatio-temporal cluster analysis and transmission drivers for Peste des Petits Ruminants in Uganda",
    "abstract": "Peste des Petits Ruminants (PPR) is a transboundary, highly contagious, and fatal disease of small ruminants. PPR causes global annual economic losses of between USD 1.5 and 2.0 billion across more than 70 affected countries. Despite the commercial availability of effective PPR vaccines, lack of financial and technical commitment to PPR control coupled with a dearth of refined PPR risk profiling data in different endemic countries has perpetuated PPR virus transmission. In Uganda, over the past 5 years, PPR has extended from northeastern Uganda (Karamoja) with sporadic incursions in other districts /regions. To identify disease cluster hotspot trends that would facilitate the design and implementation of PPR risk-based control methods (including vaccination), we employed the space-time cube approach to identify trends in the clustering of outbreaks in neighbouring space-time cells using confirmed PPR outbreak report data (2007-2020). We also used negative binomial and logistic regression models and identified high small ruminant density, extended road length, low annual precipitation and high soil water index as the most important drivers of PPR in Uganda. The study identified (with 90-99% confidence) five PPR disease hotspot trend categories across subregions of Uganda. Diminishing hotspots were identified in the Karamoja region whereas consecutive, sporadic, new and emerging hotspots were identified in central and southwestern districts of Uganda. Inter-district and cross-border small ruminant movement facilitated by longer road stretches and animal comingling precipitate PPR outbreaks as well as PPR virus spread from its initial Karamoja focus to the central and southwestern Uganda. There is therefore urgent need to prioritize considerable vaccination coverage to obtain the required herd immunity among small ruminants in the new hotspot areas to block transmission to further emerging hotspots. Findings of this study provide a basis for more robust timing and prioritization of control measures including vaccination.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "bb118ec11f96b28bd27024f2dec687fb",
    "relevant_keywords": [
      "clustering",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:34:13.431915"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是动物疾病（Peste des Petits Ruminants）的时空聚类分析和传播驱动因素，属于兽医学和流行病学领域，并未涉及任何金融研究领域的应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是动物疾病（Peste des Petits Ruminants）的时空聚类分析和传播驱动因素，属于兽医学和流行病学领域，并未涉及任何金融研究领域的应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:33:53.009976"
}