{
  "paper": {
    "id": 6,
    "title": "Portfolio optimization based on the pre-selection of stocks by the Support Vector Machine model",
    "abstract": "This study aims to analyze the performance of an investment portfolio using the Markowitz model, which maximizes the Sharpe ratio from a set of assets preselected through the Support Vector Machine (SVM) model using fundamental indicators in the Brazilian stock market. With an accuracy of 61% for the SVM model, the results indicate that preselecting assets based on fundamental indicators and subsequently optimizing them by maximizing the Sharpe ratio showed a superior return and faster recovery after drawdown periods compared to the benchmark or SVM (1/n) strategy. These results suggest the relevance of including the SVM in the optimization portfolio process.",
    "year": 2024,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "3d53dfa534a24d5343b0aba12063947c",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM"
    ],
    "stage1_timestamp": "2025-05-15T00:38:16.213913"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "The paper focuses on optimizing an investment portfolio using the Markowitz model and SVM for stock pre-selection, which is directly related to portfolio management. The study aims to maximize the Sharpe ratio and improve portfolio performance, which are key objectives in portfolio management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Portfolio Management\"],\n  \"justification\": \"The paper focuses on optimizing an investment portfolio using the Markowitz model and SVM for stock pre-selection, which is directly related to portfolio management. The study aims to maximize the Sharpe ratio and improve portfolio performance, which are key objectives in portfolio management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:34:28.317263"
}