{
  "paper": {
    "id": 4016,
    "title": "Regression function model in risk management of bank resource allocation",
    "abstract": "Commercial bank asset-liability management is a method of overall risk control and resource allocation. It has an essential impact on commercial banks' operational safety and affects the stability of a country's overall financial system due to the domino effect. The article chooses the regression function model to measure the expected default frequency (EDF) in the resource allocation risk of Chinese banks. It analyses the transmission process of the impact of the main macroeconomic variables on the EDF of the resource allocation risk of Chinese commercial banks. The study found that under the significance level of 5%, standardised industrial output growth rate, money supply growth rate, and real estate price index are the main reasons for the changes in bank resource allocation risk EDF.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "aa5bed93e30204196edee57c0652b045",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:32:27.426876"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on using a regression function model to measure the expected default frequency (EDF) in the context of bank resource allocation risk, which is a key aspect of financial risk management. It analyzes the impact of macroeconomic variables on bank risk, aligning with risk management practices.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on using a regression function model to measure the expected default frequency (EDF) in the context of bank resource allocation risk, which is a key aspect of financial risk management. It analyzes the impact of macroeconomic variables on bank risk, aligning with risk management practices.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:34:41.756221"
}