{
  "paper": {
    "id": 2170,
    "title": "Early Warning of Companies' Credit Risk Based on Machine Learning",
    "abstract": "With the advent of the big data era, information barriers are gradually being broken down and credit has become a key factor of company operations. The lack of company credit has greatly and negatively impacted the social economy, which has triggered considerable research on company credit. In this article, a credit risk warning model based on the XGBoost-SHAP algorithm is proposed that can accurately assess the credit risk of a company. The degree of influence of the characteristics of a company's credit risk and the warning threshold of important characteristics are obtained based on the model output. Finally, a comparison with several other machine learning algorithms showed that the XGBoost-SHAP model achieved the highest early warning accuracy and the most comprehensive explanatory output results. The experimental results show that the method can effectively provide a warning of the credit risk of a company based on the historical performance of the company's historical characteristics data. This method provides positive guidance for companies and financial institutions.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "a907d17237868be98fb7877a7fa41770",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "decision tree",
      "feature learning",
      "feature representation"
    ],
    "stage1_timestamp": "2025-05-15T02:12:17.352484"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文提出了一种基于XGBoost-SHAP算法的信用风险预警模型，旨在准确评估公司的信用风险。这直接涉及金融风险管理中的信用风险分析，属于该领域的应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"该论文提出了一种基于XGBoost-SHAP算法的信用风险预警模型，旨在准确评估公司的信用风险。这直接涉及金融风险管理中的信用风险分析，属于该领域的应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:44:03.818763"
}