{
  "paper": {
    "id": 812,
    "title": "Intelligent Road Crashes Avoidance System",
    "abstract": "Human deaths, injuries caused by road crashes have tremendous impacts on individuals, families, and societies. Economically, it causes financial burden on countries as, on average, they loss of 3% of their Gross Domestic Product (GDP). Many driving assistant techniques, embedded in several vehicles, are helping drivers to avoid car crashes by giving them early warning message. In this work, An Intelligent Road Crashes Avoidance (IRCA) system which adopts the Artificial Neural Network (ANN) and Decision Tree (DT) algorithms is proposed. The prediction model of IRCA is trained using big dataset composed of 1.6 million rows (car accidents) and 23 features (information) spanning over 14 years of data collection by United Kingdom (UK). With prediction accuracy of 72% for ANN and 74% for TD algorithms, IRCA system can predict car crash risk levels for 941 districts of UK. IRCA system can be exploited either in human- driven or in self- driving cars. The prediction accuracy can further be improved by training on new collected dataset with less missing data and outliers.",
    "year": 2019,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "ba81650bd22c109c4b92834070c29d06",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "decision tree",
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T01:55:08.129365"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是使用机器学习和决策树算法来预测和避免道路交通事故，其应用场景是交通安全和车辆驾驶辅助系统，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是使用机器学习和决策树算法来预测和避免道路交通事故，其应用场景是交通安全和车辆驾驶辅助系统，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:54:37.436103"
}