{
  "paper": {
    "id": 2991,
    "title": "Networks with Hierarchical Structure: Applications to the Patent Domain",
    "abstract": "In this paper we introduced a graph-based metric to measure a similarity between weighted sets of classifications codes defined as nodes on hierarchical taxonomy trees. We applied this metric to build relationship networks among companies and to find company peers (communities) in IPR (intellectual-property rights) domain based on patent portfolios. To characterize evolution of patent portfolios for companies we used weighted sets of international patent classification codes (IPC), where each IPC weight corresponds to a number of IPC codes in a company patent portfolio aggregated to a given hierarchy level over a given period of time. We used the suggested graph-based similarity at different hierarchical IPC levels to build corresponding networks and detected communities over different time periods. To track communities evolution in time we developed a cluster-matching algorithm to align community labels over time. Then we study evolution of communities in time to identify changes in a company strategy and its peers at the given time. The suggested methodology may be applied to other domains that include hierarchical classification sets such as trademarks, legal documents, scientific papers, lawsuits etc.",
    "year": 2017,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "b8ba22b640f07567e196e68a89f33591",
    "relevant_keywords": [
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T01:12:42.969026"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究基于图的方法来衡量分类代码集合之间的相似性，并应用于专利领域构建公司关系网络和识别同行社区。虽然提到了'portfolios'一词，但指的是专利组合而非金融投资组合，且未涉及衍生品定价、金融风险管理或投资组合管理等金融领域的具体应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究基于图的方法来衡量分类代码集合之间的相似性，并应用于专利领域构建公司关系网络和识别同行社区。虽然提到了'portfolios'一词，但指的是专利组合而非金融投资组合，且未涉及衍生品定价、金融风险管理或投资组合管理等金融领域的具体应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:11:57.353051"
}