{
  "paper": {
    "id": 1709,
    "title": "Forecasting climate transition regulatory and market risk variables with machine learning",
    "abstract": "The financial impacts of the consequences of climate change on organisations are not always clear. Therefore, for many organisations, assessing the potential impact of climate risk remains a challenge. This piece of research is geared towards selecting the best artificial intelligence technique for modelling and forecasting the operational costs related to climate transition risk, such as direct or indirect utility consumption, including the costs of electricity and fossil fuels. These costs can be affected, especially by regulatory and market risks that are part of transition risk. We train 17 deep learning and machine learning models to forecast electricity and diesel consumption indicators, as well as the corresponding prices of these variables. Our results show an average prediction accuracy of 90.36% and emphasise the importance of using such decision support tools to analyse the financial impacts of climate risks within organisations. This calls for organisations to improve data collection and availability, as performing this kind of analysis is promising but currently remains a challenge due to the scarcity of available information.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "f3f8530dc22e88f532f65cc5ad62f792",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "neural network",
      "representation learning",
      "backpropagation",
      "BP",
      "hidden layer",
      "recurrent neural network",
      "long short-term memory",
      "LSTM"
    ],
    "stage1_timestamp": "2025-05-15T02:06:22.529411"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on forecasting operational costs related to climate transition risk, including regulatory and market risks, which are part of financial risk management. The use of machine learning models to predict these costs and their financial impacts aligns with the domain of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on forecasting operational costs related to climate transition risk, including regulatory and market risks, which are part of financial risk management. The use of machine learning models to predict these costs and their financial impacts aligns with the domain of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:46:58.039958"
}