{
  "paper": {
    "id": 2404,
    "title": "Gold characteristics as safe haven and assets diversification for Sharia stocks in Indonesia",
    "abstract": "PurposeThis study aims to determine the role of gold as a safe haven, hedge and asset diversification for Shariah stock in conditions of extreme stock market declines.Design/methodology/approachQuantitative approach is used by applying the threshold generalized autoregressive conditional heteroskedasticity (TGARCH) model to capture bad or good news in the market condition and quantile regression method to obtain the extreme values of stock returns in several market conditions. The data used were the daily closing price of gold and the Jakarta Islamic Index from January 2011 to October 2022.FindingsThe average conditions show gold does not have a hedge property and only acts as an asset diversification. Second, gold has a substantial, safe haven property in every economic condition. However, the safe-haven property of gold seemed to weaken during the most extreme stock market decline. Thus, although gold appears as a safe haven and asset diversification, it remains a risky investment and only provides a minor role in the face of the extreme stock market period.Practical implicationsThis research provides a discourse and literature for Islamic investors and investor managers to choose the right investment instrument in various economic conditions where gold has a function as diversification and safe haven in their asset portfolio under any other asset portfolio conditions which is also in line with modern portfolio theory. For policymakers, the study can be used as material for consideration in making policies related to the accessibility of gold as an investment instrument.Originality/valueThis study presents the originality by using the price of Antam gold as a proxy for gold investment during the latest research year data and focusing on case studies in Islamic capital market in Indonesia. Moreover, this research provides quantile regression that sharply discussion in various economics condition.",
    "year": 2024,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "077304ed120ae3ab493c8885d655f30a",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:06:38.053159"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文研究了黄金作为避险资产和资产多样化工具在伊斯兰股票投资组合中的作用，并应用了TGARCH模型和分位数回归方法来分析极端市场条件下的表现。这直接涉及投资组合管理的核心问题，即资产配置和风险管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文研究了黄金作为避险资产和资产多样化工具在伊斯兰股票投资组合中的作用，并应用了TGARCH模型和分位数回归方法来分析极端市场条件下的表现。这直接涉及投资组合管理的核心问题，即资产配置和风险管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:14:46.369084"
}