{
  "paper": {
    "id": 896,
    "title": "Three-MLP Ensemble Re-RX Algorithm and Recent Classifiers for Credit-Risk Evaluation",
    "abstract": "Credit-risk evaluation is a challenging and important task in the domain of financial analysis for which many classification methods have been suggested. In this paper, we present the results for eight real-life credit-risk two-class mixed datasets (i.e., discrete and continuous attributes) analyzed by the Three-MLP Ensemble Re-RX algorithm (shortened to Three-MLP Ensemble). Clarifying the neural network decisions by explanatory rules that capture the learned knowledge embedded in the networks can help a credit-risk manager explain why a particular applicant is classified as either bad or good. To compare the Three-MLP Ensemble performance, we executed comprehensive rule extraction experiments on eight two-class mixed datasets commonly used for benchmarking studies in credit-risk evaluation. The extremely high accuracy of the Three-MLP Ensemble outperformed the accuracies by the Re-RX algorithm and a variant. In this study, we also compared the accuracy of the Three-MLP Ensemble with that of classifiers recently proposed. It is concluded that neural network rule extraction by the Three-MLP Ensemble is a powerful management tool that allows us to build advanced, comprehensible, and accurate decision-support systems for credit-risk evaluation.",
    "year": 2015,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "4e8f34cf0cd5590b40e1cfb2259e0e30",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "neural network",
      "deep learning",
      "backpropagation",
      "BP",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T01:56:17.587533"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用Three-MLP Ensemble Re-RX算法进行信用风险评估，这直接应用于金融风险管理中的信用风险分析领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"该论文的核心技术是使用Three-MLP Ensemble Re-RX算法进行信用风险评估，这直接应用于金融风险管理中的信用风险分析领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:53:54.689158"
}