{
  "paper": {
    "id": 5999,
    "title": "Emerging VM Threat Prediction and Dynamic Workload Estimation for Secure Resource Management in Industrial Clouds",
    "abstract": "The inefficient sharing of industrial cloud resour-ces among multiple users and vulnerabilities of virtual machines (VM)s and servers prompt unauthorized access to users' sensitive data along with excess consumption of power and resource wastage. To address these entangled issues, this paper proposes a novel Emerging VM Threat Prediction and Dynamic Workload Estimation based Resource Allocation (ETP-WE) framework that predicts VM threats and resource usage proactively in real-time. The proposed framework contributes by introducing a Risk-Score Matrix that analyses multiple risks for each VM; utilizing knowledge of proposed security and workload analyzers for efficient VM Placement (VMP), and estimating resource utilization by developing an ensemble predictor for prior mitigation of over-/under-load on servers. ETP-WE framework collaborates machine-learning-based security and workload analysis for secure and resource-efficient VMP, thereby reducing the number of security threats, optimizing resource utilization, power-consumption, and adapting to the changes in application demands. The performance of the proposed framework is evaluated using two benchmark datasets OpenNebula and Google Cluster. The simulation-based comparison with state-of-the-arts validates the efficacy of ETP-WE in terms of reduction of security threats, power consumption, and number of active servers up to 86.9%, 66.67% and 30%-80%, respectively with an improved resource utilization up to 60%-75% over existing approaches Note to Practitioners-Industry clouds serve the precise needs and provide the service features and tools as per the industry's needs to help organizations meet their workloads processing and storage demands. For instance, healthcare and financial organizations have to comply with extended security to meet specific service requirements. To this context, we have proposed a novel ETP-WE framework for prediction and mitigation of cyberthreats on virtual resources in real-time for secure execution of industrial applications on third-party servers. ETP-WE collaborates machine-learning based security and workload analysis for secure and resource efficient VM allocation, thereby reducing number of security threats, optimizing resource utilization, power-consumption and adaptating to the changes in application demands. During the processing of any sensitive transaction such as medical data, bank transactions, ETP-WE framework will induce improved data protection by mitigating potential data breaches. ETP-WE framework will be deployed at Resource Scheduler to boost security performance by estimating the multiple risks score status of VMs engaged in execution of industrial transactions or workloads. It will help to predict and analyze the probable security threats or breaches proactively and facilitate their mitigation. The performance evaluation and comparison with state-of-the-arts validate potency of ETP-WE in terms of reduction of cybersecurity threats and number of active servers with an improved resource utilization over existing approaches.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "912d4019bbc5cbbc01b48e5c925d99b6",
    "relevant_keywords": [
      "machine learning",
      "classification",
      "regression",
      "neural network",
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T02:53:33.474569"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究工业云中的虚拟机威胁预测和动态工作负载估计，以提高资源管理的安全性和效率。虽然提到了金融组织可能的应用场景，但核心技术并未直接应用于衍生品定价、金融风险管理或投资组合管理等金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究工业云中的虚拟机威胁预测和动态工作负载估计，以提高资源管理的安全性和效率。虽然提到了金融组织可能的应用场景，但核心技术并未直接应用于衍生品定价、金融风险管理或投资组合管理等金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:28:55.885087"
}