{
  "paper": {
    "id": 1533,
    "title": "Research on early warning of agricultural credit and guarantee risk based on deep learning",
    "abstract": "Under the impact of agricultural industry differentiation, traditional financial risk model cannot forewarn the guarantee risk of agricultural credit with effectively. This paper proposes an early warning algorithm of agricultural credit and guarantee risk that can effectively overcome the interference of external factors. Using deep learning network, the risk algorithm of agricultural credit and guarantee was built and it could change the deep belief network into supervised learning. To train for an optimal model, two new hidden layers are added to extract image feature vectors, as well as a Softmax classifier. The model is trained and evaluated by the usage of the risk data set of L province from 2017 to 2019, reinforcing the pre-training network and data to deal with the issue of overfitting in training. The results show that the accuracy of the model reaches 92.56%, when the training sample proportion is 90%, with all the 13 factors in the test set taken as input. It shows that the training of the model worked well and that it can effectively predict the risk of agricultural credit and guarantee.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "4d1af6146c47a0690942741e5d00c8ab",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "deep learning",
      "neural network",
      "deep belief network",
      "hidden layer",
      "representation learning",
      "feature learning"
    ],
    "stage1_timestamp": "2025-05-15T02:04:20.071122"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用深度学习构建农业信贷和担保风险的预警算法，旨在有效预测和管理农业信贷风险，这直接属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是使用深度学习构建农业信贷和担保风险的预警算法，旨在有效预测和管理农业信贷风险，这直接属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:48:21.792628"
}