{
  "paper": {
    "id": 743,
    "title": "A collective portfolio selection approach for investment clubs",
    "abstract": "Recently, with the popularity of social investing platforms, participating in an investment club has become a good choice for investors. Following financial experts in the investment club likely generates more profit as they have higher expertise in planning an investment portfolio. In this study, we propose a portfolio selection mechanism that combines collective intelligence extracted from investors' opinions and LSTM stock price predictions to infer a club's investment preference and predict the profitability of the extracted investment targets. Based on a club's risk tolerance and investment preference, the proposed mechanism can create an appropriate stock portfolio for the investors in the club. Utilizing StockTwits and stock historical data, the experimental results verify that the proposed portfolio selection mechanism performs better than market indices and other benchmark approaches in the market.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "deep learning",
    "cache_key": "9f5624e966bdf3a5694c1e61ffc92b9c",
    "relevant_keywords": [
      "deep learning",
      "neural network",
      "long short-term memory",
      "LSTM"
    ],
    "stage1_timestamp": "2025-05-15T01:42:05.396686"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "The paper focuses on developing a portfolio selection mechanism that combines collective intelligence and LSTM predictions to create appropriate stock portfolios for investment clubs, which directly aligns with the field of Portfolio Management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Portfolio Management\"],\n  \"justification\": \"The paper focuses on developing a portfolio selection mechanism that combines collective intelligence and LSTM predictions to create appropriate stock portfolios for investment clubs, which directly aligns with the field of Portfolio Management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:02:25.184782"
}