{
  "paper": {
    "id": 1853,
    "title": "Let's talk about risk! Stock market effects of risk disclosure for European energy utilities",
    "abstract": "We analyze how risk reporting by European energy utilities is related to uncertainty about firms' future prospects. Using an unsupervised machine learning topic model, we classify the content of the risk reports presented in the notes to the financial statements into different risk topics over the period from 2007 to 2017. We find that more risk reporting is related to lower idiosyncratic volatility and that this relation is especially evident for reporting about credit risk, risk management processes, economic risk, and accounting related risk. We also find that the uncertainty-decreasing effect of risk disclosure extends to a positive relation between risk disclosure and firm value. Our study contributes to the call for more transparency in risk reporting and disclosure. Interestingly, we are unable to identify a climate-related risk topic, and further tests show only a rudimentary disclosure of climate-related risks. Combining the usefulness of the current risk disclosure regulation with the current lack of climate-related risk disclosures, we see good reasons for increased mandatory climate-related risk disclosures.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "0b923011fc7d40c7bbbbfd03ad4839ec",
    "relevant_keywords": [
      "machine learning",
      "unsupervised learning",
      "classification",
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T02:08:04.008653"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要研究风险披露对欧洲能源公用事业公司股票市场的影响，特别是通过无监督机器学习对风险报告内容进行分类，并分析其与公司特定波动性和公司价值的关系。这直接涉及金融风险管理领域，尤其是信用风险、经济风险等具体风险类型的披露和管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文主要研究风险披露对欧洲能源公用事业公司股票市场的影响，特别是通过无监督机器学习对风险报告内容进行分类，并分析其与公司特定波动性和公司价值的关系。这直接涉及金融风险管理领域，尤其是信用风险、经济风险等具体风险类型的披露和管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:45:52.626044"
}