{
  "paper": {
    "id": 1426,
    "title": "On a Spread Model for Portfolio Credit Risk Modeling",
    "abstract": "We propose a model for determining the spread of a credit portfolio based on the actuarial principle. In this model the spread is a function of the recovery rate and of the probability of default. In an application to data, from a consumer credit portfolio of a Cape Verde bank, we estimate the recovery rate by a beta regression and the probability of default by a logistic regression, both regressions using as independent variables sociodemographic information and consumer credit contract variables in the data set. We show that the data support the possibility of defining a spread for each client - the borrower - that is coherent with the portfolio spread given by the model.",
    "year": 2015,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "8f312486766d646d05d067bd218faf31",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T00:55:28.558215"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk",
      "Portfolio Management"
    ],
    "justification": "The paper proposes a model for determining the spread of a credit portfolio based on the actuarial principle, which involves estimating recovery rates and probabilities of default. This directly relates to managing credit risk (Financial Risk Management) and optimizing the portfolio's performance (Portfolio Management). The application to a consumer credit portfolio further supports its relevance to these domains.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\", \"Portfolio Management\"],\n  \"justification\": \"The paper proposes a model for determining the spread of a credit portfolio based on the actuarial principle, which involves estimating recovery rates and probabilities of default. This directly relates to managing credit risk (Financial Risk Management) and optimizing the portfolio's performance (Portfolio Management). The application to a consumer credit portfolio further supports its relevance to these domains.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:21:07.870836"
}