{
  "paper": {
    "id": 3765,
    "title": "Use of Multiple Linear Regression Techniques to Predict Energy Storage Systems' Total Capital Costs and Life Cycle Costs",
    "abstract": "In the United States, legislative and regulatory requirements are the primary drivers for the use of grid-level energy storage. In some cases, state-level legislative mandates called Renewable Portfolio Standards (RPSs) necessitate the use of storage to support renewable generation (e.g., solar, wind energy). At the federal level, the Federal Energy Regulatory Commission (FERC) has issued final Orders that stipulate fair and equitable competition rules for regional interstate transmission markets. In both instances, it is the investor-owned utility (IOU) entities that are financially responsible to either satisfy the state and FERC Orders or face noncompliance tines or tariffs. Unfortunately, utility investors do not have a reliable tool to assist in understanding the front-end installation costs or whole life cycle costs for electrical storage systems that service the electric grid. This paper proposes the use of multiple linear regression (MLR) techniques using R-Script to predict the total capital cost. (TCC) and life cycle cost (LCC) of real-world energy storage systems (ESSs) derived from manufactures' design specifications and intrinsic characteristics of lead-acid, lithium-ion, sodium sulfur; and vanadium and Ainc-based Aow Aatteries.",
    "year": 2020,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "22ad337a0db1be4dc549e28851e51fbd",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:20:36.092620"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究使用多元线性回归技术预测能源存储系统的总资本成本和生命周期成本，其应用场景是能源存储系统的成本预测，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究使用多元线性回归技术预测能源存储系统的总资本成本和生命周期成本，其应用场景是能源存储系统的成本预测，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:08:50.540814"
}