{
  "paper": {
    "id": 4933,
    "title": "Study on Effect of Consumer Information in Personal Credit Risk Evaluation",
    "abstract": "This study selects Chinese borrowers' information from a platform that has both online shopping and consumer loan service as sample, studies the effect of consumer information in personal credit risk evaluation, and uses the lLogistic regression model, light gradient boosting machine (LightGBM) algorithm, and Shapley Additive Explanation (SHAP). The results show that the information of all consumer loan groups cannot be covered by traditional credit information. Consumer information can help predict the behavior of borrower's repayment and provide support for personal credit risk evaluation effective. Adding consumption information to the personal credit risk evaluation model can improve the accuracy of the model effectively. The model variables are ranked by feature importance, and there are 5 consumption indicators in the first 5 indicators of feature importance, which further verifies the value and effect of consumption information in personal credit risk evaluation. This study not only reveals the effect and value of consumer information in personal credit risk evaluation effectively, but also provides new ideas for the development of consumer financial market.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "a1936bf6d1617592dc702f3a9bff6194",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "regression",
      "feature representation"
    ],
    "stage1_timestamp": "2025-05-15T02:42:36.152703"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要研究个人信用风险评估，通过机器学习模型预测借款人的还款行为，这直接属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文主要研究个人信用风险评估，通过机器学习模型预测借款人的还款行为，这直接属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:31:32.073900"
}