{
  "paper": {
    "id": 469,
    "title": "Effects of geographical origin and post-harvesting processing on the bioactive compounds and sensory quality of Brazilian specialty coffee beans",
    "abstract": "Specialty coffee beans are those produced, processed, and characterized following the highest quality standards, toward delivering a superior final product. Environmental, climatic, genetic, and processing factors greatly influence the green beans' chemical profile, which reflects on the quality and pricing. The present study focuses on the assessment of eight major health-beneficial bioactive compounds in green coffee beans aiming to underscore the influence of the geographical origin and post-harvesting processing on the quality of the final beverage. For that, we examined the non-volatile chemical profile of specialty Coffea arabica beans from Minas Gerais state, Brazil. It included samples from Cerrado (Savannah), and Matas de Minas and Sul de Minas (Atlantic Forest) regions, produced by two post-harvesting processing practices. Trigonelline, theobromine, theophylline, chlorogenic acid derivatives, caffeine, caffeic acid, ferulic acid, and p-coumaric acid were quantified in the green beans by high-performance liquid chromatography with diode array detection. Additionally, all samples were roasted and subjected to sensory analysis for coffee grading. Principal component analysis suggested that Cerrado samples tended to set apart from the other geographical locations. Those samples also exhibited higher levels of trigonelline as confirmed by two-way ANOVA analysis. Samples subjected to de-pulping processing showed improved chemical composition and sensory score. Those pulped coffees displayed 5.8% more chlorogenic acid derivatives, with an enhancement of 1.5% in the sensory score compared to unprocessed counterparts. Multivariate logistic regression analysis pointed out altitude, ferulic acid, p-coumaric acid, sweetness, and acidity as predictors distinguishing specialty coffee beans obtained by the two post-harvest processing. These findings demonstrate the influence of regional growth conditions and post-harvest treatments on the chemical and sensory quality of coffee. In summary, the present study underscores the value of integrating target metabolite analysis with statistical tools to augment the characterization of specialty coffee beans, offering novel insights for quality assessment with a focus on their bioactive compounds.",
    "year": 2024,
    "source": "WOS",
    "area": "derivatives_pricing",
    "method": "machine learning",
    "cache_key": "793da3dca7f10aa62cc96b99cd4fd82e",
    "relevant_keywords": [
      "principal components analysis"
    ],
    "stage1_timestamp": "2025-05-15T01:32:30.165969"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究咖啡豆的地理来源和收获后处理对生物活性化合物和感官质量的影响，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究咖啡豆的地理来源和收获后处理对生物活性化合物和感官质量的影响，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:04:49.272069"
}