{
  "paper": {
    "id": 3145,
    "title": "Using ELECTRE-TRI and FlowSort methods in a stock portfolio selection context",
    "abstract": "In recent years, multi-criteria sorting problems have become an interesting topic for researchers working on multi-criteria decision-making. ELimination and Choice Expressing REality (ELECTRE)-TRI and FlowSort are well-known approaches suggested for such a classification. The current study aimed to implement ELECTRE-TRI and FlowSort methods in the stock portfolio selection (SPS) as one of the most popular and important decision-making subjects and compare the outcomes of each method to understand how these methods perform in SPS problems. In this study, the best-worst method was applied to determine the weights of criteria. Four approaches for ELECTRE-TRI and 15 approaches for FlowSort were considered. Finally, 19 different approaches were considered to select stocks from a large pool of stocks. Results indicated that the model parameter should be properly defined to minimize inconsistencies and improve the power of the model.",
    "year": 2022,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "57e91ff50f8bb86fd3d87ec7ed6b8588",
    "relevant_keywords": [
      "classification"
    ],
    "stage1_timestamp": "2025-05-15T01:14:16.134906"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "The paper focuses on implementing ELECTRE-TRI and FlowSort methods specifically for stock portfolio selection (SPS), which is a core aspect of portfolio management. The study aims to compare these methods in the context of selecting stocks from a large pool, directly addressing investment decision-making processes.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Portfolio Management\"],\n  \"justification\": \"The paper focuses on implementing ELECTRE-TRI and FlowSort methods specifically for stock portfolio selection (SPS), which is a core aspect of portfolio management. The study aims to compare these methods in the context of selecting stocks from a large pool, directly addressing investment decision-making processes.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:10:37.385865"
}