{
  "paper": {
    "id": 2626,
    "title": "Financial Risk Early Warning Model Combining SMOTE and Random Forest for Internet Finance Companies",
    "abstract": "At present, there have been many achievements on enterprise financial risk early warning model, but relatively few early warning studies focusing on the Internet industry. Research shows that the model has stable recognition accuracy and good prediction performance. The improved SMOTE algorithm based on PCA can realize the equalization of unbalanced data sets and use random forest as a classifier to classify and predict geological data. Because the noise data in the original data set may cause the change of the data distribution after interpolation, it is proposed to combine the PCA algorithm and the SMOTE algorithm, first perform noise reduction and dimension reduction, and then perform data interpolation to improve the classification performance of imbalanced data sets. my country's Internet financial listed companies conduct experiments on research samples, algorithm can better improve the classification accuracy and provide new ideas for the classification and prediction of unbalanced data.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "60be9ce312341d03e12e6c2185a0b16e",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "principal components analysis",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T02:17:32.124063"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是结合SMOTE和随机森林的财务风险预警模型，旨在提高对互联网金融公司财务风险的分类和预测准确性，这直接属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"该论文的核心技术是结合SMOTE和随机森林的财务风险预警模型，旨在提高对互联网金融公司财务风险的分类和预测准确性，这直接属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:41:06.624405"
}