{
  "paper": {
    "id": 5461,
    "title": "Cloud Outsourcing in the Financial Sector: An Assessment of Internal Governance Strategies on a Cloud Transaction Between a Bank and a Leading Cloud Service Provider",
    "abstract": "Cloud applications are becoming central and critical to the delivery of financial services. Despite their significance, banks face increased exposure to transaction risks related to the use of cloud services and internal and external pressures to improve their risk management practices. In this study, we use a unique data set from a bank's cloud register to examine the effectiveness of internal governance on an ongoing cloud outsourcing transaction between a bank and cloud service provider. We employ structural equation modeling and a simple linear regression to test for transaction misalignment and causes of governance inefficiencies. We find that a strong degree of misalignment is largely due to poor design of internal controls and a weak control system that does not provide acceptable indications of residual risk likelihood. The findings indicate that cloud risks are driven not only by agency costs, but also by firm-specific risks which contribute to a number of transaction uncertainties and governance misalignment.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "afc6767c9fbbd3adf7ae854738f02ebc",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:47:43.102468"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要研究银行在云外包交易中的内部治理策略及其对交易风险的影响，这属于金融风险管理的范畴。论文使用了结构方程模型和线性回归来分析治理效率低下和交易不对齐的原因，并讨论了内部控制和剩余风险的可能性，这些都是金融风险管理的关键方面。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文主要研究银行在云外包交易中的内部治理策略及其对交易风险的影响，这属于金融风险管理的范畴。论文使用了结构方程模型和线性回归来分析治理效率低下和交易不对齐的原因，并讨论了内部控制和剩余风险的可能性，这些都是金融风险管理的关键方面。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:30:04.325847"
}