{
  "paper": {
    "id": 1685,
    "title": "'Too interconnected to fail' financial network of US CDS market: Topological fragility and systemic risk",
    "abstract": "A small segment of credit default swaps (CDS) on residential mortgage backed securities (RMBS) stand implicated in the 2007 financial crisis. The dominance of a few big players in the chains of insurance and reinsurance for CDS credit risk mitigation for banks' assets has led to the idea of too interconnected to fail (TITF) resulting, as in the case of AIG, of a tax payer bailout. We provide an empirical reconstruction of the US CDS network based on the FDIC Call Reports for off balance sheet bank data for the 4th quarter in 2007 and 2008. The propagation of financial contagion in networks with dense clustering which reflects high concentration or localization of exposures between few participants will be identified as one that is TITF. Those that dominate in terms of network centrality and connectivity are called 'super-spreaders'. Management of systemic risk from bank failure in uncorrelated random networks is different to those with clustering. As systemic risk of highly connected financial firms in the CDS (or any other) financial markets is not priced into their holding of capital and collateral, we design a super-spreader tax based on eigenvector centrality of the banks which can mitigate potential socialized losses. (C) 2012 Elsevier B.V. All rights reserved.",
    "year": 2012,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "9289b659f92541bf8e2f31db8b90abed",
    "relevant_keywords": [
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T02:06:22.446211"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要研究美国CDS市场的网络结构和系统性风险，特别是通过分析网络的拓扑结构和中心性来识别和管理系统性风险。这属于金融风险管理的范畴，尤其是针对系统性风险的管理和缓解措施。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文主要研究美国CDS市场的网络结构和系统性风险，特别是通过分析网络的拓扑结构和中心性来识别和管理系统性风险。这属于金融风险管理的范畴，尤其是针对系统性风险的管理和缓解措施。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:46:59.882516"
}