{
  "paper": {
    "id": 1470,
    "title": "Reforming higher education with ePortfolio implementation, enhanced by learning analytics",
    "abstract": "In a time when blended learning is the norm and not the exception, ePortfolio implementation has the potential to serve as a tool for 21st-century skills development, namely self-reflection, self-assessment, goal-setting, evi-dence-based learning, as well as a tool for digital literacy development. Two learning scenarios implementing ePortfolio in teaching and learning processes are presented. The first one deals with a learning model, following principles of autonomous learning applied in language learning, with a focus on goal-setting and evidence-based portfolio as a growth portfolio, with attention to applied assessment types and learning processes of university students. A constructivist approach to ePortfolio creation makes a solid foundation for the learning model. The second scenario of ePortfolio implementation presents how to use ePortfolio in pre-service teacher education, especially as an active learning strategy in the subject oriented to technology-enhanced learning. Students present in ePortfolios interviews with different target groups, relevant materials research, best practices, and applications. ePortfolios are shared between students, and create a special dynamic effect in the online course. Both presented case studies highlight the differences in positivist and constructivist approaches to ePortfolio implementation with respect to student behavior in areas of their attitudes and learning processes and evidencing. In both scenarios, learning analytics are used as an important tool to monitor students' work and for the gradual improvement of ePortfolio implementation model. Presented results prove ePortfolio tool to be a high impact practice fostering student autonomy and active learning.",
    "year": 2023,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "0736e2c2b24e7eaa1ac2e46ab5dc9170",
    "relevant_keywords": [
      "active learning"
    ],
    "stage1_timestamp": "2025-05-15T00:56:08.333179"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要讨论的是在教育领域中实施ePortfolio和利用学习分析来增强学习过程，并未涉及任何金融领域的技术应用或研究。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要讨论的是在教育领域中实施ePortfolio和利用学习分析来增强学习过程，并未涉及任何金融领域的技术应用或研究。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:20:43.616376"
}