{
  "paper": {
    "id": 1374,
    "title": "Transfer learning-based default prediction model for consumer credit in China",
    "abstract": "Financial institutions in China, such as banks, are encountering competitive impacts from Internet financial businesses. To address these impacts, financial institutions are seeking business innovations, such as an automatic credit evaluation system that is based on machine learning. Abundant new credit data are required in the implementation of new businesses to establish related risk evaluation models; however, new businesses lack data. Based on these insights, this paper innovatively proposes the idea of transfer learning, determines the similarity between traditional businesses and new businesses and transfers the data of traditional bank businesses to new business data to construct new training sets and to train small data sets. The reconstructed training data sets are used to train default risk prediction models, compare them with the benchmark models in the tests and validate the performance and adaptation of the default prediction model based on transfer learning technique. Our study highlights the commercial value of the transfer learning concept in the financial risk field and provides practitioners and management personnel with a decision basis.",
    "year": 2019,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "5272308b2532bd6b3396e7465647ab77",
    "relevant_keywords": [
      "machine learning",
      "transfer learning",
      "classification"
    ],
    "stage1_timestamp": "2025-05-15T02:02:22.677157"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on developing a default prediction model for consumer credit using transfer learning techniques, which is directly related to assessing and managing credit risk, a key aspect of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on developing a default prediction model for consumer credit using transfer learning techniques, which is directly related to assessing and managing credit risk, a key aspect of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:49:26.425734"
}