{
  "paper": {
    "id": 2521,
    "title": "Modified Average of the Base-Level Models in the Hill-Climbing Bagged Ensemble Selection Algorithm for Credit Scoring",
    "abstract": "Performance of credit scoring model is a main concern for financial institutions in determining the credit risk of credit applicants. Credit score will be one of basis for the lender to make a decision, approved or rejected, for any credit applications. There are many methods and approaches that have been modeled for this problem. This study tries to explore further the Hill-Climbing Bagged Ensemble Selection (HCES-Bag) algorithm which has the best performance for credit scoring model as has been analyzed comprehensively in the research conducted by Lessmann et al.. We modify some average formulas for the base-level models to find out the opportunity for improving the performance of credit scoring model as measured by several performance indicators. Experiment with German Credit Data from the UCI Machine Learning Repository by first using Multivariate Adaptive Regression Splines (MARS) model for features selection demonstrates that the modification average does not affect credit scoring model performance significantly. However, some of them make the credit scoring model become more efficient because we can obtained same level of credit scoring model performances by using only smaller number of base-level models. (C) 2019 The Authors. Published by Elsevier B.V. This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/) Peer-review under responsibility of the scientific committee of the 4th International Conference on Computer Science and Computational Intelligence 2019.",
    "year": 2019,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "c233bbf4053c835418267bccce1e1410",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "feature learning",
      "feature representation"
    ],
    "stage1_timestamp": "2025-05-15T02:16:32.585858"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要研究信用评分模型的性能改进，用于评估信用申请人的信用风险，这直接属于金融风险管理中的信用风险管理范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"该论文主要研究信用评分模型的性能改进，用于评估信用申请人的信用风险，这直接属于金融风险管理中的信用风险管理范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:41:34.651359"
}