{
  "paper": {
    "id": 7,
    "title": "Classifying a Lending Portfolio of Loans with Dynamic Updates via a Machine Learning Technique",
    "abstract": "Bankruptcy prediction has been broadly investigated using financial ratios methodologies. One involved factor is the quality of the portfolio of loans which is given. Hence, having a model to classify/predict position of each loan candidate based on several features is important. In this work, an application of machine learning approach in mathematical finance and banking is discussed. It is shown how we can classify some lending portfolios of banks under several features such as rating categories and various maturities. Dynamic updates of the portfolio are also given along with the top probabilities showing how the financial data of this type can be classified. The discussions and results reveal that a good algorithm for doing such a classification on large economic data of such type is the k-nearest neighbors (KNN) with k=1 along with parallelization even over the support vector machine, random forest, and artificial neural network techniques to save as much as possible on computational time.",
    "year": 2021,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "0ed362724ed7c76b8f9f11d8cd591285",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM",
      "neural network",
      "random forest"
    ],
    "stage1_timestamp": "2025-05-15T00:38:16.215908"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要讨论了使用机器学习技术对银行贷款组合进行分类和预测，特别是针对破产预测和贷款质量评估，这属于金融风险管理中的信用风险管理范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文主要讨论了使用机器学习技术对银行贷款组合进行分类和预测，特别是针对破产预测和贷款质量评估，这属于金融风险管理中的信用风险管理范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:34:27.972376"
}