{
  "paper": {
    "id": 8509,
    "title": "Prediction of Future Health Care Utilization Through Note-extracted Psychosocial Factors",
    "abstract": "Background: Persons with multimorbidity (>= 2 chronic conditions) face an increased risk of poor health outcomes, especially as they age. Psychosocial factors such as social isolation, chronic stress, housing insecurity, and financial insecurity have been shown to exacerbate these outcomes, but are not routinely assessed during the clinical encounter. Our objective was to extract these concepts from chart notes using natural language processing and predict their impact on health care utilization for patients with multimorbidity. Methods: A cohort study to predict the 1-year likelihood of hospitalizations and emergency department visits for patients 65+ with multimorbidity with and without psychosocial factors. Psychosocial factors were extracted from narrative notes; all other covariates were extracted from electronic health record data from a large academic medical center using validated algorithms and concept sets. Logistic regression was performed to predict the likelihood of hospitalization and emergency department visit in the next year. Results: In all, 76,479 patients were eligible; the majority were White (89%), 54% were female, with mean age 73. Those with psychosocial factors were older, had higher baseline utilization, and more chronic illnesses. The 4 psychosocial factors all independently predicted future utilization (odds ratio=1.27-2.77, C-statistic=0.63). Accounting for demographics, specific conditions, and previous utilization, 3 of 4 of the extracted factors remained predictive (odds ratio=1.13-1.86) for future utilization. Compared with models with no psychosocial factors, they had improved discrimination. Individual predictions were mixed, with social isolation predicting depression and morbidity; stress predicting atherosclerotic cardiovascular disease onset; and housing insecurity predicting substance use disorder morbidity. Discussion: Psychosocial factors are known to have adverse health impacts, but are rarely measured; using natural language processing, we extracted factors that identified a higher risk segment of older adults with multimorbidity. Combining these extraction techniques with other measures of social determinants may help catalyze population health efforts to address psychosocial factors to mitigate their health impacts.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "51d0a8023bb9ecd9f34834f3e161425a",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T03:19:21.390472"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究使用自然语言处理技术从医疗记录中提取心理社会因素，并预测其对医疗资源利用的影响。虽然涉及机器学习和回归分析，但其应用领域是医疗健康而非金融。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究使用自然语言处理技术从医疗记录中提取心理社会因素，并预测其对医疗资源利用的影响。虽然涉及机器学习和回归分析，但其应用领域是医疗健康而非金融。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:25:36.607049"
}