{
  "paper": {
    "id": 2598,
    "title": "Improved Artificial Bee Colony Algorithm for Feature Selection to Enhance the Prediction of Credit Risk in SMEs",
    "abstract": "Prediction for enterprise credit risk in the era of Industry 4.0 is important for early credit crisis warning. Existing evaluation methods for small and medium-sized enterprises (SMEs) credit levels simply using financial information have two major limitations. Firstly, it relies heavily on financial reports to ignore the soft information, including the influence of digital supply chain. (DSC). Secondly, it demands higher efficiency in feature selection with the increase in the dimension of credit data. Therefore, we introduce a novel ensemble model for SMEs credit risk prediction combined with the improved Artificial Bee Colony (ABC) algorithm for feature selection (IABCFS). Firstly, we build a new evaluation system for SMEs credit risk with consideration of the information value of digital supply chain, and then use TF-IDF algorithm to measure the indexes. Secondly, we improve the standard ABC algorithm for feature selection by a new search strategy, and use Symmetric Uncertainty (SU) to construct the fitness function for the higher efficiency. Finally, we introduce the SVM-Adaboost ensemble model to generate the prediction result, and use SMOTE algorithm with Tomek Link Removal to handle the problem of class imbalance. The results of feature selection show that the information of DSC in SMEs credit risk prediction deserve more attention, and our proposed model also achieves competitive results both on a Chinese SMEs dataset and three public datasets.",
    "year": 2025,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "1b3bfdbd119d7d79677a4b84a90c72e0",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM",
      "feature learning"
    ],
    "stage1_timestamp": "2025-05-15T02:17:01.787016"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是改进的人工蜂群算法用于特征选择，以增强中小企业信用风险的预测。信用风险预测是金融风险管理的重要组成部分，因此该论文的主要应用领域是金融风险管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"该论文的核心技术是改进的人工蜂群算法用于特征选择，以增强中小企业信用风险的预测。信用风险预测是金融风险管理的重要组成部分，因此该论文的主要应用领域是金融风险管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:41:07.816133"
}