{
  "paper": {
    "id": 4986,
    "title": "Quantifying longevity gaps using micro-level lifetime data",
    "abstract": "Using flexible Poisson regressions, we analyse a huge micro-level lifetime dataset from a Dutch pension fund, including categorical, continuous and spatial risk factors collected on participants in the fund. The availability of granular lifetime data allows us to quantify the longevity gap between the national population and the fund on the one hand, and between participants within the fund on the other hand. We identify the most important risk factors using statistical criteria that measure the in- and out-of sample performance of the regression models. We evaluate the financial performance of the models by introducing a novel type of backtest, which selects the risk factors that contribute most to an accurate prediction of future pension liabilities. For this portfolio, the most relevant risk factors (next to age and gender) are the salary, the time spent in disability and working at irregular hours. The resulting personalized mortality risk profiles show substantial differences between the remaining life expectancies for the most-favourable and least-favourable risk profiles. Our method to estimate these longevity gaps will help policy makers to assess wanted and unwanted consequences of longevity risk sharing in pension schemes.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "953941be1d922d353370c7d340c246ae",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:43:06.772501"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用灵活的泊松回归分析微观层面的寿命数据，以量化长寿风险差距，并评估其对未来养老金负债预测的影响。这直接关系到养老金计划中的长寿风险管理，属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是使用灵活的泊松回归分析微观层面的寿命数据，以量化长寿风险差距，并评估其对未来养老金负债预测的影响。这直接关系到养老金计划中的长寿风险管理，属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:31:31.420692"
}