{
  "paper": {
    "id": 1009,
    "title": "Predictably Unpredictable? How Judgmental and Machine Learning Forecasts Complement Each Other",
    "abstract": "Demand forecasting for seasonal products becomes especially challenging in the case of fast innovations, where the product portfolio is upgraded every season. In addition to the problem of forecasting demand without any historical data, companies also have to deal with frequent stockouts, which bias past sales and provide an unreliable anchor for making new forecasts. We show how one can use machine learning models to leverage information on comparable products from the past together with experts' forecasts to improve forecasting accuracy. A machine learning forecast using only statistical features results in a forecast error reduction of 24%, measured by weighted mean absolute percentage error, compared to a purely judgmental prediction on data from Canyon Bicycles. Better yet, an integrated human-machine forecast leads to a further 14% reduction in forecast error, indicating that experts' predictions remain essential for forecasting demand for rapidly innovating seasonal products. The combination of the experts' knowledge of the future and the machine learning algorithms' ability to leverage historical information works best in this setting.",
    "year": 2024,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "2b9f256cc0f41dca2bcc5f0bb06f089b",
    "relevant_keywords": [
      "machine learning",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T00:50:40.781955"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究如何结合机器学习和专家判断来提高季节性产品的需求预测准确性，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究如何结合机器学习和专家判断来提高季节性产品的需求预测准确性，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:25:20.857554"
}