{
  "paper": {
    "id": 2513,
    "title": "A hybrid stock selection model using genetic algorithms and support vector regression",
    "abstract": "In the areas of investment research and applications, feasible quantitative models include methodologies stemming from soft computing for prediction of financial time series, multi-objective optimization of investment return and risk reduction, as well as selection of investment instruments for portfolio management based on asset ranking using a variety of input variables and historical data, etc. Among all these, stock selection has long been identified as a challenging and important task. This line of research is highly contingent upon reliable stock ranking for successful portfolio construction. Recent advances in machine learning and data mining are leading to significant opportunities to solve these problems more effectively. In this study, we aim at developing a methodology for effective stock selection using support vector regression (SVR) as well as genetic algorithms (GAs). We first employ the SVR method to generate surrogates for actual stock returns that in turn serve to provide reliable rankings of stocks. Top-ranked stocks can thus be selected to form a portfolio. On top of this model, the GA is employed for the optimization of model parameters, and feature selection to acquire optimal subsets of input variables to the SVR model. We will show that the investment returns provided by our proposed methodology significantly outperform the benchmark. Based upon these promising results, we expect this hybrid GA-SVR methodology to advance the research in soft computing for finance and provide an effective solution to stock selection in practice. (C) 2011 Elsevier B. V. All rights reserved.",
    "year": 2012,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "36a6dd8f91deeef39dbd0ff04dced753",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "regression",
      "support vector machine",
      "SVM",
      "feature learning"
    ],
    "stage1_timestamp": "2025-05-15T02:16:32.544891"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是使用支持向量回归（SVR）和遗传算法（GA）进行股票选择，目的是构建一个表现优异的投资组合。论文明确提到股票选择是为了成功的投资组合构建，并且通过优化模型参数和特征选择来提高投资回报，这直接关联到投资组合管理领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是使用支持向量回归（SVR）和遗传算法（GA）进行股票选择，目的是构建一个表现优异的投资组合。论文明确提到股票选择是为了成功的投资组合构建，并且通过优化模型参数和特征选择来提高投资回报，这直接关联到投资组合管理领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:41:35.303254"
}