{
  "paper": {
    "id": 1665,
    "title": "Identifying Veterans with a Higher Risk of Social Needs Using Cluster Analysis",
    "abstract": "ImportanceMany social need screening to advance population health and reduce health disparities, but barriers to screening remain. Improved knowledge of patient populations at risk for social needs based on administrative data could facilitate more targeted practices, and by extension, feasible social need screening and referral efforts.ObjectiveTo illustrate the use of cluster analysis to identify patient population segments at risk for social needs.DesignWe used clustering analysis to identify population segments among Veterans (N=2010) who participated in a survey assessing nine social needs (food, housing, utility, financial, employment, social disconnection, legal, transportation, and neighborhood safety). Clusters were based on eight variables (age, race, gender, comorbidity, region, no-show rate, rurality, and VA priority group). We used weighted logistic regression to assess association of clusters with the risk of experiencing social needs.ParticipantsNational random sample of Veterans with and at risk for cardiovascular disease who responded to a mail survey (N=2010).Main Outcomes and MeasuresSelf-reported social needs defined as the risk of endorsing (1) each individual social need, (2) one or more needs, and (3) a higher total count of needs.Key ResultsFrom the clustering analysis process with sensitivity analysis, we identified a consistent population segment of Veterans. From regression modeling, we found that this cluster, with lower average age and higher proportions of women and racial minorities, was at higher risk of experiencing >= 1 unmet need (OR 1.74, CI 1.17-2.56). This cluster was also at a higher risk for several individual needs, especially utility needs (OR 3.78, CI 2.11-6.78).ConclusionsThe identification of characteristics associated with increased unmet social needs may provide opportunities for targeted screenings. As this cluster was also younger and had fewer comorbidities, they may be less likely to be identified as experiencing need through interactions with healthcare providers.",
    "year": 2025,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "ddff343ec49a8547642d8c6f56e8f543",
    "relevant_keywords": [
      "unsupervised learning",
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T02:06:22.378118"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究使用聚类分析识别退伍军人中社会需求较高的群体，其应用领域属于公共卫生和社会服务，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究使用聚类分析识别退伍军人中社会需求较高的群体，其应用领域属于公共卫生和社会服务，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:47:17.631569"
}