{
  "paper": {
    "id": 392,
    "title": "Machine learning-based prediction of energy poverty in Bangladesh: Unveiling key socioeconomic drivers for targeted policy actions",
    "abstract": "Energy poverty remains a critical issue in Bangladesh, with substantial disparities in access to energy services across socio-economic and geographic groups. This study explores the socio-demographic factors driving multidimensional energy poverty and evaluates the potential of machine learning (ML) models to improve the predictive accuracy of the multidimensional energy poverty index score compared to traditional statistical models. Using national survey data, we first applied binary logistic regression to identify key determinants, such as division, place of residence, education, and financial inclusion. The results indicate that rural households, particularly in Rangpur and Barisal, face a significantly higher risk of energy poverty. In contrast, higher education and access to financial services are associated with reduced energy deprivation. Recognizing the limitations of traditional statistical models in capturing complex, nonlinear interactions and multicollinearity among socio-demographic factors, we implemented six ML algorithms-Random Forest, Support Vector Machine, KNearest Neighbor, Linear Discriminant Analysis, Extreme Gradient Boosting, and Artificial Neural Networks-to enhance predictive precision. The models demonstrated consistently high accuracy, with geographic and socioeconomic factors like division, education and financial inclusion emerging as the most important predictors. Our findings emphasize the need for targeted energy policies, especially in rural areas and disadvantaged divisions. Promoting financial inclusion and improving educational access are recommended as effective strategies to further alleviate energy poverty. While the study provides valuable insights, it acknowledges the limitations of cross-sectional data and calls for further research using longitudinal approaches and an analysis of institutional factors.",
    "year": 2025,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "e5b2188e3ce71c48a8db9612a449fc3e",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "regression",
      "support vector machine",
      "SVM",
      "decision tree",
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T01:50:14.075311"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究能源贫困的预测及其社会经济驱动因素，虽然涉及金融包容性（financial inclusion）等金融相关概念，但其核心技术（机器学习模型）的应用场景是能源政策和社会经济分析，而非衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究能源贫困的预测及其社会经济驱动因素，虽然涉及金融包容性（financial inclusion）等金融相关概念，但其核心技术（机器学习模型）的应用场景是能源政策和社会经济分析，而非衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:58:27.139234"
}