{
  "paper": {
    "id": 1753,
    "title": "A Particle Swarm Optimized Fuzzy Neural Network for Credit Risk Evaluation",
    "abstract": "Neural networks (NNs) have been widely used to financial risk management because of their excellent performances of treating non-linear data with self-learning capability. However,the shortcoming of neural networks is also significant due to a black box syndrome and the difficulty in dealing with qualitative information, which limited its applications in practice. To overcome these drawbacks of NNs, in this study a particle swarm optimized fuzzy neural network(PSO-FNN) are proposed to evaluate credit risk. the results indicate that the predictive accuracies obtained from PSO-FNN are much higher than the ones obtained from NNs. To make this clearer, an illustrative example is also demonstrated in this study.",
    "year": 2008,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "9b234531a39ec1fdc5d6f2884eb8eea9",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "neural network",
      "deep learning",
      "backpropagation",
      "BP",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T02:06:52.764109"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on evaluating credit risk using a particle swarm optimized fuzzy neural network, which is a specific application within the domain of financial risk management, particularly in assessing the likelihood of default or creditworthiness.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on evaluating credit risk using a particle swarm optimized fuzzy neural network, which is a specific application within the domain of financial risk management, particularly in assessing the likelihood of default or creditworthiness.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:46:37.188039"
}