{
  "paper": {
    "id": 36,
    "title": "A data analytics method based on data science and machine learning for bank risk prediction in credit applications for financial institutions",
    "abstract": "Nowadays, banks grant credits so that customers can acquire a good or service, start or improve a business, among other benefits. The problems that may arise are over-indebtedness and low saving possibilities on the part of customers, so the tendency is the risk of default. Financial institutions require tools for default risk analysis and problem prediction. Therefore, in this research, a data analysis method based on data science and machine learning is proposed for bank risk prediction in credit applications for financial institutions. For the analysis process and for the prediction of a credit, predictive analysis methods are used: Genetic Algorithms (GA), Random Forest (RF), K-Nearest-Neighbor (KNN), Support Vector Machines (SVM) and Neural Network (NN). Quality metrics such as Accuracy, Precision, Recall and F1 Score are used to evaluate the results. A public dataset called Statlog [1] is used. This work opens the door for data analysis in different banking services. The main objective of this research is to help financial companies to optimize their processes.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "630be821ab79e4bc59f3efd3d35bc4c4",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM",
      "neural network",
      "random forest",
      "decision tree",
      "k-nearest neighbors",
      "genetic algorithms"
    ],
    "stage1_timestamp": "2025-05-15T01:46:03.855163"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on predicting default risk in credit applications using machine learning techniques, which is a core aspect of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on predicting default risk in credit applications using machine learning techniques, which is a core aspect of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:01:31.957173"
}