{
  "paper": {
    "id": 1316,
    "title": "When one domino falls, others follow: A machine learning analysis of extreme risk spillovers in developed stock markets",
    "abstract": "This study investigates the potential for extreme risk spillovers across developed stock markets using a machine learning approach. We utilize a novel methodology, proposed by Keilbar and Wang (2022), that combines extreme value theory with artificial neural networks to quantify the likelihood and magnitude of risk spillovers among twenty-three major developed stock markets for the period encompassing January 1991 to July 2022. The results reveal significant evidence of risk spillovers across the markets based on the extent of trade integration among countries. Secondly, during prolonged and vigorous periods of crisis events, extreme risk spillovers and corresponding contagion(s) within this integrated system of markets are likely to return. Moreover, the authors find that the magnitude of spillovers can be influenced by factors such as economic interconnectedness, size, book -to -market, investment portfolio and financial market volatility. The study offers important insights into the nature and dynamics of risk spillovers in developed stock markets and highlights the potential benefits of incorporating machine learning techniques into risk management strategies.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "a5843d6311bf41a97a9f56d8b76402fc",
    "relevant_keywords": [
      "machine learning",
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T02:01:44.667619"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on analyzing extreme risk spillovers across developed stock markets using machine learning techniques, which is directly related to understanding and managing financial risks in interconnected markets. The study's methodology and findings are aimed at improving risk management strategies, making it primarily applicable to the Financial Risk Management domain.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on analyzing extreme risk spillovers across developed stock markets using machine learning techniques, which is directly related to understanding and managing financial risks in interconnected markets. The study's methodology and findings are aimed at improving risk management strategies, making it primarily applicable to the Financial Risk Management domain.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:49:49.889845"
}