{
  "paper": {
    "id": 418,
    "title": "The Hybrid Artificial Intelligence Model for Analyzing the Default Risk of Non-Profit Financial Intermediation",
    "abstract": "This study proposed a novel hybrid artificial intelligence (HAI) model that integrated the unique advantages of the synthetic minority over-sampling technique with borderline schema (Borderline-SMOTE), fuzzy rough set theory (FRST), and support vector machine (SVM), in order to predict the default probability of non-profit financial institutes (credit unions) under an imbalanced data structure. We utilized Borderline-SMOTE to overcome the class imbalance problem and employ FRST to select the important features of credit unions, feeding these representative characteristics into SVM to construct the risk assessment model. The result showed that no specific risk assessment model presented the best performance under different criteria and dissimilar environment factors. Thus, we handled model selection through a statistical examination that systematically determined a more appropriate one. The study further tackled the obscure nature of the SVM-based hybrid model and generated interpretable rules, which helped develop an interactive rule format so that decision makers can use condition attributes to predict the status of credit unions, as well as to follow the model's directions to improve their organization's capital structure. Finally, the study compared the ex-ante and ex-post decision rules established in relation to the 2007-2008 global financial crisis. The comparison could be useful for central bank governors in assessing policy implications and in formulating future policy that will ensure stability in a credit union environment.",
    "year": 2016,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "71954d563d8bd0397c74a36328ca45b4",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM",
      "feature learning"
    ],
    "stage1_timestamp": "2025-05-15T01:50:52.607849"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是开发一种混合人工智能模型来预测非营利金融机构（信用合作社）的违约概率，并生成可解释的规则以帮助决策者改善资本结构。这直接涉及信用风险评估和违约预测，属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是开发一种混合人工智能模型来预测非营利金融机构（信用合作社）的违约概率，并生成可解释的规则以帮助决策者改善资本结构。这直接涉及信用风险评估和违约预测，属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:58:05.360390"
}