{
  "paper": {
    "id": 2632,
    "title": "TENET: Tail-Event driven NETwork risk",
    "abstract": "CoVaR is a measure for systemic risk of the networked financial system conditional on institutions being under distress. The analysis of systemic risk is the focus of recent econometric analyses and uses tail event and network based techniques. Here, in this paper we bring tail event and network dynamics together into one context. In order to pursue such joint efforts, we propose a semiparametric measure to estimate systemic interconnectedness across financial institutions based on tail-driven spillover effects in a high dimensional framework. The systemically important institutions are identified conditional to their interconnectedness structure. Methodologically, a variable selection technique in a time series setting is applied in the context of a single-index model for a generalized quantile regression framework. We could thus include more financial institutions into the analysis to measure their tail event interdependencies and, at the same time, be sensitive to non-linear relationships between them. Network analysis, its behaviour and dynamics, allows us to characterize the role of each financial industry group in 2007-2012: the depositories received and transmitted more risk among other groups, the insurers were less affected by the financial crisis. The proposed TENET-Tail Event driven NETwork technique allows us to rank the Systemic Risk Receivers and Systemic Risk Emitters in the US financial market. (C) 2016 Elsevier B.V. All rights reserved.",
    "year": 2016,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "a6d685f3861425e67db553b1e907a109",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:17:32.149800"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是提出了一种半参数方法来估计金融机构之间的系统性互联风险，特别是在高维框架下基于尾部驱动的溢出效应。研究重点在于识别系统性重要机构及其互联结构，以及通过网络分析来评估金融市场的系统性风险接收者和发射者。这些内容直接关联到金融风险管理中的系统性风险分析。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是提出了一种半参数方法来估计金融机构之间的系统性互联风险，特别是在高维框架下基于尾部驱动的溢出效应。研究重点在于识别系统性重要机构及其互联结构，以及通过网络分析来评估金融市场的系统性风险接收者和发射者。这些内容直接关联到金融风险管理中的系统性风险分析。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:41:06.209349"
}