{
  "paper": {
    "id": 2026,
    "title": "Improving Credit Risk Prediction in Online Peer-to-Peer (P2P) Lending Using Feature selection with Deep learning",
    "abstract": "At the early of 211 century, In the UK Peer2Peer (P2P) lending began with Zopa at the start of 2005. After that, it has grown rapidly in United States, China and some other countries. The main challenge for individual investors in the P2P lending market is to allocate their money efficiently through different loans by accurately evaluating the credit of each loan. The traditional ranking models cannot conform to the needs of individual investors in P2P lending because they do not provide natural mechanisms for asset allocation. P2P loans do not have the presence of traditional financial institutions. In this study, we propose a novel method for analyzing data for this emerging market. We have designed a credit risk model based on advanced machine learning methods, capable of assessing the returns and risks of individual loans. We also applied a selection feature method to eliminate the irrelevant features for improving the efficient of machine learning models. We conducted experiments on real-world data sets from P2P lending markets. The experimental results show that the proposed model can improve the efficiency of investment compared to the existing methods of P2P lending.",
    "year": 2019,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "bef9a2e456d6b6f4fe4532118fc1cd3e",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "feature learning",
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T02:10:25.686481"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk",
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是使用深度学习和特征选择方法来评估P2P借贷中的信用风险，这直接涉及金融风险管理。同时，论文提到帮助个体投资者高效分配资金，这涉及到投资组合管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\", \"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是使用深度学习和特征选择方法来评估P2P借贷中的信用风险，这直接涉及金融风险管理。同时，论文提到帮助个体投资者高效分配资金，这涉及到投资组合管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:44:47.968865"
}