{
  "paper": {
    "id": 1775,
    "title": "Credit Risk Models for Financial Fraud Detection: A New Outlier Feature Analysis Method of XGBoost With SMOTE",
    "abstract": "Outlier detection is currently applied in many fields, where existing research focuses on improving imbalanced data or enhancing classification accuracy. In the financial area, financial fraud detection puts higher demands on real-time and interpretability. This paper attempts to develop a credit risk model for financial fraud detection based on an extreme gradient boosting tree (XGBoost). SMOTE is adopted to deal with imbalanced data. AUC is the assessment indicator, and the running time is taken as the reference to compare with other frequently used classification algorithms. The results indicate that the method proposed by this paper performs better than others. At the same time, XGBoost can obtain a ranking of important features that impact the classification results when performing classification tasks, making the evaluation results of the model interpretable. The above shows that the model proposed in the paper is more practical in solving credit risk assessment problems. It has faster response times, reduced costs, and better interpretability.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "1bccdbb3dd2240a5adfb7fd554d2ac5d",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T02:07:25.682311"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是开发一种基于XGBoost和SMOTE的信用风险模型，用于金融欺诈检测。信用风险模型和欺诈检测属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是开发一种基于XGBoost和SMOTE的信用风险模型，用于金融欺诈检测。信用风险模型和欺诈检测属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:46:35.092200"
}