{
  "paper": {
    "id": 354,
    "title": "A Trading Strategy Based on Analysts' Industry Analyses - Evidence from Textual Analyses of Analyst Reports in Chinese Stock Market",
    "abstract": "Applying a deep-learning method that is efficient in differentiating the order of words, we extract the tone of analysts' industry analyses to measure analyst expertise and aggregate it at industry level as OPNI. Based on OPNI, we successfully construct the industry hedging portfolio that longs industries with highest OPNI and shorts industries with lowest OPNI, which generates significant and robust abnormal returns. Furthermore, we find that the industry hedging portfolio based on industry-level numerical forecasts cannot generate significant returns. Additionally, in mechanism analyses, we find that the informativeness of analysts' industry analyses is driven by its predictability on industry-level unexpected revenues and earnings. Our findings suggest that industry analyses in analysts' reports contain incremental value about their industry expertise, which is beyond analysts' quantitative forecasts.",
    "year": 2023,
    "source": "WOS",
    "area": "portfolio",
    "method": "deep learning",
    "cache_key": "999388ccc0e1a33c76df5a0393086905",
    "relevant_keywords": [
      "deep learning",
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T00:35:17.433722"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是使用深度学习分析分析师报告的行业分析语调，并基于此构建行业对冲投资组合（long industries with highest OPNI and shorts industries with lowest OPNI），这直接涉及投资组合的构建和管理。论文的研究目标和实验设计都集中在投资组合的绩效上，因此其主要应用领域是投资组合管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是使用深度学习分析分析师报告的行业分析语调，并基于此构建行业对冲投资组合（long industries with highest OPNI and shorts industries with lowest OPNI），这直接涉及投资组合的构建和管理。论文的研究目标和实验设计都集中在投资组合的绩效上，因此其主要应用领域是投资组合管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T14:23:00.601588"
}