{
  "paper": {
    "id": 2750,
    "title": "How loud is consumer voice in product deletion decisions? Retail analytic insights",
    "abstract": "This study examines the role of online consumer reviews in product deletion decisions. Building upon product portfolio management theory and the signaling theory, we integrate consumer voice, represented by online consumer review behavior into organizational voice-strategic product deletion decision-making. We empirically evaluated the relationship between online consumer reviews and organizational product deletion decisions using text mining and logistic regression models. The results indicate consumer online review characteristics are significant factors for product deletion decisions. Findings suggest that products with lower review attribute ratings, or those with textual review content less pertinent to the core performance attributes, are more likely to be deleted. The linguistic retail analytic characteristics of online reviews also provide insights for product deletion decisions. Products with reviews having higher subjectivity, shorter length, and lower readability are more likely to be deleted. Pre-purchase consumer voice-the perceived helpfulness or unhelpfulness of online reviews also impacts product deletion decisions. A general conclusion is that online reviews can provide important retail analytics for smarter retail operations planning at the strategic and tactical levels when it comes to product planning and portfolio management through product deletion.",
    "year": 2025,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "9d0065d6a90333a004e791d101ba092e",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:10:16.444723"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究在线消费者评论对产品删除决策的影响，属于零售分析和产品组合管理领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究在线消费者评论对产品删除决策的影响，属于零售分析和产品组合管理领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:13:13.117176"
}