{
  "paper": {
    "id": 6923,
    "title": "Evaluating disease management programs",
    "abstract": "The growing burden of chronic illness has contributed to increasing healthcare costs in the past two decades. Disease management can play an important role in reducing the growth in costs while at the same time improving outcomes. It is important that disease management companies accurately measure the financial impact of their program interventions in order to provide evidence that costs are reduced in the participant population because of the interventions. The most satisfactory method for evaluating the impact of disease management programs is a randomized controlled study. Unfortunately, randomized controlled studies can be costly, time-consuming and not morally acceptable for some clients. On the other hand, performing financial evaluations of a program without using a control group can be misleading and result in inefficient use of resources. The next best alternative to a randomized controlled study is to perform a retrospective pre-post control study. The key focus of a retrospective study is identifying a control group that is similar in socioeconomic, clinical and demographic characteristics to the intervention group. It is important not to use patients in the control group who refuse to participate in the program, because of self-selection biases that can be difficult to overcome. In this article, a high-risk coronary artery disease management program is used as an example in designing and implementing a retrospective financial outcomes study. The main hurdle to overcome was identifying a suitably large control group that had characteristics similar to the intervention group. Regression analysis was used to adjust for additional differences between the two groups. The results provide evidence that a retrospective pre-post control study can be a feasible alternative to costly randomized controlled studies. Although not reaching statistical significance at the usual 5% level, which is a limitation likely to be due to the small sample size, the sample study estimated total cost savings to be $US504 per member per month (PMPM). This represents an annualized saving of $US 1016 064 for the 168 members in the intervention group.",
    "year": 2002,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "b336f3d96ad3d78917cdf61b5e7ec960",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T03:03:13.425221"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究疾病管理项目的财务影响评估，涉及回归分析等技术，但其核心应用领域是医疗健康管理而非金融领域。论文未提及衍生品定价、金融风险管理或投资组合管理等金融应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究疾病管理项目的财务影响评估，涉及回归分析等技术，但其核心应用领域是医疗健康管理而非金融领域。论文未提及衍生品定价、金融风险管理或投资组合管理等金融应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:27:06.714512"
}