{
  "paper": {
    "id": 2167,
    "title": "Energy Financial Risk Management in China Using Complex Network Analysis",
    "abstract": "Effective energy financial risk management is crucial to ensure that China's economic system can remain stable. This article utilizes the quantile vector autoregressive spillover index model, complex networks, and deep learning methods to simultaneously assess both the internal and external energy financial market risks in China. Spillover effects under different market conditions are also examined. The research findings indicate that: (1) Under extreme market conditions, static total spillover values between internal and external markets exceed 70%, while under normal market conditions, they are only around 53% and 13%, respectively; (2) Crude oil and fuel oil as well as energy and stocks are important nodes in both internal and external markets; and (3) The attention-convolutional neural network-long short-term memory model outperforms the second-best performing model, and achieves an improvement of 12.9% and 21.4% in terms of mean absolute error and root mean square error, respectively; inclusion of early warning indicators leads to further improvements of 19.8% and 31.9%, respectively.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "583ed1e7586ee668f505ff1f0c7bfc48",
    "relevant_keywords": [
      "deep learning",
      "neural network",
      "convolutional neural network",
      "CNN",
      "long short-term memory",
      "LSTM",
      "attention mechanism"
    ],
    "stage1_timestamp": "2025-05-15T02:12:17.344904"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on assessing internal and external energy financial market risks in China using advanced models like quantile vector autoregressive spillover index, complex networks, and deep learning methods. The primary goal is to manage financial risks associated with energy markets, which falls under the domain of Financial Risk Management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on assessing internal and external energy financial market risks in China using advanced models like quantile vector autoregressive spillover index, complex networks, and deep learning methods. The primary goal is to manage financial risks associated with energy markets, which falls under the domain of Financial Risk Management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:44:04.110802"
}