{
  "paper": {
    "id": 3607,
    "title": "Can a Company's Poor Customer Service Be a Security Risk? An Examination of Airbnb's Twitter Data Using Artificial Intelligence Supervised Machine Learning",
    "abstract": "This research explores whether poor customer service can lead to security risks for customers. Airbnb was used as the case study subject for this research as its customer service is largely transparent to the public due to Airbnb's reliance on Twitter. While existing literature has documented both Airbnb's poor customer service and safety and security risks at Airbnb sites, no research has explored the relationship between these two phenomena. Using Artificial Intelligence Supervised Machine Learning, this study examined over 300,000 tweets to @Airbnbhelp over a period of seven years, from January 1, 2013, to September 2, 2020. This review showed that the public primarily contacts @Airbnbhelp to complain about Airbnb's customer service; however, these complainants frequently cited Airbnb's lack of customer service in situations reflecting serious security issues, including unsafe conditions and account hacking. This review shows that Airbnb not only has poor customer service, but this lack of attention to customer service puts its customers at personal and financial risk. It is possible that dysfunctional organizational bureaucracy, illustrated by the reliance on bots, could be a contributing factor.",
    "year": 2025,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "018108b01d9fc7afe6f0f841414d4e1d",
    "relevant_keywords": [
      "machine learning",
      "supervised learning"
    ],
    "stage1_timestamp": "2025-05-15T02:27:54.123501"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是通过机器学习分析Airbnb的客户服务与安全风险之间的关系，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是通过机器学习分析Airbnb的客户服务与安全风险之间的关系，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T14:23:36.614025"
}