{
  "paper": {
    "id": 3464,
    "title": "Computer-supported portfolio analysis and comparison using ontology-based patent classification mapping scheme: the case of mobile communication patent pools",
    "abstract": "Mobile communication patents must conform to LTE-Advanced (called fourth generation or 4G) specifications to be categorized as LTE-A standard essential patents (SEPs). Global LTE-A patent pools, such as Sisvel and Via Licensing, collect SEPs from patent assignees, facilitate the SEP licensing processes, and provide fast-forward technical solutions to licensees. This research develops a computer-supported ontology-based patent classification (ontology-IPC) mapping scheme. Two major LTE-A patent pools (Sisvel and Via Licensing) and a national research project pool provide the case study. The research methodology defines the patent pool profiles using visualization maps for collaborative SEPs licensing and provides critical data to avoid re-inventing technologies and infringing upon existing intellectual property. The research enables mobile network and device developers to work cooperatively to develop fast, dependable, and interoperable products and services. The ontology-IPC analysis of the data demonstrates the approach's versatile application to support national project research reviews.",
    "year": 2017,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "6318551ff5a2d60ec8c1de9a16f63d29",
    "relevant_keywords": [
      "classification"
    ],
    "stage1_timestamp": "2025-05-15T01:17:25.492944"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是基于本体的专利分类映射方案，用于移动通信专利池的分析和比较，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是基于本体的专利分类映射方案，用于移动通信专利池的分析和比较，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:09:42.462723"
}