{
  "paper": {
    "id": 775,
    "title": "The Impact of the U.S. Macroeconomic Variables on the CBOE VIX Index",
    "abstract": "The purpose of this study is to find the influence of various macroeconomic factors on the volatility index, as macroeconomic factors affect stock market volatility, resulting in an impact on the VIX Index, representing the risk in the stock market. To estimate the significance and importance of the U.S. macroeconomic variables on stock market volatility and risk, classification problems from machine learning are constructed to predict the daily and weekly trends of the VIX Index. Data from May 2007 to December 2021 is considered for analysis. The selected models are trained with twenty-four daily features and twenty-four plus nine weekly features. The outcomes suggest that the decisions made by the Light GBM and XG Boost on ranking features can be significantly accepted over logistic regression. It is found from the results that economic policy uncertainty indices, gold price, the USD Index, and crude oil are signified as strong predictors. The Financial Stress Index, initial claims, M2, TED spread, Fed rate, and credit spread are also strong predictors, while various yields on fixed income securities make a little less impact on the VIX Index. The TED spread, Financial Stress Index, and Equity Market Volatility (Infectious Disease Tracker) are positively associated with the VIX.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "8e2b4c999bdb8ffc1c3800445886e842",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T01:55:07.993940"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心研究是使用机器学习模型预测VIX指数的趋势，VIX指数是衡量市场风险的重要指标，因此该研究主要应用于金融风险管理领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心研究是使用机器学习模型预测VIX指数的趋势，VIX指数是衡量市场风险的重要指标，因此该研究主要应用于金融风险管理领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:54:41.679689"
}