{
  "paper": {
    "id": 538,
    "title": "A grouping-based AdaBoost method for factor investing",
    "abstract": "Constructing a quantitative factor investment strategy based on hundreds of candidate factors is a critical challenge. Existing linear models do not account for nonlinearities and variable interactions, while complex machine learning models are easily overfitting. In this paper, motivated by the portfolio sorts methods in empirical asset pricing, we propose an alternative approach called grouping-based AdaBoost by adapting the existing AdaBoost. It introduces the experience of the financial field into the algorithm design to improve the performance and generalization of machine learning-based factor investing strategies. The proposed method restricts the factor to only predict the common part of the returns of the same groups and allows the potential nonlinear relationship between a factor and the return. Moreover, to enhance the model's ability to use factors with high correlation, we extend the single-grouping AdaBoost in a multi-grouping way. Experiments on the Chinese A-share market demonstrate the effectiveness of our approach in both stock performance classification and portfolio selection and provide intuitive evidence for the generalization of the proposed method.",
    "year": 2022,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "971f70dd4c0476701e25b7e76eb58a5e",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T00:44:21.149215"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是提出一种基于分组的AdaBoost方法，用于构建量化因子投资策略，并在中国A股市场上进行了股票绩效分类和投资组合选择的实验。这些内容明确指向投资组合管理领域，而非衍生品定价或金融风险管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是提出一种基于分组的AdaBoost方法，用于构建量化因子投资策略，并在中国A股市场上进行了股票绩效分类和投资组合选择的实验。这些内容明确指向投资组合管理领域，而非衍生品定价或金融风险管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T14:20:20.311544"
}