{
  "paper": {
    "id": 128,
    "title": "A Suspicious Financial Transaction Detection Model Using Autoencoder and Risk-Based Approach",
    "abstract": "This study focuses on the detection of suspicious transactions characterized by the opaque and complex electronic channels that have emerged with the advancement of electronic financial technology. A model that can immediately reflect trends in various types of fund and transaction flows, and autonomously learn complex transaction types, is proposed. As a key outcome, an internal control model for detecting suspicious transactions based on the risk-based approach is constructed by utilizing autoencoder to enhance anti-money laundering (AML) operations, and this method surpasses traditional AML methods. Additionally, the proposed model facilitates the extraction of candidate factors for suspicious transactions and updates warning models in AML monitoring systems, thereby allowing for the analysis of alert cases. As a result, AML operations based on the proposed model are quantitatively and qualitatively superior to those based on the traditional approaches, resulting in swift processing by avoiding exhaustive examinations of suspicious transaction types. This research provides information that can improve the AML operation systems used within the financial sector by evaluating the risk of suspicious transactions and reflecting various elements of funds and transactions.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "deep learning",
    "cache_key": "a49381e76bcc7d4d1e6c730bf6d8fbb3",
    "relevant_keywords": [
      "unsupervised learning",
      "autoencoder",
      "deep learning",
      "neural network",
      "representation learning"
    ],
    "stage1_timestamp": "2025-05-15T01:34:25.376727"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用自编码器和基于风险的方法来检测可疑金融交易，这直接应用于反洗钱（AML）操作，属于金融风险管理领域。论文的研究目标和应用场景明确指向风险管理，而非衍生品定价或投资组合管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是使用自编码器和基于风险的方法来检测可疑金融交易，这直接应用于反洗钱（AML）操作，属于金融风险管理领域。论文的研究目标和应用场景明确指向风险管理，而非衍生品定价或投资组合管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:04:08.389327"
}