{
  "paper": {
    "id": 1523,
    "title": "Credit Risk Analysis Using Hidden Markov Model",
    "abstract": "This study investigates the performance of Hidden Markov Model (RMM) for credit risk analysis in terms of classification and probability of default (PD) modeling. The PD modeling assigns default bankruptcy probabilities to credit customers instead of strictly classifying them as good (solvent) and bad (insolvent) borrowers. In the first part, the classification ability of HMM is compared to that of Logistic Regression (LR) and k-Nearest Neighbors (k-NN). In the second part, the PD modeling performance of HMM is analyzed and compared to that of popular LR algorithm for PD modeling. This study aims to build appropriate algorithms to make HMM an effective way of credit risk analysis as well as conventional methods. Results of the experiments show that HMM is a powerful and robust method for credit risk analysis and can be utilized by financial institutions.",
    "year": 2008,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "8cc9c92e0fd3d0b05d315be1304608bc",
    "relevant_keywords": [
      "machine learning",
      "classification",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:04:20.028401"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on using Hidden Markov Model for credit risk analysis, specifically in modeling the probability of default (PD) and classifying borrowers, which are key components of financial risk management in assessing and mitigating credit risk.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on using Hidden Markov Model for credit risk analysis, specifically in modeling the probability of default (PD) and classifying borrowers, which are key components of financial risk management in assessing and mitigating credit risk.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:48:22.713354"
}