{
  "paper": {
    "id": 8848,
    "title": "Clinical and Sociobehavioral Prediction Model of 30-Day Hospital Readmissions Among People With HIV and Substance Use Disorder: Beyond Electronic Health Record Data",
    "abstract": "Background: Under the Affordable Care Act, hospitals receive reduced reimbursements for excessive 30-dayread missions. However, the Centers for Medicare and Medicaid Services does not consider social and behavioral variables in expected readmission rate calculations, which may unfairly penalize systems caring for socially disadvantaged patients, including patients with HIV. Setting: Randomized controlled trial of patient navigation with or without financial incentives in HIV-positive substance users recruited from the inpatient setting at 11 US hospitals. Methods: External validation of an existing 30-day readmission prediction model, using variables available in the electronic health record (EHR-only model), in a new multicenter cohort of HIV-positive substance users was assessed by C-statistic and Hosmer-Lemeshow testing. A second model evaluated sociobehavioral factors in improving the prediction model (EHR-plus model) using multivariable regression and C-statistic with cross-validation. Results: The mean age of the cohort was 44.1 years, and participants were predominantly males (67.4%), non-white (88.0%), and poor (62.8%, <$20,000/year). Overall, 17.5% individuals had a hospital readmission within 30 days of initial hospital discharge. The EHR-only model resulted in a C-statistic of 0.65 (95% confidence interval: 0.60 to 0.70). Inclusion of additional sociobehavioral variables, food insecurity and readiness for substance use treatment, in the EHR-plus model resulted in a C-statistic of 0.74 (0.71 after cross-validation, 95% confidence interval: 0.64 to 0.77). Conclusions: Incorporation of detailed social and behavioral variables substantially improved the performance of a 30-day readmission prediction model for hospitalized HIV-positive substance users. Our findings highlight the importance of social determinants in readmission risk and the need to ask about, adjust for, and address them.",
    "year": 2019,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "e5fea54d0ab7ce0264ff02d38ccd7bf2",
    "relevant_keywords": [
      "classification",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T03:22:57.932051"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是医疗领域的30天再入院预测模型，特别是针对HIV和物质使用障碍患者。虽然使用了分类和回归技术，但这些技术并未应用于衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是医疗领域的30天再入院预测模型，特别是针对HIV和物质使用障碍患者。虽然使用了分类和回归技术，但这些技术并未应用于衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:25:35.119072"
}