{
  "paper": {
    "id": 2393,
    "title": "International stock market comovement in time and scale outlined with a thick pen",
    "abstract": "We quantify time-varying, bivariate and multivariate comovement between international stock market returns, across various time scales, based on a novel approach of Fryzlewicz and Oh (2011) called thick pen transform. With help of this nonparametric and simple tool, we study 11 countries and examine their comovement with respect to (non-dyadic) time scales/frequencies, development and region. We also consider all possible 2036 different combinations of two or more of these countries. In the two-country case, we make comparisons with cross-correlations, either rolling-window or based on the multi-period returns. We find that in the bivariate set-up with the USA, the BRIC countries, except for Brazil (especially over small time scales), offer diversification benefits, while in the multivariate one, clustering with respect to America or Europe (but not Asia) leads to homogeneous groups. Hence development and region cannot always be considered as ultimate clustering factors. Leave-one-out cross-validation shows a nuanced interplay of time scales, development and region as grouping factors for Brazil, Japan, Hong Kong and Russia. Additionally, we provide an example of a time-scale-dependent portfolio strategy.",
    "year": 2017,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "d7ddb1622922abcc0cc1f9c504ae6176",
    "relevant_keywords": [
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T01:06:38.025482"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文研究了国际股票市场的联动性，并探讨了不同时间尺度下的投资组合策略，这直接关联到投资组合管理的领域。论文中提到的‘time-scale-dependent portfolio strategy’明确表明其研究与应用属于投资组合管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文研究了国际股票市场的联动性，并探讨了不同时间尺度下的投资组合策略，这直接关联到投资组合管理的领域。论文中提到的‘time-scale-dependent portfolio strategy’明确表明其研究与应用属于投资组合管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:14:47.139545"
}