{
  "paper": {
    "id": 736,
    "title": "A new corporate credit scoring system using semi-supervised discriminant analysis",
    "abstract": "Corporate credit scoring is important for investors and banks in risk management. However, the high dimensional data available from public financial statements make credit analysis difficult. To address the problem, dimensionality reduction is a key step to enhance scoring accuracy. By using semi-supervised discriminant analysis (SSDA) and support vector machines (SVMs), this study develops a novel system for credit scoring, where SSDA transforms high dimensional data space (over 50 financial variables) to a perfect low dimensional representative subspace with maximal discriminating power. Constructing SVM classifier in the new space effectively reduces overfitting and enhances classification accuracy. Empirical results indicate that SSDA is better than traditional dimensionality reduction schemes, and it significant improves SVM performance. More importantly, the new classification system substantially outperforms conventional classifiers. The new decision support system can help corporate bond investors make good assessments on their risks and substantially reduce their losses.",
    "year": 2011,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "52f1d76a755ce804ca4db12be44c2407",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "semi-supervised learning",
      "classification",
      "support vector machine",
      "SVM",
      "feature representation"
    ],
    "stage1_timestamp": "2025-05-15T01:54:34.042041"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on developing a corporate credit scoring system using semi-supervised discriminant analysis and support vector machines to improve risk assessment for corporate bond investors. This directly addresses the need for better risk management tools in financial institutions, making it relevant to the Financial Risk Management domain.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on developing a corporate credit scoring system using semi-supervised discriminant analysis and support vector machines to improve risk assessment for corporate bond investors. This directly addresses the need for better risk management tools in financial institutions, making it relevant to the Financial Risk Management domain.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:55:25.766225"
}