{
  "paper": {
    "id": 6482,
    "title": "Abortion studies in Iranian dairy herds: I. Risk factors for abortion",
    "abstract": "Abortions, especially those occurring during late pregnancy, lead to considerable economic losses. To estimate the financial losses related to pregnancy loss, at first the influencing factors on abortion need to be identified. Thus, the objective of this study was to determine and quantify the risk factors and their interactions for abortion in Iranian dairy herds. Based on data from 6 commercial herds, logistic regression was used to identify the risk factors for abortion. The basic time unit used in the study was a 3-week period corresponding to an estrus cycle. Thus, stage of lactation is measured as number of 3-week periods in milk (3-WIM) and stage of pregnancy accordingly as number of 3-week periods in pregnancy. After removing the records with missing information, the analysis included 482,071 3-WIM records for 26,289 pregnant cows collected between 2005 and 2014. The investigated factors were herd effect, pregnancy stage, previous abortion, calving month, cumulative fat corrected milk (FCM) yield level, mastitis in current 3-weeks in milk, accumulated number of mastitis and all 2-way interactions. Pregnancy tests were performed between 35 and 50 days after insemination. Abortion was defined as fetal death or return to estrus after confirmed pregnancy between 63 and 252 days in pregnancy. The overall rate of abortion, calculated as the number of aborted cows divided by the number of pregnant cows, was 15.4% ranging from 13.6% to 17.4% at herd level. The results of the logistic regression analysis showed that the risk of abortion differs between herds. Furthermore, all other investigated factors interacted significantly with herd thus illustrating that the effects of risk factors also differ between herds. Other significant risk factors included parity (interacting with pregnancy stage, mastitis, lactation stage and previous abortion), calving month, mastitis (interacting with pregnancy stage), pregnancy stage (interacting with previous abortion and mastitis), lactation stage (interacting with mastitis) and previous abortion. Milk yield was not a significant risk factor for abortion, but due to significant interaction with mastitis it was kept in the final model. In general, it is concluded that inclusion of significant interactions in a risk factor analysis as the present is of paramount importance for a correct quantification of the risk factors for a cow with given characteristics.",
    "year": 2017,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "cbb78c784a57adbd576ec2f8bcd40663",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:58:34.164268"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是伊朗奶牛群的流产风险因素，虽然使用了回归分析技术，但其应用领域是农业和兽医学，与金融领域的衍生品定价、金融风险管理和投资组合管理无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是伊朗奶牛群的流产风险因素，虽然使用了回归分析技术，但其应用领域是农业和兽医学，与金融领域的衍生品定价、金融风险管理和投资组合管理无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:27:53.322845"
}