{
  "paper": {
    "id": 1455,
    "title": "The Application of ESL Robust Regression in the Single Index Model",
    "abstract": "Robust regression has been a common method to solve some portfolio selection problem by using traditional ordinary least square estimation (OLS). However, the outliers in the realistic data often break the data consistency rules which make the ordinary least square estimation lose efficacy. Here, the Exponential Squared Loss (ESL) robust regression is considered to eliminate the influence of outliers. By adjusting the square loss function into the exponential squared loss function and adaptive LASSO penalty function, the parameters estimation accuracy are improved. In this way, it reduces the impact of outliers in historical returns on the investment portfolio decision. Then, combined with the characteristic of the stock market in China, the data of Shenzhen A share market is used to validate the robust of the single index model. The result indicates the advantage of the ESL robust regression by comparing the estimation accuracy of the ESL robust estimation with OLS estimation and M estimation. Finally, the portfolio efficient frontier reveals the stability of ESL robust regression in the single index model.",
    "year": 2016,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "77e0543fa3bdcebd0cd095fd93dfa835",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T00:56:08.285985"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "The paper focuses on improving the accuracy of parameter estimation in the single index model to reduce the impact of outliers on investment portfolio decisions, which is a core aspect of portfolio management. The study validates the method using stock market data and discusses the portfolio efficient frontier, further confirming its application in portfolio management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Portfolio Management\"],\n  \"justification\": \"The paper focuses on improving the accuracy of parameter estimation in the single index model to reduce the impact of outliers on investment portfolio decisions, which is a core aspect of portfolio management. The study validates the method using stock market data and discusses the portfolio efficient frontier, further confirming its application in portfolio management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:21:03.322402"
}