{
  "paper": {
    "id": 2853,
    "title": "Fusing Economic Indicators for Portfolio Optimization - A Simulation-Based Approach",
    "abstract": "Portfolio optimization and quantitative risk management have been extensively studied since the 1990s, and attracted even more attention after the financial crisis in 2008. Such a disastrous event required portfolio managers to better manage the risk and return trade-off when building their clients' portfolios. With that said, the advancement of machine-learning algorithms and computing resources helps portfolio managers explore rich information by incorporating the macro-economy conditions into their investment strategies and optimizing their portfolio performance in a timely manner. In this paper, we present a simulation-based approach by fusing eleven macroeconomic factors using Neural Networks (NN) to build an Economic Factor-based Predictive Model (EFPM). Then, we combine it with Copula-GARCH simulation model and the Mean-Conditional Value at Risk (Mean-CVaR) framework to derive an optimal portfolio comprised of six index funds. Empirical test on the achieved portfolio is conducted on an out-of-sample dataset utilizing a rolling-horizon approach. Finally, we compare its performance against the three benchmark portfolios over a twelve-year period (01/2007 - 12/2018). The results indicate that the proposed EFPM-based asset allocation strategy outperforms the three alternatives on many common metrics, including annualized return, 99% VaR, and Sharpe ratio.",
    "year": 2019,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "f85230db3b62f6b3a1118b01efe20b1b",
    "relevant_keywords": [
      "machine learning",
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T02:19:46.747795"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management",
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是结合宏观经济因素和机器学习模型（神经网络）来优化投资组合，并采用Mean-CVaR框架进行风险管理。研究目标明确指向投资组合的构建和优化，同时涉及风险管理的指标（如VaR和Sharpe ratio）。因此，该论文主要应用于投资组合管理和金融风险管理领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\", \"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是结合宏观经济因素和机器学习模型（神经网络）来优化投资组合，并采用Mean-CVaR框架进行风险管理。研究目标明确指向投资组合的构建和优化，同时涉及风险管理的指标（如VaR和Sharpe ratio）。因此，该论文主要应用于投资组合管理和金融风险管理领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:39:44.616852"
}