{
  "paper": {
    "id": 1635,
    "title": "Research and Development of a Research Base Learning Model (RBL) In Teaching Students of the Faculty of Education St. Theresa International College",
    "abstract": "Research objectives to develop a Research-Based Learning model, to develop teaching skills by Research-Based Learning model, and to compare student achievement between general teaching and Research-Based Learning teaching. The target group is students in the graduate diploma teacher program, in the subjects Curriculum and Teaching. The research findings are as follows: 1) Summary of the learning management model by using Active Learning concepts in research teaching (RBL) of students Diploma Teaching Profession In the Curriculum and Teaching subject. There are 16 distinctive works in E-Portfolio. Individual work files are sent via E-mail to the instructor, stored as a portfolio in each student's identification folder provided. 2) Assessment of teacher teaching skills In each aspect and overall, students found their opinions Overall is at a high level. 3) Achievement score of teaching by Active Learning concept with using Research-Based Learning(RBL) found that the achievement scores at a very good level. The highest number is 36.21 percent, followed by a good level of 34.48 percent and a fair level. 18.97 percent, with a low level of achievement (passed the minimum criteria) 8.62 percent and a person who has a very low assessment (lower than the threshold) amount of 1 person, representing 1.72 percent. 4) Research results and research quality level of 58 students from 2 study groups. A total of 33 research studies found that the research work of the students has been completed. And passed the criteria for consideration of 26 cases, representing 78.79%, There were 47 researchers, accounting for 81.34 percent, while 7 disqualified works were 21.21 percent, with 11 researchers accounting for 18.96 percent. Of these, there were 6 very good works for development. Submitted for publication in CTI base journals, amount 3 subjects.",
    "year": 2020,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "43c25cf053384ed3603c8fcd10ecad2c",
    "relevant_keywords": [
      "active learning"
    ],
    "stage1_timestamp": "2025-05-15T00:57:46.927178"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究基于研究的学习模型（RBL）在教育领域的应用，特别是教师教学技能和学生成就的比较，并未涉及任何金融领域的技术或应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究基于研究的学习模型（RBL）在教育领域的应用，特别是教师教学技能和学生成就的比较，并未涉及任何金融领域的技术或应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:19:41.534149"
}