{
  "paper": {
    "id": 260,
    "title": "Measurement of Project Portfolio Benefits With a GA-BP Neural Network Group",
    "abstract": "To facilitate the project portfolio benefits (PPB) management and realize the maximization of the benefits, a PPB measurement model based on the genetic algorithm (GA)-BP neural network group (GA-BPNNG) is proposed in current research. Unlike traditional benefits management approaches, the proposed model takes full cooperation and information sharing advantages of group learning to measure PPB more accurately, which considers both the financial and nonfinancial benefits and synergy benefits generated from the interrelationships among project portfolio components. To ascertain the priority of the PPB measurement model, the GA-BPNNG model is compared with BPNN and GA-BPNN, two common models in the literature. The mean square error of the GA-BPNNG model reduced by 94% and 83%, respectively, when compared to the BPNN and GA-BPNN models. The results suggest that the PPB measurement model performs more effectively. Therefore, it could be concluded that the proposed model has a better nonlinear fitting effect for PPB measurement. This article can support managers, decision-makers, and management in realizing strategy by providing a practical and scalable tool for PPB measurement.",
    "year": 2023,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "6af71999ac16106837b5be6ebfd31fe0",
    "relevant_keywords": [
      "neural network",
      "backpropagation",
      "BP"
    ],
    "stage1_timestamp": "2025-05-15T00:41:04.759573"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究项目组合效益（PPB）的测量模型，虽然涉及组合的概念，但其应用场景是项目管理而非金融投资组合管理。论文未提及衍生品定价或金融风险管理的相关内容。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究项目组合效益（PPB）的测量模型，虽然涉及组合的概念，但其应用场景是项目管理而非金融投资组合管理。论文未提及衍生品定价或金融风险管理的相关内容。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:32:16.566265"
}