{
  "paper": {
    "id": 218,
    "title": "Forecasting volatility spillovers across Chinese financial industries: an out-of-sample framework using a novel matrix autoregressive model",
    "abstract": "Effective control of current and future financial volatility spillovers is crucial for risk management. Earlier studies indicate the presence of financial volatility spillovers; however, little is known about how to predict their dynamic evolution. This article proposes an out-of-sample forecasting framework based on the novel matrix autoregressive (MAR) model, which fully exploits the predictive information contained in the matrix structure of financial volatility spillovers. Specifically, we estimate cross-industry volatility spillover matrices of Chinese financial institutions by the Elastic Net vector autoregression network approach. We then apply the MAR model to forecast cross-industry volatility spillovers, and further evaluate its predictive ability versus different benchmark models. We find that cross-industry volatility spillovers increase rapidly in response to risk events during the entire period. The banking, insurance, and real estate industries are net volatility receivers, while the securities and diversified financial industries act as net transmitters. Moreover, it is demonstrated that the MAR model outperforms long short-term memory (LSTM) network model, vector autoregressive (VAR) model, and the VAR models with various predictors. The results are robust to a series of tests. Forecasting changes in cross-industry volatility spillovers can provide early warnings for financial regulation and investment decision.",
    "year": 2025,
    "source": "WOS",
    "area": "financial_risk",
    "method": "deep learning",
    "cache_key": "4fae9d7c6855abca3cc25539f0199bac",
    "relevant_keywords": [
      "long short-term memory",
      "LSTM"
    ],
    "stage1_timestamp": "2025-05-15T01:35:45.470608"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是预测跨行业波动溢出效应，旨在为金融监管和投资决策提供早期预警，这直接关联到金融风险管理领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是预测跨行业波动溢出效应，旨在为金融监管和投资决策提供早期预警，这直接关联到金融风险管理领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:04:02.624065"
}