{
  "paper": {
    "id": 720,
    "title": "A hybrid model for credit risk assessment: empirical validation by real-world credit data",
    "abstract": "This paper examines which hybridization strategy is more suitable for credit risk assessment in the dynamic financial world. As such, we use extensive new data sets and develop different hybrid models by combining traditional statistical and modern artificial intelligence methods based on classification and clustering feature selection approaches. We find that a multilayer perceptron (MLP) combined with discriminant analysis or logistic regression (LR) can significantly improve classification accuracy compared with other single and hybrid classifiers. In particular, the findings of our empirical analysis, statistical significance test and expected cost of misclassification test confirm the superiority of the clustering-based LR + MLP hybrid classifier in improving prediction accuracy in maximum performance criteria. To check the efficiency and viability of the proposed model, we use three imbalanced data sets: Chinese farmer credit, Chinese small and medium-sized enterprise (SME) credit and German credit. We also use Australian credit data for further authentication and a robustness check. The first two data sets are private and high dimensional, whereas the second two are mostly used, publicly available and low dimensional. Thus, our findings are relevant for many areas of credit risk, such as SME, farmer and consumer credit risk modeling.",
    "year": 2020,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "5e1ade98360678af089c2b139a941e97",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "regression",
      "clustering",
      "neural network",
      "deep learning",
      "backpropagation",
      "BP",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T01:54:33.994305"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on developing hybrid models for credit risk assessment, which is a key aspect of financial risk management. The study uses real-world credit data to validate the models, specifically addressing credit risk in various contexts such as SME, farmer, and consumer credit.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on developing hybrid models for credit risk assessment, which is a key aspect of financial risk management. The study uses real-world credit data to validate the models, specifically addressing credit risk in various contexts such as SME, farmer, and consumer credit.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:55:27.864788"
}