{
  "paper": {
    "id": 1131,
    "title": "Combination of ESG scores and prediction-based returns using long short-term memory neural networks to generate responsible portfolios",
    "abstract": "The significance of the environmental, social, and governance (ESG) factors has risen substantially among investors in recent years. Similarly, machine learning techniques have allowed for improvements in the prediction of stock prices. Our research combines ESG factors and prediction-based returns using recurrent neural networks to create profitable-sustainable portfolios that can consistently beat the market index in return and ESG scores. Our analysis focuses on the components of the EURO STOXX 50 (R) Index during the year 2021 and the first half of 2022, allowing us to analyze two different market scenarios, continuous growth and bear market, respectively. This paper provides empirical evidence that combining machine learning with ESG scores and its application in portfolio optimization can achieve higher returns and higher ESG performance depending on the macroeconomic context and presents the trade-off between the Sharpe Ratio and the ESG score of the optimized portfolios for different scenarios.",
    "year": 2024,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "6f5c939cba698ba966b6ecbcda171fa3",
    "relevant_keywords": [
      "machine learning",
      "neural network",
      "deep learning",
      "recurrent neural network",
      "long short-term memory",
      "LSTM"
    ],
    "stage1_timestamp": "2025-05-15T00:52:00.397246"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是结合ESG评分和基于LSTM神经网络的预测回报来构建可持续的投资组合，并优化其表现。这直接涉及投资组合的构建和优化，属于投资组合管理领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是结合ESG评分和基于LSTM神经网络的预测回报来构建可持续的投资组合，并优化其表现。这直接涉及投资组合的构建和优化，属于投资组合管理领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:23:59.285689"
}