{
  "paper": {
    "id": 1366,
    "title": "Portfolio Optimization with Prediction-Based Return Using Long Short-Term Memory Neural Networks: Testing on Upward and Downward European Markets",
    "abstract": "In recent years, artificial intelligence has helped to improve processes and performance in many different areas: in the field of portfolio optimization, the inputs play a crucial role, and the use of machine learning algorithms can improve the estimation of the inputs to create robust portfolios able to generate returns consistently. This paper combines classical mean-variance optimization and machine learning techniques, concretely long short-term memory neural networks to provide more accurate predicted returns and generate profitable portfolios for 10 holding periods that present different financial contexts. The proposed algorithm is trained and tested with historical EURO STOXX 50 (R) Index data from January 2015 to December 2020, and from January 2021 to June 2022, respectively. Empirical results show that our LSTM neural networks are able to achieve minor predictive errors since the average of the MSE of the 10 holding periods is 0.00047, the average of the MAE is 0.01634, and predict the direction of returns with an average accuracy over the 10 investment periods of 95.8%. Our prediction-based portfolios consistently beat the EURO STOXX 50 (R) Index, achieving superior positive results even during bear markets.",
    "year": 2025,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "96474e29cbfd3211572375def40af356",
    "relevant_keywords": [
      "machine learning",
      "neural network",
      "deep learning",
      "long short-term memory",
      "LSTM",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T00:54:56.448036"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是使用长短期记忆神经网络（LSTM）来预测股票收益，并将其应用于投资组合优化。研究目标是生成能够持续产生收益的稳健投资组合，并通过实证测试验证其表现优于基准指数。这明确属于投资组合管理领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Portfolio Management\"],\n  \"justification\": \"该论文的核心技术是使用长短期记忆神经网络（LSTM）来预测股票收益，并将其应用于投资组合优化。研究目标是生成能够持续产生收益的稳健投资组合，并通过实证测试验证其表现优于基准指数。这明确属于投资组合管理领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:21:35.694900"
}