{
  "paper": {
    "id": 1582,
    "title": "Current status and future directions of high-throughput ADME screening in drug discovery",
    "abstract": "During the last decade high-throughput in vitro absorption, distribution, metabolism and excretion (HT-ADME) screening has become an essential part of any drug discovery effort of synthetic molecules. The conduct of HT-ADME screening has been industrialized due to the extensive development of software and automation tools in cell culture, assay incubation, sample analysis and data analysis. The HT-ADME assay portfolio continues to expand in emerging areas such as drug-transporter interactions, early soft spot identification, and ADME screening of peptide drug candidates. Additionally, thanks to the very large and high-quality HT-ADME data sets available in many biopharma companies, in silico prediction of ADME properties using machine learning has also gained much momentum in recent years. In this review, we discuss the current state-of-the-art practices in HT-ADME screening including assay portfolio, assay automation, sample analysis, data processing, and prediction model building. In addition, we also offer perspectives in future development of this exciting field. (c) 2020 Xi'an Jiaotong University. Production and hosting by Elsevier B.V. All rights reserved. This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/).",
    "year": 2020,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "b7869eaf7b7ba171e8550f999f1ec3c9",
    "relevant_keywords": [
      "machine learning"
    ],
    "stage1_timestamp": "2025-05-15T00:57:12.722866"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要讨论的是药物发现中的高通量ADME筛选技术，包括自动化工具、数据分析和机器学习预测模型的应用。这些内容与衍生品定价、金融风险管理或投资组合管理等金融领域无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要讨论的是药物发现中的高通量ADME筛选技术，包括自动化工具、数据分析和机器学习预测模型的应用。这些内容与衍生品定价、金融风险管理或投资组合管理等金融领域无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:20:07.148261"
}