{
  "paper": {
    "id": 1373,
    "title": "Predicting the credit risk of small and medium-sized enterprises in supply chain finance using machine learning algorithms",
    "abstract": "The credit risk of small and medium-sized enterprises (SMEs) in supply chain finance (SCF) hinders the sustainability of the supply chain and threatens the monetary loss of SCF partners, that is, focal enterprises (FEs) and financial institutions (FIs). Thus, it is crucial to predict SMEs' credit risk accurately. However, redundant features and imbalanced sample data may decrease the accuracy of the prediction model. Therefore, a novel credit risk prediction framework is proposed called FS-RS-ML, which is short for Feature Selection-Resample Strategy-Machine Learning. In this approach, Recursive Feature Elimination with Cross-Validation (RFECV) is applied to select key features influencing SMEs' credit risk prediction, and three resampling techniques are used to balance the sample data. Finally, five machine learning algorithms are adopted to classify high-risk and low-risk SMEs. The experiments based on Chinese SCF data demonstrate that the FS-RS-ML framework outperforms any single algorithm. Moreover, according to the analysis of empirical results, features derived from SMEs have the most important impact on credit risk prediction. And the effect of key features on predicting SMEs' credit risk is revealed.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "8356cf9fca2bc781ff0283255e94a14e",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM",
      "decision tree",
      "feature learning"
    ],
    "stage1_timestamp": "2025-05-15T02:02:22.665142"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用机器学习算法预测中小企业的信用风险，这直接涉及金融风险管理中的信用风险评估。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是使用机器学习算法预测中小企业的信用风险，这直接涉及金融风险管理中的信用风险评估。\"\n}\n```"
  },
  "timestamp": "2025-05-20T14:23:00.286830"
}