{
  "paper": {
    "id": 885,
    "title": "Constructing credit auditing and control & management model with data mining technique",
    "abstract": "The 2008 financial tsunami, hitting the globe across all types of industries, causing tides of bankruptcies and severe unemployment, had its epicenter at American subprime in the housing market. In fact, the US subprime storm was just a premonition, while the root cause of the financial tsunami lied in the oversupply of structured credit products. Credit card business, one of the structured credit products, which under an intensively competitive environment, have been released by many banks with high spread, high return, and easy-to-apply appeals to carter to consumers needs. In order to allure the customers, some banks even go to the extent as simplify the credit rating, which in turn has increased credit risk, causing high non-performing ratio, increased debt collection cost, and growing bad debt counts. Accordingly, credit risk auditing plays a vital role in the successful management of credit card business. In response to such needs, the present study aims to conduct analysis and investigation on the current status of the industry with CRISP-DM model. First, customers' demographic data and payment-related statistics were analyzed to identify feature variables, which were then sorted out as demographic data, debt data, payment rating etc. Next, by utilizing artificial neural network of data mining technique, the study tries to predict customer's regular pattern of consumption, payment and/or default and bad debt, and to develop a set of credit granting principle by employing the decision tree technique. Since data mining classification model has a greater power in discriminating credit card granting, it can thus be used to construct accurate credit variable rules and predictive model, to further improve credit checking effect and credit risk control. Using the credit auditing data of a certain bank as a case study, the study intends to verify that the model constructed by the researcher can effectively identify the potential key factors of its credit card granting rule, to minimize the cost loss of Model I and Model II credit business, and eventually enhance the stability and profitability of the bank's credit card business. (C) 2010 Elsevier Ltd. All rights reserved.",
    "year": 2011,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "8dfcc8e50a831224f32f99cf540546f1",
    "relevant_keywords": [
      "machine learning",
      "classification",
      "decision tree",
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T01:56:17.531921"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用数据挖掘技术（如人工神经网络和决策树）来预测客户的消费、支付和违约模式，并构建信用审计和控制模型。这些技术主要用于信用风险管理，旨在减少不良贷款和提高银行信用卡业务的稳定性，因此属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"该论文的核心技术是使用数据挖掘技术（如人工神经网络和决策树）来预测客户的消费、支付和违约模式，并构建信用审计和控制模型。这些技术主要用于信用风险管理，旨在减少不良贷款和提高银行信用卡业务的稳定性，因此属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:53:55.534383"
}