{
  "paper": {
    "id": 2208,
    "title": "Stock price forecasting model analysis based on the wavelet neural network and the data cleaning technology",
    "abstract": "Financial time arrangement, for example, stock cost and trade rates are, regularly, non-straight and non-stationary. Beforehand, numerous scientists have endeavored to conjecture those utilizing factual models and machine learning models. Measurable models expect the time arrangement to be stationary and straight, accordingly bringing about expansive factual mistakes. Examination and expectation of securities exchange time arrangement information has pulled in impressive enthusiasm from the exploration group in the course of the most recent decade. Quick advancement and development of modern calculations for measurable examination of time arrangement information, and accessibility of elite equipment has made it conceivable to prepare and dissect high volume securities exchange time arrangement information successfully, continuously. In monetary field, exceptions speak to unpredictability of securities exchange, which assumes an imperative part in administration, portfolio choice and subordinate evaluating. Along these lines, anticipating anomalies of securities exchange is of the immense significance in principle and application. In this paper, the issue of anticipating anomalies in light of versatile gathering models of Intense Erudition Machines (IEMs) is considered. We discovered that the prescribed novel model is material for exception estimating and beats the strategies in light of auto relapse (AR) Intense Erudition Machines (IEMs) models.",
    "year": 2016,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "d865c23626a9856203ba06dd84a2c403",
    "relevant_keywords": [
      "machine learning",
      "neural network",
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T01:04:27.426420"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究基于小波神经网络和数据清洗技术的股票价格预测模型，虽然提到了异常值预测在投资组合决策和衍生品定价中的重要性，但论文的核心技术并未直接应用于这些特定金融领域，而是专注于股票价格预测这一更广泛的金融时间序列分析问题。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究基于小波神经网络和数据清洗技术的股票价格预测模型，虽然提到了异常值预测在投资组合决策和衍生品定价中的重要性，但论文的核心技术并未直接应用于这些特定金融领域，而是专注于股票价格预测这一更广泛的金融时间序列分析问题。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:16:42.244917"
}