{
  "paper": {
    "id": 139,
    "title": "Artificial Intelligence for Conversational Robo-Advisor",
    "abstract": "With the advent of the artificial intelligence (AI) era, the combination of AI with financial technology (FinTech) has become a development trend in the financial industry. However, deep learning (DL) on the application of automated financial management has been rarely investigated. Thus, this research focuses on the applications of FinTech and DL in asset allocation and aims to optimize investment portfolio. The best investment portfolio in index-based funds based on Taiwan's index-type security investment trust funds are the main investment targets. Time series models for DL, that is, long short-term memory, predict the increase of each investment target and find the best investment portfolio in combination with the relevant asset allocation theory. In this research, we use the Markowitz mean-variance and Black-Litterman models as our asset allocation models for robo-advisor. Results show that the Black-Litterman model has a better accumulated return performance than the Morkowitz model and outperforms other strategies. The Human-Computer Interaction (HCI) dialogue service adopts artificial intelligence markup language (AIML) and a generative model. The main contribution of this paper is that we have developed an integrated knowledge-based and generative-based models for AI conversational robo-advisor.",
    "year": 2018,
    "source": "WOS",
    "area": "portfolio",
    "method": "deep learning",
    "cache_key": "38d23be53d0cf901796c73578ca06b1e",
    "relevant_keywords": [
      "deep learning",
      "long short-term memory",
      "LSTM"
    ],
    "stage1_timestamp": "2025-05-15T00:32:31.561994"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是应用深度学习和时间序列模型（如LSTM）来优化投资组合，并使用了Markowitz均值-方差模型和Black-Litterman模型作为资产配置模型，这些都属于投资组合管理的范畴。论文的主要目标是优化投资组合，而不是衍生品定价或金融风险管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是应用深度学习和时间序列模型（如LSTM）来优化投资组合，并使用了Markowitz均值-方差模型和Black-Litterman模型作为资产配置模型，这些都属于投资组合管理的范畴。论文的主要目标是优化投资组合，而不是衍生品定价或金融风险管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:35:34.314459"
}