{
  "paper": {
    "id": 391,
    "title": "An Artificial Neural Network in Short-Term Electrical Load Forecasting of a University Campus: A Case Study",
    "abstract": "This paper presents an artificial neural network (ANN) for forecasting the short-term electrical load of a university campus using real historical data from Colorado State University. A spatio-temporal ANN model with multiple weather variables as well as time identifiers, such as day of week and time of day, are used as inputs to the network presented. The choice of the number of hidden neurons in the network is made using statistical information and taking into account the point of diminishing returns. The performance of this ANN is quantified using three error metrics: the mean average percent error; the error in the ability to predict the occurrence of the daily peak hour; and the difference in electrical energy consumption between the predicted and the actual values in a 24-h period. These error measures provide a good indication of the constraints and applicability of these predictions. In the presence of some enabling technologies such as energy storage, rescheduling of noncritical loads, and availability of time of use (ToU) pricing, the possible demand-side management options that could stem from an accurate prediction of energy consumption of a campus include the identification of anomalous events as well the management of usage.",
    "year": 2013,
    "source": "WOS",
    "area": "derivatives_pricing",
    "method": "machine learning",
    "cache_key": "41da3008912fbe22d3ad52e9e9ee525c",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "neural network",
      "backpropagation",
      "BP",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T01:31:13.212448"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究使用人工神经网络预测大学校园的短期电力负荷，其应用场景为能源管理和需求侧管理，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究使用人工神经网络预测大学校园的短期电力负荷，其应用场景为能源管理和需求侧管理，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:05:12.090875"
}