{
  "paper": {
    "id": 4173,
    "title": "Data-Driven Model for Estimating the Probability of Riverine Levee Breach Due to Overtopping",
    "abstract": "Breach due to overtopping is the most common failure mode of earthen levees. Historic records and future projections consistently show exacerbating patterns in the frequency and severity of floods in several regions, which can increase the probability of levee overtopping. The main objective of this study is twofold: (1) to present a comprehensive data set of levee overtopping events, and (2) to develop a data-driven model for determining the probability of levee breach due to overtopping that can support risk assessment. For this purpose, we first assessed available performance data to develop a refined data set of 185 riverine levee overtopping events within the portfolio of levee systems maintained by the US Army Corps of Engineers. The data set includes several geometric, geotechnical, and hydraulic variables for each overtopping incident. We then employed the data set along with logistic regression to develop, train and validate a model for calculating the probability of levee breach due to overtopping. Among several variables and functional forms examined, levee construction history, overtopping depth, overtopping duration, embankment erosion resistance, and duration of levee hydraulic loading prior to overtopping were found to be statistically significant, thus were included in the proposed model. The model was validated through k-fold cross validation and tested against a separate performance data set aside for validation purposes. The data set presented in this study can be used for identifying key factors controlling overtopping behavior, validation of model results, and providing new insight into the phenomenon of levee overtopping. The proposed model offers a practical yet robust tool for levee risk analysis that can be readily employed in practice.",
    "year": 2022,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "c1e5ebbee2a8585073ff5eb6d7eafdd9",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:24:25.428666"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是堤坝溢流破坏的概率模型，属于土木工程和自然灾害风险评估领域，并未涉及金融领域的应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是堤坝溢流破坏的概率模型，属于土木工程和自然灾害风险评估领域，并未涉及金融领域的应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:07:59.016911"
}