{
  "paper": {
    "id": 1947,
    "title": "What Financial Incentives Will Be Created by Medicare Bundled Payments for Total Hip Arthroplasty?",
    "abstract": "Background: Bundled payments are gaining popularity in arthroplasty as a tactic for encouraging providers and hospitals to work together to reduce costs. However, this payment model could potentially motivate providers to avoid unprofitable patients, limiting their access to care. Rigorous risk adjustment can prevent this adverse effect, but most current bundling models use limited, if any, risk-adjustment techniques. This study aims to identify and quantify the financial incentives that are likely to develop with total hip arthroplasty (THA) bundled payments that are not accompanied by comprehensive risk stratification. Methods: Financial data were collected for all Medicare-eligible patients (age 65+) undergoing primary unilateral THA at an academic center over a 2-year period (n = 553). Bundles were considered to include operative hospitalizations and unplanned readmissions. Multivariate regression was performed to assess the impact of clinical and demographic factors on the variable cost of THA episodes, including unplanned readmissions. (Variable costs reflect the financial incentives that will emerge under bundled payments). Results: Increased costs were associated with advanced age (P < .001), elevated body mass index (BMI; P = .005), surgery performed for hip fracture (P < .001), higher American Society of Anaesthesiologists (ASA) Physical Classification System grades (P < .001), and MCCs (Medicare modifier for major complications; P < .001). Regression coefficients were $155/y, $107/BMI point, $2775 for fracture cases, $2137/ASA grade, and $4892 for major complications. No association was found between costs and gender or race. Conclusion: If generalizable, our results suggest that Centers for Medicare and Medicaid Services bundled payments encompassing acute inpatient care should be adjusted upward by the aforementioned amounts (regression coefficients above) for advanced age, increasing BMI, cases performed for fractures, elevated ASA grade, and major complications (as defined by Medicare MCC modifiers). Furthermore, these figures likely underestimate costs in many bundling models which incorporate larger proportions of postdischarge care. Failure to adjust for factors affecting costs may create barriers to care for specific patient populations. (C) 2016 Elsevier Inc. All rights reserved.",
    "year": 2016,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "e807a738eb20582c25a0294a3c29fa0a",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:09:14.411348"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究医疗保险捆绑支付对全髋关节置换术的经济激励影响，涉及医疗成本分析和风险调整，但并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究医疗保险捆绑支付对全髋关节置换术的经济激励影响，涉及医疗成本分析和风险调整，但并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:45:10.775159"
}