{
  "paper": {
    "id": 7049,
    "title": "Impact of Behavioral Health Screening on Proactive Identification of Patients at Risk for Hospital Readmission",
    "abstract": "Improving the ability to predict which patients are at increased risk for readmission can lead to more effective interventions and greater compliance with CMS Hospital Readmissions Reduction Program (HRRP) requirements. This study evaluated the performance of a risk model that used data from a health system's electronic medical record (EMR) to predict all-cause readmission among adult inpatients with acute medical conditions, with a specific focus on the impact of including behavioral health screening data. The study included 39,155 unique adult patients admitted during 2015 to 4 acute care inpatient facilities within a nonprofit community-based health care system. The risk model integrated a comprehensive set of data elements including demographics, psychosocial characteristics, medical history, assessment results, and clinical events. Predictive models were constructed using a multivariable logistic regression with a stepwise selection approach. Among study participants, the mean age was 62.9 years, 48.0% were male, 31.2% had comorbid psychiatric conditions, and 6986 had medical conditions/procedures subject to HRRP penalties. Results from exploratory predictive analyses demonstrated that any patients with a Serious Mental Illness (SMI) diagnosis were 28% more likely to be readmitted within 30 days, and the likelihood of readmission associated with SMI increased to 56% for patients with medical conditions subject to HRRP penalties. As health care systems face increasing pressures to reduce readmissions and avoid CMS HRRP financial penalties, study results indicate the importance of including behavioral health data from EMRs and screening assessments for all inpatients to improve discharge planning and patient outcomes.",
    "year": 2019,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "7f55f16a33b23d156aa2822a429f883c",
    "relevant_keywords": [
      "classification",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T03:04:23.034902"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究医疗领域的患者再入院风险预测模型，虽然使用了分类和回归技术，但其应用场景是医疗健康管理，与金融领域无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究医疗领域的患者再入院风险预测模型，虽然使用了分类和回归技术，但其应用场景是医疗健康管理，与金融领域无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:27:05.774162"
}