{
  "paper": {
    "id": 445,
    "title": "Taste and value: Exploring sensory acceptance and willingness-to-pay for convenient farm-raised catfish products through experimental auction",
    "abstract": "Gaining insights into consumer perceptions of newly developed food products is essential for enhancing their success in the marketplace, as it allows for refining products to align with evolving consumer preferences and aids in the formulation of effective marketing and pricing strategies. This study examines consumer insights for four newly developed, convenient, and healthy U.S. farm-raised catfish products using sensory evaluations and consumer willingness to pay (WTP) elicited through Vickrey's second-price experimental auction. Using Elastic Net (EN) regularized regression, we identified key sensory and demographic attributes affecting consumer preference and WTP. Results indicate that consumers favor these catfish products over similar market options, with taste emerging as the most significant sensory attribute driving WTP, followed by texture and smell. Additionally, demographic factors such as age, education, gender, and race significantly impacted WTP. We also evaluated the suitability of the organoleptic attributes for each product, providing recommendations for improvement where needed. This research supports product reformulation and marketing strategies and offers valuable insights for future seafood product development initiatives.",
    "year": 2025,
    "source": "WOS",
    "area": "derivatives_pricing",
    "method": "machine learning",
    "cache_key": "b2a2eb8605d1e44f4dac9ee5b5494354",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:31:50.800539"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究消费者对新型鲶鱼产品的感官接受度和支付意愿，使用回归分析来识别影响消费者偏好的关键因素。虽然提到了支付意愿（WTP）和实验拍卖方法，但这些内容属于消费者行为和市场研究领域，而非衍生品定价、金融风险管理或投资组合管理等金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究消费者对新型鲶鱼产品的感官接受度和支付意愿，使用回归分析来识别影响消费者偏好的关键因素。虽然提到了支付意愿（WTP）和实验拍卖方法，但这些内容属于消费者行为和市场研究领域，而非衍生品定价、金融风险管理或投资组合管理等金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:04:50.437783"
}