{
  "paper": {
    "id": 921,
    "title": "An XGboost Algorithm Based Model for Financial Risk Prediction",
    "abstract": ": This study presents a novel financial risk prediction model utilizing the XGboost algorithm, analyzing macroeconomic data from the Jorda-Schularic-Taylor database. Our method achieves an 84.77% accuracy rate in predicting systemic financial risks. Unlike traditional models, this model combines the anomaly detection algorithm with the XGboost model, solving the possible gray sample problem and improving predictive accuracy. The model's feature importance analysis reveals key indicators, providing insights into the dynamics of financial risk occurrence. Finally, the systemic financial risk score is used to comprehensively evaluate a country's systemic financial risk level, offering a robust risk assessment and monitoring tool. This research enhances the application of machine learning in financial risk prediction, offering a reference for improving risk identification and prevention.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "4aabd0110fd201f09b54868b474151ee",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T01:56:49.547207"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on developing a model for predicting systemic financial risks using the XGboost algorithm, which is a clear application in the field of financial risk management. The study aims to improve risk assessment and monitoring, which are key aspects of managing financial risks.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on developing a model for predicting systemic financial risks using the XGboost algorithm, which is a clear application in the field of financial risk management. The study aims to improve risk assessment and monitoring, which are key aspects of managing financial risks.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:53:51.840468"
}