{
  "paper": {
    "id": 27,
    "title": "Attention-enhanced graph neural network for financial distress and bankruptcy risk prediction",
    "abstract": "Accurate prediction of financial distress and bankruptcy risk is crucial for informed investment decisions and effective risk management. Traditional predictive approaches, which primarily rely on linear models or shallow machine learning techniques, often fail to capture the intricate non-linear interdependencies. To address this limitation, this paper proposes an attention-enhanced graph neural network (AE-GNN) model that integrates an advanced attention mechanism to enhance predictive accuracy. By structuring corporate financial data as a feature-based graph, AE-GNN effectively processes complex financial relationships through graph neural networks, employing feature aggregation and a multi-attention mechanism. Extensive experimental evaluations conducted on three benchmark datasets demonstrate that AE-GNN significantly outperforms traditional models in predictive performance, highlighting its potential as a powerful tool for financial risk assessment.",
    "year": 2025,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "8a2456e6ac88ec3b4ada04d6bbf63fa9",
    "relevant_keywords": [
      "machine learning",
      "classification",
      "neural network",
      "deep learning",
      "representation learning",
      "attention mechanism"
    ],
    "stage1_timestamp": "2025-05-15T01:46:03.792260"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on predicting financial distress and bankruptcy risk, which are key aspects of financial risk management. The proposed AE-GNN model is specifically designed to enhance predictive accuracy in this context, making it a clear application within the financial risk management domain.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on predicting financial distress and bankruptcy risk, which are key aspects of financial risk management. The proposed AE-GNN model is specifically designed to enhance predictive accuracy in this context, making it a clear application within the financial risk management domain.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:01:33.195497"
}