{
  "paper": {
    "id": 4997,
    "title": "Categorical multiblock linear discriminant analysis",
    "abstract": "Techniques of credit scoring have been developed these last years in order to reduce the risk taken by banks and financial institutions in the loans that they are granting. Credit Scoring is a classification problem of individuals in one of the two following groups: defaulting borrowers or non-defaulting borrowers. The aim of this paper is to propose a new method of discrimination when the dependent variable is categorical and when a large number of categorical explanatory variables are retained. This method, Categorical Multiblock Linear Discriminant Analysis, computes components which take into account both relationships between explanatory categorical variables and canonical correlation between each explanatory categorical variable and the dependent variable. A comparison with three other techniques and an application on credit scoring data are provided.",
    "year": 2018,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "b073e4778ce6d609cef6876f1c7f1704",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "principal components analysis"
    ],
    "stage1_timestamp": "2025-05-15T02:43:06.817284"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on developing a new method for credit scoring, which is a technique used by banks and financial institutions to assess the risk of loan defaults. This directly relates to the management of credit risk, a key aspect of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on developing a new method for credit scoring, which is a technique used by banks and financial institutions to assess the risk of loan defaults. This directly relates to the management of credit risk, a key aspect of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:31:31.237581"
}