{
  "paper": {
    "id": 3281,
    "title": "Script- and Cluster-based UCT for StarCraft",
    "abstract": "Controlling units in real-time strategy (RTS) games is a challenging problem in Artificial Intelligence (AI) as these games are fast-paced with simultaneous moves and massive branching factors. This paper presents two extensions to the algorithm VCT Considering Durations (VCTCD) for finding optimal sequences of actions to units engaged in combat using the RTS game StarCraft as a test bed. The first extension uses a script-based approach inspired by Portfolio Greedy Search and searches for sequences of scripts instead of actions. The second extension uses a cluster-based approach as it assigns scripts to clusters of units based on their type and position. Our results show that both our script-based and cluster-based VCTCD extensions outperform the original VCTCD with a winning percentage of 100% with 32 units or more. Additionally, our results show that unit clustering gives some improvement in large scenarios while it is less ef1'ective in small combats. We suggest further research of the behavior and possible variants of the cluster-based approach which can be applied to many other algorithms similarly to VCT. The algorithms were tested in our StarCraft combat simulator called JarCraft, a complete Java translation of the original C++ package SparCraft, made in hopes of making this research area more accessible.",
    "year": 2014,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "d411cb5b6756134f48aaa4224843a84b",
    "relevant_keywords": [
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T01:15:26.179681"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究实时策略游戏（RTS）中单位控制的优化算法，特别是针对《星际争霸》游戏的脚本和集群方法。虽然提到了'Portfolio Greedy Search'，但这与金融领域的投资组合管理无关，而是指算法中的一种搜索策略。论文的核心技术和应用场景均与金融领域无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究实时策略游戏（RTS）中单位控制的优化算法，特别是针对《星际争霸》游戏的脚本和集群方法。虽然提到了'Portfolio Greedy Search'，但这与金融领域的投资组合管理无关，而是指算法中的一种搜索策略。论文的核心技术和应用场景均与金融领域无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:10:14.143518"
}