{
  "paper": {
    "id": 3589,
    "title": "The impact of bank-specific factors on the commercial banks liquidity: empirical evidence from CEE countries",
    "abstract": "The recent economic and financial crisis has had a tremendous impact on the banking system, raising key questions about liquidity risk. Its management is seen to be of paramount importance, receiving great attention from policymakers, researchers and practitioners, taking into consideration that a liquidity shortage at a single so called too big to fail financial institution can lead to systemic contagion and instability. In this context, the aim of the paper is to analyse a significant issue that needs to be tackled when promoting financial stability, more exactly the determinants of the liquidity risk of a sample of banks operating in a series of CEE countries (Bulgaria, the Czech Republic, Hungary, Latvia, Lithuania, Poland, Romania), reviewing at the same time the progresses made in certain key areas and the remaining challenges. We considered bank specific factors over the period 2004-2011 and examined them employing an OLS regression analysis. The results of our research highlighted the negative impact that the depreciation of the loans portfolio had on the overall liquidity of the analysed banks. (C) 2015 The Authors. Published by Elsevier B.V.",
    "year": 2015,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "e99c30567937cc27b3e176c84d465620",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:27:54.073907"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on analyzing the determinants of liquidity risk in commercial banks, which is a key aspect of financial risk management. The study employs regression analysis to examine bank-specific factors affecting liquidity, directly addressing risk management concerns in the banking sector.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on analyzing the determinants of liquidity risk in commercial banks, which is a key aspect of financial risk management. The study employs regression analysis to examine bank-specific factors affecting liquidity, directly addressing risk management concerns in the banking sector.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:35:59.247690"
}