{
  "paper": {
    "id": 3084,
    "title": "Comparison of Econometric Models and Artificial Neural Networks Algorithms for the Prediction of Baltic Dry Index",
    "abstract": "The shipping market, a major component of the global economy, is characterized by high risk and volatility. The Baltic dry index is an influential indicator in the world shipping market and international trade. Several studies have used a variety of techniques to generate Baltic dry index predictions. The most prominent techniques utilize either econometric or artificial intelligence computing. We compare the forecasting accuracy of two typical univariant econometric models and three artificial neural networks (ANNs)-based algorithms. We find that when using daily data, econometric forecasting models produce better one-step-ahead predictions than ANN-based algorithms. When forecasting weekly and monthly data, ANN-based algorithms produce fewer errors and a higher direction matching rate than econometric models. We also compare the predictive power of a number of different models when applied to the 2008 financial crisis and and that the generalized autoregressive conditional heteroskedasticity model and the back propagation neural network algorithm produce the best one-step-ahead and seven-steps ahead predictions, respectively.",
    "year": 2019,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "42b34a2f7bb3847ca950bececf13b365",
    "relevant_keywords": [
      "neural network",
      "backpropagation",
      "BP"
    ],
    "stage1_timestamp": "2025-05-15T02:22:25.101334"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要比较了不同预测模型在预测波罗的海干散货指数（Baltic Dry Index）方面的准确性，虽然涉及金融市场的预测，但并未明确指出其核心技术应用于衍生品定价、金融风险管理或投资组合管理等特定金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要比较了不同预测模型在预测波罗的海干散货指数（Baltic Dry Index）方面的准确性，虽然涉及金融市场的预测，但并未明确指出其核心技术应用于衍生品定价、金融风险管理或投资组合管理等特定金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:38:30.573483"
}