{
  "paper": {
    "id": 471,
    "title": "Diagnosing of the Corporate Financial Health Using DEA: an Application to Companies in the Slovak Republic",
    "abstract": "The paper deals with the examining the possibilities for diagnosing the corporate financial health using Data Envelopment Analysis (DEA) technique. The main aim of the paper is to present a new proposal for diagnosing the corporate financial health by DEA, to predict financial distress of Slovak manufacturing companies using the proposed procedure, and to assess the potential of DEA as a tool for predicting financial distress of the company. Due to the special input and output variables selection and the construction of the Corporate Distress Frontier, the proposed procedure is very different from the conventional use of DEA. The proposed two-step procedure results into the identification of three zones of corporate financial health with different stage of corporate distress risk. The application of the proposed procedure to Slovak manufacturing companies and its comparison with the logistic regression model and decision tree show relatively satisfactory results of the proposed methodology in terms of correct classification of non-bankrupt firms.",
    "year": 2017,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "3cc1166d4c87a6a15edcfe19122f22e8",
    "relevant_keywords": [
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T01:51:31.199437"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on diagnosing corporate financial health and predicting financial distress using Data Envelopment Analysis (DEA), which is directly related to assessing and managing financial risks faced by companies. This falls under the domain of Financial Risk Management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on diagnosing corporate financial health and predicting financial distress using Data Envelopment Analysis (DEA), which is directly related to assessing and managing financial risks faced by companies. This falls under the domain of Financial Risk Management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:57:39.942893"
}