{
  "paper": {
    "id": 4163,
    "title": "Stylized Model of Levy Process in Risk Estimation",
    "abstract": "Risk management is a popular and important problem in academia and industry. From a small-scale system, such as city logistics, to a large-scale system, such as the supply chain of a global industrial or financial system, efficient risk management is required to prevent loss from uncertainty. In this paper, we assume that risk factors follow the Levy process, and propose a stylized model, based on regression, that can estimate the risk of a complicated system under the framework of nest simulation. Specifically, portfolio risk estimation using the Levy process is discussed as an example. The stylized model simplifies the risk factors artificially, and provides useful basis functions to fit the portfolio loss with little computational effort. Numerical experiments showed the good performance of the stylized model in estimating risk for the Variance Gamma process and the Normal Inverse Gaussian process, which are two examples of the Levy process.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "ae02172b10092631bc2f050c8d943c83",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:34:13.296918"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk",
      "Portfolio Management"
    ],
    "justification": "The paper focuses on risk estimation using the Levy process, specifically mentioning portfolio risk estimation as an example. This directly relates to financial risk management and portfolio management, as it discusses estimating risk for complex systems and provides examples relevant to portfolio loss.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\", \"Portfolio Management\"],\n  \"justification\": \"The paper focuses on risk estimation using the Levy process, specifically mentioning portfolio risk estimation as an example. This directly relates to financial risk management and portfolio management, as it discusses estimating risk for complex systems and provides examples relevant to portfolio loss.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:33:53.356548"
}