{
  "paper": {
    "id": 21,
    "title": "EXTENDING THE FEATURE SET OF A DATA-DRIVEN ARTIFICIAL NEURAL NETWORK MODEL OF PRICING FINANCIAL OPTIONS",
    "abstract": "Prices of derivative contracts, such as options, traded in the financial markets are expected to have complex relationships to fluctuations in the values of the underlying assets, the time to maturity and type of exercise of the contracts as well as other macroeconomic variables. Hutchinson, Lo and Poggio showed in 1994 that a non-parametric artificial neural network may be trained to approximate this complex functional relationship. Here, we consider this model with additional inputs relevant to the pricing of options and show that the accuracy of approximation may indeed be improved. We consider volume traded, historic volatility, observed interest rates and combinations of these as additional features. In addition to giving empirical results on how the inclusion of these variables helps predicting option prices, we also analyse prediction errors of the different models with volatility and volume traded as inputs, and report an interesting correlation between their contributions.",
    "year": 2016,
    "source": "WOS",
    "area": "derivatives_pricing",
    "method": "machine learning",
    "cache_key": "dbbb420d67c6ac8d13b71720d32fbffe",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "neural network",
      "backpropagation",
      "BP",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T01:27:29.490353"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Derivatives Pricing"
    ],
    "justification": "该论文的核心技术是使用人工神经网络模型来预测金融期权价格，这直接属于衍生品定价领域。论文明确讨论了期权价格与标的资产价值波动、到期时间等变量的复杂关系，并通过增加交易量、历史波动率等特征来提高预测准确性。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"衍生品定价\"],\n  \"justification\": \"该论文的核心技术是使用人工神经网络模型来预测金融期权价格，这直接属于衍生品定价领域。论文明确讨论了期权价格与标的资产价值波动、到期时间等变量的复杂关系，并通过增加交易量、历史波动率等特征来提高预测准确性。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:07:30.194799"
}