{
  "paper": {
    "id": 3612,
    "title": "Research on Electricity Demand Combination Forecasting Model in Beijing-Tianjin-Hebei Region Based on Shapley Value",
    "abstract": "Due to the electricity power is the foundation of economic development, reasonable and accurate electricity demand forecasting not only helps to develop electricity power planning scientifically, but also has important reference value to the economic development planning. In order to integrate different forecast models' strengths as well as improve the forecast accuracy, this paper puts forward the electricity demand forecasting model based on Shapley value. First, it chooses one-dimensional linear regression model, Holt two-parameter linear exponential smoothing model and ARIMA model for electricity demand forecasting respectively, and through the game theory Shapley value theory determines the weight of single model in the portfolio model, and then the combined forecasting result is obtained; Second, it analyzes the electricity demand data in Beijing-Tianjin-Hebei Region and the results show that the proposed method has high forecast accuracy; Finally, it forecasts electricity demand in Beijing-Tianjin-Hebei Region during 13th five-year period and provides decision-making basis for the economic development planning of Beijing, Tianjin Hebei province during 13th five-year period.",
    "year": 2016,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "569653abbe4232209ac71619af853f67",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:19:00.696619"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是电力需求预测模型，虽然使用了组合预测和Shapley值理论，但其应用场景是电力需求预测和经济规划，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是电力需求预测模型，虽然使用了组合预测和Shapley值理论，但其应用场景是电力需求预测和经济规划，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:09:16.793266"
}