{
  "paper": {
    "id": 9160,
    "title": "Cities in the epidemic, the epidemic in cities: Reconstruction of COVID-19 development in Polish cities",
    "abstract": "The Covid-19 pandemic, with its epicentres in cities, came as the most severe social, economic and financial shock of the 21st century. The reconstruction of the pandemic spread in cities, the determination of factors conducive to and preventing from SARS-CoV-2 virus infections as well as searching for the ways to combat it and its effects have become the subject of many studies and analyses. The results presented in this article are part of this research. The study covered 20 large Polish cities with different functions, in the set of which: (1) the course of the infection process (by means of a rarely used trajectory method) was determined as well as its temporal variation (variance), (2) cities were classified in terms of the similarity of the epidemic process (correlation analysis), and (3) the factors conducive to infections presented in the literature (using a multivariate regression method) were verified. In this case the investigation was also carried out on the set of 66 large cities. Generally, the relative number of infections (per 10,000 inhabitants), i.e. the intensity of infections, was used as the basis for the analysis. The research has shown that the size, function and location within the country have no influence on the course and intensity of the epidemic in particular cities. Unfortunately, it was not possible to identify factors that could be responsible for infections, or at least that could determine the risk of infections (no confirmed impact on infections of population density, the level of poverty, the proportion of a post-working age population or the level of people's health). Thus, the obtained results testify to the individual nature of the spread of the epidemic in each city and to the possible influence of other explanatory features on the infection level than those considered in this investigation, or to the level of infections as the effect of the synergetic interaction of more than just socio-economic features. The solution to this issue remains open, as it seems, not only in the case of Polish cities.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "1b55dbc95ab7c6c54b1aa548a343452f",
    "relevant_keywords": [
      "regression",
      "classification",
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T03:25:54.694961"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究COVID-19在波兰城市中的传播过程及其影响因素，使用了回归、分类和聚类等方法，但其研究内容与衍生品定价、金融风险管理或投资组合管理等金融领域无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究COVID-19在波兰城市中的传播过程及其影响因素，使用了回归、分类和聚类等方法，但其研究内容与衍生品定价、金融风险管理或投资组合管理等金融领域无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:25:12.607828"
}