{
  "paper": {
    "id": 1431,
    "title": "Enabling Cooperative Behavior for Building Demand Response Based on Extended Joint Action Learning",
    "abstract": "This paper explores the use of distributed intelligence to assist the integration of the demand as a flexible resource, to mitigate the emerging uncertainty in the power system, while fulfilling the customer's local needs, i.e., comfort management. More exactly, our contribution is twofold. First, we propose a novel cooperative and decentralized reinforcement learning method, dubbed extended joint action learning (eJAL). Second, we perform a comparison between eJAL to noncooperative decentralized decision making strategies, i.e., Q-learning, and a centralized game theoretic approach, i.e., Nash n-player game. This comparison has been conducted on the basis of grid support effectiveness and the loss of comfort for each customer. Various metrics were used to analyze the advantages and disadvantages of each method. We demonstrated that a range of flexibility requests can be met by providing an optimal energy portfolio of buildings without substantially violating comfort constraints. Moreover, we showed that the proposed eJAL method achieves the highest fairness index.",
    "year": 2018,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "091c621a16cabe8c289c76e6c4686900",
    "relevant_keywords": [
      "reinforcement learning",
      "neural network",
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T00:55:28.584021"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究分布式智能和强化学习在电力系统需求响应中的应用，核心关注点是能源组合优化和舒适度管理，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究分布式智能和强化学习在电力系统需求响应中的应用，核心关注点是能源组合优化和舒适度管理，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:21:06.941746"
}