{
  "paper": {
    "id": 6837,
    "title": "HIRA Model for Short-Term Electricity Price Forecasting",
    "abstract": "In competitive power markets, electric utilities, power producers, and traders are exposed to increased risks caused by electricity price volatility. The growing reliance on renewable sources and their dependence on weather, nuclear uncertainty, market coupling, and global financial instability are contributing to the importance of accurate electricity price forecasting. Since power markets are not all equally developed, different price forecasting methods have been introduced for individual markets. The aim of this research is to introduce a short-term electricity price forecasting method that addresses the problems of price volatility, a varying number of input parameters, varying data availability, and a large number of parameters and input data. Furthermore, the proposed model can be used on any market as it targets the characteristics and specifics of each market. The proposed Hybrid Iterative Reactive Adaptive (HIRA) method consists of two phases. In analysis phase, fundamental parameters which affect the electricity price are identified depending on market development. Obtained parameters are used as data inputs for price forecasting using a hybrid method. The HIRA model combines a statistical approach for large data set analysis and a similar day method with neural network tools. Similar days are examined using a statistical method which combines correlation significance, price volatility, and forecasting accuracy of the historical data. Data are collected based on their availability and electricity prices are forecasted in several iterations. All relevant data for price forecasting are collected, categorized, and arranged using simple indicators which makes the HIRA model adaptive and reactive to new market circumstances. The proposed model is validated using the Hungarian Power Exchange (HUPX) electricity price data records. The results show that with HIRA model forecasting, the error is stable and does not depend on price volatility. The HIRA method has proven to be applicable for forecasting electricity prices in real-time market conditions and enables effective hedging of price risk in the production or market portfolio.",
    "year": 2019,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "5bccc8b9b5be0c7712c012ee96754996",
    "relevant_keywords": [
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T03:02:07.484472"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是短期电价预测模型（HIRA），旨在帮助电力市场参与者应对电价波动带来的风险，并提到可以用于有效对冲价格风险，这属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是短期电价预测模型（HIRA），旨在帮助电力市场参与者应对电价波动带来的风险，并提到可以用于有效对冲价格风险，这属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:27:07.986621"
}