{
  "paper": {
    "id": 1756,
    "title": "Reducing Hospital Readmissions of Older Adults Pursuing Postacute Care at Skilled Nursing Facilities: A Scoping Review",
    "abstract": "Importance: Unplanned hospital readmissions can profoundly affect older adults' quality of life and the financial status of skilled nursing facilities (SNFs). Although many clinical practices focus on reforming these issues, occupational therapy's involvement remains unclear. Objective: To explore clinical practices aimed at reducing hospital readmissions of older adults pursuing postacute care (PCA) at SNFs and describe how they align with occupational therapy's scope of practice. Data Sources: We searched CINAHL, Scopus, PubMed, and OTseeker for articles published from January 2011 to February 2020. Study Selection and Data Collection: We conducted a scoping review of peer-reviewed articles with functional outcomes of clinical practices reducing unplanned hospital readmissions of patients older than age 65 yr pursuing PCA services in SNFs. Trained reviewers completed the title and abstract screens, full-text reviews, and data extraction. Findings: Thirteen articles were included and focused on five areas: risk and medical disease management and follow-up, hospital-to-SNF transition, enhanced communication and care, function, and nutrition. Early coordination of care and early identification of patients' needs and risk of readmission were common features. All clinical practices aligned with occupational therapy domains and processes, but only 1 study specified occupational therapy as part of the research team. Conclusions and Relevance: Comprehensive, multipronged clinical practices encompassing care coordination and early identification and management of acute conditions are critical in reducing preventable readmissions among older adults pursuing PCA services in SNFs. Further research is needed to support occupational therapy's value in preventing hospital readmissions of older adults in this setting. What This Article Adds: This scoping review maps the presence of occupational therapy's domains and processes in the clinical practices that reduce hospital readmissions of older adults pursuing PCA services in SNFs. Findings provide occupational therapy practitioners with opportunities to assume roles beyond direct patient care, research, advocate, and publish more, thereby increasing their presence and adding value to occupational therapy interventions that reduce hospital readmissions.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "8c63f4b5f9ca07d0a1929482b730348b",
    "relevant_keywords": [
      "PCA"
    ],
    "stage1_timestamp": "2025-05-15T02:06:52.783731"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要探讨的是如何通过临床实践减少老年人在专业护理机构中的非计划性再入院，研究重点在于医疗护理和职业治疗的应用，与金融领域无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要探讨的是如何通过临床实践减少老年人在专业护理机构中的非计划性再入院，研究重点在于医疗护理和职业治疗的应用，与金融领域无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:46:36.806885"
}