{
  "paper": {
    "id": 1734,
    "title": "Bridging Predictive Insights and Retention Strategies: The Role of Account Balance in Banking Churn Prediction",
    "abstract": "The banking industry faces significant challenges, from high customer churn rates to threatening long-term revenue generation. Traditionally, churn models assess service quality using customer satisfaction metrics; however, these subjective variables often yield low predictive accuracy. This study examines the relationship between customer attrition and account balance using decision trees (DT), random forests (RF), and gradient-boosting machines (GBM). This research utilises a customer churn dataset and applies synthetic oversampling to balance class distribution during the preprocessing of financial variables. Account balance service is the primary factor in predicting customer churn, as it yields more accurate predictions compared to traditional subjective assessment methods. The tested model set achieved its highest predictive performance by applying boosting methods. The evaluation of research data highlights the critical role of financial indicators in shaping effective customer retention strategies. By leveraging machine learning intelligence, banks can make more informed decisions, attract new clients, and mitigate churn risk, ultimately enhancing long-term financial results.",
    "year": 2025,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "94e173b214c9938f365e7ca177bd628e",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "decision tree",
      "random forest",
      "gradient boosting"
    ],
    "stage1_timestamp": "2025-05-15T02:06:52.683222"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究银行客户流失预测，虽然涉及金融指标（如账户余额），但其核心技术（决策树、随机森林、梯度提升机）应用于客户行为分析而非衍生品定价、金融风险管理或投资组合管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究银行客户流失预测，虽然涉及金融指标（如账户余额），但其核心技术（决策树、随机森林、梯度提升机）应用于客户行为分析而非衍生品定价、金融风险管理或投资组合管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:46:56.380163"
}