{
  "paper": {
    "id": 1175,
    "title": "Integrating StEP-COMPAC definition and enhanced recovery after surgery status in a machine-learning-based model for postoperative pulmonary complications in laparoscopic hepatectomy",
    "abstract": "Background: Postoperative pulmonary complications (PPCs) contribute to high mortality rates and impose significant financial burdens. In this study, a machine learning-based prediction model was developed to identify patients at high risk of developing PPCs following laparoscopic hepatectomy. Methods: Data were collected from 1022 adult patients who underwent laparoscopic hepatectomy at two centres between January 2015 and February 2021. The dataset was divided into a development set and a temporal external validation set based on the year of surgery. A total of 42 factors were extracted for premodelling, including the implementation status of Enhanced Recovery after Surgery (ERAS). Feature selection was performed using the least absolute shrinkage and selection operator (LASSO) method. Model performance was assessed using the area under the receiver operating characteristic curve (AUC). The model with the best performance was externally validated using temporal data. Results: The incidence of PPCs was 8.7%. Lambda.1se was selected as the optimal lambda for LASSO feature selection. For implementation of ERAS, serum gamma-glutamyl transferase levels, malignant tumour presence, total bilirubin levels, and age-adjusted Charleston Comorbidities Index were the selected factors. Seven models were developed. Among them, logistic regression demonstrated the best performance, with an AUC of 0.745 in the internal validation set and 0.680 in the temporal external validation set. Conclusions: Based on the most recent definition, a machine learning model was employed to predict the risk of PPCs following laparoscopic hepatectomy. Logistic regression was identified as the bestperforming model. ERAS implementation was associated with a reduction in the number of PPCs. (c) 2024 The Authors.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "e86896aee5142225a413fdca5faa3f8f",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "regression",
      "feature learning",
      "logistic regression"
    ],
    "stage1_timestamp": "2025-05-15T01:59:56.256521"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是使用机器学习模型预测术后肺部并发症的风险，属于医疗健康领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是使用机器学习模型预测术后肺部并发症的风险，属于医疗健康领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:51:38.168141"
}