{
  "paper": {
    "id": 3061,
    "title": "Developing a Novel Audit Risk Metric Through Sentiment Analysis",
    "abstract": "This study introduces the Audit Risk Sentiment Value (ARSV), a novel audit risk proxy that leverages sentiment analysis to address limitations in traditional audit risk measures such as audit fees (LNFEE), audit hours (LNHOUR), and discretionary accruals (|MJDA|). Traditional proxies primarily capture quantitative dimensions, overlooking qualitative insights embedded in audit report narratives. By systematically analyzing sentiment and tone, ARSV captures nuanced audit risk dimensions that reflect the auditor's risk perception. The study validates ARSV using a dataset of South Korean firms listed on the KOSPI from 2018 to 2023. The results demonstrate the ARSV's superior explanatory power, as confirmed through the Vuong test, showing consistent performance across binary and continuous measures of explanatory language. ARSV bridges the gap between qualitative and quantitative audit risk assessments, offering significant benefits to auditors, regulators, and investors. Its ability to enhance the interpretability of audit reports improves transparency and trust in financial reporting, addressing stakeholder demands for actionable, forward-looking information. Furthermore, ARSV aligns with global trends emphasizing sustainability and accountability by integrating qualitative insights into audit practices. While this study provides robust evidence supporting ARSV effectiveness, its focus on South Korean firms may limit its generalizability. Future research should explore ARSV application in diverse regulatory and cultural contexts and refine the sentiment analysis tools using advanced machine learning techniques. Expanding ARSV to include other unstructured data, such as management commentary, could further enhance its applicability. This study marks a significant step toward modernizing audit methodologies, aligning them with evolving demands for comprehensive and transparent financial reporting. The empirical analysis reveals that ARSV outperforms traditional audit risk proxies with significantly higher explanatory power. Specifically, ARSV achieved a pseudo R2 of 0.786, compared to 0.608 for LNFEE, 0.604 for LNHOUR, and 0.578 for |MJDA|. The Vuong test results further validate ARSV superiority, with Z-statistics of -12.168, -12.492, and -9.775 when compared against LNFEE, LNHOUR, and |MJDA|, respectively. The model incorporating ARSV demonstrated a 62.454 F-value and an Adjusted R2 of 0.599, highlighting its robustness and reliability in audit risk assessment. These quantitative metrics underscore ARSV's effectiveness in capturing qualitative audit risk dimensions, offering a more precise and informative measure for stakeholders.",
    "year": 2025,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "b4e48480dfcb6dfb1a6904537e544dae",
    "relevant_keywords": [
      "machine learning"
    ],
    "stage1_timestamp": "2025-05-15T02:21:52.321950"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是审计风险的度量方法，通过情感分析开发了一种新的审计风险代理指标（ARSV）。虽然涉及金融领域，但其核心应用是审计和财务报告，而非衍生品定价、金融风险管理或投资组合管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是审计风险的度量方法，通过情感分析开发了一种新的审计风险代理指标（ARSV）。虽然涉及金融领域，但其核心应用是审计和财务报告，而非衍生品定价、金融风险管理或投资组合管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:38:31.646169"
}