{
  "paper": {
    "id": 1281,
    "title": "Bayesian machine learning framework for characterizing structural dependency, dynamics, and volatility of cryptocurrency market using potential field theory",
    "abstract": "Identifying the structural dependence between the cryptocurrencies and predicting market trend are fundamental for effective portfolio management in cryptocurrency trading. In this paper, we present a unified Bayesian machine learning framework based on potential field theory and Gaussian Process to characterize the structural dependency of various cryptocurrencies, using historic price information. The following are our significant contributions: (i) Proposed a novel model for cryptocurrency price movements as a trajectory of a dynamical system governed by a time-varying non-linear potential field. (ii) Developed a Bayesian machine learning framework for inferring the non-linear potential function from observed cryptocurrency prices. (iii) Proposed that attractors and repellers inferred from the potential field are reliable cryptocurrency market indicators, surpassing existing attributes in the literature. (iv) Analysis of cryptocurrency market during various Bitcoin crash durations shows that attractors captured the market trend, volatility, and correlation. In addition, attractors aids explainability and visualization. (v) The proposed cryptocurrency market indicators (attractors and repellers) was used to improve the prediction performance of state-of-art deep learning price prediction models.",
    "year": 2025,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "144c9ad541e2f732a22e85c00847de5f",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "representation learning",
      "neural network",
      "long short-term memory",
      "LSTM"
    ],
    "stage1_timestamp": "2025-05-15T00:53:42.199843"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是使用贝叶斯机器学习框架和潜在场理论来识别加密货币之间的结构依赖关系并预测市场趋势，这些技术直接应用于加密货币交易中的有效投资组合管理。论文明确提到这些方法对于投资组合管理的重要性，并展示了如何利用市场指标（吸引子和排斥子）来改进预测性能，这些都是投资组合管理的关键方面。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是使用贝叶斯机器学习框架和潜在场理论来识别加密货币之间的结构依赖关系并预测市场趋势，这些技术直接应用于加密货币交易中的有效投资组合管理。论文明确提到这些方法对于投资组合管理的重要性，并展示了如何利用市场指标（吸引子和排斥子）来改进预测性能，这些都是投资组合管理的关键方面。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:22:08.940816"
}