{
  "paper": {
    "id": 1785,
    "title": "A Study of Dimensionality Reduction Techniques with Machine Learning Methods for Credit Risk Prediction",
    "abstract": "With the huge advancement of financial institution, credit risk prediction assumes a critical part to grant a loan to the customer and helps the financial institution to minimize their misfortunes. Despite the fact that there are different statistical and artificial intelligent methods available, there is no single best strategy for credit risk prediction. In our work, we have used feature selection and feature extraction methods as preprocessing techniques before building a classifier model. To validate the feasibility and effectiveness of our models, three credit data sets are picked namely Australia, German, and Japanese. Experimental results demonstrates that the SVM classifier performs better among several classifier methods, i.e., NB, LogR, DT, and KNN with LDA feature extraction technique. Test result demonstrates that the feature extraction preprocessing technique with base classifiers are the best suited for credit risk prediction.",
    "year": 2017,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "f953586b3728a25bf107889e2b2d1fca",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM",
      "decision tree",
      "feature learning",
      "feature representation"
    ],
    "stage1_timestamp": "2025-05-15T02:07:25.710314"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on credit risk prediction using machine learning techniques, which is a key aspect of financial risk management. The study aims to minimize financial losses for institutions by improving credit risk assessment, directly addressing risk management concerns.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on credit risk prediction using machine learning techniques, which is a key aspect of financial risk management. The study aims to minimize financial losses for institutions by improving credit risk assessment, directly addressing risk management concerns.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:46:34.253414"
}