{
  "paper": {
    "id": 296,
    "title": "Forecasting rare earth stock prices with machine learning",
    "abstract": "Rare earth elements (REEs) are indispensable for producing green technologies and electronics. Demand for REEs in clean energy technologies in 2040 are projected to be three to seven times higher than today and will be critical to the clean technology transition needed to stave off catastrophic climate change. Forecasting rare earth stock prices is critical for making well informed investment decisions concerning this important asset class. Despite the latter, the literature on forecasting rare earth stock prices is scarce. We use machine learning techniques to forecast daily rare earth stock price direction. The analysis reveals that random forests, extremely randomized trees, RNN, and support vector machine have higher prediction accuracy than Lasso or Naive Bayes. We find that the 10-to 20-day forecasts using random forests, extremely randomized trees, and support vector machine achieve prediction accuracies greater than 85% with some prediction accuracy reaching 90%. Lasso prediction accuracy is higher than Naive Bayes but never greater than 67%. The MA200, MA50, on balance volume, VIX, and WAD are the most important predictive features of rare earth stock price direction. A switching portfolio that uses trading signals from an Extra Trees model impressively outperforms a buy and hold portfolio. Our results reveal the high prediction accuracy of using machine learning methods in forecasting rare earth stock price direction which should be useful to investors, policy makers and venture capitalists.",
    "year": 2023,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "83cf9a5f64ec73d33eb4e2c21e2797ab",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM",
      "decision tree",
      "neural network",
      "recurrent neural network"
    ],
    "stage1_timestamp": "2025-05-15T00:42:00.395491"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是使用机器学习方法预测稀土股票价格方向，并提到一个基于交易信号的切换投资组合显著优于买入并持有策略。这直接涉及投资组合管理的应用，旨在优化投资决策和组合表现。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是使用机器学习方法预测稀土股票价格方向，并提到一个基于交易信号的切换投资组合显著优于买入并持有策略。这直接涉及投资组合管理的应用，旨在优化投资决策和组合表现。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:32:08.932035"
}