{
  "paper": {
    "id": 5629,
    "title": "SYSTEMIC RISK AND REAL ECONOMIC ACTIVITY: A SOUTH AFRICAN INSURANCE STRESS INDEX OF SYSTEMIC RISK",
    "abstract": "This study investigates the link between systemic risk in the South African insurance sector real economic activity in South Africa. To this end, we use six systemic risk measures, the Conditional Value at Risk (CoVaR), the Marginal Conditional Value at Risk (Delta CoVaR), the Comovement and Interconnectedness of the South African insurance sector (Eigen), the Dynamic Mixture Copula Marginal Expected Shortfall (DMC-MES), the Average Conditional Volatility (Ave-vol), and the South African Volatility Index (SAVI). We first evaluate the significance of each measure by assessing its ability to forecast future economic downturns in South Africa. We find that only two systemic risk measures possess the ability to predict future economic downturns in South Africa. We then use principal component quantile regression analysis to aggregate these measures into a composite stress index of systemic risk for the South African insurance sector and assess the ability of the proposed index to predict future economic downturns in South Africa. Our results reveal that the proposed index is a good predictor of future economic downturns in South Africa. Thus, our results suggest that regulators and risk managers must develop an analysis of systemic risk in the insurance sector with particular attention to its effects on real economic activity. In addition, our index can potentially be used as an instrument to monitor and mitigate systemic risk in the insurance sector in order to ensure the stability of the financial system and the economy in South Africa.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "60e8227e11066ba4af28632e2e21a9c1",
    "relevant_keywords": [
      "principal components analysis",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:49:50.268952"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要研究系统性风险的测量和预测，特别是通过多种风险度量方法（如CoVaR、Delta CoVaR等）构建一个综合压力指数来预测经济衰退，这直接属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文主要研究系统性风险的测量和预测，特别是通过多种风险度量方法（如CoVaR、Delta CoVaR等）构建一个综合压力指数来预测经济衰退，这直接属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:30:02.082424"
}