{
  "paper": {
    "id": 6495,
    "title": "Performance decay analysis of cementitious composite cladding structure under stochastic aging",
    "abstract": "Facade cladding structure made of cementitious composite is prone to cracking due to its brittle characteristics, despite being a non-load-bearing member. Served as building exteriors, aging of cementitious composite may further raise the risk of fracture failure under accidental loads, causing both financial loss and safety hazards. To address this issue, a computational approach, fusing together a novel physics-based stochastic aging model and phase field fracture model, is developed to assess the mechanical performance decay of aging cladding structure. In this study, stochastic leaching under inherent material uncertainty is taken as the primary aging concern, and the analysis is assisted with extended support vector regression for substantial efficiency enhancements. The proposed method is carefully validated against two designed benchmark problems and a real-life application. It is demonstrated to be able to predict the time-dependent reliability of cementitious composite cladding structures precisely and efficiently under stochastic leaching-induced aging.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "0e39f65917ec85e3aac35cd36f150b4b",
    "relevant_keywords": [
      "support vector machine",
      "SVM",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:58:34.234750"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究水泥基复合材料覆层结构在随机老化下的性能衰减分析，其核心技术是物理基础的随机老化模型和相场断裂模型，以及支持向量回归的应用。这些技术和方法主要用于建筑材料的力学性能评估和可靠性预测，与金融领域的衍生品定价、金融风险管理和投资组合管理无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究水泥基复合材料覆层结构在随机老化下的性能衰减分析，其核心技术是物理基础的随机老化模型和相场断裂模型，以及支持向量回归的应用。这些技术和方法主要用于建筑材料的力学性能评估和可靠性预测，与金融领域的衍生品定价、金融风险管理和投资组合管理无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:27:53.082858"
}