{
  "paper": {
    "id": 3723,
    "title": "To borrow or insure? Long term care costs and the impact of housing",
    "abstract": "We assess the impact of housing, the availability of reverse mortgages and long-term care (LTC) insurance on a retiree's optimal portfolio choice and consumption decisions using a multi-period life cycle model that takes into consideration individual longevity risk, health shocks and house price risk. We determine how much an individual should borrow against their home equity and how much to insure health care costs with LTC insurance. We introduce an endogenous grid method, along with a regression based approach, to improve computational efficiency and avoid the curse of dimensionality. Our results confirm that borrowing against home equity provides higher consumption in earlier years and longevity insurance. LTC insurance transfers wealth from healthy states to disabled states, but reduces early consumption because of the payment of insurance premiums. Housing is an illiquid asset that is important in meeting bequest motives, and it reduces the demand for LTC insurance for the wealthy. We show that the highest welfare benefits come from combining a reverse mortgage with LTC insurance because of strong complementary effects between them. This result highlights the benefits of innovative products that bundle these two products together. (C) 2018 Elsevier B.V. All rights reserved.",
    "year": 2019,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "7a1c52fe127697bedc8d782dfefaa5a7",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:20:03.491487"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文主要研究退休人员的最优投资组合选择和消费决策，使用了多周期生命周期模型来考虑个体长寿风险、健康冲击和房价风险，这属于投资组合管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文主要研究退休人员的最优投资组合选择和消费决策，使用了多周期生命周期模型来考虑个体长寿风险、健康冲击和房价风险，这属于投资组合管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:08:52.397072"
}