{
  "paper": {
    "id": 64,
    "title": "Study of Pricing of High-Dimensional Financial Derivatives Based on Deep Learning",
    "abstract": "Many problems in the fields of finance and actuarial science can be transformed into the problem of solving backward stochastic differential equations (BSDE) and partial differential equations (PDEs) with jumps, which are often difficult to solve in high-dimensional cases. To solve this problem, this paper applies the deep learning algorithm to solve a class of high-dimensional nonlinear partial differential equations with jump terms and their corresponding backward stochastic differential equations (BSDEs) with jump terms. Using the nonlinear Feynman-Kac formula, the problem of solving this kind of PDE is transformed into the problem of solving the corresponding backward stochastic differential equations with jump terms, and the numerical solution problem is turned into a stochastic control problem. At the same time, the gradient and jump process of the unknown solution are separately regarded as the strategy function, and they are approximated, respectively, by using two multilayer neural networks as function approximators. Thus, the deep learning-based method is used to overcome the curse of dimensionality caused by high-dimensional PDE with jump, and the numerical solution is obtained. In addition, this paper proposes a new optimization algorithm based on the existing neural network random optimization algorithm, and compares the results with the traditional optimization algorithm, and achieves good results. Finally, the proposed method is applied to three practical high-dimensional problems: Hamilton-Jacobi-Bellman equation, bond pricing under the jump Vasicek model and option pricing under the jump diffusion model. The proposed numerical method has obtained satisfactory accuracy and efficiency. The method has important application value and practical significance in investment decision-making, option pricing, insurance and other fields.",
    "year": 2023,
    "source": "WOS",
    "area": "derivatives_pricing",
    "method": "deep learning",
    "cache_key": "128b18ad29e775629a1dc785113d1fea",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "neural network",
      "backpropagation",
      "BP",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T01:26:54.979435"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Derivatives Pricing"
    ],
    "justification": "该论文的核心技术是应用深度学习算法解决高维非线性偏微分方程和倒向随机微分方程，并明确提到将其应用于期权定价问题，这属于衍生品定价的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"衍生品定价\"],\n  \"justification\": \"该论文的核心技术是应用深度学习算法解决高维非线性偏微分方程和倒向随机微分方程，并明确提到将其应用于期权定价问题，这属于衍生品定价的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:07:34.941743"
}