{
  "paper": {
    "id": 8290,
    "title": "Change in treatment burden among people with multimorbidity: Protocol of a follow up survey and development of efficient measurement tools for primary care",
    "abstract": "Background Treatment burden is the effort required of patients to look after their health and the impact this has on their functioning and wellbeing. It is likely treatment burden changes over time as circumstances change for patients and health services. However, there are a lack of population-level studies of treatment burden change and factors associated with this change over time. Furthermore, there are currently no practical screening tools for treatment burden in time-pressured clinical settings or at population level. Methods and analysis This is a three-year follow-up of a cross-sectional survey of 723 people with multimorbidity (defined as three or more long-term conditions; LTCs) registered at GP practices in in Dorset, England. The survey will repeat collection of information on treatment burden (using the 10-item Multimorbidity Treatment Burden Questionnaire (MTBQ) and a novel single-item screening tool), sociodemographics, medications, LTCs, health literacy and financial resource, as at baseline. Descriptive statistics will be used to compare change in treatment burden since the baseline survey in 2019 and associations of treatment burden change will be assessed using regression methods. Diagnostic test accuracy metrics will be used to evaluate the single-item treatment burden screening tool using the MTBQ as the gold-standard. Routine primary care data (including demographics, medications, LTCs, and healthcare usage data) will be extracted from medical records for consenting participants. A forward-stepwise, likelihood-ratio logistic regression model building approach will be employed in order to assess the utility of routine data metrics in quantifying treatment burden in comparison to self-reported treatment burden using the MTBQ. Impact To the authors' knowledge, this will be the first study investigating longitudinal aspects of treatment burden. Findings will improve understanding of the extent to which treatment burden changes over time for people with multimorbidity and factors contributing to this change, as well as allowing better identification of people at risk of high treatment burden.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "f4b7bcadff32ce75d811e1952204e7bd",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T03:17:21.544326"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究多病症患者的治疗负担变化及其测量工具的开发，属于医疗健康领域，与金融研究领域无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究多病症患者的治疗负担变化及其测量工具的开发，属于医疗健康领域，与金融研究领域无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:25:37.517115"
}