{
  "paper": {
    "id": 1460,
    "title": "Should Deep Learning Models be in High Demand, or Should They Simply be a Very Hot Topic? A Comprehensive Study for Exchange Rate Forecasting",
    "abstract": "Exchange rate movements can significantly impact not only foreign trade, capital flows, and asset portfolio management, but also real economic activity. Therefore, the forecast of exchange rates has always been of great interest among academics, economic agents, and institutions. However, exchange rate series are essentially dynamic and nonlinear in nature and thus, forecasting exchange rates is a difficult task. On the other hand, deep learning models in solving time series forecasting tasks have been proposed in the last half-decade. But the number of formal comparative study in terms of exchange rate forecasting with deep learning models is quite limited. For this purpose, this study applies ten different models (Random Walk, Autoregressive Moving Average, Threshold Autoregression, Autoregressive Fractionally Integrated Moving Average, Support Vector Regression, Multilayer Perceptron, Recurrent Neural Network, Long Short Term Memory, Gated Recurrent Unit and Autoregressive Moving Average-Long Short Term Memory Hybrid Models) and two forecasting modes (recursive and rolling window) to predict three major exchange rate returnsnamely, the Canadian dollar, Australian dollar and British pound against the US Dollar in monthly terms. To evaluate the forecasting performances of the models, we used Model Confidence Set procedure as an advanced test. According to our results, the proposed hybrid model produced the best out-of-sample forecast performance in all samples, without exception.",
    "year": 2021,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "f4d1b045be092bb822ee5b5bccd8ca37",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "neural network",
      "recurrent neural network",
      "long short-term memory",
      "LSTM",
      "support vector machine",
      "SVM",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T00:56:08.304561"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文主要研究使用深度学习模型预测汇率变动，而汇率预测在投资组合管理中是一个重要的因素，因为它直接影响资产配置和风险管理决策。然而，论文并未直接涉及衍生品定价或金融风险管理的具体应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文主要研究使用深度学习模型预测汇率变动，而汇率预测在投资组合管理中是一个重要的因素，因为它直接影响资产配置和风险管理决策。然而，论文并未直接涉及衍生品定价或金融风险管理的具体应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:21:02.614741"
}