{
  "paper": {
    "id": 4144,
    "title": "Sugar Futures as an Investment Alternative During Market Turmoil: Case Study of 2008 and 2020 Market Drop",
    "abstract": "In times of turbulent financial markets, investors all around the globe seek for opportunities protecting their portfolios from devastating losses. Historically, commodities were regarded as a safe haven providing sound returns which offset potential losses arising from dropping equity prices in times of market turmoil. While sugar would have provided a proper hedge against crashing equity markets during the initiation of the 2007 bear market and the onset financial crisis, sugar prices dropped likewise equity during the outbreak of COVID-19 and the consequent market shock. The goal of the paper is to elaborate on the differences in sugar price dynamics during the aforementioned economic disruptions by employing a multiple linear regression approach using data from the last quarter 2007 as well as the first quarter of 2019. The findings suggest that the behavioral differences stem from the deep link between oil and sugar prices. While oil did not influence the price of sugar during the outbreak of the financial crisis, it had tremendous influence on sugar prices during the outbreak of the corona crisis. Currently, sugar provides a substantial upside for an investor's portfolio since the demand and supply-side shock on oil prices due to corona crisis as well as the Saudi-Russian oil price war drove oil prices and consequently sugar prices to a historic low. Sugar futures provide the advantage of offering a smaller contract size compared to oil futures, and even though both commodities trade in contango as of March 2020, the sugar future curve is by far not as steep as the oils. Resultingly, investors benefit from lower rollover costs while prospering from a potential surge in oil prices.",
    "year": 2021,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "202530396386374314c4cc5070c9a8d9",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:24:25.319506"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文主要研究糖期货作为投资组合中的对冲工具，探讨其在市场动荡时期的表现和潜在收益，属于投资组合管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文主要研究糖期货作为投资组合中的对冲工具，探讨其在市场动荡时期的表现和潜在收益，属于投资组合管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:07:59.322068"
}