{
  "paper": {
    "id": 6285,
    "title": "Foreign exchange risk hedging in the context of speculative revaluation attacks",
    "abstract": "Purpose - The purpose of this paper is to propose predictive models of speculative revaluation attacks, which would facilitate currency risk hedging in emerging and developed countries. Design/methodology/approach - The purpose of this paper is achieved using the methodology of multiple triangulation. Paper combines different theoretical perspectives (three generations of speculative attack models), two sources of data (emerging countries and developed countries) and three methods (logit regression, probit regression and artificial neural networks, ANN) for identification of leading indicators and forecasting of speculative attacks. Combination of multiple observations (data), underlying theories and methods allowed achieving least biased results. Findings - A list of leading indicators of speculative revaluation attacks was generated based on previous researches and three generations of speculative attacks' models. Qualitative and quantitative differences of speculative revaluation attacks in emerging and developed countries were identified. The decision matrix of currency risk hedging in the context of speculative devaluation and revaluation attacks was proposed. Research limitations/implications - Although the sample of this researcher includes a wide range of countries (65 in total), their separation into developed and emerging countries is arbitrary (in the course of 35 years some countries have changed the status from emerging towards developed). The initial list of leading indicators is limited, includes mostly economic variables. It could be improved by encompassing political variables, credit ratings, consumer and business confidence indices. Practical implications - Developed predictive models of speculative revaluation attacks may significantly reduce important element of risk - uncertainty - and, consequently, the cost of financial hedging. Originality/value - This paper is one of the first public attempts to apply alternative methodology of ANN for forecasting speculative attacks. The results showed that latter method is more accurate than probit and logit regressions. Also, to the author's best knowledge, this is a first public attempt to separately analyse the phenomenon of speculative revaluation attacks.",
    "year": 2008,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "85ac1bba7770a63e9dc567d32271d72c",
    "relevant_keywords": [
      "neural network",
      "classification",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:56:37.341703"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用多种方法（包括人工神经网络）预测投机性重估攻击，并提出货币风险对冲的决策矩阵，这直接涉及金融风险管理中的货币风险识别和应对策略。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是使用多种方法（包括人工神经网络）预测投机性重估攻击，并提出货币风险对冲的决策矩阵，这直接涉及金融风险管理中的货币风险识别和应对策略。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:28:30.234741"
}