{
  "paper": {
    "id": 2429,
    "title": "Association of Mandatory Bundled Payments for Joint Replacement With Postacute Care Outcomes Among Medicare and Medicaid Dual Eligible Patients",
    "abstract": "Importance: The Medicare comprehensive care for joint replacement (CJR) model, a mandatory bundled payment program started in April 2016 for hospitals in randomly selected metropolitan statistical areas (MSAs), may help reduce postacute care (PCA) use and episode costs, but its impact on disparities between Medicaid and non-Medicaid beneficiaries is unknown. Objective: To determine effects of the CJR program on differences (or disparities) in PCA use and outcomes by Medicare-Medicaid dual eligibility status. Design, Setting, and Participants: Observational cohort study of 2013-2017, based on difference-in-differences (DID) analyses on Medicare data for 1,239,452 Medicare-only patients, 57,452 dual eligibles with full Medicaid benefits, and 50,189 dual eligibles with partial Medicaid benefits who underwent hip or knee surgery in hospitals of 75 CJR MSAs and 121 control MSAs. Main Outcome Measures: Risk-adjusted differences in rates of institutional PCA [skilled nursing facility (SNF), inpatient rehabilitation, or long-term hospital care] use and readmissions; and for the subgroup of patients discharged to SNF, risk-adjusted differences in SNF length of stay, payments, and quality measured by star ratings, rate of successful discharge to community, and rate of transition to long-stay nursing home resident. Results: The CJR program was associated with reduced institutional PCA use and readmissions for patients in all 3 groups. For example, it was associated with reductions in 90-day readmission rate by 1.8 percentage point [DID estimate=-1.8; 95% confidence interval (CI), -2.6 to -0.9; P<0.001] for Medicare-only patients, by 1.6 percentage points (DID estimate=-1.6; 95% CI, -3.1 to -0.1; P=0.04) for full-benefit dual eligibles, and by 2.0 percentage points (DID estimate=-2.0; 95% CI, -3.6 to -0.4; P=0.01) for partial-benefit dual eligibles. These CJR-associated effects did not differ between dual eligibles (differences in above DID estimates=0.2; 95% CI, -1.4 to 1.7; P=0.81 for full-benefit patients; and -0.3; 95% CI, -1.9 to 1.3; P=0.74 for partial-benefit patients) and Medicare-only patients. Among patients discharged to SNF, the CJR program showed no effect on successful community discharge, transition to long-term care, or their persistent disparities. Conclusions: The CJR program did not help reduce persistent disparities in readmissions or SNF-specific outcomes related to Medicare-Medicaid dual eligibility, likely due to its lack of financial incentives for reduced disparities and improved SNF outcomes.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "b8ac27f61910fc7f5ff62547fc6f5060",
    "relevant_keywords": [
      "PCA"
    ],
    "stage1_timestamp": "2025-05-15T02:15:26.977088"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究医疗保险中的捆绑支付计划对术后护理结果的影响，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究医疗保险中的捆绑支付计划对术后护理结果的影响，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:42:28.643762"
}