{
  "paper": {
    "id": 2193,
    "title": "Risk Information in Non-Financial Disclosure",
    "abstract": "This paper aims to research the topics related to risk included in non-financial disclosure (NFD) of companies listed on the Warsaw Stock Exchange (WSE) and explore factors that influence the risk topics ratio in NFD. We applied a content analysis using topic modeling to discover latent risk topics in NFD. Next, with Ward's clustering, we identified four groups of companies with a homogenous risk topic mixture. For causal analysis, to explain the differences in risk topics ratio, we used qualitative comparative analysis (QCA), which allowed us to obtain three paths (variable configurations) leading to the high ratio of risk topics in NFD. Our results suggest that companies disclosing risk information extensively in their NFDs concentrate almost solely on social risk matters. In contrast, companies talking briefly about environmental and social (E&S) risk prepare their NFDs with a more balanced distribution of E&S topics and their financial implication. In general, the companies' exposure to E&S risk and the use of NFD standards and guidelines as well as the type of NFD impact the space dedicated to risk information. This paper contributes to academics and regulators, filling the gap about risk disclosure in the NFD, identifying the nature of corporate risk disclosures, and upgrading research about determinants of risk information in non-financial disclosure.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "6f9cd58891e9251d5977894e73e215f6",
    "relevant_keywords": [
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T02:12:17.450741"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究非财务披露（NFD）中的风险信息，特别是社会和环境风险，以及影响风险信息披露比例的因素。虽然涉及风险信息，但其核心研究并不直接涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究非财务披露（NFD）中的风险信息，特别是社会和环境风险，以及影响风险信息披露比例的因素。虽然涉及风险信息，但其核心研究并不直接涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:43:42.948859"
}