{
  "paper": {
    "id": 344,
    "title": "A Machine Learning Portfolio Allocation System for IPOs in Korean Markets Using GA-Rough Set Theory",
    "abstract": "An initial public offering (IPO) is a type of public offering in which a company's shares are sold to institutional and individual investors. While the majority of studies on IPOs have focused on the efficiency of raising capital and price adequacy in IPOs, studies on portfolio allocation strategies for IPO stocks are relatively scarce. This paper develops a machine learning investment strategy for IPO stocks based on rough set theory and a genetic algorithm (GA-rough set theory). To reduce issues of information asymmetry, we use nonfinancial data that are publicly available to individual and institutional investors in the IPO process. Based on the rule sets generated from the training sets, we conduct 120 tests with various conditions involving the target days and the partition of the training and testing sets, and we find excess returns of the constructed portfolios compared to the benchmark portfolios. Investors in IPO stocks can formulate more efficient investment strategies using our system. In this sense, the system developed in this paper contributes to the efficiency of financial markets and helps achieve sustained economic growth.",
    "year": 2019,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "32b1864bcbdc78c5586deb2f1acdf2bd",
    "relevant_keywords": [
      "machine learning",
      "genetic algorithm",
      "rough set theory"
    ],
    "stage1_timestamp": "2025-05-15T00:42:32.448286"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是开发一种基于机器学习的投资策略，用于IPO股票的投资组合分配，旨在通过非财务数据构建投资组合并获得超额收益，这直接属于投资组合管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是开发一种基于机器学习的投资策略，用于IPO股票的投资组合分配，旨在通过非财务数据构建投资组合并获得超额收益，这直接属于投资组合管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:31:41.063634"
}