{
  "paper": {
    "id": 4790,
    "title": "Exposure of rural Alaskan infrastructure to coastal erosion and permafrost subsidence",
    "abstract": "Accelerating permafrost thaw and coastal erosion in rural Alaska destabilize the built environment, increasing the risk of sociotechnical failures that negatively impact nearby communities. Infrastructure adaptation is necessary to mitigate these threats, yet epistemic uncertainty remains about where the most exposed infrastructure is located and the corresponding community impact of failure. As a result, existing adaptation activity may not be prioritized according to relative need, potentially reducing the efficiency and effectiveness of adaptation activity. To address this gap, this study seeks to identify the likely failures, cascading impacts, as well as which communities are likely to experience them. To do so, this study employs machine learning techniques and permafrost terrain maps to identify vulnerable coastlines. Using density-based cluster mapping, statistical summarization, and semi-cognitive mapping, we explore the locations and functions of infrastructure, and infrastructure interdependencies occurring on Alaskan coastlines. Results suggest the following to improve vulnerable infrastructure outcomes: (1) allocate public funding to support adaptation of exposed infrastructure, (2) increase financial and physical resources for resilience research and development for exposed infrastructure, and (3) expand access to adaptation activity through increased local input in decision-making. For instance, as results show that water and sewer infrastructure in the Bethel census area is highly exposed, results could support additional funding to organizations that repair and relocate such infrastructure. Through these changes, regional adaptation activity can become more prioritized-ensuring that funds address the most pressing needs.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "721e44968020c870899ffa525ddb06ec",
    "relevant_keywords": [
      "machine learning",
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T02:41:00.875622"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究阿拉斯加农村基础设施对海岸侵蚀和永久冻土沉降的暴露情况，并探讨了如何通过机器学习和地理空间分析来识别脆弱的基础设施。虽然提到了资金分配和公共资助，但其核心技术和研究目标并不涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究阿拉斯加农村基础设施对海岸侵蚀和永久冻土沉降的暴露情况，并探讨了如何通过机器学习和地理空间分析来识别脆弱的基础设施。虽然提到了资金分配和公共资助，但其核心技术和研究目标并不涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:31:56.756456"
}