{
  "paper": {
    "id": 3042,
    "title": "An insight into the implications of investor sentiment on crash risk in Asia-Pacific stock markets: are uncertainty factors important?",
    "abstract": "PurposeThis study aims to examine the effect of investor sentiment on stock market crash risk in the Asia-Pacific region and the moderating role of uncertainty factors.Design/methodology/approachThis research uses principal component analysis to construct an investor sentiment index of 17 Asia-Pacific stock markets before analyzing the data through hierarchical regression with the feasible generalized least squares method.FindingsThe empirical results show that investor sentiment has a positive impact on crash risk in the Asia-Pacific stock markets. This impact is more significant in advanced economies compared to emerging markets and developing economies. The nexus between investor sentiment and stock market crash risk is increased by economic policy uncertainty but decreased by uncertainty from pandemics.Research limitations/implicationsThis study only investigates the moderating roles of global uncertainty factors but not local uncertainty factors. In addition, the sentiment of different investor groups has not been examined yet.Practical implicationsThe findings of this study are relevant for global investors, portfolio managers and policymakers. Investors and portfolio managers can use sentiment indicators to predict downturns and adjust strategies, whereas policymakers can leverage these insights to design regulations that mitigate systemic risks during global uncertainties.Originality/valueThis study expands the literature on the relationship between investor sentiment and stock market crash risk, providing updated insights into sentimental bias in behavioral finance.",
    "year": 2025,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "9c8753f53b7ff054aebe0e1e1d149928",
    "relevant_keywords": [
      "principal components analysis"
    ],
    "stage1_timestamp": "2025-05-15T01:13:09.811057"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk",
      "Portfolio Management"
    ],
    "justification": "该论文研究了投资者情绪对亚太股市崩盘风险的影响，并探讨了不确定性因素的调节作用。这直接涉及金融风险管理中的市场风险分析。此外，研究结果对全球投资者和投资组合管理者的策略调整具有实际意义，因此也适用于投资组合管理领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\", \"投资组合管理\"],\n  \"justification\": \"该论文研究了投资者情绪对亚太股市崩盘风险的影响，并探讨了不确定性因素的调节作用。这直接涉及金融风险管理中的市场风险分析。此外，研究结果对全球投资者和投资组合管理者的策略调整具有实际意义，因此也适用于投资组合管理领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:11:32.968466"
}