{
  "paper": {
    "id": 813,
    "title": "Risks and Benefits of Future Travel with Hyperloop: A Multi-Analytical Approach",
    "abstract": "Despite significant government investment in Hyperloop transportation across various countries, research on its potential advantages and drawbacks from the tourist's perspective remains scarce. Guided by prospect theory, this study examines the perceptions and behaviors of frequent (n = 386) and occasional (n = 214) travelers regarding Hyperloop technology, using multiple analytical methods such as partial least squares structural equation modeling (PLS-SEM), multi-group analysis (MGA), fuzzy-set Qualitative Comparative Analysis (fsQCA), and artificial neural networks (ANN). The study explores how four perceived benefits (economic, environmental, socio-cultural, and time-saving) and four perceived risks (functional, physical, psychological, and financial concerns) influence travelers' intentions to use Hyperloop for tourism. The PLS-SEM and MGA analyses indicate that frequent travelers prioritize time-saving, while economic, environmental, socio-cultural benefits, and functional risks influence occasional travelers' decisions. Additionally, fsQCA findings identify distinct benefit-risk combinations affecting travel decisions, and deep learning models highlight critical factors predicting Hyperloop adoption. This study provides theoretical insights and practical strategies for integrating Hyperloop into tourism planning and management.",
    "year": 2025,
    "source": "WOS",
    "area": "financial_risk",
    "method": "deep learning",
    "cache_key": "101a542d2327226d2a85cd3a60e0c1c9",
    "relevant_keywords": [
      "neural network",
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T01:42:44.503462"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究Hyperloop技术在旅游领域的应用，探讨了旅行者的感知利益和风险，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究Hyperloop技术在旅游领域的应用，探讨了旅行者的感知利益和风险，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:02:03.548838"
}