{
  "paper": {
    "id": 5212,
    "title": "Analysis of depression status and influencing factors in middle-aged and elderly patients with chronic diseases",
    "abstract": "Objectives To explore prevalence of depression and its influencing factors in middle-aged and elderly patients with chronic diseases.Method Data were extracted from the 2018 China Health and Retirement Tracking Survey (CHARLS) for 6,704 middle-aged and elderly patients >= 45 years with chronic diseases. The influencing variables were selected based on LASSO-logistic regression model, and a nomogram was further drawn to visualize regression results.Results Comorbidity between chronic diseases and depression symptoms were detected in 3058 individuals (45.6%). Female, rural, lower education, poor, insomnia, multiple chronic disease, and functional impairment were associated with a higher proportion of depression. Meanwhile, family interaction, intergenerational financial support, social activity intensity, and satisfaction with life can protect against depression.Conclusion Depressive symptoms are common in Chinese older adults with chronic diseases. They need regular assessment and intervention, especially those with multiple diseases, female, rural, alone, impaired, poor sleep, or poor economy. These high-risk elders also need family, medical, and social support and care.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "bdfab371d3f4edddf825f396ed1fd992",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:45:17.155305"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究慢性病中老年患者的抑郁状况及其影响因素，属于医学和公共卫生领域，与金融研究领域无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究慢性病中老年患者的抑郁状况及其影响因素，属于医学和公共卫生领域，与金融研究领域无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:31:07.009780"
}