{
  "paper": {
    "id": 923,
    "title": "Postdisaster image-based damage detection and repair cost estimation of reinforced concrete buildings using dual convolutional neural networks",
    "abstract": "Reinforced concrete (RC) buildings are commonly used around the world. With recent earthquakes worldwide, rapid structural damage inspection and repair cost evaluation are crucial for building owners and policy makers to make informed risk management decisions. To improve the efficiency of such inspection, advanced computer vision techniques based on convolutional neural networks have been adopted in recent research to rapidly quantify the damage state (DS) of structures. In this article, an advanced object detection neural network, named YOLOv2, is implemented, which achieves 98.2% and 84.5% average precision in training and testing, respectively. The proposed YOLOv2 is used in combination with the classification neural network, which improves the identification accuracy for critical DS of RC structures by 7.5%. The improved classification procedures allow engineers to rapidly and more accurately quantify the DSs of the structure, and also localize the critical damage features. The identified DS can then be integrated with the state-of-the-art performance evaluation framework to quantify the financial losses of critical RC buildings. The results can be used by the building owners and decision makers to make informed risk management decisions immediately after the strong earthquake shaking. Hence, resources can be allocated rapidly to improve the resiliency of the community.",
    "year": 2020,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "a411e793647d96c3784651fc7eca1094",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "neural network",
      "deep learning",
      "convolutional neural network",
      "CNN"
    ],
    "stage1_timestamp": "2025-05-15T01:56:49.550572"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究使用卷积神经网络进行灾后钢筋混凝土建筑的损伤检测和修复成本估算，虽然提到了风险管理决策，但其核心技术和应用场景属于结构工程和灾害管理领域，并未直接涉及衍生品定价、金融风险管理或投资组合管理等金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究使用卷积神经网络进行灾后钢筋混凝土建筑的损伤检测和修复成本估算，虽然提到了风险管理决策，但其核心技术和应用场景属于结构工程和灾害管理领域，并未直接涉及衍生品定价、金融风险管理或投资组合管理等金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:53:51.636231"
}