{
  "paper": {
    "id": 1818,
    "title": "Lenders' Environmental Monitoring: Evidence From Environmental Covenants in Private Loan Contracts",
    "abstract": "We investigate the role of covenants in private loan contracts that place requirements or limitations on borrowers' environmental actions (hereafter, environmental covenants). Utilizing a machine learning algorithm, we find that environmental covenants are highly prevalent, appearing in 54% of loan contracts in our sample. The use of these covenants is significantly associated with borrowers' environmental risk exposure, borrower-lender information asymmetry, and key contract terms, such as collateral and loan maturity. The association between environmental risk and environmental covenants is more pronounced when borrowers face greater financial distress, lenders have a stronger reputation, and there is a higher risk of regulatory enforcement. Additional analysis shows that the presence of a board committee overseeing environmental matters reduces lenders' demand to contractually address the borrower's environmental risk. Collectively, our results provide novel insights into the contractual mechanisms addressing environmental risk and the factors shaping lenders' environmental monitoring demand.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "6beffbfa3008e9805032ccfdcf1828e5",
    "relevant_keywords": [
      "machine learning"
    ],
    "stage1_timestamp": "2025-05-15T02:08:03.866905"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文研究了私人贷款合同中环境条款的作用，这些条款用于管理借款人的环境风险，并通过机器学习算法分析其使用情况。这属于金融风险管理领域，因为它涉及识别和管理与借款人环境风险相关的金融风险。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文研究了私人贷款合同中环境条款的作用，这些条款用于管理借款人的环境风险，并通过机器学习算法分析其使用情况。这属于金融风险管理领域，因为它涉及识别和管理与借款人环境风险相关的金融风险。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:45:56.147949"
}