{
  "paper": {
    "id": 6187,
    "title": "Risk and Revenue Management in the Chinese Auto Loan Industry",
    "abstract": "The automobile consumption credit business promotes the development of the automobile industry. However, the current credit system in China requires further refinement. Thus, the credit loan business is associated with certain risks, and company profits are often negatively impacted by clients who default on loans. Based on the data, this article leverages the economic and financial theories of consumer credit risk control to construct a logistic model to predict customers' default probability. Then, a quadratic regression model is established to determine the optimal commission structure to balance profitability with incentives from retail stores. Results show that the macro-level variables are negatively associated with the probability of good behavior. The personal level variables exhibit a positive association. In addition, a negative coefficient in the quadratic profit equation indicates the presence of an inverted U relationship between profit and commission. Corresponding suggestions are put forward.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "f7bd1cf1f2a792985ac23c6d95c186d7",
    "relevant_keywords": [
      "classification",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:55:44.549976"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on constructing a logistic model to predict customers' default probability and optimizing commission structures to manage risks in the auto loan industry, which falls under the domain of Financial Risk Management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on constructing a logistic model to predict customers' default probability and optimizing commission structures to manage risks in the auto loan industry, which falls under the domain of Financial Risk Management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:28:31.485947"
}