{
  "paper": {
    "id": 6905,
    "title": "Variations in cardiovascular disease under-diagnosis in England: national cross-sectional spatial analysis",
    "abstract": "Background: There is under-diagnosis of cardiovascular disease (CVD) in the English population, despite financial incentives to encourage general practices to register new cases. We compared the modelled (expected) and diagnosed (observed) prevalence of three cardiovascular conditions-coronary heart disease (CHD), hypertension and stroke-at local level, their geographical variation, and population and healthcare predictors which might influence diagnosis. Methods: Cross-sectional observational study in all English local authorities (351) and general practices (8,372) comparing model-based expected prevalence with diagnosed prevalence on practice disease registers. Spatial analyses were used to identify geographic clusters and variation in regression relationships. Results: A total of 9,682,176 patients were on practice CHD, stroke and transient ischaemic attack, and hypertension registers. There was wide spatial variation in observed: expected prevalence ratios for all three diseases, with less than five per cent of expected cases diagnosed in some areas. London and the surrounding area showed statistically significant discrepancies in observed: expected prevalence ratios, with observed prevalence much lower than the epidemiological models predicted. The addition of general practitioner supply as a variable yielded stronger regression results for all three conditions. Conclusions: Despite almost universal access to free primary healthcare, there may be significant and highly variable under-diagnosis of CVD across England, which can be partially explained by persistent inequity in GP supply. Disease management studies should consider the possible impact of under-diagnosis on population health outcomes. Compared to classical regression modelling, spatial analytic techniques can provide additional information on risk factors for under-diagnosis, and can suggest where healthcare resources may be most needed.",
    "year": 2011,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "f0646fb3f7a17f0dd9bedc3f2bb96bfc",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T03:02:41.351898"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究心血管疾病在英格兰地区的诊断不足问题，并使用了空间分析和回归模型来探讨地理差异和医疗资源分配的影响。这些技术与金融研究领域无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究心血管疾病在英格兰地区的诊断不足问题，并使用了空间分析和回归模型来探讨地理差异和医疗资源分配的影响。这些技术与金融研究领域无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:27:06.889166"
}