{
  "paper": {
    "id": 585,
    "title": "Technologies and Designs for Small Optical Missions",
    "abstract": "The worldwide growing interest in small payloads and platforms require the use of solutions that are compact, cost effective and simple to align and test. In particular, the possibility to use constellations of small satellites require the payloads to be easily built in a relatively large number compared to typical space missions where only the flight model and possibly few flight spares need to be procured. This clearly drives the payload architecture towards solutions that can be easily manufactured, and in large quantities. The recent progress of manufacturing techniques favours this rapid change. For instance, for some applications the possibility to use a spectrometer with a magnification different from one is a key factor to enable instrument designs that are compact, cost effective and with high performance. This can be for instance achieved by using freeform or aspheric mirrors and freeform or spherical gratings. Other compact designs use instead linearly variable filters as dispersive devices, pointing to a different set of applications and performance. The progress on small satellites and payloads, especially in the vision of large constellations, also benefits from the rapid development of imaging processing and deep learning machines, for instance equipping the payloads with powerful on-board data processor for real time generation of Level 2 data to face the challenge of handling the huge amount of data that is produced on-board. By combining all these developments, it is possible to produce a portfolio of innovative multi/hyperspectral payloads covering a broad range of applications, spanning from high spatial resolution to large swath width, from minisatellite to cubesat format. Exploiting the flexibility and interoperability of these payloads, the users will be provided with turnkey solutions and real time response to their specific needs. The European Space Agency is leading several R&D activities in the field of compact multispectral and hyperspectral payloads, fit for small platforms. These activities encompass technology development of novel optical designs, materials and processes, including also engineering of detectors, EEE components and dedicated data processing to achieve innovative and cost-effective solutions. The paper provides an overview of the technology developments, the status of the instruments manufactured so far and those in operation, their performance and their expected applications. An example of an imaging spectrometer design that is extremely compact, realized with only two spherical optical elements and with a magnification different from one (1:3) is also addressed.",
    "year": 2018,
    "source": "WOS",
    "area": "portfolio",
    "method": "deep learning",
    "cache_key": "eb88f33e00eead8a75cd9ca87697f711",
    "relevant_keywords": [
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T00:37:38.198336"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要讨论小型光学任务的技术和设计，包括小型卫星载荷的制造、光学元件和数据处理技术，并未提及任何与金融领域相关的应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要讨论小型光学任务的技术和设计，包括小型卫星载荷的制造、光学元件和数据处理技术，并未提及任何与金融领域相关的应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:34:32.901682"
}