{
  "paper": {
    "id": 515,
    "title": "Credit Risk Analysis Using Machine-Learning Algorithms",
    "abstract": "Credit risk and default risk are very important concepts for an banks and financial institutions globally. As credit risk measurement and modeling requires working with large samples, it was preferred to use machine learning, one of the modern analysis techniques. In the study, Logistic Regression, Random Forest and Artificial Neural Networks, which are quite common among machine learning algorithms and have taken their place in research, were used for data analysis and modeling studies. 66,078 loan samples and 11 variables belonging to these samples have been used in the modeling, and research has been carried out on the estimation of the results of successful (0) or unsuccessful (1) credits using machine learning algorithms according to the effect of these variables. These records were taken anonymously from the test environment of a financial institution and the necessary data engineering and modeling studies were carried out using the Python programming language. As a result of the study, it was seen that the model established with Logistic Regression produces better results and is a more suitable method for the research subject.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "5dade458024d5a88bbb81da4d8fbe937",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "regression",
      "neural network",
      "Logistic Regression",
      "Random Forest",
      "Artificial Neural Networks"
    ],
    "stage1_timestamp": "2025-05-15T01:52:12.183979"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on using machine learning algorithms to analyze and predict credit risk and default risk, which are key components of financial risk management in banking and financial institutions.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on using machine learning algorithms to analyze and predict credit risk and default risk, which are key components of financial risk management in banking and financial institutions.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:57:07.971129"
}