{
  "paper": {
    "id": 2978,
    "title": "Portfolio Investments in the Forex Market",
    "abstract": "Investing in the forex market seems to be an especially challenging task due to the large variety of dependencies related to instruments. Among the crucial aspects that should be considered is the correlation between the currency pairs. In this article, we derive a general investing schema considering the signal generation based on the well-known classification methods and verify the quality of these signals with the idea of portfolio building. To do so, we derive a two-stage process, where the first stage is devoted to deriving the classifier capable of generating the trading signals on the forex market. We use the set of the most popular market indicators, and the decision about the potential buy (or sell) signal is dependent on the values of these indicators. Eventually, we derive the classifier in which quality is measured on the basis of accuracy, recall, and precision. Further, we use signals generated by the classifier to adjust the account balance of the decision-maker and estimate the relation between the quality of classification and the final account balance. Experiments are performed using the trading system implemented by the authors on the real-world data covering several years.",
    "year": 2022,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "78c194c4b9e74a6463e6114c52905765",
    "relevant_keywords": [
      "classification",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T01:12:09.230246"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "The paper focuses on developing a classification-based signal generation method for forex market investments and verifies the quality of these signals through portfolio building. The core research is centered around optimizing investment decisions in the forex market, which falls under the domain of Portfolio Management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Portfolio Management\"],\n  \"justification\": \"The paper focuses on developing a classification-based signal generation method for forex market investments and verifies the quality of these signals through portfolio building. The core research is centered around optimizing investment decisions in the forex market, which falls under the domain of Portfolio Management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:11:58.232317"
}