{
  "paper": {
    "id": 948,
    "title": "Domain adaptation-based multistage ensemble learning paradigm for credit risk evaluation",
    "abstract": "Machine learning methods are widely used to evaluate the risk of small- and medium-sized enterprises (SMEs) in supply chain finance (SCF). However, there may be problems with data scarcity, feature redundancy, and poor predictive performance. Additionally, data collected over a long time span may cause differences in the data distribution, and classic supervised learning methods may exhibit poor predictive abilities under such conditions. To address these issues, a domain-adaptation-based multistage ensemble learning paradigm (DAMEL) is proposed in this study to evaluate the credit risk of SMEs in SCF. In this methodology, a bagging resampling algorithm is first used to generate a dataset to address data scarcity. Subsequently, a random subspace is applied to integrate various features and reduce feature redundancy. Additionally, a domain adaptation approach is utilized to reduce the data distribution discrepancy in the cross-domain. Finally, dynamic model selection is developed to improve the generalization ability of the model in the fourth stage. A real-world credit dataset from the Chinese securities market was used to validate the effectiveness and feasibility of the multistage ensemble learning paradigm. The experimental results demonstrated that the proposed domain-adaptation-based multistage ensemble learning paradigm is superior to principal component analysis, joint distribution adaptation, random forest, and other ensemble and transfer learning methods. Moreover, dynamic model selection can improve the model generalization performance and prediction precision of minority samples. This can be considered a promising solution for evaluating the credit risk of SMEs in SCF for financial institutions.",
    "year": 2025,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "dea1698229115dbef99fd752af372926",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "principal components analysis",
      "feature learning",
      "feature representation",
      "deep learning",
      "representation learning"
    ],
    "stage1_timestamp": "2025-05-15T01:56:49.709173"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on evaluating the credit risk of small- and medium-sized enterprises (SMEs) in supply chain finance (SCF) using a domain-adaptation-based multistage ensemble learning paradigm. Credit risk evaluation is a key aspect of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on evaluating the credit risk of small- and medium-sized enterprises (SMEs) in supply chain finance (SCF) using a domain-adaptation-based multistage ensemble learning paradigm. Credit risk evaluation is a key aspect of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:53:08.016098"
}