{
  "paper": {
    "id": 837,
    "title": "Financial early warning of non-life insurance company based on RBF neural network optimized by genetic algorithm",
    "abstract": "Due to the characteristic of risk diversification in non-life insurance industry, the company's financial risk early warning is very important. In order to reasonably predict the financial status of non-life insurance company, the evaluation system of financial risk indicator is constructed from the aspects of solvency, profitability, and growth ability. Taking data of non-life insurance companies in past years as sample, the evaluation indicators are weighted objectively using the entropy method. The RBF neural network model is improved with the genetic algorithm, and the early warning model is established. The empirical results show that the prediction accurate rate of RBF neural network model based on genetic algorithm is increased.",
    "year": 2018,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "c84d6a10bd5cfa0eea09c51b936756bb",
    "relevant_keywords": [
      "machine learning",
      "neural network",
      "backpropagation",
      "BP",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T01:55:41.580028"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on developing a financial early warning system for non-life insurance companies using an improved RBF neural network model. This system is designed to predict financial risks by evaluating solvency, profitability, and growth ability, which are key aspects of financial risk management in the insurance industry.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on developing a financial early warning system for non-life insurance companies using an improved RBF neural network model. This system is designed to predict financial risks by evaluating solvency, profitability, and growth ability, which are key aspects of financial risk management in the insurance industry.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:54:17.138654"
}