{
  "paper": {
    "id": 4039,
    "title": "THE EFFECT OF MFI PERFORMANCE INDICATORS ON POVERTY",
    "abstract": "In recent years, microfinance has become one of the commonly used word in academic research. Mainly it is caused by the fact microfinance has been set as an official development tool to reduce poverty by the United Nations and it has spread all over the world. However, the academic opinions on the effect of microfinance on the poor are still uncertain. In this paper we examined the performance of MFIs in 73 world countries and 53 developing countries. The regression analysis was used to find the effect of MFIs performance and sustainability indicators like ability to fund the loans by deposits, the cost per borrower, portfolios in risk or profitability on poverty. Moreover, we compared the results from the year 2009 with the year 2015. The results proved that the countries with higher values of growth in borrowers and cost per borrower tend to be the countries with the higher poverty ratios. On the other hand, the higher the profit over loan portfolio the lower the poverty level of the country. In other words, the microfinance is more attractive to the poor countries and therefore they experience higher growth in microfinance borrowers. Moreover, in 2015 they were able to mobilize more deposits and be less dependent on external funders both in world countries analysis and developing countries analysis. The countries where the MFIs are more profitable, the poverty level tends to be lower as the risk of serving the clients is lower.",
    "year": 2019,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "e0d1a7cde87640b2102dc5cbfec55bc3",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:23:07.451208"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究小额信贷机构（MFIs）绩效指标对贫困的影响，虽然涉及金融术语如贷款组合和风险，但其核心研究目标是贫困问题，而非衍生品定价、金融风险管理或投资组合管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究小额信贷机构（MFIs）绩效指标对贫困的影响，虽然涉及金融术语如贷款组合和风险，但其核心研究目标是贫困问题，而非衍生品定价、金融风险管理或投资组合管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:08:20.741547"
}