{
  "paper": {
    "id": 5282,
    "title": "Does Awareness and Demographics Really Influence the Investment Motives of Working Women? -An Empirical Analysis",
    "abstract": "Purpose-Active participation of females in the economic activities has brought independence to them on social as well as economic front (Census 2011, chapter 4). This economic independency brought an emphatic wisdom in them for financial planning backed by certain motives. The present study is an attempt to find out the variables that influences the investment motives of economically empowered females. Design/methodology/approach-The present study is conducted on a random sample of 300 females from National Capital region of India those who are either working or have some temporary break from their work. A questionnaire put in use to collect their responses. Further factor analysis executed in order to have meaningful component through principle component analysis. Finally cross sectional regression used to find out the impact of selected demographic variables on investment motives i.e Safety & Growth of funds and specific future planning. Findings-It is found Safety & Growth of funds and specific future planning are two significant investment motives of the working females and both the investment motives significantly explained by the level of education and awareness of financial products. Research limitations/implications: The study has considered the NCR region and working females only. Practical implications-Companies who sells financial products by looking at the investment motives and the risk appetite of females can develop financial products in line of their investment motives. Originality/value-The study conferred the variables that indicate investment motives of working females such as Safety & Growth of funds & and specific future planning. It also pinpoints the impact of demographics on investment motives.",
    "year": 2020,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "53cb9c4d25b1ccf99cc203acce97ae9a",
    "relevant_keywords": [
      "principal components analysis"
    ],
    "stage1_timestamp": "2025-05-15T02:46:16.213724"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是影响职业女性投资动机的因素，如安全与资金增长和特定未来规划，并未涉及衍生品定价、金融风险管理或投资组合管理的核心技术或应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是影响职业女性投资动机的因素，如安全与资金增长和特定未来规划，并未涉及衍生品定价、金融风险管理或投资组合管理的核心技术或应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:30:33.680254"
}