{
  "paper": {
    "id": 1187,
    "title": "Methodology for effective and efficient regional seismic retrofit using machine learning and stochastic optimization",
    "abstract": "A major challenge in specifying design requirements for policy-based seismic retrofits is ensuring that the desired performance enhancements are achieved across a portfolio of buildings with diverse structural characteristics and hazard. To address this challenge, a modular optimization methodology is developed. A prediction module uses machine learning-based surrogate models as compact statistical links between building structural characteristics and seismic performance outcomes. The optimization module uses regionally targeted objective functions to determine the retrofit enhancements that achieve the most desirable aggregated performance outcome for the portfolio of buildings. Lastly, the evaluation module benchmarks the performance of the optimized retrofit scheme against the existing inventory as well as more conventional retrofit approaches. The ability of the framework to balance the need for effective (improved performance) and efficient (minimizing cost) retrofits is demonstrated by applying it to the inventory of buildings under the purview of the Los Angeles Soft-Story Ordinance.",
    "year": 2024,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "17f7b46b73425a72b57a0caf376bd577",
    "relevant_keywords": [
      "machine learning",
      "regression",
      "neural network",
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T00:52:33.957103"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是使用机器学习和随机优化方法进行区域地震改造，其核心应用领域是土木工程和灾害管理，并未涉及金融领域的衍生品定价、金融风险管理或投资组合管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是使用机器学习和随机优化方法进行区域地震改造，其核心应用领域是土木工程和灾害管理，并未涉及金融领域的衍生品定价、金融风险管理或投资组合管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:23:27.579428"
}