{
  "paper": {
    "id": 3259,
    "title": "Alternative estimation method of earnings growth rate for PEGR strategy",
    "abstract": "The ambiguous return pattern for the PEGR (the ratio of the stock's price/earnings to its estimated earnings growth rate) strategy has been documented in literature for the US stock markets. As stock prices and earnings per share (EPS) are objective data, earnings growth rate, however, is estimated by analyst whose method partial explains the PEGR vague return pattern. The purpose of this study is not to deny or substitute analysts' estimation, but rather, to provide a simple and popular method, log-linear regression model, to forecast the earnings growth rate (G), and examine whether the typical PEGR effect, such as PER (price/earnings ratio) or PBR (price/book ratio) effect, exists by using our alternative estimation method. Our evidence indeed shows that returns on the lowest PEGR portfolio not only dominate over all higher PEGR portfolios, but also beat the market with stochastic dominance (SD) analysis, which is consistent with our prediction. Our results, at least, imply that using the log-linear regression model to construct the PEGR-sorted portfolios can benefit investors and the model is also a good choice for analysts in their forecasting.",
    "year": 2020,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "8df6df0f54c0b770c3e87a3164770a36",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:15:26.095553"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是使用log-linear回归模型来预测收益增长率，并用于构建PEGR排序的投资组合。研究结果表明，这种投资组合策略能够超越市场表现，这直接关联到投资组合管理的领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是使用log-linear回归模型来预测收益增长率，并用于构建PEGR排序的投资组合。研究结果表明，这种投资组合策略能够超越市场表现，这直接关联到投资组合管理的领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:10:30.822461"
}