{
  "paper": {
    "id": 2954,
    "title": "Analyzing and forecasting China's financial resilience: Measurement techniques and identification of key influencing factors☆",
    "abstract": "This paper measures China's financial resilience from the perspective of external risk shocks and analyzes its influencing factors for forecasting. First, we introduce an innovative financial resilience model comprising three submodels: the dynamic factor model, the TVP-VAR model, and a resilience characteristic measurement model that captures resistance and recoverability through absorption intensity and absorption duration. The results show a clear inverse relationship between absorption intensity and absorption duration, with resilience fluctuations exhibiting distinct phase characteristics. Notably, intervals of low resilience often correspond to specific risk events. Second, we apply the Lasso-logistic model for recursive estimation and forecasting financial resilience, while comparing its performance to that of the Logistic regression model. The results indicate that the Lasso-logistic model achieves, on average, a 10 % higher forecasting accuracy than the Logistic model does. Among the most important features identified by the model are macroeconomic and public expectation variables. The analysis shows that the stability of economic fundamentals and market participants' confidence in the future play pivotal roles in strengthening financial resilience and ensuring the stability of the financial system.",
    "year": 2025,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "63b6d2096714b6d818352412a077f0ee",
    "relevant_keywords": [
      "regression",
      "feature representation"
    ],
    "stage1_timestamp": "2025-05-15T02:20:48.276561"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要研究中国金融韧性的测量和预测，通过动态因子模型、TVP-VAR模型和韧性特征测量模型来分析外部风险冲击的影响，并应用Lasso-logistic模型进行预测。这些技术和方法主要用于评估和预测金融系统的稳定性，属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文主要研究中国金融韧性的测量和预测，通过动态因子模型、TVP-VAR模型和韧性特征测量模型来分析外部风险冲击的影响，并应用Lasso-logistic模型进行预测。这些技术和方法主要用于评估和预测金融系统的稳定性，属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:39:18.680486"
}