{
  "paper": {
    "id": 1995,
    "title": "An attention embedded DUAL-LSTM method for financial risk early warning of the three new board-listed companies",
    "abstract": "Computer and financial fields are both involved in the interdisciplinary topic of financial risk early warning. We suggest an attention-embedded dual Long Short Term Memory (DUAL-LSTM) for the financial risk early warning to deal with the potential and constraints of rapid economic development to improve the precision of the financial risk prediction for the listed businesses on the New Third Board. First, feature fusion attentionally quantifies data characteristics, increasing the robustness and generalizability of data features. The model's predictive power is then increased by creating a dual LSTM model to meet the financial risk. The studies show that the attention-embedded dual LSTM model can achieve 96.9% of the F value scores and is superior to state-of-the-art model (SOTA) such as the Z-score model, Fisher discriminant method, logistic regression, and Back-Propagation network, achieves the advantage of time series in financial risk prediction. Additionally, for predicting financial risk, our algorithm performs flawlessly and effectively.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "6c79c20d2ada299e0d1307cc78b2bb28",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "neural network",
      "long short-term memory",
      "LSTM",
      "attention mechanism",
      "backpropagation",
      "BP",
      "classification"
    ],
    "stage1_timestamp": "2025-05-15T02:09:48.406924"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是开发一种基于注意力机制的双LSTM模型，用于金融风险早期预警，特别是针对新三板上市公司的财务风险预测。这直接属于金融风险管理的范畴，因为其主要目标是预测和管理财务风险。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是开发一种基于注意力机制的双LSTM模型，用于金融风险早期预警，特别是针对新三板上市公司的财务风险预测。这直接属于金融风险管理的范畴，因为其主要目标是预测和管理财务风险。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:44:50.564195"
}