{
  "paper": {
    "id": 834,
    "title": "Volatility Forecasting using a Hybrid GJR-GARCH Neural Network Model",
    "abstract": "Volatility forecasting in the financial markets, along with the development of financial models, is important in the areas of risk management and asset pricing, among others. Previous testing has shown that asymmetric GARCH models outperform other GARCH family models with regard to volatility prediction. Utilizing this information, three popular Neural Network models (Feed-Forward with Back Propagation, Generalized Regression, and Radial Basis Function) are implemented to help improve the performance of the GJR(1,1) method for estimating volatility over the next forty-four trading days. During training and testing, four different economic cycles have been considered between 1997-2011 to represent real and contemporary periods of market calm and crisis. In addition to stress testing for different neural network architectures to assess their performance under various turmoil and normal situations in the U.S. market, their synergy along with another econometric model is also accessed. (C) 2014 Published by Elsevier B.V.",
    "year": 2014,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "f917aae7f1747b294315945cb66110cd",
    "relevant_keywords": [
      "machine learning",
      "neural network",
      "backpropagation",
      "BP"
    ],
    "stage1_timestamp": "2025-05-15T01:55:41.563576"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on volatility forecasting in financial markets, which is a critical component of financial risk management. The study aims to improve the performance of volatility estimation using neural networks and GJR-GARCH models, specifically for risk management applications during different economic cycles.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on volatility forecasting in financial markets, which is a critical component of financial risk management. The study aims to improve the performance of volatility estimation using neural networks and GJR-GARCH models, specifically for risk management applications during different economic cycles.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:54:17.520172"
}