{
  "paper": {
    "id": 3715,
    "title": "A methodology for detection and classification of power quality disturbances using a real-time operating system in the context of home energy management systems",
    "abstract": "Demand-side management comprises a portfolio of actions on the consumers' side to ensure reliable power indices from the electrical system. The home energy management system (HEMS) is used to manage the consumption and production of energy in smart homes. However, the technology of HEMS architecture can be used for the detection and classification of power quality disturbances. This paper presents low-voltage metering hardware that uses an ARM Cortex M4 and real-time operating system to detect and classify power quality disturbances. In the context of HEMS, the proposed metering infrastructure can be used as a smart meter, which provides the service of power quality monitoring. For this type of application, there is a need to ensure that the development of this device has an acceptable cost, which is one of the reasons for the choice of an ARM microprocessor. However, managing a wide range of operations (data acquisition, data preprocessing, disturbance detection and classification, energy consumption, and data exchange) is a complex task and, consequently, requires the optimization of the embedded software. To overcome this difficulty, the use of a real-time operating system provided by Texas Instruments (called TI-RTOS) is proposed with the objective of managing operations at the hardware level. Thus, a methodology with low computational cost has been defined and embedded. The proposed approach uses a preprocessing stage to extract some features that are used as inputs to detect and classify disturbances. In this way, it was possible to evaluate and demonstrate the performance of the embedded algorithm when applied to synthetic and real power quality signals. Consequently, it is noted that the results are significant in the analysis of power quality in a smart grid scenario, as the smart meter offers low cost and high accuracy in both detecting (an accuracy rate above 90%) and classifying (an average accuracy rate above 94%) disturbances.",
    "year": 2021,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "4c73f5752b5e30966d85a6e0a28545f0",
    "relevant_keywords": [
      "classification"
    ],
    "stage1_timestamp": "2025-05-15T01:20:03.456814"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究家庭能源管理系统中的电能质量扰动检测与分类技术，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究家庭能源管理系统中的电能质量扰动检测与分类技术，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:09:12.013154"
}