{
  "paper": {
    "id": 446,
    "title": "Big data analytics on enterprise credit risk evaluation of e-Business platform",
    "abstract": "In recent years, the research on supply chain finance has been mature, in the supply chain financial risk research, the research on credit risk is mostly. However, there is little research on online supply chain finance, especially on credit risk. Therefore, this article has carried on the detailed research to the commercial bank online supply chain financial credit risk assessment. Firstly, the article applies the literature induction method to review the supply chain financial credit risk indicators, add the online specific indicators to supplement, combine the indicators selection principle to determine the final indicators, and construct the commercial bank online supply chain financial credit risk assessment index system, select online The supply chain financial business carried out the concentrated SMEs in the automobile manufacturing industry as the research object, using the nonlinear LS-SVM model for empirical analysis, and compared with the logistic regression model results. Secondly, the designed index system can effectively evaluate credit risk. The classification accuracy of LS-SVM evaluation model is higher than that of Logistic regression model and it has strong generalization ability. It can comprehensively identify the credit risk of small and medium-sized financing enterprises, and provide a reasonable and scientific analysis and support tool for assessing SME credit risk. Finally, combined with the fierce competition background of supply chain finance, it is proposed that commercial banks should actively carry out online supply chain finance, comprehensive risk management and deepen cooperation with e-Business platforms and logistics platforms.",
    "year": 2020,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "0dadaa6a3e1a0b2b84560435fe44d78c",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM"
    ],
    "stage1_timestamp": "2025-05-15T01:50:52.674633"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要研究商业银行在线供应链金融信用风险评估，使用机器学习模型（如LS-SVM）来评估中小企业的信用风险，这直接属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文主要研究商业银行在线供应链金融信用风险评估，使用机器学习模型（如LS-SVM）来评估中小企业的信用风险，这直接属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:58:01.677538"
}