{
  "paper": {
    "id": 296,
    "title": "An optimized support vector machine intelligent technique using optimized feature selection methods: evidence from Chinese credit approval data",
    "abstract": "This paper focuses on feature selection methods for support vector machine (SVM) classifiers, checking their optimality by comparing them with some statistical and baseline methods. To achieve the above objective, we exploit twelve feature selection methods from the family of filters and embedded approaches by splitting a Chinese database. Our findings suggest that the average result from sample division cases will achieve a more robust prediction ability than that from no sample division cases. Moreover, ridge regression (SVM9) in training and average results from sample division data sets, along with DTQUEST (SVM7) in no sample division example sets, give outstanding performance with respect to all performance criteria. With these contributions, therefore, our paper complements previous evidence and modernizes the methods of feature selection to render SVM classifiers favorable for credit approval data modeling. This study has practical implications for financial institutions, managers, employees, investors and government officials looking to sort out forthcoming lending transactions to attain a target risk/return trade-off.",
    "year": 2019,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "bbb4d25254ea4fa282206a57a6e11682",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM",
      "decision tree",
      "feature learning"
    ],
    "stage1_timestamp": "2025-05-15T01:49:04.655538"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要研究支持向量机在信用审批数据建模中的应用，旨在优化特征选择方法以提高预测能力，这直接关联到金融机构在贷款交易中的风险评估和管理，属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文主要研究支持向量机在信用审批数据建模中的应用，旨在优化特征选择方法以提高预测能力，这直接关联到金融机构在贷款交易中的风险评估和管理，属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:59:27.430415"
}