{
  "paper": {
    "id": 9253,
    "title": "Study protocol: associations between dietary patterns, cognitive function and metabolic syndrome in older adults - a cross-sectional study",
    "abstract": "BackgroundLoss of cognitive function is a significant issue as the world's population ages. Preserving cognitive function maintains independence in older adults bringing major societal and financial benefits. Lifestyle factors such as diet are modifiable risk factors, which may help preserve cognitive function.Most nutrition research aimed at preserving cognitive function and metabolic health has focussed on individual nutrients and foods, not allowing for food combinations and interactions. A dietary pattern approach considers the entire diet including its complexity. Previous research investigating dietary patterns and cognitive function has not always considered relevant covariates such as physical activity and the Apolipoprotein E genotype, which are known to have associations with cognitive function.The aim of the REACH (Researching Eating, Activity and Cognitive Health) study is to investigate associations between dietary patterns, cognitive function and metabolic syndrome, accounting for a range of covariates.MethodsThis cross-sectional study design will recruit older, community-living adults (65-74years) from Auckland, New Zealand. Dietary data will be collected via a 109-item food frequency questionnaire validated using a 4-day food record. Cognitive function will be assessed using the Montreal Cognitive Assessment (paper based) and the Computerised Mental Performance Assessment System (COMPASS) - a testing suite covering six domains. Additional data will include genetic (Apolipoprotein E epsilon 4) and biochemical markers (fasting glucose, HbA1c, lipids profile), anthropometric measurements (weight, height, waist and hip circumference, body composition using dual X-ray absorptiometry), blood pressure, physical activity (International Physical Activity Questionnaire - short form) and health and demographics (questionnaire).Dietary patterns will be derived by principal component analysis. Associations between cognitive function and dietary patterns will be examined using multiple regression analysis. Covariates and interaction factors will include age, education, socio-economic status, physical activity, Apolipoprotein E epsilon 4 genotype, family history of dementia or cognitive impairment, and lifestyle factors. Differences between participants with and without metabolic syndrome will also be examined.DiscussionThis study will bring new knowledge regarding associations between dietary patterns and cognitive function and metabolic health in older adults living in New Zealand. This is important for developing nutrition related recommendations to help older adults maintain cognitive function.",
    "year": 2019,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "c9c301a2c29dc38386c54a357f0a8878",
    "relevant_keywords": [
      "principal components analysis"
    ],
    "stage1_timestamp": "2025-05-15T03:26:54.606587"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究饮食模式与认知功能和代谢综合征之间的关联，属于健康科学领域，并未涉及任何金融研究领域的应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究饮食模式与认知功能和代谢综合征之间的关联，属于健康科学领域，并未涉及任何金融研究领域的应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:25:12.202631"
}