{
  "paper": {
    "id": 3727,
    "title": "African buffalo optimized multinomial softmax regression based convolutional deep neural network for software fault prediction",
    "abstract": "Software fault prediction is an essential part of the software quality assurance to detect faulty software modules depending on software measurement data. This models area of the research generates software engineers focus to development activities on fault-prone code for increasing the software quality. Many existing designed for improving the software quality by various methods. The software failure cause prediction accuracy and defect detection rate of the conventional techniques were not sufficient. Introduced an African Buffalo Optimized Multinomial Softmax Regression based Convolutional Deep Neural Learning (ABOMSR-CDNL). ABOMSR-CDNL model to enhance the software reliability through predicting root cause of software failure at earlier stage. ABOMSR-CDNL Model comprises four layers, namely input layer, two hidden layers and output layer and software program codes, event log files as an input layer then transmits the software program codes to the hidden layer 1. Construct the projects portfolio with help of optimal parameters selected from event log files then sent to the hidden layer 2. This method reduce the amount of time taken for examining the failure behaviour of system application. ABOMSR-CDNL Model applied multinomial softmax regression analysis in hidden layer 2 this objective of determining the cause of higher accuracy the result is sent to the output layer. Result illustrates ABOMSR-CDNL Model is increasing the accuracy, false positive rate and minimized the software failure identification time. Copyright (c) 2022 Elsevier Ltd. All rights reserved. Selection and peer-review under responsibility of the scientific committee of the International Conference on Recent Advances in Mechanical Engineering and Nanomaterials",
    "year": 2022,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "71e7880162798a37ad34d9fc5fc6307d",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "regression",
      "neural network",
      "deep learning",
      "hidden layer",
      "convolutional neural network",
      "CNN"
    ],
    "stage1_timestamp": "2025-05-15T01:20:03.608012"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是软件故障预测，通过非洲水牛优化的多项Softmax回归卷积深度神经网络来提高软件可靠性。虽然提到了'projects portfolio'，但这与金融领域的投资组合管理无关，而是指软件项目的组合。论文的核心技术和应用场景均属于软件工程领域，与衍生品定价、金融风险管理和投资组合管理无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是软件故障预测，通过非洲水牛优化的多项Softmax回归卷积深度神经网络来提高软件可靠性。虽然提到了'projects portfolio'，但这与金融领域的投资组合管理无关，而是指软件项目的组合。论文的核心技术和应用场景均属于软件工程领域，与衍生品定价、金融风险管理和投资组合管理无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T14:20:20.289810"
}