{
  "paper": {
    "id": 219,
    "title": "E-Commerce Fraud Detection Model by Computer Artificial Intelligence Data Mining",
    "abstract": "This study aims to identify e-commerce fraud, solve the financial risks of e-commerce enterprises through big data mining (BDM), further explore more effective solutions through Information fusion technology (IFT), and create an e-commerce fraud detection model (FDM) based on IFT (namely, computer technology (CT), artificial intelligence (AI), and data mining (DM). Meanwhile, BDM technology, support vector machine (SVM), logistic regression model (LRM), and the proposed IFT-based FDM are comparatively employed to study e-commerce fraud risks deeply. Specifically, the LRM can effectively solve data classification problems. The proposed IFT-based FDM fuses different information sources. The experimental findings corroborate that the proposed Business-to-Business (B2B) e-commerce enterprises-oriented IFT-based FDM presents significantly higher fraud identification accuracy than SVM and LRM. Therefore, the IFT-based FDM is superior to SVM and LRM; it can process and calculate e-commerce enterprises' financial risk data from different sources and obtain higher accuracy. BDM technology provides an important research method for e-commerce fraud identification. The proposed e-commerce enterprise-oriented FDM based on IFT can correctly analyze enterprises' financial status and credit status, obtaining the probability of fraudulent behaviors. The results are of great significance to B2B e-commerce fraud identification and provide good technical support for promoting the healthy development of e-commerce.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "7c777091682815994602a61477ccab89",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM"
    ],
    "stage1_timestamp": "2025-05-15T01:48:30.640982"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究电子商务欺诈检测模型，虽然涉及金融风险数据，但其核心应用场景是电子商务企业的欺诈识别，而非特定的金融研究领域如衍生品定价、金融风险管理或投资组合管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究电子商务欺诈检测模型，虽然涉及金融风险数据，但其核心应用场景是电子商务企业的欺诈识别，而非特定的金融研究领域如衍生品定价、金融风险管理或投资组合管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:59:55.793942"
}