{
  "paper": {
    "id": 2126,
    "title": "Enhancing Customer Experience: Exploring Deep Learning Models for Banking Customer Journey Analysis",
    "abstract": "Customer journey analytics is the process of monitoring and analyzing how customers use combinations of points of contact, services, or products to interact with an organization. Companies use customer journey analytics because it is one of the most effective ways to increase long-term customer value, improve customer loyalty, and drive revenue growth. Customer journey analysis provides teams with a window on customer behavior that provides valuable information that they can then use to inform their decisions. These points of contact are called events and they define the customer's behavioral model across an organization. In a typical big bank, about 100,000 events are carried out per second. Several dynamic events are associated with a bank such as an ATM withdrawal, a POS transaction, a cash deposit. This series of customer journey events can be used for different use cases such as cross-selling, account reactivation, hard rolling, soft rolling to name a few. This paper uses deep neural network-based, recurrent neural network (RNN) algorithm to capture these customer journey events across a bank and how these events can be used to predict cross-sell propensity for other bank products. We developed various RNN models using both time series and static data layers to estimate the likelihood of cross-selling credit card facility to existing customers on hypothetical dataset. A highly predictable model is developed with an AUC of 0.92 on training and 0.90 on validation sample. This model can capture around 91% of the cross-sell events in first two deciles for training sample, indicating that by targeting a small proportion of the portfolio, a bank can achieve maximum conversions from cross-sell programs.",
    "year": 2024,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "5b5bea6d63d62a83a54fa850f79c5dc0",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "neural network",
      "recurrent neural network",
      "RNN",
      "representation learning",
      "backpropagation",
      "BP",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T01:03:03.778870"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究使用深度学习模型分析银行客户旅程，以预测交叉销售倾向，并未涉及衍生品定价、金融风险管理或投资组合管理等特定金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究使用深度学习模型分析银行客户旅程，以预测交叉销售倾向，并未涉及衍生品定价、金融风险管理或投资组合管理等特定金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:17:17.535073"
}