{
  "paper": {
    "id": 1302,
    "title": "Financial Application: Predicting the Wealth Management Products Buying Behaviour of Listed Companies",
    "abstract": "The behaviors of business entities affect the entire business world in a variety of ways. Based on the prediction of these behaviors, we could make appropriate business plans in advance to achieve profitable investment, precision marketing and risk management. But factors affecting these business issues are complex and diverse, making financial analysis invalid. Big data technology based on machine learning brings us the dawn to business intelligence applications. In this paper, we will predict the wealth management products buying behaviour of Chinese listed companies by reasonably defining the capability range of machine learning algorithms to solve business problems. Our data comes from the financial database of the Wind, which provides strong support for real-time applications. We not only use the model to backtest historical data, but also deploy the model online to predict the behavior of 2019. In addition, we obtain the importance scores of factors that influence these predictions, providing valuable explanatory bases for business applications.",
    "year": 2019,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "6af3dae1c352686ffe616d84384e22f6",
    "relevant_keywords": [
      "machine learning",
      "classification",
      "regression",
      "feature representation"
    ],
    "stage1_timestamp": "2025-05-15T02:01:11.896914"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究利用机器学习预测上市公司购买理财产品的行为，虽然涉及金融领域，但其核心应用更偏向于行为预测和商业智能，并未直接涉及衍生品定价、金融风险管理或投资组合管理等特定金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究利用机器学习预测上市公司购买理财产品的行为，虽然涉及金融领域，但其核心应用更偏向于行为预测和商业智能，并未直接涉及衍生品定价、金融风险管理或投资组合管理等特定金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:49:50.971874"
}