{
  "paper": {
    "id": 703,
    "title": "House price prediction with gradient boosted trees under different loss functions",
    "abstract": "Many banks and credit institutions are required to assess the value of dwellings in their mortgage portfolio. This valuation often relies on an Automated Valuation Model (AVM). Moreover, these institutions often report the models accuracy by two numbers: The fraction of predictions within +/- 20% and +/- 10% range from the true values. Until recently, AVMs tended to be hedonic regression models, but lately machine learning approaches like random forest and gradient boosted trees have been increasingly applied. Both the traditional approaches and the machine learning approaches rely on minimising mean squared prediction error, and not the number of predictions in the +/- 20% and +/- 10% range. We investigate whether introducing a loss function closer to the AVMs actual loss measure improves performance in machine learning approaches, specifically for a gradient boosted tree approach. This loss function yields an improvement from 89.4% to 90.0% of predictions within +/- 20% of the true value on a data set of N = 126719 transactions from the Norwegian housing market between 2013 and 2015, with the biggest improvements in performance coming from the lower price segments. We also find that a weighted average of models with different loss functions improves performance further, yielding 90.4% of the observations within +/- 20% of the true value.",
    "year": 2022,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "969d90b517721de069dd59763b30d997",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "regression",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T00:47:18.493086"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是使用梯度提升树和不同的损失函数来预测房价，以提高自动估值模型（AVM）的准确性。虽然这与金融机构的抵押贷款组合评估相关，但并未直接涉及衍生品定价、金融风险管理或投资组合管理等特定金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是使用梯度提升树和不同的损失函数来预测房价，以提高自动估值模型（AVM）的准确性。虽然这与金融机构的抵押贷款组合评估相关，但并未直接涉及衍生品定价、金融风险管理或投资组合管理等特定金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:28:26.833401"
}