{
  "paper": {
    "id": 290,
    "title": "Adaptive Mutation PSO Based SVM Model for Credit Scoring",
    "abstract": "Credit risk1 is one of the primary sources of risk to financial institutions. It is necessary for financial institutions to construct a scientific credit scoring model, which is essential for managing credit assets. In order to improve the accuracy of credit evaluation, a credit scoring model based on support vector machine (SVM) optimized by an adaptive mutation partial swarm algorithm (APSO) is proposed. Firstly, we employ both normalization method and principal component analysis method to simplify credit scoring data. Secondly, in order to search optimal parameters values for SVM, the APSO algorithm is presented by means of introducing premature convergence indicator and adaptive mutation operator, which can solve the premature convergence in traditional PSO. Finally, credit data are evaluated via the trained SVM model. Experimental results show that the proposed model has generalization ability and achieves higher prediction accuracy.",
    "year": 2018,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "7a9c44460656cc75a792542e3703a842",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM",
      "principal components analysis"
    ],
    "stage1_timestamp": "2025-05-15T01:49:04.616094"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on developing a credit scoring model to assess credit risk, which is a key component of financial risk management for institutions. The proposed SVM model optimized by APSO is specifically designed to improve the accuracy of credit evaluation, directly addressing credit risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on developing a credit scoring model to assess credit risk, which is a key component of financial risk management for institutions. The proposed SVM model optimized by APSO is specifically designed to improve the accuracy of credit evaluation, directly addressing credit risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:59:28.261306"
}