{
  "paper": {
    "id": 3344,
    "title": "Housing in the greater Paris area as an inflation hedge?",
    "abstract": "PurposeOver a long period, even low inflation has an impact on portfolio value and households' purchasing power. In such a context, inflation hedging should remain an important issue for investors. In particular, long-term investors, who are concerned with the protection of their wealth, seek to hold effective hedging assets. This study aims to demonstrate that residential assets in Grand Paris are a hedge against inflation and particularly against its unexpected component. Design/methodology/approachIn this study, the physical residential markets in 127 communes in Paris and the Parisian first-ring suburbs are considered as potential asset classes. We simplified the analysis by clustering the 127 communes into five homogenous groups using ascending hierarchical classification (AHC). Then, we test the hedging ability of these groups within a mixed asset portfolios using both correlation and regression analysis. FindingsThis paper presents an analysis of the Grand Paris housing market and its inflation hedging ability with comparison to other financial asset classes. Results show that the five housing groups act as a highly positive hedge against unexpected inflation. Furthermore, cash and bonds seem to provide, respectively, a partial and an over hedge against unexpected inflation. Stocks act as a perverse hedge against unexpected inflation and provide no significant hedge against expected inflation. Also, indirect listed real estate demonstrates little correlation with inflation, which makes us reject its hedging ability contrary to physical residential real estate. Research limitations/implicationsThe inflation topic: although several researches exist that question the hedging property of real estate, very few concentrate on physical residential assets and to the best of the authors' knowledge, this study is the only one that targets the Grand Paris area. Residential assets of the Grand Paris communes are confirmed to be a hedge against inflation and particularly against its unexpected component thanks to its capital appreciation rather than income one. Also, we show that the listed real estate in France (Societes d'Investissement Immobilier Cotee) does not provide the same hedging properties contrary to the US real estate investment trusts (REITs) who demonstrate this ability. Listed real estate could thus not be used interchangeably with housing to protect from inflation in the French market. Practical implicationsProtection of investors against inflation and in particular in the face of its return to France in 2022. Reassuring promoters and investors of the interest of residential investment projects in Greater Paris and of the potential that this holds. Social implicationsInflation takes a chunk out of the purchasing power of money and thereby erodes the real value of people's finance. Investors and households who seek protection from inflation erosion should invest in direct housing, and in particular within areas that are experiencing an effective metropolization process. Originality/valueThe originality of the study is precisely relative to the geographical area studied. The latter has experienced favorable economic conditions for several years and offers interesting fundamentals to explore and exploit in investment strategies that prove capable of protecting against imminent inflation. The database is specific to this project and has been built through the compilation of several sources and with the support of BNP Paribas Real Estate.",
    "year": 2024,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "6810cdb76bc19d2c0fb59ac9bdf501cd",
    "relevant_keywords": [
      "clustering",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:16:22.071156"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文研究了住宅资产作为通胀对冲工具的有效性，并将其与其他金融资产类别进行比较，以优化投资组合。这直接涉及投资组合管理的核心内容，即资产选择和风险分散。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文研究了住宅资产作为通胀对冲工具的有效性，并将其与其他金融资产类别进行比较，以优化投资组合。这直接涉及投资组合管理的核心内容，即资产选择和风险分散。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:10:10.377620"
}