{
  "paper": {
    "id": 6838,
    "title": "ADAPTING TO UNCERTAINTY: A QUANTITATIVE INVESTMENT DECISION MODEL WITH INVESTOR SENTIMENT AND ATTENTION ANALYSIS",
    "abstract": "In the face of global uncertainties, including pandemics, economic fluctuations, disruptions in supply chains, major disasters, wars, and impending economic crises, the financial landscape and the impact of investor sentiment on the return of stock index futures can be significantly altered. Understanding the relationship between investor sentiment, attention, and stock index futures returns in the face of these diverse challenges has become particularly critical. However, existing research does not adequately consider the effect of these unexpected events on the market and the shifts in investor attention. Using the COVID-19 pandemic as a case study, this research proposes a dynamic quantitative investment decision-making model that considers the influence of investors' attention and emotional characteristics, aiming to adapt to the financial market under these global changes and improve the accuracy of quantitative investment forecasting. Initially, the Bidirectional Encoder Representations from Transformers model is employed to analyze investor comment data, extract information on investor attention and emotional characteristics, and construct investor sentiment indicators. Subsequently, a stock index futures forecasting method based on Variational Mode Decomposition algorithm and Support Vector Regression (SVR) model is constructed, and the grey wolf optimization algorithm is introduced to optimize the parameters of the SVR model. Guided by investor sentiment indicators, different market states are further distinguished, and appropriate investment strategies are implemented to effectively enhance the returns of quantitative investment. When compared with models that neglect investor attention and emotional characteristics, the results show that considering investor sentiment indicators not only improves the predictive ability of the model, but also reduces cognitive bias and market risk.",
    "year": 2025,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "99347fea9012777b05f0fb322bc44b16",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "regression",
      "support vector machine",
      "SVM",
      "neural network",
      "deep learning",
      "attention mechanism",
      "Large Language Model",
      "LLM"
    ],
    "stage1_timestamp": "2025-05-15T03:02:07.485969"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是构建一个动态定量投资决策模型，旨在通过分析投资者情绪和注意力特征来优化投资策略，提高量化投资的回报。这直接涉及投资组合管理的领域，因为它关注的是如何根据市场状态和投资者行为调整投资策略以实现更好的收益。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是构建一个动态定量投资决策模型，旨在通过分析投资者情绪和注意力特征来优化投资策略，提高量化投资的回报。这直接涉及投资组合管理的领域，因为它关注的是如何根据市场状态和投资者行为调整投资策略以实现更好的收益。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:27:07.939149"
}