{
  "paper": {
    "id": 539,
    "title": "Financial Risk Evaluation of Digital Currency Based on CART Algorithm Blockchain",
    "abstract": "In recent years, digital currencies based on blockchain technology have brought about a boom in the research of encrypted digital currencies with the design concept of peer-to-peer trading and decentralization, but due to the lack of supervision and obvious speculative characteristics of the digital currency market, the sharp fluctuations in the market can easily trigger investor sentiment fluctuations, which in turn will lead to social instability and even financial system risks. In this paper, through the analysis of the financial risk source factors of blockchain digital currency, the evaluation index is established, the risk evaluation index system is constructed, and then the CART classification algorithm is used to analyze it and evaluate and test the model. The characteristic factor structure obtained by the CART algorithm in this paper better explains the financial risk characteristics of blockchain digital currency and gives relatively reliable identification results. The results show that the CART decision tree classification method is effective and has a high accuracy rate, which classifies the financial risks of blockchain digital currency, and the method has excellent adaptability and matchability for the classification of risk problems.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "6621eaad269936b650d8275c1342e2e5",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T01:52:12.257923"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心内容是使用CART算法对区块链数字货币的金融风险进行评估和分类，这直接涉及金融风险管理领域。论文明确讨论了风险源因素、风险评价指标体系的构建以及风险分类，这些都是金融风险管理的典型研究内容。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心内容是使用CART算法对区块链数字货币的金融风险进行评估和分类，这直接涉及金融风险管理领域。论文明确讨论了风险源因素、风险评价指标体系的构建以及风险分类，这些都是金融风险管理的典型研究内容。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:57:04.772779"
}