{
  "paper": {
    "id": 3910,
    "title": "MANAGEMENT GAME STRATEGIC CHALLENGE AND ITS DEVELOPMENT, IMPROVING AND SUITABILITY FOR USING IN EDUCATION PROCESS",
    "abstract": "The paper deals with the further development and improvement of previously created management game Strategic Challenge. The game simulates real operations in a manufacturing process by uploading specific model situations in the department of production, research and development department, quality and control department, financial department, health, safety and environmental issues department or supply chain department. The aim of this game is to give participants possibility to try to solve everyday tasks relating to business operation in a risk-free environment. It is one of the actual and active learning methods. The game supports development of systems thinking, thereby leads to sharing and developing of knowledge in various fields. These activities could be considered as integral part of knowledge management and education process. Effective knowledge management which uses modern approaches is necessary due to its growing importance in the field of education and management. The aim of this paper is to introduce and verify suitability of the proposed game in education process by using testing operation - pilotage in case of students of bachelor and master programs.",
    "year": 2016,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "806022240cc10af28a1a237f3786b89f",
    "relevant_keywords": [
      "active learning"
    ],
    "stage1_timestamp": "2025-05-15T02:30:58.392985"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要讨论的是管理游戏在教育过程中的应用和改进，虽然涉及金融部门，但其核心内容是模拟企业运营和知识管理，并未具体涉及衍生品定价、金融风险管理或投资组合管理等金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要讨论的是管理游戏在教育过程中的应用和改进，虽然涉及金融部门，但其核心内容是模拟企业运营和知识管理，并未具体涉及衍生品定价、金融风险管理或投资组合管理等金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:34:44.756281"
}