{
  "paper": {
    "id": 3475,
    "title": "Estimation & Forecasting of Volatility using Arima, Arfima and Neural Network based Techniques",
    "abstract": "Volatility is used to indicate the stock market movement; in general terms can be defined as the risk associated with stocks. Volatility is measured as standard deviation and variance of Closing Prices. Forecasting volatility has been a prime issue in financial market and lots of researchers are working on it since more than a decade. The main goal of this paper is to forecast volatility with a high accuracy. The volatility is calculated using traditional volatility calculation techniques called volatility estimators. The volatility is calculated using Close, Garman klass, Parkinson, Roger and Yang estimating methods. Time series forecasting techniques ARIMA, ARFIMA and a feed forward Neural Network based techniques are used for forecasting volatility. The results of all the three techniques are compared to find an accurate estimation and forecasting technique. The best forecasting technique is shortlisted by comparing the error results of all the forecasting techniques with error measuring parameters such as ME, RMSE, MAE, MPE, MAPE, MASE and ACF1. Garman klass estimator with Arima technique as the forecasting methods yields more accurate volatility forecasts for next 10 days.",
    "year": 2015,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "59c040437d11ded5a32b0ed90b008dc5",
    "relevant_keywords": [
      "neural network",
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T02:26:48.471388"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on forecasting volatility, which is a key component in financial risk management. Volatility forecasting is used to assess and manage the risk associated with stock market movements, making it directly relevant to financial risk management. The techniques discussed (ARIMA, ARFIMA, and Neural Networks) are applied to improve the accuracy of volatility forecasts, which is crucial for risk assessment and mitigation.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on forecasting volatility, which is a key component in financial risk management. Volatility forecasting is used to assess and manage the risk associated with stock market movements, making it directly relevant to financial risk management. The techniques discussed (ARIMA, ARFIMA, and Neural Networks) are applied to improve the accuracy of volatility forecasts, which is crucial for risk assessment and mitigation.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:36:25.532391"
}