{
  "paper": {
    "id": 1479,
    "title": "Suitability of using technical indicator-based Strategies as potential strategies within intelligent trading systems",
    "abstract": "The potential of machine learning to automate and control nonlinear, complex systems is well established. These same techniques have always presented potential for use in the investment arena, specifically for the managing of equity portfolios. In this paper, the opportunity for such exploitation is investigated through analysis of potential simple trading strategies that can then be meshed together for the machine learning system to switch between. It is the eligibility of these strategies that is being investigated in this paper, rather than application. In order to accomplish this, the underlying assumptions of each trading system are explored, and data is created in order to evaluate the efficacy of these systems when trading on data with the underlying patterns that they expect. The strategies are tested against a buy-and-hold strategy to determine if the act of trading has actually produced any worthwhile results, or are simply facets of the underlying prices. These results are then used to produce targeted returns based upon either a desired return or a desired risk, as both are required within the portfolio-management industry. Results show a very viable opportunity for exploitation within the aforementioned industry, with the Strategies performing well within their narrow assumptions, and the intelligent system combining them to perform without assumptions.",
    "year": 2011,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "1010948e6bb75145ea8d200daf0f6e6f",
    "relevant_keywords": [
      "machine learning"
    ],
    "stage1_timestamp": "2025-05-15T00:56:08.392621"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文探讨了机器学习在自动化交易策略中的应用，特别是针对股票投资组合的管理。论文研究了简单交易策略的有效性，并将其与买入持有策略进行比较，以确定交易行为是否产生有价值的回报。这些研究直接关联到投资组合管理的核心问题，即如何通过策略选择和组合优化来实现目标回报或控制风险。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文探讨了机器学习在自动化交易策略中的应用，特别是针对股票投资组合的管理。论文研究了简单交易策略的有效性，并将其与买入持有策略进行比较，以确定交易行为是否产生有价值的回报。这些研究直接关联到投资组合管理的核心问题，即如何通过策略选择和组合优化来实现目标回报或控制风险。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:20:42.283016"
}