{
  "paper": {
    "id": 3776,
    "title": "Heterogeneity and fine wine prices: application of the quantile regression approach",
    "abstract": "This study addresses the price heterogeneity of the five first growths of Bordeaux. We apply the quantile regression (QR) approach with market segmentation based on wine bottle price quantiles. We compute the hedonic price of wine attributes for various price segments in the market. This approach is applied to a major dataset comprising approximately 50,000 transactions over the 2003-2017 period. The findings indicate that the relative hedonic prices of several wine attributes differ significantly among deciles. The implications of our results are manifold. Vintage and Parker grades have a strong impact on the variation in wine prices, and there is a hierarchy among the five first growths of Bordeaux. There is also a premium commanded by the reputation and experience of an auction house. Since the financial crisis of 2012-2013, investors have considered that the five first growths are overrated, save for the most expensive wines; for those most expensive ones, investors prefer scarcity to liquidity. These results are of import to several actors in the fine wine market: investors, for example, could use the findings herein to better diversify their wine portfolio, while auction houses could better anticipate their future sales based on consumers' expectation.",
    "year": 2020,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "dedc66a8c7af7fba9e28fdb5b67421d1",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:20:36.108333"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文研究了优质葡萄酒价格的异质性，并提到投资者可以利用研究结果更好地分散他们的葡萄酒投资组合。这直接关联到投资组合管理的领域，尽管研究对象是葡萄酒而非传统金融资产。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文研究了优质葡萄酒价格的异质性，并提到投资者可以利用研究结果更好地分散他们的葡萄酒投资组合。这直接关联到投资组合管理的领域，尽管研究对象是葡萄酒而非传统金融资产。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:08:49.990722"
}