{
  "paper": {
    "id": 4289,
    "title": "Are we ready for climate risk? Assessing the bottom-up climate maturity",
    "abstract": "Nationally Determined Contribution in UN members focuses on the readiness for national mitigation and adaptation. There still remains a need for firm climate data relevant to measuring the climate situation. Many studies have concluded that the successful path of climate risk adaptation and mitigation should work together between top-down (national) climate policy and bottom-up (firm) climate policy. To address this concern, this study empirically assessed climate maturity, measured by the firm's ability to mitigate and adapt to physical and transition risks. Furthermore, the authors analysed the influential factors enhancing climate maturity using the Task Force on Climate-related Financial Disclosures framework with multiple discriminant analysis (MDA). This research gathered empirical data from listed companies in Thailand and conducted in-depth interviews using two case studies. Our quantitative model using clustering displayed the low maturity of the Thai firms relating to climate risk, except for the energy sector. Large companies perform better in terms of climate risk. After analysing stepwise MDA, two significant factors were found to enhance climate mitigation and adaptation: climate strategy and climate metrics. Finally, a climate policy to increase climate maturity will be proposed.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "49e9a8e4796b2dabf67b51d6574648b4",
    "relevant_keywords": [
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T02:35:26.286445"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究企业应对气候风险的成熟度评估，虽然涉及风险管理概念，但其核心内容属于环境政策和企业战略领域，并未直接应用于金融风险管理、衍生品定价或投资组合管理等金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究企业应对气候风险的成熟度评估，虽然涉及风险管理概念，但其核心内容属于环境政策和企业战略领域，并未直接应用于金融风险管理、衍生品定价或投资组合管理等金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:33:50.702599"
}