{
  "paper": {
    "id": 3237,
    "title": "Research and Design of Credit Risk Assessment System Based on Big Data and Machine Learning",
    "abstract": "Since the outbreak of the COVID-19, small and medium-sized enterprises have been greatly affected. In order to cope with the difficulty of capital turnover for small and medium-sized enterprises, the government has successively introduced a series of financial policies to increase credit support and reduce financing costs. The rapid development of technology has also prompted further innovations in the operating models of banks and other credit platforms. However, banks and credit platforms must consider practical issues such as their own capital costs and risk assessment while they help small and medium-sized enterprises reduce financing costs. This paper aims to study and design a credit risk assessment system based on big data technology and machine learning algorithms. It is hoped that the system will enhance the bank's ability to identify the credit risks of small and medium-sized enterprises, so as to solve the problem of difficult and expensive financing for small and medium-sized enterprises. At the same time, it will reduce the bank's own bad loan ratio and increase profit margins. Achieving a win-win situation for small and medium-sized enterprises and banks, it's crucial to promote jointly the development of economy.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "fde4dc94a70504cb2dd4308fc0cfe442",
    "relevant_keywords": [
      "machine learning",
      "classification",
      "feature learning",
      "feature representation",
      "neural network",
      "deep learning",
      "representation learning"
    ],
    "stage1_timestamp": "2025-05-15T02:24:05.148006"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on designing a credit risk assessment system using big data and machine learning to enhance banks' ability to identify credit risks for small and medium-sized enterprises, which is a key aspect of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on designing a credit risk assessment system using big data and machine learning to enhance banks' ability to identify credit risks for small and medium-sized enterprises, which is a key aspect of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:37:20.548050"
}