{
  "paper": {
    "id": 1832,
    "title": "Dimension Estimation using Second Order data in Finance",
    "abstract": "Estimating intrinsic dimension of financial markets informs the number of assets in portfolio selection models and can help archetypal Mean-Variance (MV) single portfolio optimization model pioneered by Markowitz, especially when intrinsic dimension is introduced as a cardinality constraint in the model. The balance between portfolio concentration risk and portfolio diversification benefit is a quintessential active portfolio management problem. Portfolio variance-covariance matrix, a second order dataset derived from first order portfolio constituents return time series, is an essential tool to quantify risk in a portfolio. Our goal in this paper is to estimate financial markets non-linear intrinsic dimension using second order inputs such as distances (dissimilarity) between asset returns. Second-order data is widely used in financial applications such as portfolio optimization, hierarchical clustering, and risk metrics. We demonstrate the effectiveness of our techniques on synthetic data, benchmark image problems, and, most importantly, financial markets.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "cb0f3ce20d47fae6422128eadbd04df2",
    "relevant_keywords": [
      "clustering",
      "principal components analysis",
      "manifold learning"
    ],
    "stage1_timestamp": "2025-05-15T02:08:03.934589"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是估计金融市场的内在维度，并将其应用于投资组合选择模型，特别是作为Markowitz均值-方差模型的基数约束。论文明确提到投资组合集中风险与多样化收益之间的平衡是主动投资组合管理的典型问题，并使用了投资组合的方差-协方差矩阵来量化风险。这些内容直接指向投资组合管理领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是估计金融市场的内在维度，并将其应用于投资组合选择模型，特别是作为Markowitz均值-方差模型的基数约束。论文明确提到投资组合集中风险与多样化收益之间的平衡是主动投资组合管理的典型问题，并使用了投资组合的方差-协方差矩阵来量化风险。这些内容直接指向投资组合管理领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:45:54.957040"
}