{
  "paper": {
    "id": 1155,
    "title": "An Index for Ranking Financial Portfolios According to Internal Turnover",
    "abstract": "Style analysis models are widely used in common financial practice to estimate the composition of a financial portfolio. The models exploit past returns of the financial portfolio and a set of market indexes, the so-called constituents, that reflect the portfolio investment strategy. The classical model is based on a constrained least squares regression model Sharpe (J Portfol Manage, 1992; Investment management review, 2(6), 59-69, Berlin, Physica, 1998) in which the portfolio returns are regressed on the constituent returns. The quantile regression model, originally proposed in Basset and Chen (Portfolio style: Return-based attribution using quantile regression. In Economic applications of quantile regression (Studies in empirical economics), 293-305,2001) and revisited in Attardi and Vistocco (Statistica Applicata, 18(2), 2006; On estimating portfolio conditional returns distribution through style analysis models. In Quantitative methods for finance and insurance. Berlin, Springer, 2007), provides a useful complement to the standard model, as it allows the discrimination of portfolios that would be otherwise judged equivalent. Indeed different patterns of weights could correspond to the same conditional expectation, whereas the use of regression models estimating different conditional quantile functions should allow this kind of effect to be discriminated. The aim of this paper is to propose an index based on quantile regression estimates for ranking portfolios according to the level of constituent turnover.",
    "year": 2010,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "97f030552a91083c50f00bf498efb7ab",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T00:52:33.837562"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文主要研究基于分位数回归的指数，用于根据成分股周转率对金融投资组合进行排名，这直接涉及投资组合的分析和管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文主要研究基于分位数回归的指数，用于根据成分股周转率对金融投资组合进行排名，这直接涉及投资组合的分析和管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:23:54.999866"
}