{
  "paper": {
    "id": 190,
    "title": "Cyber risk definition and classification for financial risk management",
    "abstract": "Cyber risk is undeniably one of the most critical emerging risks to the financial industry. However, even though cyber risk is recognized as a significant threat to financial institutions and, more generally, to financial stability, the lack of proper data on cyber risk losses impedes efforts to effectively measure and manage this risk. This paper aims to address this gap by providing a cyber risk definition and classification scheme for risk management purposes, to be used as a data collection template for financial institutions. As such, the proposed scheme would ensure that the adopting institutions utilize common language and would allow consistent data collection and sharing. We provide a deeper dive into the reasoning behind the variables we propose to collect and demonstrate how some of the existing cyber security events map into our proposed scheme.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "2e1296cdf08099d811bd5fb8b7a8be93",
    "relevant_keywords": [
      "classification"
    ],
    "stage1_timestamp": "2025-05-15T01:47:53.016754"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on defining and classifying cyber risk for the purpose of financial risk management, aiming to provide a data collection template for financial institutions to measure and manage cyber risk effectively.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on defining and classifying cyber risk for the purpose of financial risk management, aiming to provide a data collection template for financial institutions to measure and manage cyber risk effectively.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:00:20.724883"
}