{
  "paper": {
    "id": 4218,
    "title": "Social media and family investment behavior",
    "abstract": "This study delves into the intricate connections between family investment habits and social media. Through an analysis of social media use patterns, information exposure, family financial literacy, and the impact of social media on investment decisions, this research aims to shed light on the intricacies that characterize contemporary family investment plans. Using regression models to examine data from 75 countries between 2000 and 2022, this research aims to illuminate how social media users see financial risks and the relationship between exposure and risk tolerance. Furthermore, the study examines how social media plays a part in long-term budgeting, specifically whether families use it to set investment targets. This research also looks at how people in a family use technology and how social media affects people's openness to new financial tools. Additionally, it investigates the effects, both good and bad, of social media on family conversations on money and investing. The thorough examination of these factors in this research sheds light on how family investing habits have evolved in the digital era. The findings of this study reveal the impact of internet media on family financial dynamic cycles, which is of great importance to scholars, professionals, and lawmakers.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "28fdd7d00fe665ec08925bc4faae980a",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:34:48.878167"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究社交媒体对家庭投资行为的影响，涉及投资决策、风险感知和家庭财务动态，但并未明确指出其核心技术应用于衍生品定价、金融风险管理或投资组合管理等特定金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究社交媒体对家庭投资行为的影响，涉及投资决策、风险感知和家庭财务动态，但并未明确指出其核心技术应用于衍生品定价、金融风险管理或投资组合管理等特定金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:33:52.135014"
}