{
  "paper": {
    "id": 2687,
    "title": "In silico design and automated learning to boost next-generation smart biomanufacturing",
    "abstract": "The increasing demand for bio-based compounds produced from waste or sustainable sources is driving biofoundries to deliver a new generation of prototyping biomanufacturing platforms. Integration and automation of the design, build, test and learn (DBTL) steps in centers like SYNBIOCHEM in Manchester and across the globe (Global Biofoundries Alliance) are helping to reduce the delivery time from initial strain screening and prototyping towards industrial production. Notably, a portfolio of producer strains for a suite of material monomers was recently developed, some approaching industrial titers, in a tour de force by the Manchester Centre that was achieved in less than 90 days. New in silico design tools are providing significant contributions to the front end of the DBTL pipelines. At the same time, the far-reaching initiatives of modern biofoundries are generating a large amount of high-dimensional data and knowledge that can be integrated through automated learning to expedite the DBTL cycle. In this Perspective, the new design tools and the role of the learning component as an enabling technology for the next generation of automated biofoundries are discussed. Future biofoundries will operate under completely automated DBTL cycles driven by in silico optimal experimental planning, full biomanufacturing devices connectivity, virtualization platforms and cloud-based design. The automated generation of robotic build worklists and the integration of machine-learning algorithms will collectively allow high levels of adaptability and rapid design changes toward fully automated smart biomanufacturing.",
    "year": 2020,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "5c77d6f4e207b89373d01abc146c32a0",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "representation learning",
      "autoencoder",
      "denoising autoencoder"
    ],
    "stage1_timestamp": "2025-05-15T01:09:14.990143"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要讨论的是生物制造领域中的计算机辅助设计和自动化学习技术，并未涉及任何金融领域的具体应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要讨论的是生物制造领域中的计算机辅助设计和自动化学习技术，并未涉及任何金融领域的具体应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:13:16.908022"
}