{
  "paper": {
    "id": 2271,
    "title": "Predictive models to assess risk of extended length of stay in adults with spinal deformity and lumbar degenerative pathology: development and internal validation",
    "abstract": "BACKGROUND CONTEXT: Postoperative recovery after adult spinal deformity (ASD) opera-tions is arduous, fraught with complications, and often requires extended hospital stays. A need exists for a method to rapidly predict patients at risk for extended length of stay (eLOS) in the pre-operative setting.PURPOSE: To develop a machine learning model to preoperatively estimate the likelihood of eLOS following elective multi-level lumbar/thoracolumbar spinal instrumented fusions (>= 3 seg-ments) for ASD.STUDY DESIGN/SETTING: Retrospectively from a state-level inpatient database hosted by the Health care cost and Utilization Project. PATIENT SAMPLE: Of 8,866 patients of age >= 50 with ASD undergoing elective lumbar or thor-acolumbar multilevel instrumented fusions. OUTCOME MEASURES: The primary outcome was eLOS (>7 days). METHODS: Predictive variables consisted of demographics, comorbidities, and operative infor-mation. Significant variables from univariate and multivariate analyses were used to develop a logistic regression-based predictive model that use six predictors. Model accuracy was assessed through area under the curve (AUC), sensitivity, and specificity.RESULTS: Of 8,866 patients met inclusion criteria. A saturated logistic model with all significant variables from multivariate analysis was developed (AUC=0.77), followed by generation of a sim-plified logistic model through stepwise logistic regression (AUC=0.76). Peak AUC was reached with inclusion of six selected predictors (combined anterior and posterior approach, surgery to both lumbar and thoracic regions, >= 8 level fusion, malnutrition, congestive heart failure, and academic institution). A cutoff of 0.18 for eLOS yielded a sensitivity of 77% and specificity of 68%.CONCLUSIONS: This predictive model can facilitate identification of adults at risk for eLOS fol-lowing elective multilevel lumbar/thoracolumbar spinal instrumented fusions for ASD. With a fair diagnostic accuracy, the predictive calculator will ideally enable clinicians to improve preoperative planning, guide patient expectations, enable optimization of modifiable risk factors, facilitate appropriate discharge planning, stratify financial risk, and accurately identify patients who may represent high-cost outliers. Future prospective studies that validate this risk assessment tool on external datasets would be valuable.(c) 2022 The Author(s). Published by Elsevier Inc. This is an open access article under the CC BY license (http://creativecommons.org/licenses/by/4.0/)",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "c61a0043b9c80eb9a563646816367efa",
    "relevant_keywords": [
      "machine learning",
      "classification",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:13:31.756322"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是医疗领域中的术后恢复预测模型，用于预测脊柱畸形手术后患者的住院时间延长风险，并未涉及任何金融领域的研究或应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是医疗领域中的术后恢复预测模型，用于预测脊柱畸形手术后患者的住院时间延长风险，并未涉及任何金融领域的研究或应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:43:21.254482"
}