{
  "paper": {
    "id": 4185,
    "title": "EARLY IDENTIFICATION OF FIRST YEAR STUDENTS IN NEED OF ACADEMIC SUPPORT",
    "abstract": "Financial Accounting 188 is a compulsory first-year module for all BComm degrees at Stellenbosch University, South Africa, with an annual average of 1 300 students. The throughput rate of traditionally below 75% is a cause for concern at both a departmental and institutional level, which prompted an investigation into student success in the module. This paper presents the results of the process of establishing a profile of successful and at-risk students in this particular module. A two-step process was followed to achieve the goals of the study. Firstly, the significance of a number of factors influencing students' ability to succeed was statistically tested (by employing univariate techniques) to determine the possible correlation between specific factors and students' success. For all the categorical factors, two-way cross-tabulation tables were prepared. Univariate logistic regressions were done on the ordinal factors. Furthermore, receiver operating characteristic (ROC) analyses were done to describe the contribution of the factors in predicting success in the module. The most important factors in determining success of students in the module include average Grade 12 mark, whether students had Accounting as a subject at secondary school, class attendance, home language (Afrikaans or English), and the programme within which students were enrolled. In the second step of the research, the simultaneous effect of all these factors was determined by means of a multivariate technique, CART (classification and regression tree), to derive a profile of successful and at-risk students. An at-risk Financial Accounting 188 student profile in the study cohort was a student: with an average Grade 12 mark below 74.15% and no prior background in Accounting; who attended less than 51% of classes; whose home language is English; and who enrolled for a BComm general degree. The results of this study can be used at faculty level by considering entrance requirements for BComm degrees or, alternatively, at institutional level in determining language policy. At micro-level, the results will be used to provide interventions in Financial Accounting 188 itself, to address specific risk areas. Students will be stratified in the first week of classes. Focused mentor groups and tutorials will be provided for students below the cut-off points as identified above. In this manner irrelevant and time-consuming efforts on interventions and actions which might be worthless in the pursuit of student success in the module can be avoided. The results provide insight into the significantly predictive factors that may influence first-year students' success within the particular module. This insight may facilitate a more learner-centred ethos through the development of student support systems and teaching practices based on an empirically founded notion of student success. The results are not generalisable beyond the module, but are significant in informing similar studies in other modules.",
    "year": 2010,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "835e27f1115541468ce49a2889985dba",
    "relevant_keywords": [
      "classification",
      "regression",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T02:34:13.425883"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是教育领域中如何识别需要学术支持的一年级学生，使用了统计和机器学习技术（如CART）来分析影响学生成功的因素。虽然论文中提到了金融会计课程，但其核心应用场景是教育管理而非金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是教育领域中如何识别需要学术支持的一年级学生，使用了统计和机器学习技术（如CART）来分析影响学生成功的因素。虽然论文中提到了金融会计课程，但其核心应用场景是教育管理而非金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:33:53.078359"
}