{
  "paper": {
    "id": 411,
    "title": "New tool for stock investment risk management Trend forecasting based on individual investor behavior",
    "abstract": "Purpose The purpose of this paper is to propose a new tool for stock investment risk management through studying stocks with what kind of characteristics can be predicted by individual investor behavior. Design/methodology/approach Based on comment data of individual stock from the Snowball, a thermal optimal path method is employed to analyze the lead-lag relationship between investor attention (IA) and the stock price. And machine learning algorithms, including SVM and BP neural network, are used to predict the prices of certain kind of stock. Findings It turns out that the lead-lag relationships between IA and the stock price change dynamically. Forecasting based on investor behavior is more accurate only when the IA of the stock is stably leading its price change most of the time. Originality/value This paper is one of the first few research works that introduce individual investor data into portfolio risk management. The new tool put forward in this study can capture the dynamic interplay between IA and stock price change, which help investors identify and control the risk of their portfolios.",
    "year": 2020,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "dd2193ada533e3fc68824882eaa5c7f9",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "support vector machine",
      "SVM",
      "neural network",
      "backpropagation",
      "BP"
    ],
    "stage1_timestamp": "2025-05-15T00:43:10.523997"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk",
      "Portfolio Management"
    ],
    "justification": "该论文的主要目的是提出一种新的股票投资风险管理工具，通过分析个体投资者行为来预测股票价格变化，从而帮助投资者识别和控制投资组合的风险。这直接涉及金融风险管理和投资组合管理两个领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\", \"投资组合管理\"],\n  \"justification\": \"该论文的主要目的是提出一种新的股票投资风险管理工具，通过分析个体投资者行为来预测股票价格变化，从而帮助投资者识别和控制投资组合的风险。这直接涉及金融风险管理和投资组合管理两个领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:31:09.596792"
}