{
  "paper": {
    "id": 2535,
    "title": "Selecting and Weighting Mechanisms in Stock Portfolio Design Based on Clustering Algorithm and Price Movement Analysis",
    "abstract": "The fundamental stages in designing a stock portfolio are each stock's selection and capital weighting. Selection and weighting must be conducted through diversification and price movement analysis to maximize profits and minimize losses. The problem is how the technical implementations of both are carried out. Based on this problem, this study aims to design these selection and weighting mechanisms. Stock selection is based on clusters and price movement trends. The optimal stock clusters are formed using the K-Means algorithm, and price movement analyses are carried out using the moving average indicator. The selected stocks are those whose prices have increasing trends with the most significant Sharpe ratio in each cluster. Then, the capital weighting for each preferred stock is carried out using the mean-variance model with transaction cost and income tax. After designing the mechanism, it is applied to Indonesia's 80 index stock data. In addition, a comparison is conducted between the estimated portfolio return and the actual one day ahead. Finally, the sensitivity of investors' courage in taking risks to their profits and losses is also analyzed. This research is expected to assist investors in diversification and price movement analysis of the stocks in the portfolios they form.",
    "year": 2023,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "53d98abe4e111a3ece159cbfba6c70c9",
    "relevant_keywords": [
      "unsupervised learning",
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T01:07:35.786499"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是使用聚类算法和价格趋势分析来选择股票并进行资本加权，旨在优化投资组合的设计和管理，这直接属于投资组合管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Portfolio Management\"],\n  \"justification\": \"该论文的核心技术是使用聚类算法和价格趋势分析来选择股票并进行资本加权，旨在优化投资组合的设计和管理，这直接属于投资组合管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:14:06.606855"
}