{
  "paper": {
    "id": 2665,
    "title": "Patterns of persistence among engineering students at a South African university: A decision tree analysis",
    "abstract": "Globally, there is growing concern about student progression in most higher education institutions. In this study, we examined patterns of persistence among students who began their engineering degree at the University of KwaZulu-Natal (UKZN) in 2012 and 2013. The sample was restricted to 1370 incoming students who were tracked to 2019, allowing for a 7-year graduation period for the initial cohort. The data were analysed using descriptive statistics as well as the decision tree approach - a highly visual data-mining technique which helps identify subgroups and relationships that are often difficult to detect through traditional statistical methods. The results from these analyses indicate that up to 50% of students enrolled in the School of Engineering had chosen engineering as their first choice. Approximately 40% had persisted in engineering, 50% had withdrawn by the time of this survey, while the remaining 10% were still registered in the engineering programme. Departure from engineering occurs most in the first year, while graduation most likely occurs after 5 years of registration. Student persistence in engineering can also be classified based on first-year accumulated credits, admission point scores, race, and financial aid, of which first-year accumulated credits is the most critical factor. Overall, our study suggests that understanding failure in the first year might be the missing link in our understanding of student persistence in engineering. Significance: The study makes several contributions to the field. First, the issue of student persistence is of concern to higher education institutions, not only in South Africa but globally. For institutions to improve student outcomes, they need to understand the reasons behind attrition. Second, in our analysis, we separate students who withdraw from the university and those who switch to other programmes within the same university. Most studies on student progression treat withdrawing students as a single population, which might lead to inaccurate prediction of student outcomes. Third, we draw on data-mining methods and present an interesting way of classifying students using both enrolment data as well as the rules derived from each node of the classification tree. The classification tree analysis method is highly visual and helps identify subgroups and relationships, which might be difficult to detect through traditional statistical methods. The information derived from the classification trees can be used to identify students who might be at risk of failing timeously and come up with interventions that will support them.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "be0542edcceb940c064970ea40cd654a",
    "relevant_keywords": [
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T02:18:06.124783"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究工程学生的持续学习模式，使用决策树分析方法来识别影响学生坚持工程学位的因素。虽然使用了决策树这一技术，但论文的研究内容和应用场景与衍生品定价、金融风险管理或投资组合管理无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究工程学生的持续学习模式，使用决策树分析方法来识别影响学生坚持工程学位的因素。虽然使用了决策树这一技术，但论文的研究内容和应用场景与衍生品定价、金融风险管理或投资组合管理无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:40:40.302103"
}