{
  "paper": {
    "id": 324,
    "title": "Smart Financial Investor's Risk Prediction System Using Mobile Edge Computing",
    "abstract": "The financial system has reached its pinnacle because of economic and social growth, which has propelled the financial sector into another era. Public and corporate financial investment operations have significantly risen in this climate, and they now play a significant part in and impact the efficient use of market money. This finance sector will be affected by high-risk occurrences because of the cohabitation of dangers and passions, which will cause order to become unstable and definite financial losses. An organization's operational risk is a significant barrier to its growth. A bit of negligence could cause the business's standing to erode rapidly. Increasing funding management and forecasting risks is essential for the successful development of companies, enhancing their competitiveness in the marketplace and minimizing negative effects. As a result, this study takes the idea of mobile edge computing. It creates an intelligent system that can forecast different risks throughout the financial investment process based on the operational knowledge of important investment platforms. The CNN-LSTM approach, based on knowledge graphs, is then used to forecast financial risks. The results are then thoroughly examined through tests, demonstrating that the methodology can accurately estimate the risk associated with financial investments. Finally, a plan for improving the system for predicting financial risk is put out.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "deep learning",
    "cache_key": "9769d3d4808ba98945bb02e32e42c191",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "neural network",
      "convolutional neural network",
      "CNN",
      "long short-term memory",
      "LSTM",
      "representation learning"
    ],
    "stage1_timestamp": "2025-05-15T01:36:59.756790"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on developing an intelligent system to forecast different risks in the financial investment process using CNN-LSTM approach, which is directly related to financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on developing an intelligent system to forecast different risks in the financial investment process using CNN-LSTM approach, which is directly related to financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:03:42.075553"
}