{
  "paper": {
    "id": 489,
    "title": "An online portfolio strategy based on trend promote price tracing ensemble learning algorithm",
    "abstract": "How to carry out an investment portfolio efficiently and reasonably has become a hot issue. This study mainly addresses the problem of the instability of forecasting stock price investment and the difficulty in determining investment proportion by proposing the trend peak price tracing (TPPT). First of all, because of the influence of stock price anomaly, TPPT strategy sets adjustable historical window width. It uses slope value to judge prediction direction to track price change, which uses exponential moving average and peak equal weight slope value three-state price prediction method. Secondly, the accumulated wealth target is refined, and the fast error Back Propagation based on gradient projection algorithm (BP) is added. The algorithm solves investment proportion and feedbacks the increasing ability of assets to the investment proportion in order to maximize the accumulated wealth. Finally, comparison of eight empirical strategies in five typical data and statistical tests show that TPPT strategy has great advantages in balancing risk and return, and it is a robust and effective online portfolio strategy. (c) 2021 Elsevier B.V. All rights reserved.",
    "year": 2022,
    "source": "WOS",
    "area": "portfolio",
    "method": "deep learning",
    "cache_key": "a16661135f1d233698454d1242434341",
    "relevant_keywords": [
      "neural network",
      "backpropagation",
      "BP"
    ],
    "stage1_timestamp": "2025-05-15T00:36:26.602857"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是提出一种在线投资组合策略（TPPT），旨在解决股票价格预测的不稳定性和投资比例确定的问题，并通过实证策略比较验证其在平衡风险和回报方面的优势。这直接属于投资组合管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是提出一种在线投资组合策略（TPPT），旨在解决股票价格预测的不稳定性和投资比例确定的问题，并通过实证策略比较验证其在平衡风险和回报方面的优势。这直接属于投资组合管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:34:56.201259"
}