{
  "paper": {
    "id": 628,
    "title": "Machine Learning for Real Estate Time Series Prediction",
    "abstract": "Several researchers have demonstrated that real estate investments have improved the risk-adjusted performance of mixed-asset portfolios belonging to institutional investors. In order for these portfolio strategies to be more effective, one could use price predictions (instead of historical data) to optimize weights. The goal of this paper is to investigate the predictive performance on price time series of REITs (real estate investment trusts), stocks and bonds, of five different machine learning (ML) algorithms. These algorithms are: linear regression; support vector regression; gradient boosting; long short-term memory neural networks; and k-nearest neighbour. We run experiments on 90 datasets and compare the ML results to those of an ARIMA model, which is a popular econometric benchmark used in financial time series predictions. Our results show that machine learning algorithms statistically outperform ARIMA. In addition, we find that all machine learning algorithms are able to produce very low root mean square errors, with linear regression and long short-term memory obtaining the lowest error values.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "6430a8faab99a5a303e20a13ef673bee",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "regression",
      "support vector machine",
      "SVM",
      "neural network",
      "deep learning",
      "long short-term memory",
      "LSTM"
    ],
    "stage1_timestamp": "2025-05-15T01:53:24.799515"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文研究了使用机器学习算法预测房地产投资信托（REITs）、股票和债券的价格时间序列，目的是为了优化混合资产组合的权重，这直接关联到投资组合管理的领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文研究了使用机器学习算法预测房地产投资信托（REITs）、股票和债券的价格时间序列，目的是为了优化混合资产组合的权重，这直接关联到投资组合管理的领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:56:17.339033"
}