{
  "paper": {
    "id": 1456,
    "title": "Seemingly manipulated anomaly: Evidence from corporate site visits",
    "abstract": "We find that the stock prices of some firms are suspected to be manipulated by the market in the CSV disclosure event scenario. An anomaly in the daily cumulative abnormal returns (CARs) of these suspicious CSVs is documented. Around the suspicious CSVs, the CAR trending upward (downward) one month before the event day, temporarily declining (increasing) on the event day, and then trending upward (downward) one year after the event day. We refer to this seemingly manipulated anomaly as the CSV manipulative effect. Based on a unique data set of CSVs to listed firms in China, we obtain the following main findings. First, the CSV manipulative effect is not caused by other company announcements disclosed around the CSV event date, and the probability of manipulative effect brought by CSVs is significantly greater than that brought by other company announcements. Second, factors related to market manipulation significantly affect the CSV manipulative effect. Third, we construct a machine learning model to detect the CSV manipulative effect and find that it is capable of detecting this effect. Fourth, the portfolio constructed by the CSV manipulative effect performs better than the portfolio constructed by the momentum or reversal effect.",
    "year": 2024,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "a190ee25aaea7d1d346ccd50ed859a85",
    "relevant_keywords": [
      "machine learning",
      "classification"
    ],
    "stage1_timestamp": "2025-05-15T00:56:08.289469"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文研究了公司现场访问（CSV）事件中的股票价格异常现象，并构建了一个机器学习模型来检测这种异常效应。此外，论文还提到基于这种异常效应构建的投资组合表现优于基于动量或反转效应构建的投资组合。这表明论文的核心技术主要应用于投资组合管理领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文研究了公司现场访问（CSV）事件中的股票价格异常现象，并构建了一个机器学习模型来检测这种异常效应。此外，论文还提到基于这种异常效应构建的投资组合表现优于基于动量或反转效应构建的投资组合。这表明论文的核心技术主要应用于投资组合管理领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:21:03.117583"
}