{
  "paper": {
    "id": 945,
    "title": "Research on Credit Risk Evaluation Model Based on LVQ Neural Network",
    "abstract": "In this paper, we have established one credit risk evaluation model based on Learning Vector Quantization respectively. This model is used to identify two patterns samples of Chinese listed companies, including training samples of 285 listed companies (59 companies with special treatment and 226 normal companies) and test samples of 117 listed companies(29 companies with special treatment and 88 normal companies). The two patterns indicate that the listed companies are divided into two groups in terms of their business conditions: credit default group (ST and *ST listed companies) and credit non-default group (normal listed companies). 4 main financial indexes are considered: earning per share, net asset per share, return on equity, cash flow per share. The simulating results showed that, after 20 training steps, LVQ neural network becomes steady after 300 training epochs and the overall discriminant accuracy rate is 92.79%. Therefore this indicates that the credit risk evaluation model based on Learning Vector Quantization neural network is able to result in good classification and has research value to the reality.",
    "year": 2008,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "56f525f88c6818fe50219888f874b095",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "neural network",
      "Learning Vector Quantization",
      "LVQ"
    ],
    "stage1_timestamp": "2025-05-15T01:56:49.676883"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on developing a credit risk evaluation model using LVQ neural network to classify listed companies into credit default and non-default groups, which is a direct application in financial risk management, specifically in credit risk assessment.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on developing a credit risk evaluation model using LVQ neural network to classify listed companies into credit default and non-default groups, which is a direct application in financial risk management, specifically in credit risk assessment.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:53:08.246227"
}