{
  "paper": {
    "id": 177,
    "title": "A Prototype Decision Support System for Residential Property Valuation",
    "abstract": "Property valuation is crucial to real estate developers, financial institutions and buyers as it could help determine the financial viability, eliminate the risk of borrowing, and establish a fair value of a real estate scheme respectively. Traditional methods for property valuation fall short of accuracy, as it is difficult to identify a set of variables and account for these factors when conducting property valuation. Advanced mathematical algorithms like Artificial Neural Network (ANN) and Support Vector Machine (SVM) may open up new ways to improve the valuation accuracy. This research aims to present an overview of potential suitability of SVM technique for property valuation. It is proceeded by identifying the key variables which could affect the property price with the application of entropy method. Then based on the key variables, the predictive ability of SVM is compared with MRA and ANN outcomes. The results obtained from practical case studies in Hong Kong and mainland China indicate that, with the optimal values of the parameters gamma and epsilon, SVM serves better function for the property valuation. Hence a SVM and entropy based decision support system is proposed.",
    "year": 2008,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "fec40d2e2286a0b737c0fb1b75cc6715",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "regression",
      "support vector machine",
      "SVM",
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T01:47:52.982785"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是住宅物业估值的决策支持系统，虽然涉及金融相关领域（如房地产金融），但其核心技术（SVM和熵方法）并未直接应用于衍生品定价、金融风险管理或投资组合管理等特定金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是住宅物业估值的决策支持系统，虽然涉及金融相关领域（如房地产金融），但其核心技术（SVM和熵方法）并未直接应用于衍生品定价、金融风险管理或投资组合管理等特定金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:00:22.559551"
}