{
  "paper": {
    "id": 405,
    "title": "A hybrid machine learning framework by incorporating categorical boosting and manifold learning for financial analysis",
    "abstract": "The financial analysis is essential to evaluate and assess the financial behavior and risk during the financial activities. However, it is challenging to implement the financial analysis due to the complexity of financial features and their interaction mechanism. This study developed a hybrid machine-learning framework incorporating categorical boosting (CatBoost) and manifold learning for financial analysis. CatBoost was employed to capture the financial mechanism and characterize the complex and nonlinear relationship between the financial feature and the associated financial behavior. Manifold learning was utilized to select and extract the critical financial features. The developed framework was verified and illustrated by the synthetic datasets, which are based on the financial model for the loan evaluation. The overall accuracy of the CatBoost model increased from 81.5 % to 99.1 %, and the accuracy for predicting unapproved loans increased from 64 % to 98.88 %. The developed framework significantly improves the prediction accuracy of loan-approved status and characterizes the financial behavior and mechanism well. The developed hybrid framework distinguishes between various financial features and the associated loan-approved status. Based on the developed framework, it also found that credit score and annual income are the two essential features, and the contribution of other features is almost negligible. The developed framework revealed that a credit score of 500 and an annual income of 70,000 are critical thresholds for loan approval, as set by the financial analysis model used to generate the dataset. The results show that the developed framework could extract the financial features and capture the financial mechanism during the financial analysis. It provides a scientific, reasonable, and promising approach to financial analysis and understanding financial behavior.",
    "year": 2025,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "5f94831d626d3a2000c769c12d2fdfbd",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "manifold learning",
      "feature learning"
    ],
    "stage1_timestamp": "2025-05-15T01:50:14.127983"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文开发了一种混合机器学习框架，用于贷款评估中的金融行为分析和风险预测，这属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文开发了一种混合机器学习框架，用于贷款评估中的金融行为分析和风险预测，这属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:58:25.351966"
}