{
  "paper": {
    "id": 392,
    "title": "Long-term forecasting in asset pricing: Machine learning models' sensitivity to macroeconomic shifts and firm-specific factors",
    "abstract": "This study investigates the long-term forecasting capabilities of five prominent machine learning models-decision tree, random forest, gradient boosted regression trees, support vector machines, and neural networks-within the domain of asset pricing. Applying these models to S&P 500 constituent stocks from 2000 to 2023, we examine their predictive performance over extended horizons. Our findings indicate that Gradient Boosting and Random Forest models stand out for their superior performance, though their predictive accuracy exhibits sensitivity to the prevailing economic stability. Furthermore, these models show enhanced effectiveness in forecasting returns for larger companies, with their performance demonstrating significant variation across different industry sectors. A notable decline in accuracy with the increase in forecasting horizons underscores the challenges inherent in long-term financial prediction. Our results highlight the substantial impact of macroeconomic factors, particularly Consumer Sentiment and Net Exports, whose influences fluctuate over time. Practically, machine learning models, especially Gradient Boosting and Random Forest, are shown to consistently surpass the benchmark S&P 500 index in portfolio construction scenarios. We show the importance of economic stability, firm size, and industry sector context, providing novel insights for the strategic application of machine learning in asset pricing and the formulation of investment strategies suited to diverse market conditions.",
    "year": 2025,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "ed9c06b769689bda651553c2e95d95c7",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "regression",
      "support vector machine",
      "SVM",
      "decision tree",
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T00:43:10.463842"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文主要研究机器学习模型在资产定价中的长期预测能力，并特别提到这些模型在构建投资组合时表现优于基准指数，这直接关联到投资组合管理的领域。论文未提及衍生品定价或金融风险管理的具体应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文主要研究机器学习模型在资产定价中的长期预测能力，并特别提到这些模型在构建投资组合时表现优于基准指数，这直接关联到投资组合管理的领域。论文未提及衍生品定价或金融风险管理的具体应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:31:13.275803"
}