{
  "paper": {
    "id": 1042,
    "title": "A Machine Learning-Based Analysis on the Causality of Financial Stress in Banking Institutions",
    "abstract": "In this paper, we applied machine learning techniques to analyze the default probability in financial institutions using a large dataset of variables collected from 2325 banks over 17 years, extracting the most relevant variables using a feature selection method, predicting default and systemic risk, and finally investigating the contributions of each relevant feature to the overall financial stress of banking institutions using explainable artificial intelligence techniques. We found that the most important variables for the default risk prediction include the bailout probability, the market share in terms of assets, and the market-to-book ratio, highlighting the relevance of issues like moral hazard and market leverage. On the other hand, for systemic risk prediction, the number of banks in the country and interest rates level are among the most relevant features, indicating that markets with more competition fare better against systemic risks. The findings of this research provide an empirical assessment of the main factors that explain the presence of financial stress in banking institutions, conciliating the versatility of machine learning models with practical interpretability and causal inference, being of potential interest to researchers in quantitative finance and market practitioners.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "d1935c475dfa0ad62f70ace3dc9bc3a1",
    "relevant_keywords": [
      "machine learning",
      "feature learning",
      "feature representation",
      "classification",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:58:08.533502"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on analyzing default probability and systemic risk in banking institutions using machine learning techniques, which are core aspects of financial risk management. The study aims to identify key variables contributing to financial stress, a primary concern in risk assessment and mitigation.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on analyzing default probability and systemic risk in banking institutions using machine learning techniques, which are core aspects of financial risk management. The study aims to identify key variables contributing to financial stress, a primary concern in risk assessment and mitigation.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:52:22.038162"
}