{
  "paper": {
    "id": 1147,
    "title": "A Novel Model for Stock Portfolio Based on ARX, RS and a New Grey Relational Grade Theories",
    "abstract": "In this study, the new grey relational grade (GRG) method is combined with moving Average Autoregressive Exogenous (ARX) prediction model, GM(1,N) theory and Rough Set (RS) theory to create an automatic stock market forecasting and portfolio selection mechanism. In the proposed approach, financial data are collected automatically every quarter and are input to an ARX prediction model to forecast the future trends of the collected data over the next quarter or half-year period. The forecast data is then reduced using a GM(I,N) model, clustered using a K-means clustering algorithm and then supplied to a RS classification module which selects appropriate investment stocks by applying a set of decision-making rules. Finally, a new grey relational analysis technique is employed to specify an appropriate weighting of the selected stocks such that the portfolio's rate of return is maximized. The validity of the proposed approach is demonstrated using electronic stock data extracted from the financial database maintained by the Taiwan Economic Journal (TEJ). It is found that the proposed method yields an average annual rate of return, 25.91%, on the selected stocks from 2004 to 2006 in Taiwan stock market.",
    "year": 2008,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "d758890444d7907b8841030cb1e6a18f",
    "relevant_keywords": [
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T00:52:33.802398"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是结合多种预测和分类方法（如ARX预测模型、灰色关联度分析、粗糙集理论）来选择和优化股票投资组合，以最大化投资回报率。这直接属于投资组合管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是结合多种预测和分类方法（如ARX预测模型、灰色关联度分析、粗糙集理论）来选择和优化股票投资组合，以最大化投资回报率。这直接属于投资组合管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:23:56.627807"
}