{
  "paper": {
    "id": 5479,
    "title": "Corporate Bankruptcy Prediction: Evidence from Wholesale Companies in the Western European Countries",
    "abstract": "The aim of this paper was to develop a model that can forecast the bankruptcy of the companies using logistic regression model. The sample consists of 23 bankrupts and 30 healthy companies selected from the initial sample of all large active companies (1740 companies). The companies operate in the trade industry, sector wholesale in Western Europe, in the time period from 2010 to 2018. The logit model was based on the choice between 23 financial indicators. The obtained results with high accuracy showed that the most important bankruptcy predictors were the following five indicators: return on equity, current assets/ total assets, solvency, working capital turnover, stocks/current assets. The developed model provides an opportunity for all external stakeholders to easily identify companies that are facing the risk of bankruptcy. The possibility of the company's bankruptcy prediction, the assessment of risk and threatened circumstances to continue business is crucial information for making all future business decisions with the company.",
    "year": 2020,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "a49bbfe636d023564a782087b3940aa9",
    "relevant_keywords": [
      "classification",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:48:23.646836"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on developing a model to predict corporate bankruptcy, which is a key aspect of financial risk management. The study aims to assess the risk of bankruptcy and provide crucial information for stakeholders to make informed business decisions, aligning with the objectives of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on developing a model to predict corporate bankruptcy, which is a key aspect of financial risk management. The study aims to assess the risk of bankruptcy and provide crucial information for stakeholders to make informed business decisions, aligning with the objectives of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:30:03.983763"
}