{
  "paper": {
    "id": 1446,
    "title": "THE EFFECT OF AI-ENABLED CREDIT SCORING ON FINANCIAL INCLUSION: EVIDENCE FROM AN UNDERSERVED POPULATION OF OVER ONE MILLION",
    "abstract": "We studied the effect of a major bank adopting an AI-enabled credit scoring model on financial inclusion as measured by changes to the approval rate, default rate, and utilization level of a personal loan product for an underserved population. The bank serves over 50 million customers and previously used a traditional rule-based model to evaluate the default risk of each loan application. It recently developed an AI model with a higher prediction accuracy of default risk and used the AI model and the traditional model together to assess loan applications for one of its personal loan products. Although the AI model may be more accurate in estimating default risk, little is known about its impact on financial inclusion. We investigated this question using a difference- in-differences approach by comparing changes in financial inclusion of the personal loan product that adopted the AI model to that of a similar personal loan product that did not adopt the AI model. We found that the AI model enhanced financial inclusion for the underserved population by simultaneously increasing the approval rate and reducing the default rate. Further analysis attributed the enhancement in financial inclusion to the use of weak signals (i.e., data not conventionally used to evaluate creditworthiness) by the AI model and its sophisticated machine learning algorithms. Our findings are consistent with statistical discrimination theory, as the use of weak signals and sophisticated machine learning algorithms improves prediction accuracy at the individual level, thus reducing the reliance on group characteristics that often lead to financial exclusion. We elaborated on the development process of the AI model to illustrate how and why the AI model can better evaluate members of underserved populations. We also found the impacts of the AI model to be heterogeneous across subgroups, and those with missing weak signals saw smaller improvements in the approval rate. A simulation- based analysis showed that simplified AI models were also able to increase the approval rate and reduce the default rate for this population. Our findings provide rich theoretical and practical implications for social justice by documenting how an AI model designed for improving prediction accuracy can enhance financial inclusion.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "ef6eca5c632c890434142b7d6b6df82b",
    "relevant_keywords": [
      "machine learning",
      "classification",
      "feature learning",
      "feature representation",
      "neural network",
      "deep learning",
      "representation learning"
    ],
    "stage1_timestamp": "2025-05-15T02:03:00.768327"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用AI模型进行信用评分，旨在更准确地预测贷款违约风险，这直接涉及金融风险管理中的信用风险评估。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是使用AI模型进行信用评分，旨在更准确地预测贷款违约风险，这直接涉及金融风险管理中的信用风险评估。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:49:02.228794"
}