{
  "paper": {
    "id": 2586,
    "title": "Rule-Based Classification Based on Ant Colony Optimization: A Comprehensive Review",
    "abstract": "The Ant Colony Optimization (ACO) algorithms have been well-studied by the Operations Research community for solving combinatorial optimization problems. A handful of researchers in the Data Science community have successfully implemented various ACO methodologies for rule-based classification. This family of ACO algorithms is referred to as AntMiner algorithms. Due to the flexibility of the framework, and the availability of alternative strategies at the modular level, a systematic review on the AntMiner algorithms can benefit the broader community of researchers and practitioners interested in highly interpretable classification techniques. In this paper, we provided a comprehensive review of each module of the AntMiner algorithms. Our motivation is to provide insight into the current practices and future research scope in the context of the rule-based classification. Our discussions address ACO methodologies, rule construction strategies, candidate selection metrics, rule quality evaluation functions, rule pruning strategies, methods to address continuous attributes, parameter selection, and experimental settings. This review also reports a summary of real-life implementations of the rule-based classifiers in diverse domains including medical, genetics, portfolio analysis, geographic information system (GIS), human-machine interaction (HMI), autonomous driving, ICT, quality, and reliability engineering. These implementations demonstrate the potential application domains that can be benefitted from the methodological contributions to the rule-based classification technique.",
    "year": 2022,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "ba4776d5a7d3d088acbe4fbe4561f972",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T01:08:10.974913"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要对基于蚁群优化的规则分类算法（AntMiner）进行了全面综述，并讨论了其在多个领域的应用，包括医疗、遗传学、地理信息系统等。虽然摘要中提到'portfolio analysis'（投资组合分析），但这只是众多应用领域中的一个例子，并非论文的主要研究方向。因此，该论文的核心技术并不主要应用于上述特定的金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要对基于蚁群优化的规则分类算法（AntMiner）进行了全面综述，并讨论了其在多个领域的应用，包括医疗、遗传学、地理信息系统等。虽然摘要中提到'portfolio analysis'（投资组合分析），但这只是众多应用领域中的一个例子，并非论文的主要研究方向。因此，该论文的核心技术并不主要应用于上述特定的金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:13:43.175145"
}