{
  "paper": {
    "id": 540,
    "title": "IMPROVING FRACTALS FINANCIAL CREDIT RISK EVALUATION BASED ON DEEP LEARNING TECHNIQUES AND BLOCKCHAIN-BASED ENCRYPTION",
    "abstract": "Predicting a client's affluence is essential in financial services. This task is the unity of the most important danger factors in groups and additional economic institutions. Typically, credit risk evaluation relies on black box models. However, these models often need to clarify the hidden information within the data. Moreover, few clear models focus on being easy to understand and accessible. This paper proposes a fractal credit risk assessment model that uses deep techniques like self-attention generative adversarial networks (SA-GAN) and deep multi-layer perceptron (DMLP). We use blockchain technology with the Brakerski-Gentry-Vaikuntanathan (BGV) encryption method to bolster safekeeping. Additionally, the scheme is designed for the Edge-of-things network, enabling communication through a LoRaWAN server. The proposed solution was tested on the German retail credit dataset. We assessed its performance using accuracy, F1 score, precision, and recall as metrics. Notably, our hybrid deep model, which combines SA-GAN with DMLP, achieved an impressive accuracy of 97.8% - outperforming existing methods in works.",
    "year": 2025,
    "source": "WOS",
    "area": "financial_risk",
    "method": "deep learning",
    "cache_key": "2a5657b91edac1c31a588a4ba934d273",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "neural network",
      "representation learning",
      "hidden layer",
      "attention mechanism"
    ],
    "stage1_timestamp": "2025-05-15T01:39:38.277114"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用深度学习和区块链技术进行信用风险评估，这直接属于金融风险管理中的信用风险管理范畴。论文明确提到信用风险评价是金融风险管理中的重要任务，并提出了具体的模型和方法来改进这一过程。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是使用深度学习和区块链技术进行信用风险评估，这直接属于金融风险管理中的信用风险管理范畴。论文明确提到信用风险评价是金融风险管理中的重要任务，并提出了具体的模型和方法来改进这一过程。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:02:49.485546"
}