{
  "paper": {
    "id": 3832,
    "title": "Mapping Sub-Metre 3D Land-Sea Coral Reefscapes Using Superspectral WorldView-3 Satellite Stereoimagery",
    "abstract": "Shallow coral reefs ensure a wide portfolio of ecosystem services, from fish provisioning to tourism, that support more than 500 million people worldwide. The protection and sustainable management of these pivotal ecosystems require fine-scale but large-extent mapping of their 3D composition. The sub-metre spaceborne imagery can neatly produce such an expected product using multispectral stereo-imagery. We built the first 3D land-sea coral reefscape mapping using the 0.3 m superspectral WorldView-3 stereo-imagery. An array of 13 land use/land cover and sea use/sea cover habitats were classified using sea-, ground- and air-truth data. The satellite-derived topography and bathymetry reached vertical accuracies of 1.11 and 0.89 m, respectively. The value added of the eight mid-infrared (MIR) channels specific to the WorldView-3 was quantified using the classification overall accuracy (OA). With no topobathymetry, the best combination included the eight-band optical (visible + near-infrared) and the MIR8, which boosted the basic blue-green-red OA by 9.58%. The classes that most benefited from this MIR information were the land use roof and land cover soil classes. The addition of the satellite-derived topobathymetry to the optical+MIR1 produced the best full combination, increasing the basic OA by 9.73%, and reinforcing the roof and soil distinction.",
    "year": 2021,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "77a22fabfb438a4559a165917b8d3da7",
    "relevant_keywords": [
      "classification"
    ],
    "stage1_timestamp": "2025-05-15T01:21:08.305515"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究利用卫星图像进行珊瑚礁3D测绘和分类，其核心技术应用于环境科学和遥感领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究利用卫星图像进行珊瑚礁3D测绘和分类，其核心技术应用于环境科学和遥感领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:08:46.967328"
}