{
  "paper": {
    "id": 3256,
    "title": "Enterprise Credit Risk Assessment Using Feature Selection Approach and Ensemble Learning Technique",
    "abstract": "Financial crisis happened in 2008 has inflicted heavy losses on the global economy and enterprise credit risk has caused extensive concern. There are all kinds of financial data in an enterprise. By using these data, credit risk models can be used to judge credit risk accurately. However, there are still many limitations in these models and the high dimension data brings about difficulties for modeling. Therefore, this paper puts forward a hybrid system based on feature selection approach and ensemble learning. The first experiment is the hybrid system HFES based on F-score and ensemble learning; and the second one is the hybrid system HGIES combines the Gini index and ensemble learning. Both experiments achieve good performance. The real data set consists of 160 listed companies with total 22 features. By using this data, our experiment indicates that the accuracy of classification is signifiantly raised by hybrid system HFES and HGIES. Meanwhile, they not only can be applied to credit risk assessment, but also can be put into use in more fields.",
    "year": 2020,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "a6116657593334645422f9f815e56efb",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "feature learning",
      "ensemble learning"
    ],
    "stage1_timestamp": "2025-05-15T02:24:05.259566"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用特征选择和集成学习方法来评估企业信用风险，这直接属于金融风险管理的范畴。论文明确提到信用风险模型的应用，并旨在提高分类准确性以更好地评估信用风险。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是使用特征选择和集成学习方法来评估企业信用风险，这直接属于金融风险管理的范畴。论文明确提到信用风险模型的应用，并旨在提高分类准确性以更好地评估信用风险。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:37:20.215447"
}