{
  "paper": {
    "id": 1434,
    "title": "Interpretable credit scoring based on an additive extreme gradient boosting",
    "abstract": "Credit scoring is a critical component of the financial ecosystem, driving lending decisions, risk assessment, and resource allocation. However, the inherent nonlinear and chaotic nature of creditworthiness poses a significant challenge for traditional credit scoring algorithms. Existing methods often struggle to balance predictive performance with interpretability, leading to a lack of transparency in the decision-making process and hindering their practical application. To address this issue, we propose Add-XGBoost, a novel additive ensemble model leveraging the strengths of Generalized Additive Models (GAM) and Extreme Gradient Boosting (XGBoost). Add-XGBoost enhances interpretability by employing an additive architecture wherein individual decision trees are trained for each feature, facilitating granular feature importance analysis and capturing nonlinear feature effects. Furthermore, Add-XGBoost incorporates second-order feature interactions within the additive framework, enabling a nuanced understanding of complex relationships within credit data. To further enhance robustness, a Lasso regression-based optimization method refines the weights assigned to individual feature functions (shape functions). Empirical evaluation across four diverse credit datasets demonstrates AddXGBoost's superior performance compared to existing statistical and machine learning-based credit scoring methods, including ensemble approaches. Crucially, Add-XGBoost excels in providing both global and local interpretability, offering valuable insights into feature interactions and their influence on credit risk. This makes Add-XGBoost a transformative tool, bridging the gap between high-performance credit scoring and transparent, comprehensible decision-making in the financial sector.",
    "year": 2025,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "eb4a9642d47e479ad15c2df3a4b27fb1",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "decision tree",
      "feature learning",
      "feature representation"
    ],
    "stage1_timestamp": "2025-05-15T02:03:00.676463"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是开发一种可解释的信用评分模型（Add-XGBoost），用于信用风险评估和贷款决策支持，这直接属于金融风险管理中的信用风险管理范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是开发一种可解释的信用评分模型（Add-XGBoost），用于信用风险评估和贷款决策支持，这直接属于金融风险管理中的信用风险管理范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:49:03.188361"
}