{
  "paper": {
    "id": 399,
    "title": "An Approach for Variable Selection and Prediction Model for Estimating the Risk-Based Capital (RBC) Based on Machine Learning Algorithms",
    "abstract": "The risk-based capital (RBC) ratio, an insurance company's financial soundness system, evaluates the capital adequacy needed to withstand unexpected losses. Therefore, continuous institutional improvement has been made to monitor the financial solvency of companies and protect consumers' rights, and improvement of solvency systems has been researched. The primary purpose of this study is to find a set of important predictors to estimate the RBC ratio of life insurance companies in a large number of variables (1891), which includes crucial finance and management indices collected from all Korean insurers quarterly under regulation for transparent management information. This study employs a combination of Machine learning techniques: Random Forest algorithms and the Bayesian Regulatory Neural Network (BRNN). The combination of Random Forest algorithms and BRNN predicts the next period's RBC ratio better than the conventional statistical method, which uses ordinary least-squares regression (OLS). As a result of the findings from Machine learning techniques, a set of important predictors is found within three categories: liabilities and expenses, other financial predictors, and predictors from business performance. The dataset of 23 companies with 1891 variables was used in this study from March 2008 to December 2018 with quarterly updates for each year.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "5ef36b34a6064d023a90827320ba598e",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "regression",
      "neural network",
      "deep learning",
      "backpropagation",
      "BP",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T01:50:14.099483"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用机器学习算法（随机森林和贝叶斯正则化神经网络）来预测保险公司的风险资本（RBC）比率，这是金融风险管理中的一个重要应用，旨在评估保险公司的资本充足性和财务稳健性。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是使用机器学习算法（随机森林和贝叶斯正则化神经网络）来预测保险公司的风险资本（RBC）比率，这是金融风险管理中的一个重要应用，旨在评估保险公司的资本充足性和财务稳健性。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:58:26.191849"
}