{
  "paper": {
    "id": 758,
    "title": "Research on Risk Warning of Financial Information System Based on Triangular Fuzzy Method and Support Vector Machine",
    "abstract": "It is well known that electronic bank whose development speed is so quick represents the future direction of bank industry. Although electronic bank can bring some convenient ways to us, it makes us have to face some realistic problems. In this paper, two aspects are demonstrated as follows: firstly, an improved fuzzy-AHP method is proposed. In real case, it is difficult to provide exact assessments by people. Therefore, triangular membership method is developed to improve acquirement of weights of each risk factor to avoid some qualitative methods such as expert scoring. Then, combining of the characteristic of risk assessment framework of bank information system, the proposed fuzzy-AHP method is applied to obtain weights of each risk factor of bank information system from 2011 to 2013 and further obtain the risk index of each risk factor. Secondly, based on this risk index and using classification properties of support vector machine to predict the risk. Finally, the experiment demonstrates the validity and applicability of the proposed method.",
    "year": 2015,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "517acf1851bf3b04fb473445ca969921",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM"
    ],
    "stage1_timestamp": "2025-05-15T01:54:34.161858"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要研究基于三角模糊法和支持向量机的金融信息系统风险预警，其核心目标是评估和预测银行信息系统的风险，这属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文主要研究基于三角模糊法和支持向量机的金融信息系统风险预警，其核心目标是评估和预测银行信息系统的风险，这属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:55:22.998369"
}