{
  "paper": {
    "id": 640,
    "title": "Feature Selection on Credit Risk Prediction for Peer-to-Peer Lending",
    "abstract": "Lending plays a key role in economy from early civilization. One of the most important issue in lending business is to measure the risk that the borrower will default or delay in loan payment. This is called credit risk. After Lehman shock in 2008-2009, big banks increased verification for lending operation to reduce risk. As borrowing from established financial institutions is getting harder, social lending also called Peer-to-Peer (P2P) lending, is becoming the popular trend. Because the client information at P2P lending is not sufficient as in traditional financial system, big data and machine learning become the default methods for analyzing credit risk. However, cost of computation and the problem of training the classifier with imbalance data affect the quality of result. This paper proposes a machine learning model with feature selection to measure credit risk of individual borrower on P2P lending. Based on our experimental results, we showed that the credit risk prediction for P2P lending can be improved using Logistic Regression in addition to proper feature selection.",
    "year": 2019,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "032b5db1c68f87ece121ae33b369a7af",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "regression",
      "feature representation"
    ],
    "stage1_timestamp": "2025-05-15T01:53:24.869051"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on using machine learning models with feature selection to predict credit risk in P2P lending, which is a key aspect of financial risk management, specifically in assessing and mitigating credit risk.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on using machine learning models with feature selection to predict credit risk in P2P lending, which is a key aspect of financial risk management, specifically in assessing and mitigating credit risk.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:56:15.709763"
}