{
  "paper": {
    "id": 2830,
    "title": "An Audit Risk Model Based on Improved BP Neural Network Data Mining Algorithm",
    "abstract": "Professional auditors provide audit services to businesses and they are key participants in enterprise development. Effective identification of audit risks can help auditors plan their audit work rationally and issue correct audit opinions. In the era of big data and the Internet, enterprises generate a large amount of data in their daily operations. For auditors, it is a great challenge to use data mining algorithms, machine learning, artificial intelligence, and other emerging technologies to identify high-quality audit data from the vast amount of data of audited enterprises. At the same time, some companies may falsify and modify their financial statements for their own benefit, which further increases the difficulty for auditors in conducting audits. Traditional auditing methods are costly and consuming and cannot meet standard auditing requirements. Therefore, this study applies computer data mining algorithms to construct an audit risk model that provides a reference for auditors to conduct big data analysis and mines valuable data, thereby improving the efficiency and accuracy of the audit process.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "e0619889829d3fc4349d95d197d15d2f",
    "relevant_keywords": [
      "machine learning",
      "neural network",
      "deep learning",
      "backpropagation",
      "BP",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T02:19:46.632314"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是审计风险模型的构建，虽然涉及金融数据的分析，但其核心应用是审计领域，而非衍生品定价、金融风险管理或投资组合管理等金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是审计风险模型的构建，虽然涉及金融数据的分析，但其核心应用是审计领域，而非衍生品定价、金融风险管理或投资组合管理等金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T14:24:44.438682"
}