{
  "paper": {
    "id": 274,
    "title": "Risk spillover analysis of China's financial sectors based on a new GARCH copula quantile regression model",
    "abstract": "This study employs a new GARCH copula quantile regression model to estimate the conditional value at risk for systemic risk spillover analysis. To be specific, thirteen copula quantile regression models are derived to capture the asymmetry and nonlinearity of the tail dependence between financial returns. Using Chinese stock market data over the period from January 2007 to October 2020, this paper investigates the risk spillovers from the banking, securities, and insurance sectors to the entire financial system. The empirical results indicate that (i) three financial sectors contribute significantly to the financial system, and the insurance sector displays the largest risk spillover effects on the financial system, followed by the banking sector and subsequently the securities sector; (ii) the time-varying risk spillovers are much larger during the global financial crisis than during the periods of the banking liquidity crisis, the stock market crash and the COVID-19 pandemic. Our results provide important implications for supervisory authorities and portfolio managers who want to maintain the stability of China's financial system and optimize investment portfolios.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "10ff5a301718454faf866bff7f68086b",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:49:04.536890"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk",
      "Portfolio Management"
    ],
    "justification": "The paper focuses on systemic risk spillover analysis using a GARCH copula quantile regression model to estimate conditional value at risk, which is a key technique in financial risk management. Additionally, the results provide implications for portfolio managers aiming to optimize investment portfolios, indicating relevance to portfolio management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\", \"Portfolio Management\"],\n  \"justification\": \"The paper focuses on systemic risk spillover analysis using a GARCH copula quantile regression model to estimate conditional value at risk, which is a key technique in financial risk management. Additionally, the results provide implications for portfolio managers aiming to optimize investment portfolios, indicating relevance to portfolio management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:59:30.320000"
}