{
  "paper": {
    "id": 1271,
    "title": "A Bayesian analysis based on multivariate stochastic volatility model: evidence from green stocks",
    "abstract": "Green stocks are companies environmental protective and friendly. We test Green stock index in Shanghai Stock Exchange and China Securities Index as safe-havens for global investors. Suitable multivariate-SV model and Bayesian method are used to estimate the spillover effect between different assets among local and global markets. We choose multivariate volatility model because it can efficiently simulate the spillover effect by using machine learning MCMC method. The results show that the Environmental Protection Index (EPI) of Shanghai Stock Exchange (SSE) and China Securities Index (CSI) have no significant volatility spillover from Shanghai Stock index, S &P index, gold price, oil future prices of USA and China. During COVID-19 pandemic, we find Green stock index is a suitable safe-haven with low volatility spillover. Green stock indexes has a strongly one-way spillover to the crude oil future price. Environmentally friendly investor can use diversity green assets to provide a low risk investment portfolio in EPI stock market. The DCGCt-MSV model using machine learning of MCMC method is accurate and outperform others in Bayes parameter estimation.",
    "year": 2023,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "d0257a5dc14eb32ad691d16adcffbf08",
    "relevant_keywords": [
      "machine learning"
    ],
    "stage1_timestamp": "2025-05-15T00:53:42.169136"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文主要研究了绿色股票指数的波动溢出效应及其作为安全避风港的特性，并建议投资者可以通过多样化的绿色资产构建低风险的投资组合。这些内容直接关联到投资组合管理的领域，旨在帮助投资者优化资产配置和降低风险。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文主要研究了绿色股票指数的波动溢出效应及其作为安全避风港的特性，并建议投资者可以通过多样化的绿色资产构建低风险的投资组合。这些内容直接关联到投资组合管理的领域，旨在帮助投资者优化资产配置和降低风险。\"\n}\n```"
  },
  "timestamp": "2025-05-20T14:24:23.531090"
}