{
  "paper": {
    "id": 873,
    "title": "Sequential asset ranking in nonstationary time series",
    "abstract": "We extend the research into cross-sectional momentum trading strategies. Our main result is our novel ranking algorithm, the naive Bayes asset ranker (nbar), which we use to select subsets of assets to trade from the S&P 500 index. We perform feature representation transfer from radial basis function networks to a curds and whey (caw) multivariate regression model that takes advantage of the correlations between the response variables to improve predictive accuracy. The nbar ranks this regression output by forecasting the one-step-ahead sequential posterior probability that individual assets will be ranked higher than other portfolio constituents. Earlier algorithms, such as the weighted majority, deal with nonstationarity by ensuring the weights assigned to each expert never dip below a minimum threshold without ever increasing weights again. Our ranking algorithm allows experts who previously performed poorly to have increased weights when they start performing well. Our algorithm outperforms a strategy that would hold the long-only S&P 500 index with hindsight, despite the index appreciating by 205% during the test period. It also outperforms a regress-then-rank baseline, the caw model.",
    "year": 2022,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "702c1ff51f8f5ca46df678439af5b1b2",
    "relevant_keywords": [
      "machine learning",
      "regression",
      "feature representation",
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T00:49:03.181028"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是开发一种新的资产排名算法（nbar），用于从S&P 500指数中选择资产子集进行交易，并优化投资组合的表现。这直接涉及投资组合的构建和管理，属于投资组合管理领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是开发一种新的资产排名算法（nbar），用于从S&P 500指数中选择资产子集进行交易，并优化投资组合的表现。这直接涉及投资组合的构建和管理，属于投资组合管理领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:26:48.063261"
}