{
  "paper": {
    "id": 1298,
    "title": "Systemic risk prevention policies targeting systemically important banks: Does clustering pattern matter?",
    "abstract": "It is well known that strengthening the soundness of individual banks that are too large or too interconnected is essential for maintaining financial stability. The clustering among homogeneous banks may also cause financial fragility but has received less attention. This paper discusses the policy improvement for preventing systemic risk from the perspective of the clustering pattern of systemically important banks (SIBs) based on a network optimization model. The results show that the clustering pattern of SIBs is closely related to systemic risk contagion. Remarkably, networks with fewer connections among SIBs exhibit lower systemic risk than those featuring apparent clustering of SIBs. The potential mechanism is that the systemic vulnerability of small and medium-sized banks is greatly reduced in the disassortative networks. The proposed tools based on this-inter-SIBs exposure limits and pairwise capital requirements-can guide network optimization and significantly reduce systemic risk. Furthermore, combining existing capital surcharges for SIBs (focusing on the stability of individual SIBs) and proposed network-based tools (focusing on the cluster structure of the network) will be an effective way to enhance financial stability over existing policies.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "a6a4c1e35591e0e627deafdfdda88f4f",
    "relevant_keywords": [
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T02:01:11.883424"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on systemic risk prevention and the clustering patterns of systemically important banks (SIBs), which are key aspects of financial risk management. It proposes tools like inter-SIBs exposure limits and pairwise capital requirements to mitigate systemic risk, directly addressing financial stability and risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on systemic risk prevention and the clustering patterns of systemically important banks (SIBs), which are key aspects of financial risk management. It proposes tools like inter-SIBs exposure limits and pairwise capital requirements to mitigate systemic risk, directly addressing financial stability and risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:49:51.297407"
}