{
  "paper": {
    "id": 4614,
    "title": "Internet Credit Risk Scoring Based on Simulated Annealing and Genetic Algorithm",
    "abstract": "Credit risk which can be reduced by credit scoring is the focus of financial risk control. In the construction of Internet credit scoring model, we encounter the problem that variables have high dimension. To solve this problem, feature selection is necessary. Simulated annealing and genetic algorithm can be used to do feature selection. This article gives an empirical analysis of individual credit valuation using data from a microfinance internet platform. Experimental result shows both of the logistic model based on simulated annealing and logistic model based on genetic algorithm have better prediction ability and model interpretability comparing to traditional full variable logistic regression. Also, the logistic model based on simulated annealing is slightly better than logistic model based on genetic algorithm",
    "year": 2017,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "bb215aa80b60e4e9681881262cd9a9cb",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "feature learning"
    ],
    "stage1_timestamp": "2025-05-15T02:39:26.897956"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on credit risk scoring using simulated annealing and genetic algorithm for feature selection in the context of internet credit valuation. This directly addresses the problem of financial risk control, specifically in the area of credit risk management, which is a subset of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on credit risk scoring using simulated annealing and genetic algorithm for feature selection in the context of internet credit valuation. This directly addresses the problem of financial risk control, specifically in the area of credit risk management, which is a subset of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:32:21.870740"
}