{
  "paper": {
    "id": 1415,
    "title": "ML methods for assessing the risk of fraud in auto insurance",
    "abstract": "The car insurance fraud level assessment is an urgent and complex task, which is largely due to the activities of fraudulent groups. For the confident management of insurance companies in the anti-fraud strategy, a tool to assess the current state of the claim's portfolio is needed. Modern machine learning methods make it possible to carry out such an assessment using data on policyholders and insurance cases. When applying these approaches, a number of problems arise that do not allow achieving the required quality of fraud detection. These include class imbalance and the so-called concept drift, which arises as a result of changes in the scenarios of fraudsters' schemes and the subjectivity of the expert assessment of a specific insurance case. This study proposes an approach to improve model metrics for detecting fraud in a claims portfolio. A numerical experiment conducted on two open data sets demonstrated a significant improvement in the detection rate of insurance fraud compared to classical modeling. Specifically, there was an increase in the completeness of fraud detection by 49 and 19 percentage points for the two datasets, respectively.",
    "year": 2024,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "d245c9c89569864e79ddc5523ef32e68",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "feature representation",
      "neural network",
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T00:55:28.482500"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是使用机器学习方法检测汽车保险欺诈，虽然涉及风险管理，但属于保险领域而非特定的金融风险管理领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是使用机器学习方法检测汽车保险欺诈，虽然涉及风险管理，但属于保险领域而非特定的金融风险管理领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:21:09.422526"
}