{
  "paper": {
    "id": 14,
    "title": "A meta-analysis of supervised and unsupervised machine learning algorithms and their application to active portfolio management",
    "abstract": "This article applies latest machine learning algorithms, such as clustering or classification, to build and actively manage portfolios invested in U.S. stocks. We conduct a meta-analysis to compare the efficiency of these algorithms as stock screeners and their behavior during different market phases (before, during, and after the Covid19 crisis), and to identify the best investing strategy. A two-step methodology is proposed for selecting stocks and monthly rebalancing the obtained portfolios. The first step relies on a two-stage filter accounting for stock fundamentals in a given year (annual data), and the statistical features of their returns over the last three years (daily data). This first step highlights the most determining stock fundamental ratios, which are extracted from financial statements and balance sheet data. Such insightful ratios drive the stock selection process while the statistical features supplement a monthly filter that drives portfolio rebalancing. The second step focuses on five portfolio optimization schemes and compares the performance of the resulting efficient stock portfolios. The above methodology applies four clustering and four classification algorithms to select stocks based on unsupervised and supervised learning approaches. Findings reveal two outperforming optimal portfolios resulting from the best pairs of stock selection algorithms and portfolio optimization metrics. The first-best investment strategy mixes the HAC algorithm with the maximum diversification ratio optimization scheme, and the second-best strategy pairs the random forest algorithm with the maximum diversification optimization scheme. Thus, we empirically demonstrate the usefulness of machine learning techniques for efficiently building active portfolios that beat the market.",
    "year": 2025,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "a888a42e9910e12d2d25858327c4f7e3",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "unsupervised learning",
      "classification",
      "clustering",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T00:38:16.244006"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "The paper focuses on applying machine learning algorithms to actively manage portfolios of U.S. stocks, including stock selection and portfolio rebalancing, which are core activities in portfolio management. The study compares different algorithms and optimization schemes to build efficient portfolios that outperform the market, clearly aligning with the investment portfolio management domain.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Portfolio Management\"],\n  \"justification\": \"The paper focuses on applying machine learning algorithms to actively manage portfolios of U.S. stocks, including stock selection and portfolio rebalancing, which are core activities in portfolio management. The study compares different algorithms and optimization schemes to build efficient portfolios that outperform the market, clearly aligning with the investment portfolio management domain.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:34:26.322618"
}