{
  "paper": {
    "id": 742,
    "title": "A biological continuum based approach for efficient clinical classification",
    "abstract": "Clinical feature selection problem is the task of selecting and identifying a subset of informative clinical features that are useful for promoting accurate clinical diagnosis. This is a significant task of pragmatic value in the clinical settings as each clinical test is associated with a different financial cost, diagnostic value, and risk for obtaining the measurement. Moreover, with continual introduction of new clinical features, the need to repeat the feature selection task can be very time consuming. Therefore to address this issue, we propose a novel feature selection technique for diagnosis of myocardial infarction - one of the leading causes of morbidity and mortality in many high-income countries. This method adopts the conceptual framework of biological continuum, the optimization capability of genetic algorithm for performing feature selection and the classification ability of support vector machine. Together, a network of clinical risk factors, called the biological continuum based etiological network (BCEN), was constructed. Evaluation of the proposed methods was carried out using the cardiovascular heart study (CHS) dataset. Results demonstrate a significant speedup of 4.73-fold can be achieved for the development of MI classification model. The key advantage of this methodology is the provision of a reusable (feature subset) paradigm for efficient development of up-to-date and efficacious clinical classification models. (C) 2013 Elsevier Inc. All rights reserved.",
    "year": 2014,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "c7d0ecc65cc2deb9b35adc00c0d07516",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM",
      "feature learning"
    ],
    "stage1_timestamp": "2025-05-15T01:54:34.083637"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究临床特征选择技术，用于心肌梗塞的诊断，其应用领域是医疗健康而非金融。虽然提到了金融成本和风险，但这些是临床测试的背景信息，并非论文的核心研究方向。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究临床特征选择技术，用于心肌梗塞的诊断，其应用领域是医疗健康而非金融。虽然提到了金融成本和风险，但这些是临床测试的背景信息，并非论文的核心研究方向。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:55:24.979680"
}