{
  "paper": {
    "id": 7181,
    "title": "Macroeconomic shocks and credit risk stress testing the Iranian banking sector",
    "abstract": "Purpose The Iranian banking industry has been greatly affected by dramatic changes in macroeconomic conditions over the past several decades owing to volatile oil revenues, changing fiscal and monetary policies, and the imposition of US sanctions. The main objective of this paper is to estimate potential credit losses in the Iranian banking sector due to macroeconomic shocks and assess the minimum economic capital requirements under the baseline and distressed scenarios. The paper also contrasts the applications of linear and nonlinear models in estimating the impacts of macroeconomic shocks on financial institutions. Design/methodology/approach The paper uses a multistage approach to derive the portfolio loss distribution for banks. In the first step, the dynamic relationship between the selected macroeconomic variables are estimated using a VAR model to generate the stress scenarios. In the second step, the default probabilities are estimated using a quantile regression model and the results are compared with those of the conventional linear models. Finally, the default probabilities are simulated for a one-year time horizon using Monte-Carlo method and the portfolio loss distribution is calculated for hypothetical portfolios. The expected loss includes the loss given default for loans drawn randomly and uniformly distributed and exposed at default values when loans are assigned a fixed value. Findings The results indicate that the loss distributions under all scenarios are skewed to the right, with the linear model results being very similar to those of quantile at the 50% quantile, but very unlike those at the 10% and 90% quantiles. Specifically, the quantile model for the 90% (10%) quantile generates estimates of minimum economic capital requirement that are considerably higher (lower) than those using the linear model. Research limitations/implications The study has focused on credit risk because of lack of data on other types of risk at individual bank level. The future studies can estimate the aggregate economic capital using a risk aggregation approach and a panel data (not presently available), which could further improve the accuracy of the estimates. Practical implications The fiscal and monetary authorities in developing countries, specially oil-exporting countries, can follow the risk assessment approach to assess the health of their banking system and adapt policies to mitigate the impacts of large macroeconomic shocks on their financial markets. Originality/value This is the first paper estimating the portfolio loss distribution for the Iranian banks under turbulent macroeconomic conditions using linear and nonlinear models. The case study can be applied to other developing and emerging countries, particularly those highly dependent on natural resources, prone to extreme macroeconomic shocks.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "45d16d61d249f2f87167673f26de5f00",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T03:06:01.203007"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on estimating potential credit losses in the Iranian banking sector due to macroeconomic shocks and assessing the minimum economic capital requirements under various scenarios. This is a clear application of financial risk management, specifically credit risk assessment and stress testing.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on estimating potential credit losses in the Iranian banking sector due to macroeconomic shocks and assessing the minimum economic capital requirements under various scenarios. This is a clear application of financial risk management, specifically credit risk assessment and stress testing.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:26:40.082845"
}