{
  "paper": {
    "id": 316,
    "title": "An Optimal Least Square Support Vector Machine Based Earnings Prediction of Blockchain Financial Products",
    "abstract": "The booming applications of bitcoin Blockchain technologies made investors concerned about the return and risk of financial products. So, the return rate of bitcoin must be foreseen in prior. This research article devises an effective return rate prediction technique for Blockchain financial products based on Optimal Least Square Support Vector Machine (OLS-SVM) model. The parameter optimization of the LS-SVM model was performed using hybridization of Grey Wolf Optimization (GWO) with Differential Evolution (DE), called optimal GWO (OGWO) algorithm. The hybridization process is performed to eliminate the local optima problem of GWO and enhance the diversity of the population. To verify the goodness of the proposed model, the Ethereum (ETH) return rate was chosen as the target and experimental analysis was performed on it to verify the predictive results on the time series. The experimental outcome was analyzed in terms of two performance measures namely Mean Squared Error (MSE) and Mean Absolute Percentage Error (MAPE). The obtained simulation outcome infers that the OLS-SVM model yielded better predictive outcome of the return rate of financial products.",
    "year": 2020,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "5a411410210a422de9faad4b29e0301d",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "regression",
      "support vector machine",
      "SVM"
    ],
    "stage1_timestamp": "2025-05-15T01:49:40.952595"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究基于机器学习的区块链金融产品收益率预测技术，虽然涉及金融产品的回报率预测，但并未明确指出其应用于衍生品定价、金融风险管理或投资组合管理等特定金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究基于机器学习的区块链金融产品收益率预测技术，虽然涉及金融产品的回报率预测，但并未明确指出其应用于衍生品定价、金融风险管理或投资组合管理等特定金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:59:05.473465"
}