{
  "paper": {
    "id": 3263,
    "title": "Whether we are still immature to assess the environmental KPIs!",
    "abstract": "This paper explores the relationship between company maturity level and environmental key performance indicator (KPI) assessment. A cross-sectional approach was taken to examine differences among low and high maturity organizations, measuring the level of environmental KPIs importance assessed by 51 project portfolio managers. The assessment has been prepared according to Regulation (EC) No 1221/2009 of the European Parliament and the Council 2009, and IPMA Delta model for maturity assessment (individual, project and organizational level assessment). Differences between environmental KPIs and individual, project and organizational maturity were observed. Data analysis was prepared using SPSS 20.0 software and Rapid Miner Studio 6.0. The initial step was related to the determination of the relationship between environmental KPIs areas (Material Efficiency, Energy Efficiency, Water Management, Waste Management, Biodiversity, Emissions into the air). K-means algorithm was performed in order to identify group characteristics. Man Whitney test was used for group comparison to determine environmental KPIs differences that are related to organizational, project and individual maturity level. The research findings are described by mean and standard deviation. Analyzing individual, organizational and project factors, influential maturity components were identified using linear regression analysis method. Project portfolio managers' demographics have taken into account in this analysis. The study showed a significant difference between high mature and low mature organizations in environmental KPIs assessment according to project and individual level, but there is no difference according to the organizational level. Theoretical and practical implications are discussed. (C) 2016 The Authors. Published by Elsevier Ltd.",
    "year": 2016,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "8fd932f35e19fb750c1405d3338335b6",
    "relevant_keywords": [
      "clustering",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:15:26.116282"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究公司成熟度与环境关键绩效指标（KPI）评估之间的关系，涉及聚类和回归分析技术，但并未提及任何与衍生品定价、金融风险管理或投资组合管理相关的应用场景或研究目标。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究公司成熟度与环境关键绩效指标（KPI）评估之间的关系，涉及聚类和回归分析技术，但并未提及任何与衍生品定价、金融风险管理或投资组合管理相关的应用场景或研究目标。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:10:30.481085"
}