{
  "paper": {
    "id": 725,
    "title": "Aggregation of Multi-Scale Experts for Bottom-Up Load Forecasting",
    "abstract": "The development of smart grid and new advanced metering infrastructures induces new opportunities and challenges for utilities. Exploiting smart meters information for forecasting stands as a key point for energy providers who have to deal with time varying portfolio of customers as well as grid managers who needs to improve accuracy of local forecasts to face with distributed renewable energy generation development. We propose a new machine learning approach to forecast the system load of a group of customers exploiting individual load measurements in real time and/or exogenous information like weather and survey data. Our approach consists in building experts using random forests trained on some subsets of customers then normalise their predictions and aggregate them with a convex expert aggregation algorithm to forecast the system load. We propose new aggregation methods and compare two strategies for building subsets of customers: 1) hierarchical clustering based on survey data and/or load features and 2) random clustering strategy. These approaches are evaluated on a real data set of residential Irish customers load at a half hourly resolution. We show that our approaches achieve a significant gain in short term load forecasting accuracy of around 25 percent of RMSE.",
    "year": 2020,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "920ec4471a0b1bf2a027fd47fe7a86ee",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "regression",
      "decision tree",
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T00:47:18.607309"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是利用机器学习方法进行电力负荷预测，虽然涉及到了预测和聚类技术，但其应用场景是智能电网和能源管理，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是利用机器学习方法进行电力负荷预测，虽然涉及到了预测和聚类技术，但其应用场景是智能电网和能源管理，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:28:22.567593"
}