{
  "paper": {
    "id": 7948,
    "title": "Predictors of long-term anxiety and depression in discharged COVID-19 patients: A follow-up study",
    "abstract": "BACKGROUND Patients who were hospitalized for coronavirus disease 2019 (COVID-19) faced an extremely stressful experience that challenged their mental health and the long-term effects are not definitely known yet. AIM To identify both the course of mental symptoms (anxiety and depressive symptoms) and the related risk factors of recovered patients at the 20-22 mo follow-up. METHODS One hundred and seventy-two patients were enrolled. The patients were evaluated with a telepsychiatry interview and the Hospital Anxiety and Depression Scale (HADS). Sociodemographic and clinical features were analyzed by regression analysis. RESULTS The mean HADS-Anxiety (HADS-A) score was 9.08 & PLUSMN; 4.90, and the mean HADS-Depression (HADS-D) score was 8.55 & PLUSMN; 4.39. The mean HADS-A (P = 0.484) and HADS-D (P = 0.011) scores were increased compared to scores during hospitalization. Being over 50 years old, having lower financial status, and being vaccinated were associated with symptoms of depression (adjusted R-2 = 0.168) while being over 50 years old, female sex, being vaccinated, and dyspnea were associated with higher anxiety (adjusted R-2 = 0.245). CONCLUSION To prevent the deterioration of mental health, psychiatrists should play an active role in identifying emerging mental problems as soon as possible, more vulnerable groups should be characterized, and psychological support should be sustained after discharge.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "ed935336c162843782ff3139d667c2b9",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T03:13:30.705042"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究COVID-19出院患者的长期焦虑和抑郁症状及其相关风险因素，属于心理健康研究领域，与金融研究领域无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究COVID-19出院患者的长期焦虑和抑郁症状及其相关风险因素，属于心理健康研究领域，与金融研究领域无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:25:54.958523"
}