{
  "paper": {
    "id": 3643,
    "title": "Forecasting the financial performance of small and medium-sized enterprises: evidence from the Hungarian food retail sector",
    "abstract": "Introduction. This research aims to develop a financial model capable of performance measurement for food retail SMEs operating in a specific region of a typical Central and Eastern European emerging economy, Hungary, based on accounting statements and macroeconomic indicators, the utilisation of which enables managers to measure and improve financial performance. Materials and methods. Multivariate stepwise linear regression was applied to select the indicators for the model, and multivariate linear panel regression was applied to develop the specific model. The database contained 972 company statements covering the period 2015-2019. Results and discussion. Using panel data of financial indexes and macroeconomic indicators as independent variables, a multivariate linear regression function can be defined, allowing enterprises' operating profit to be estimated and predicted as a dependent variable with high accuracy and significance. The result of the modelling is a random-effects regression model that can predict 81.6% of the operating profit/loss of food retailers in Hungary's North Great Plain region. The practical results of the secondary research can be applied to the entire population of the study region based on statistical procedures. Among the financial ratios produced from the statements used in the course of the procedures, the application of ROA margin I, Net working capital, Net working capital ratio, Current assets ratio as key indicators, as well as Inventory turnover rate, Total assets turnover rate, Capital strength are suggested. Of the macroeconomic indicators, household income per capita and its change can provide guidance for planning, as food retail risk appears to be the most important macroeconomic indicator. Conclusion. Businesses can use the model in their management accounting and control activities, either by substituting the relevant financial indicators into the final model to forecast the operating profit/loss or by making decisions with the support of the developed indicator system. Such scientifically established models can help improve SMEs' management accounting, thus maintaining or enhancing their decision-making processes and competitiveness.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "ecfc33abed9dc7cfbab3548f549b3acf",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:28:29.371761"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究中小企业的财务绩效预测模型，虽然涉及财务指标和宏观经济因素，但其核心应用是企业管理会计和控制活动，而非衍生品定价、金融风险管理或投资组合管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究中小企业的财务绩效预测模型，虽然涉及财务指标和宏观经济因素，但其核心应用是企业管理会计和控制活动，而非衍生品定价、金融风险管理或投资组合管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:35:34.396637"
}