{
  "paper": {
    "id": 10,
    "title": "Futuristic portfolio optimization problem: wavelet based long short-term memory",
    "abstract": "PurposeThis paper aims to propose an improved version of portfolio optimization model through the prediction of the future behavior of stock returns using a combined wavelet-based long short-term memory (LSTM).Design/methodology/approachFirst, data are gathered and divided into two parts, namely, past data and real data. In the second stage, the wavelet transform is proposed to decompose the stock closing price time series into a set of coefficients. The derived coefficients are taken as an input to the LSTM model to predict the stock closing price time series and the future data is created. In the third stage, the mean-variance portfolio optimization problem (MVPOP) has iteratively been run using the past, future and real data sets. The epsilon-constraint method is adapted to generate the Pareto front for all three runes of MVPOP.FindingsThe real daily stock closing price time series of six stocks from the FTSE 100 between January 1, 2000, and December 30, 2020, is used to check the applicability and efficacy of the proposed approach. The comparisons of future, past and real Pareto fronts showed that the future Pareto front is closer to the real Pareto front. This demonstrates the efficacy and applicability of proposed approach.Originality/valueMost of the classic Markowitz-based portfolio optimization models used past information to estimate the associated parameters of the stocks. This study revealed that the prediction of the future behavior of stock returns using a combined wavelet-based LSTM improved the performance of the portfolio.",
    "year": 2024,
    "source": "WOS",
    "area": "portfolio",
    "method": "deep learning",
    "cache_key": "2b4bea02d53fcec39749b08b01c2fdcb",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "neural network",
      "long short-term memory",
      "LSTM"
    ],
    "stage1_timestamp": "2025-05-15T00:31:16.729420"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是使用小波变换和长短期记忆网络（LSTM）预测股票收益的未来行为，并将其应用于投资组合优化问题（MVPOP）。论文明确提到改进经典Markowitz投资组合优化模型，并通过比较过去、未来和真实的Pareto前沿来验证方法的有效性。因此，其主要应用领域是投资组合管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是使用小波变换和长短期记忆网络（LSTM）预测股票收益的未来行为，并将其应用于投资组合优化问题（MVPOP）。论文明确提到改进经典Markowitz投资组合优化模型，并通过比较过去、未来和真实的Pareto前沿来验证方法的有效性。因此，其主要应用领域是投资组合管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:36:04.878403"
}