{
  "paper": {
    "id": 1924,
    "title": "MANAGING CREDIT RISK STRATEGIES FOR COMMERCIAL BANKS: THE CASE OF KOSOVO",
    "abstract": "The study aims to substantiate effective strategies to manage credit risks in commercial banks, for example, Kosovo. Based on the annual financial statements of commercial banks in Kosovo for 2010-2020. We built polynomial regression models to assess the impact of credit risk on the bank's financial stability. Empirically, determined and argued the different nature of the credit risks influencing the bank's financial stability according to various on the assets size of commercial banks. Preventive and reactive scenarios for minimizing the negative impact of credit risk on the financial stability of commercial banks in Kosovo have been determined using the constructed regression models. The results obtained are of practical importance and can help develop effective strategies for managing the financial risks in commercial banks in times of crisis and building up financial stability in stable conditions.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "383f77213ba241fd63dc6798fb010f14",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:09:14.308153"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on managing credit risks in commercial banks using regression models to assess the impact of credit risk on financial stability, which is a core aspect of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on managing credit risks in commercial banks using regression models to assess the impact of credit risk on financial stability, which is a core aspect of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:45:12.126583"
}