{
  "paper": {
    "id": 554,
    "title": "Study of Solar Photovoltaic Potential and Carbon Mitigation in University Buildings",
    "abstract": "Capturing solar radiation through photovoltaic deployment on the rooftop of buildings not only produces clean energy but also plays an important role in mitigating carbon dioxide emissions. Semarang State University in Indonesia expanding solar energy until 2021 has installed 260 kWp rooftop solar photovoltaic in 8 buildings. Gradually, the rooftop photovoltaic portfolio is being improved to realize the vision of the green campus. It is important to conduct a quantitative assessment of the power generation potential of rooftop photovoltaics to formulate a policy on effective electricity production integration. The objective of this study is to predict the potential for rooftop solar photovoltaic exploration and the potential for mitigating carbon dioxide emissions. The method used was the combination of a deep learning approach and aerial photography of an unmanned aerial vehicle. It was found that of the 40 tallest building units, the available roof area was approximately 26,645 m(2). The average monthly irradiation was 5.63 kWh/m(2)/day. Energy potential per year: 8,671.1 GWh (m-Si); 7,234.4 GWh (p-Si); 4,427 GWh (a-Si); and 7,414.3 GWh (CdTe). Based on local emission factors, the mitigation potential per year was: 7,199,468.9 tons of CO2 (m-Si); 6,000,536.3 tons of CO2 (p-Si); 3,674,417.7 tons of CO2 (a-Si), and 6,153,902.9 tons of CO2 (CdTe). The findings of the study are dedicated to university management to design and manage roof photovoltaic systems reliably and economically.",
    "year": 2022,
    "source": "WOS",
    "area": "portfolio",
    "method": "deep learning",
    "cache_key": "46b6f74d803e527d883ce2864c3b6ece",
    "relevant_keywords": [
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T00:37:38.107051"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究太阳能光伏发电潜力和碳减排，应用场景为大学建筑的能源管理和环保政策制定，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究太阳能光伏发电潜力和碳减排，应用场景为大学建筑的能源管理和环保政策制定，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:34:35.007914"
}