{
  "paper": {
    "id": 655,
    "title": "EFFICIENT ASSET ALLOCATION BASED ON PREDICTION WITH ADAPTIVE DATA SELECTION",
    "abstract": "Portfolio optimisation is a key issue in finance for individual investors and asset managers to make profits or hedge against market risks. Based on the analysis of financial time series using machine learning techniques with mathematically adaptive data selection, we predict the future trends of the stocks and make efficient profitable portfolio selection. It is the novelty of this work to express the training data as the union of subsets of similar data and build multiple machine learning networks, each one of which is specialised for the trends in one subset. Similar data in a subset gives ease of learning, which eventually leads to an improvement in prediction accuracy. The consideration of the possibility from one trend in the past to various outcomes in the future is another novelty. The portfolio management based on such improved learning gives the high rate of returns. When the proposed portfolio management scenario is applied to the stocks included in KOSPI index in Korea, up to 4 times more profits than the standard management are obtained.",
    "year": 2023,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "3f529ca1465c7615fe16111af95e0968",
    "relevant_keywords": [
      "machine learning",
      "neural network",
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T00:46:24.411357"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "The paper focuses on portfolio optimisation using machine learning techniques for predicting stock trends and selecting profitable portfolios, which is a core aspect of investment portfolio management. The study's application to the KOSPI index further confirms its relevance to this domain.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Portfolio Management\"],\n  \"justification\": \"The paper focuses on portfolio optimisation using machine learning techniques for predicting stock trends and selecting profitable portfolios, which is a core aspect of investment portfolio management. The study's application to the KOSPI index further confirms its relevance to this domain.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:28:55.934856"
}