{
  "paper": {
    "id": 335,
    "title": "RETRACTED: Deep Learning-Driven Financial Management Innovation Upgrade for Universities (Retracted Article)",
    "abstract": "This study aims to improve the quality of college financial management and reduce the risk of college financial management, and a college financial system based on multiscale deep learning is designed in this paper. This paper designs a university financial system based on multiscale deep learning. In the hardware design, the system adds multiple sensors and scans all the information in the financial database using a coordinator. In the software design, the weights that can connect the financial information of the same attribute are set by establishing a database form; according to the multilayer perceptual network topology, a full interconnection model based on multiscale deep learning is designed to realize the system's deep extraction of data. The experimental results show that the financial risk is based on the risk warning capability for university finance, and compared with the system under the traditional design, the university finance system designed at this time has the most categories of financial information parameters extracted.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "deep learning",
    "cache_key": "c8c15aadff38c09b0f3d329dd23739db",
    "relevant_keywords": [
      "deep learning",
      "neural network",
      "representation learning",
      "backpropagation",
      "BP",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T01:36:59.829180"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要关注大学财务管理系统的设计与改进，虽然提到了金融风险预警能力，但其核心应用场景是高校财务管理，而非衍生品定价、金融风险管理或投资组合管理等特定金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要关注大学财务管理系统的设计与改进，虽然提到了金融风险预警能力，但其核心应用场景是高校财务管理，而非衍生品定价、金融风险管理或投资组合管理等特定金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:03:41.614650"
}