{
  "paper": {
    "id": 1370,
    "title": "The impact of liquidity conditions on the time-varying link between US municipal green bonds and major risky markets during the COVID-19 crisis: A machine learning approach",
    "abstract": "In this study, we aim to investigate the role of the liquidity risk channel in affecting the dynamic conditional correlations (DCCs) between the U.S. municipal green bonds and risky assets (energy commodities and stocks) by accounting for other macroeconomic risks and uncertainties during the COVID-19 crisis period. To explore the underlying mechanism behind the DCCs, we first derive the DCCs and then use novel machine learning techniques, such as CatBoost, Extreme Gradient Boosting (XGBoost), and Light Gradient Boosting Machine (LightGBM) models and select the most effective one based on its performance metrics. We also employ the Shapley Additive Explanations (SHAP) method to gain a greater understanding of machine learning predictions. The baseline findings suggest the critical role of the rising term spread in increasing the DCCs between the U.S. municipal green bonds and risky assets during the COVID-19 crisis. Equally important, we observe that this role is more pronounced at high levels of the term spread and that the term spread frequently interacts with funding liquidity conditions (TED spread). Our analysis holds valuable implications for the implementation of informed policy sets and the development of optimal portfolio diversification strategies in global markets.",
    "year": 2024,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "2f4acba96ab71fadd53a32821fc6d789",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "regression",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T00:54:56.480365"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk",
      "Portfolio Management"
    ],
    "justification": "该论文研究了流动性风险对动态条件相关性的影响，并探讨了其对全球市场最优投资组合多样化策略的启示，这直接涉及金融风险管理和投资组合管理领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\", \"投资组合管理\"],\n  \"justification\": \"该论文研究了流动性风险对动态条件相关性的影响，并探讨了其对全球市场最优投资组合多样化策略的启示，这直接涉及金融风险管理和投资组合管理领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:21:34.711382"
}