{
  "paper": {
    "id": 187,
    "title": "A Novel Quantitative Stock Selection Model Based on Support Vector Regression",
    "abstract": "Facing the huge challenges brought by changing market environment, the academic community is constantly looking for factors and combinations that can obtain excess returns on basis of traditional multi-factor stock selection model. Compared with the traditional linear multi-factor model, the machine learning algorithm can capture the more granular market signal by the nonlinear expression of the factor. To mine the stock factor data and optimize the stock selection model, this paper uses the equal weight linear model and machine learning support vector machine and linear regression algorithm for factor analysis. Based on the theory of SVM machine learning algorithm and multi-factor stock selection, this paper establishes and solves the SVR stock market forecasting model by characterizing the data. Then, this paper gives and analyzes examples after combining relevant data. The results show that the factors such as PB, PE, ROE, NetProfitGrowRate, OperatingRevenueGrowRate, EPS and NegMktValue are outstanding. After putting excellent factors into the SVR model, the return rate of the stock portfolio is far greater than that of the traditional equal weight linear model, which indicates that the stock selection model using the machine learning algorithm has higher returns and stable results. This paper provides some guidance for decision makers to formulate stock picking strategies by mining stock factor data.",
    "year": 2019,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "cbba4ed6af3ce913afd8483b2192deef",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "regression",
      "support vector machine",
      "SVM",
      "feature representation"
    ],
    "stage1_timestamp": "2025-05-15T00:40:02.142546"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是使用支持向量回归（SVR）来优化股票选择模型，目的是构建具有更高回报率的股票投资组合。这直接涉及投资组合管理的领域，因为它关注于如何选择和组合股票以实现更好的投资回报。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是使用支持向量回归（SVR）来优化股票选择模型，目的是构建具有更高回报率的股票投资组合。这直接涉及投资组合管理的领域，因为它关注于如何选择和组合股票以实现更好的投资回报。\"\n}\n```"
  },
  "timestamp": "2025-05-20T14:24:01.647909"
}