{
  "paper": {
    "id": 2730,
    "title": "Risk-Intolerant but Risk-Taking-Towards a Better Understanding of Inconsistent Survey Responses of the Euro Area Households",
    "abstract": "The sustainable development of the EU internal market for retail financial services is based on the rules of 'suitability', 'know your client', and 'know your product'. The rules ensure that financial institutions (including banks) offer retail clients only products and services that are adequate to their purposes and preferences, including risk tolerance. Our study, however, concerns households for which the above rules are not valid, since they declare risk aversion and possess risky assets. According to the European Union Markets in Financial Instruments Directive and Regulation (MiFID II and MiFIR), the inconsistent information they provide within survey questions should classify them to more compound suitability assessment procedures. In the study, we use nationally representative data for 16 euro area countries from the second wave of the Eurosystem Household Finance and Consumption Survey. Using logit regression, we identify sets of socio-demographic and socio-economic characteristics conducive to the possession of risky assets by risk-averse households in individual countries. To assess their similarity, we use the hierarchical taxonomic method with Ward's formula. The results of the study showed that risky assets were primarily possessed by risk-averse households that were characterised by high income, including from self-employment, and reference persons having a university degree and at least 55 years of age. The significance of their other characteristics was mainly shaped at the national level. The clear similarity of sets of the characteristics was confirmed only for a few pairs of countries. The information inconsistency that may result from erroneous self-assessments of being risk-averse was recognised in all countries and most often concerned high-income households with reference persons being males with a university degree. In 11 countries, the reason for this inconsistency could also be the inadequacy of assets held, also among senior households. The results provide insights for practitioners and policy. Identification of households providing inconsistent information to financial institutions, with the recognition of its reasons based on easily verifiable characteristics, may prove helpful in suitability assessments. The results confirming the similarity of household profiles requiring special attention between countries may be useful for entities operating cross-border. Due to the collection of information on risk aversion based on the single question self-classification method, conclusions regarding the restrictions of its use should also be considered relevant. In turn, policy implications may relate to consumer protection, since significant fractions of risk-averse households indeed participate in risky assets. Moreover, in selected countries, the risk-averse senior households were recognised as susceptible to making wrong investment decisions.",
    "year": 2020,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "09c2f1761ebb5eec3a7d01f67dcf8ff7",
    "relevant_keywords": [
      "classification",
      "regression",
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T02:18:37.113440"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究家庭在金融调查中的不一致反应及其社会经济特征，虽然涉及风险偏好和资产持有，但其核心研究并不直接涉及衍生品定价、金融风险管理或投资组合管理的具体技术或应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究家庭在金融调查中的不一致反应及其社会经济特征，虽然涉及风险偏好和资产持有，但其核心研究并不直接涉及衍生品定价、金融风险管理或投资组合管理的具体技术或应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:40:11.821905"
}