{
  "paper": {
    "id": 4633,
    "title": "Quantifying Causality between Climate Change and Credit Risk: A Bibliometric Study and Research Agenda",
    "abstract": "There is increasing pressure on organisations and countries to manage the financial risks associated with climate change. This paper summarises research on climate change, credit risk and the associated losses, and specifically identifies methods that could contribute to quantifying the causal relationships between climate change and credit risk. We conducted a bibliometric analysis using the Web of Science database to analyse 3138 documents that investigated climate change and credit risk. The key results reveal that climate change has a quantifiable effect on credit risk, and that the most affected industries or sectors are energy, transportation/mobility, agriculture and food, manufacturing, and construction. The prominent methods to quantify causal relationships between climate change and credit risk are regression models, but these are mostly used in preliminary and testing stages. Distance to default and credit risk are the main areas of focus when quantifying climate change and credit risk. Banks are the main type of organisation that have sought to quantify the causal relationship. We identify a research agenda to quantify these causal relationships.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "f3081faf5f2597d5f4be2f2b86411645",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:39:26.970241"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on quantifying the causal relationships between climate change and credit risk, which is a key aspect of financial risk management. It discusses methods like regression models and distance to default to assess credit risk, which are directly related to managing financial risks associated with climate change.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on quantifying the causal relationships between climate change and credit risk, which is a key aspect of financial risk management. It discusses methods like regression models and distance to default to assess credit risk, which are directly related to managing financial risks associated with climate change.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:32:21.687176"
}