{
  "paper": {
    "id": 5021,
    "title": "Modelling consumer credit risk via survival analysis",
    "abstract": "Credit risk models are used by financial companies to evaluate in advance the insolvency risk caused by credits that enter into default. Many models for credit risk have been developed over the past few decades. In this paper, we focus on those models that can be formulated in terms of the probability of default by using survival analysis techniques. With this objective three different mechanisms are proposed based on the key idea of writing the default probability in terms of the conditional distribution function of the time to default. The first method is based on a Cox's regression model, the second approach uses generalized linear models under censoring and the third one is based on nonparametric kernel estimation, using the product-limit conditional distribution function estimator by Beran. The resulting nonparametric estimator of the default probability is proved to be consistent and asymptotically normal. An empirical study, based on modified real data, illustrates the three methods.",
    "year": 2009,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "0bd31aac4adba18e25cb4bc6f4be1ceb",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:43:40.105005"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on modeling consumer credit risk and evaluating the probability of default using survival analysis techniques, which is directly related to assessing and managing financial risks associated with credit defaults.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on modeling consumer credit risk and evaluating the probability of default using survival analysis techniques, which is directly related to assessing and managing financial risks associated with credit defaults.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:31:30.664695"
}