{
  "paper": {
    "id": 3119,
    "title": "THE INFLATED VALUATION PROBLEM IN VALENCIA, SPAIN, AND IMPLICATIONS FOR FIRM SIZE",
    "abstract": "Home purchase-sale prices have been widely modeled by several authors. Nonetheless, other values exist, such as home mortgage appraisal values, used by financial institutions, which have played a key role in the recent financial crisis. This article attempts to model the appraisal price of one m(2) of residential properties obtained by 31 appraisal companies in Valencia (Spain). Mortgage appraisal values of 17 007 residential properties were used for this purpose. Spatial autocorrelation was detected in both the data and residuals of the ordinary regression model, which justified using spatial regression models. Of the four employed models, the error model offered the best results. Significant differences were found among appraisal companies, which varied as much as 83% for some. Generally speaking, small appraisal companies obtained higher over-valuation percentages, which confirms their situation of weakness. The fact that over-valuations exist in mortgage securities is a high risk for a stable financial system.",
    "year": 2018,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "25c5eb63467f2ff6131458a0ef4dc8ac",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:22:56.654244"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on modeling mortgage appraisal values and discusses the risks of over-valuation in mortgage securities, which directly relates to financial risk management in the context of the financial system's stability.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on modeling mortgage appraisal values and discusses the risks of over-valuation in mortgage securities, which directly relates to financial risk management in the context of the financial system's stability.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:38:06.202885"
}