{
  "paper": {
    "id": 154,
    "title": "Research on Financial Risk Forecast Model of Listed Companies Based on Convolutional Neural Network",
    "abstract": "With the continuous improvement of China's market economy, many listed companies enjoy the unlimited development opportunities brought by the market economy environment but are also threatened by various potential risks. They may be labeled ST at any time due to financial risks. The label may even end up in danger of delisting. Most companies encountered serious financial crises or even bankruptcies in the later period because they did not pay enough attention to the financial problems that occurred in the early stage and did not take effective measures to deal with the crisis in a timely manner. This is extremely detrimental to the subsequent development of the company. Therefore, more and more attention has been paid to the research on the financial risk status of enterprises. Therefore, on the basis of analyzing the financial information of listed companies, this article extracts the characteristics of listed companies and images them and uses convolutional neural networks to construct a financial risk prediction model to improve the accuracy of risk prediction. Specifically, this article also compares and analyzes the financial risk prediction models of different types of listed companies, optimizes the index system, and uses the convolutional neural network method to construct a targeted financial risk prediction model with data characteristics. The actual operation data and actual risk data of the listed companies are verified, proving that it has strong adaptive ability to face different types of data, strong operability, and high prediction accuracy.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "9b1ad709b1fcb40694a684909b2fe87c",
    "relevant_keywords": [
      "machine learning",
      "classification",
      "neural network",
      "deep learning",
      "convolutional neural network",
      "CNN"
    ],
    "stage1_timestamp": "2025-05-15T01:47:14.187819"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用卷积神经网络构建财务风险预测模型，旨在提高风险预测的准确性，这直接属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"该论文的核心技术是使用卷积神经网络构建财务风险预测模型，旨在提高风险预测的准确性，这直接属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:00:25.694420"
}