{
  "paper": {
    "id": 161,
    "title": "An Intelligent Fusion Model with Portfolio Selection and Machine Learning for Stock Market Prediction",
    "abstract": "Developing reliable equity market models allows investors to make more informed decisions. A trading model can reduce the risks associated with investment and allow traders to choose the best-paying stocks. However, stock market analysis is complicated with batch processing techniques since stock prices are highly correlated. In recent years, advances in machine learning have given us a lot of chances to use forecasting theory and risk optimization together. The study postulates a unique two-stage framework. First, the mean-variance approach is utilized to select probable stocks (portfolio construction), thereby minimizing investment risk. Second, we present an online machine learning technique, a combination of perceptron and passive-aggressive algorithm, to predict future stock price movements for the upcoming period. We have calculated the classification reports, AUC score, accuracy, and Hamming loss for the proposed framework in the real-world datasets of 20 health sector indices for four different geographical reasons for the performance evaluation. Lastly, we conduct a numerical comparison of our method's outcomes to those generated via conventional solutions by previous studies. Our aftermath reveals that learning-based ensemble strategies with portfolio selection are effective in comparison.",
    "year": 2022,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "6511419e4377b847cd04a1247f0e9071",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "PCA",
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T00:40:02.089517"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是结合投资组合选择（使用均值-方差方法）和机器学习技术来预测股票价格走势，旨在优化投资决策和降低风险。这直接涉及投资组合管理的领域，因为它专注于如何选择和组合股票以最小化风险并最大化回报。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是结合投资组合选择（使用均值-方差方法）和机器学习技术来预测股票价格走势，旨在优化投资决策和降低风险。这直接涉及投资组合管理的领域，因为它专注于如何选择和组合股票以最小化风险并最大化回报。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:33:17.072368"
}