{
  "paper": {
    "id": 1408,
    "title": "The evaluation of agricultural enterprise's innovative borrowing capacity based on deep learning and BP neural network",
    "abstract": "The purpose is to solve the financing difficulties of agricultural enterprises with the assistance of deep learning and neural network model, improve the overall borrowing ability of enterprises and effectively evaluate enterprise risks. First, the concepts of deep learning and neural network are introduced. On the basis of sorting out and summarizing the existing relevant research, multiple financial indexes are selected as variables, and a risk control model of innovative lending of agricultural enterprises based on back propagation neural network (BPNN) is established. The data of some listed agricultural enterprises are selected for empirical analysis. The performance of the proposed model algorithm is compared with that of the previous model. The results show that the evaluation error of BPNN algorithm is less than 1.8%, and its accuracy is as high as 94.04%. The algorithm shows excellent performance in the training process, the actual output value is very close to the expected value, and can effectively classify related enterprises. The research results can provide reference for solving the loan problem of agricultural enterprises and improving the risk management ability of agricultural enterprises.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "cb1959bc1466e19f4ef92e0219a109d5",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "neural network",
      "backpropagation",
      "BP",
      "classification"
    ],
    "stage1_timestamp": "2025-05-15T02:02:22.807471"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用深度学习和BP神经网络来评估农业企业的借款能力和风险，这直接涉及信用风险评估和管理，属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是使用深度学习和BP神经网络来评估农业企业的借款能力和风险，这直接涉及信用风险评估和管理，属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:49:05.387927"
}