{
  "paper": {
    "id": 67,
    "title": "Research on Enterprise Financial Risk Based on Radial Basis Function Neural Network",
    "abstract": "Enterprise financial risk research is based on the enterprise's operating conditions, financial indicators and other factors, the enterprise financial management activities exist in the financial risk detection and diagnosis. The effective measurement and prediction of financial risk can effectively prevent the financial crisis of enterprises and protect the interests of investors and managers. 171 listed companies in Shanghai and Shenzhen two city in 2016 as the research object, construct the research model of financial risk of Listed Companies in China Using RBF neural network method and discriminant analysis method for comparative analysis, trying to explore new way of mining research enterprise financial risk from the perspective of data. The empirical results show that the research system of enterprise financial risk based on RBF neural network model has good analytical ability, and can effectively control and prevent financial risk.",
    "year": 2017,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "f695fa630ec7659bc67e05adbc93f535",
    "relevant_keywords": [
      "machine learning",
      "neural network",
      "classification",
      "feature representation"
    ],
    "stage1_timestamp": "2025-05-15T01:46:39.460710"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on using RBF neural networks to detect and diagnose financial risks in enterprises, which is a core aspect of financial risk management. The study aims to measure and predict financial risks to prevent financial crises, aligning with the objectives of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on using RBF neural networks to detect and diagnose financial risks in enterprises, which is a core aspect of financial risk management. The study aims to measure and predict financial risks to prevent financial crises, aligning with the objectives of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:01:11.307141"
}