{
  "paper": {
    "id": 22,
    "title": "Credit Scoring to Classify Consumer Loan Using Machine Learning",
    "abstract": "Credit risk is a potential loss caused by the inability of the debtor to the obligations of debt repayment of either principal or interest debt or both. The classification of credit risk in the financial sector has an essential role in mapping the consumer risk. The wrong classification raises chain effects such as the emergence of bad credit, disruption of financial stability, which lead to banking losses. Classification in credit risk categories the customer loan into two types, good payers or bad payers (default). The aim of this research is to classify consumer's risk to minimize the risk of default. In the past decades, credit scoring using parametric techniques has been applied in the financial field, namely Discriminant Analysis and Binary Logistic Regression. In the last two decades, the non-parametric machine learning approaches, such as Neural Network and Support Vector Machine. Recently, Deep Learning era has been studied widely in credit scoring, like Deep Neural Network. This study is comparing the performance of several methods of non-parametric machine learning and parametric statistics to classify customer loans. Best method to classify customer loan is DNN with number of neuron in h(1) = 10, h(2) = 3 with value of AUC is 0.638 in testing dataset.",
    "year": 2019,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "1d747f57c6cebb52358b2a71fcc75903",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM",
      "neural network",
      "deep learning",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T01:46:03.775737"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用机器学习方法（如深度神经网络）对消费者贷款进行信用评分和分类，旨在最小化违约风险。这直接涉及信用风险管理，属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"该论文的核心技术是使用机器学习方法（如深度神经网络）对消费者贷款进行信用评分和分类，旨在最小化违约风险。这直接涉及信用风险管理，属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:01:33.997404"
}