{
  "paper": {
    "id": 3495,
    "title": "Clinical Indicators of Exposure to Coxiella burnetii in Dairy Herds",
    "abstract": "Q fever is a zoonosis occurring worldwide in livestock. Often neglected in differential diagnoses, Q fever can persist in herds causing financial losses in the long run. In ruminants, well-known manifestations of Q fever are abortion, stillbirth, delivery of weak offspring and premature delivery. In cattle, Q fever is frequently asymptomatic and/or under-reported. The use of new methodologies in veterinary clinical epidemiology is of prime importance to find accurate clinical indicators of exposure to C. burnetii at herd level. A retrospective randomly cross-sectional survey was conducted to estimate the seroprevalence of Q fever in southern Belgium by means of an ELISA test performed on the bulk tank milk (n = 206 cattle herds). At the same time, a questionnaire was accomplished allowing the investigation of presumptive clinical signs observed at herd level during the previous twelve months for dairy cows. A multivariate logistic regression analysis was used to identify abortion and irregular repeat breeding as two indicators associated with Q fever exposure in dairy herds. In addition, a bootstrapped quantile regression revealed that the average score of putative clinical signs related to Q fever was significantly more important in exposed versus non-exposed herds. A classification and regression tree (CART) analysis confirmed the importance of the average clinical score and the irregular repeat breeding as main splitters, considering or not each clinical sign separately. Considering herd clinical patterns, instead of taking each clinical sign separately, seems to be more useful to differentiate herds at risk of Q fever exposure.",
    "year": 2015,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "a63d3a5975b6827a9551fa15dc5cac97",
    "relevant_keywords": [
      "classification",
      "regression",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T02:26:48.575124"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是兽医临床流行病学中的Q热病临床指标，使用了分类和回归树（CART）等统计方法，但其应用领域是农业和兽医科学，与金融领域无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是兽医临床流行病学中的Q热病临床指标，使用了分类和回归树（CART）等统计方法，但其应用领域是农业和兽医科学，与金融领域无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:36:24.528087"
}