{
  "paper": {
    "id": 118,
    "title": "Research on Financial Risk Crisis Prediction of Listed Companies Based on IWOA-BP Neural Network",
    "abstract": "To avoid the risk brought by the financial crisis, the Improved Whale Optimization Algorithm-Back Propagation neural network (IWOA-BP) financial crisis early warning model is proposed. This paper selects the data from financial statements of some of the listed Chinese manufacturing companies from 2015-2019 as the research sample. First, the financial data of enterprises are screened by principal component analysis, and the early warning model is constructed from the financial and nonfinancial factors of six indicators: solvency, operating capacity, profitability, development capacity, cash flow and risk level factors. Second, the Whale Optimization Algorithm is optimized by the chaos strategy, as well as by the dynamic weight and sine cosine algorithm. Finally, the improved Whale Algorithm is optimized for BP neural network parameters. In the simulation experiments, the performance of the improved whale optimization algorithm is substantially improved. In addition, in the empirical analysis, compared to the prediction model with other algorithms, the prediction model of this paper has better results in terms of prediction accuracy.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "52e96f6022ff3cf49d4b9caed96d5505",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "principal components analysis",
      "neural network",
      "backpropagation",
      "BP",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T01:47:13.986992"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是改进的鲸鱼优化算法-BP神经网络模型，用于预测上市公司的财务风险危机，这直接属于金融风险管理的范畴。论文的研究目标和实验设计都集中在财务危机的早期预警上，而不是衍生品定价或投资组合管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是改进的鲸鱼优化算法-BP神经网络模型，用于预测上市公司的财务风险危机，这直接属于金融风险管理的范畴。论文的研究目标和实验设计都集中在财务危机的早期预警上，而不是衍生品定价或投资组合管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:00:48.334907"
}