{
  "paper": {
    "id": 3997,
    "title": "Analyze, Sense, Preprocess, Predict, Implement, and Deploy (ASPPID): An incremental methodology based on data analytics for cost-efficiently monitoring the industry 4.0",
    "abstract": "Industry 4.0 is revolutionizing decision making processes within the manufacturing industry. Among the technological portfolio enabling this revolution, the late literature has capitalized on the potential of data analytics for improving the production cycle at different stages, from resource provisioning to planning, delivery and storage. However, such a promising role of data analytics has been so far explored without a proper, quantitative inspection of the cost-improvement trade-off, nor has the process of acquiring sensors and extracting valuable information from their captured data formalized in a series of methodological steps. This paper introduces the Analyze, Sense, Preprocess, Predict, Implement and Deploy (ASPPID) methodology, an iterative decision workflow that spans from the acquisition of sensing equipment to the quantitative assessment of the contribution of their captured data to enhance the production step under focus. By placing the data scientist at the core of the workflow, this methodology helps improvement teams make informed decisions about which parts of the process need to be sensed, and how to exploit this information towards a verifiable improvement of the production cycle. The implementation of this methodology is exemplified in a real use case within the automotive industry, where the detection of defects in an annealing process can be modeled as a classification problem over a highly imbalanced dataset. Results obtained after applying the proposed ASPPID methodology show that the scrap ratio is reduced by sensing the correct part of the process at minimal investment costs, thus highlighting the crucial role of the data scientist in the management team of manufacturing plants.",
    "year": 2019,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "df38cb24b56177e9dfd78ca3cac4163b",
    "relevant_keywords": [
      "classification"
    ],
    "stage1_timestamp": "2025-05-15T01:23:07.251824"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要介绍了一种基于数据分析的方法论（ASPPID），用于在工业4.0环境中高效监控生产过程，其核心应用场景是制造业中的缺陷检测和生产优化，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要介绍了一种基于数据分析的方法论（ASPPID），用于在工业4.0环境中高效监控生产过程，其核心应用场景是制造业中的缺陷检测和生产优化，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:08:22.513184"
}