{
  "paper": {
    "id": 288,
    "title": "Using genetic algorithm to support clustering-based portfolio optimization by investor information",
    "abstract": "A clustering-based portfolio optimization scheme that employs a genetic algorithm (GA) based on investor information for active portfolio management is presented. Whereas numerous studies have investigated trading behaviors, investor performance, and portfolio investment strategies, few works have developed investment strategies based on investor information. This study is conducted in two phases. First, a basket of portfolio (i.e., a collection of stocks held in individual portfolios) is developed through a cluster analysis of investor information. A GA is then employed to optimize the weights of the selected stocks. And the optimized portfolio is rebalanced to get excess return. It is concluded that the proposed multistage portfolio optimization scheme for active portfolio management generates superior results than previously proposed methods for the Korean stock market. (C) 2017 Elsevier B.V. All rights reserved.",
    "year": 2017,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "75dd7f1ddd694ef78eaff72f5b67de57",
    "relevant_keywords": [
      "clustering",
      "genetic algorithm"
    ],
    "stage1_timestamp": "2025-05-15T00:41:04.929668"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "The paper presents a clustering-based portfolio optimization scheme using a genetic algorithm for active portfolio management, which directly aligns with the field of Portfolio Management. The study focuses on optimizing stock weights and rebalancing portfolios to achieve excess returns, which are core activities in portfolio management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Portfolio Management\"],\n  \"justification\": \"The paper presents a clustering-based portfolio optimization scheme using a genetic algorithm for active portfolio management, which directly aligns with the field of Portfolio Management. The study focuses on optimizing stock weights and rebalancing portfolios to achieve excess returns, which are core activities in portfolio management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:32:10.894857"
}