{
  "paper": {
    "id": 1188,
    "title": "Application of RBF neural network optimal segmentation algorithm in credit rating",
    "abstract": "Credit rating is an important part of bank credit risk management. Since the traditional radial basis function network model is more susceptible to outliers and cannot effectively process the classification data, it is very sensitive in terms of the initial center and class width of the selected model. This paper mainly studies the application of the radial basis function neural network model combined with the optimal segmentation algorithm in the personal loan credit rating model of banks or other financial institutions. The optimal segmentation algorithm is improved and applied to the training of RBF neural network parameters in this paper to increase the center and width of the class, and the center and width of the RBF network model are further improved. Finally, the adaptive selection of the number of hidden nodes is realized by using the differential objective function of the class to adjust dynamically the structure of the radial basis function network model, which is used to establish the credit rating model. The experimental results show that the improved model has higher precision when dealing with non-numeric data, and the robustness of the improved model has been improved.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "1c668935ac49a62b169a86045e368eb6",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "neural network",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T01:59:56.305402"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要研究径向基函数神经网络模型在个人贷款信用评级中的应用，信用评级是银行信用风险管理的重要组成部分，因此属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文主要研究径向基函数神经网络模型在个人贷款信用评级中的应用，信用评级是银行信用风险管理的重要组成部分，因此属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:51:36.922531"
}