{
  "paper": {
    "id": 2650,
    "title": "Does effect of risk and uncertainties on US sectoral returns differ across different investment horizons and market conditions",
    "abstract": "Our work investigates the effect of different financial, economic and political uncertainties on US sectoral returns spanning over the period January 2000 to February 2022. We sample geopolitical risk, political uncertainty, geopolitical uncertainty, financial uncertainty, monetary policy uncertainty, and US economic policy uncertainty to measure their impact on basic materials, consumer goods, consumer services, financial, healthcare, industrials, oil and gas, telecom, technologies, and utilities sector. We decompose raw returns and risk and uncertainty series into short-, and long-run components using wavelet transformation to measure the effect on sectoral returns under short- and long-run investment horizons. Later, we employ quantile regression to quantify the effect of different risk and uncertainty measures on US sectoral returns under different market conditions. Our results highlight significant impact of risk and uncertainties on US sectoral returns across all quantile distributions in the long-run. We also report non-linear causality from risk and uncertainties toward US sectoral returns in the long-run.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "5d543ba224c66d77c24aed6faf64beb9",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:17:32.274111"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk",
      "Portfolio Management"
    ],
    "justification": "该论文研究了不同金融、经济和政治不确定性对美国各行业回报的影响，并使用了小波变换和分位数回归等方法。这些研究内容直接关联到金融风险管理中对风险因素的量化和分析，同时也为投资组合管理提供了关于不同市场条件下行业回报的见解，有助于优化投资策略。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\", \"投资组合管理\"],\n  \"justification\": \"该论文研究了不同金融、经济和政治不确定性对美国各行业回报的影响，并使用了小波变换和分位数回归等方法。这些研究内容直接关联到金融风险管理中对风险因素的量化和分析，同时也为投资组合管理提供了关于不同市场条件下行业回报的见解，有助于优化投资策略。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:40:40.921881"
}