{
  "paper": {
    "id": 4773,
    "title": "Detection of earnings manipulations during the corporate life cycle in Central European countries",
    "abstract": "Research background: The growing trend of financial distress risk worldwide increases the need for effective tools to detect accounting manipulation by stakeholders (debt holders, shareholders, suppliers, and customers). However, the well-known models of accrual earnings management do not reflect the financial specificity of individual life cycle stages and their cash flow patterns. Purpose of the article: The study examines the impact of the corporate life cycle on the reliability of accrual earnings management models and identifies appropriate models for detecting accounting manipulation in Central European countries. Methods: Seven accrual earnings management models were used. They were evaluated based on five criteria: explanatory power (adjusted coefficient of determination), overall significance of the regression model, significance of the regression coefficients, predicted sign of the regression coefficients, and standard errors of the estimated regression coefficients. Finally, a comprehensive scoring model was used to determine the overall quality of the models examined. The study was conducted on a sample of more than 30,000 enterprises from four Central European countries (the Czech Republic, Hungary, Poland, and Slovakia), with data covering the period 2017-2021. The Dickinson non-sequential life cycle model was used to distinguish life cycle stages according to cash flow patterns. Findings & value added: The results of the study suggest that, firstly, discretionary accruals vary across countries as well as over the firm's life cycle; earnings manipulations have an inverted U-shape with mature firms tending to reduce their accounting profit. The reliability of the models examined was poor in the case of start-ups. This reflects the need to distinguish between life cycle stages in the detection of earnings manipulation.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "7d97414b62955f29848a36b7295739df",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:41:00.787508"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究企业生命周期对盈余管理模型可靠性的影响，并探讨如何检测会计操纵行为。虽然涉及财务风险，但其核心内容并不直接涉及衍生品定价、金融风险管理或投资组合管理等特定金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究企业生命周期对盈余管理模型可靠性的影响，并探讨如何检测会计操纵行为。虽然涉及财务风险，但其核心内容并不直接涉及衍生品定价、金融风险管理或投资组合管理等特定金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:31:57.114017"
}