{
  "paper": {
    "id": 966,
    "title": "Efficiency of corporate debt financing based on machine learning and convolutional neural network",
    "abstract": "For the digital age today, the attack of financial data has a great risk, so it is necessary to establish several specific procedures to ensure the security and privacy of our financial data. To consider the security and reliability of financial data, we should consider the security of financial data transaction. Using the form of nodes to retain the copy data of financial accounting, in this way to prevent the failure of the network. At present, a new type of network data backup method is proposed, which can be applied to financial transactions at the present stage. Using machines to classify and distribute financial accounts and backup data on each node, assuming that one node's backup fails, it will not affect the failure of adjacent nodes. No longer afraid of losing transaction data and other problems. The system is backed up by convolution neural network (CNN) and ledger. It also includes backup of credit and debit transactions and backup of transaction ID mode in timestamp and simulation.It is used to ensure the classification of accounts, including block information of chain area, hash value of previous block and latter block, etc.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "caf3f3c72265c66c6f8b2dbab512b59d",
    "relevant_keywords": [
      "machine learning",
      "classification",
      "neural network",
      "deep learning",
      "convolutional neural network",
      "CNN"
    ],
    "stage1_timestamp": "2025-05-15T01:57:29.807169"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要讨论了使用卷积神经网络和机器学习技术来确保金融数据的安全和备份，并未涉及衍生品定价、金融风险管理或投资组合管理等特定金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要讨论了使用卷积神经网络和机器学习技术来确保金融数据的安全和备份，并未涉及衍生品定价、金融风险管理或投资组合管理等特定金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:53:05.749433"
}