{
  "paper": {
    "id": 1706,
    "title": "Attention-based fuzzy neural networks designed for early warning of financial crises of listed companies",
    "abstract": "Developing an early warning model for company financial crises holds critical significance in robust risk management and ensuring the enduring stability of the capital market. Although the existing research has achieved rich results, the disadvantages of insufficient text information mining and poor model performance still exist. To alleviate the problem of insufficient text information mining, we collect related financial and annual report data from 820 listed companies in mainland China from 2018 to 2023 by using sophisticated web crawlers and advanced text sentiment analysis technologies and using missing value interpolation, standardization, and data balancing to build multi-source datasets of companies. Ranking the feature importance of multi-source data promotes understanding the formation of financial crises for companies. In the meantime, a novel Attention-based Fuzzy Neural Network (AFNN) was proposed to parse multi-source data to forecast financial crises among listed companies. Experimental results indicate that AFNN exhibits significantly improved performance compared to other advanced methods.",
    "year": 2025,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "21d1619da4e676f7293f4b02a0babb90",
    "relevant_keywords": [
      "machine learning",
      "classification",
      "neural network",
      "deep learning",
      "attention mechanism"
    ],
    "stage1_timestamp": "2025-05-15T02:06:22.516391"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是开发一种基于注意力机制的模糊神经网络模型，用于预测上市公司财务危机，这直接属于金融风险管理的范畴，特别是企业财务风险预警。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"该论文的核心技术是开发一种基于注意力机制的模糊神经网络模型，用于预测上市公司财务危机，这直接属于金融风险管理的范畴，特别是企业财务风险预警。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:46:58.336770"
}