{
  "paper": {
    "id": 2594,
    "title": "Using machine learning methods to predict financial performance: Does disclosure tone matter?",
    "abstract": "We use three supervised machine learning methods, namely linear discriminant analysis, quadratic discriminant analysis, and random forest, to predict corporate financial performance. We use a sample of 63 listed banks from eight emerging markets, covering 10 years from 2008 to 2017, using earning per share as a measure of performance. We use the design science research (DSR) framework to examine whether the textual contents of annual reports in previous years contain value-relevant information to predict future performance; thus, these contents can improve the accuracy and quality of predictive models. We combine two groups of variables in the proposed models. The first group is the sentiment analysis of disclosure tone in annual report narratives using the Loughran and McDonald dictionary (J Finance 66:35-65, 2011), while the second group is the quantitative properties of banks which consist of five variables, namely size, financial leverage, age, market-to-book ratio, and risk. Our analysis suggests that the random forest method provides the best predictive model. We also provide evidence on the accuracy and performance of predictive models that can be increased by incorporating disclosure tone variables as non-financial variables with financial variables. Interestingly, we find that the uncertainty variable is the most important disclosure tone variable. Finally, we find that size is the most important variable related to banks' quantitative characteristics. Our study suggests that the analysis of tone through corporate narrative disclosures can be used as a complementary or diagnostic approach rather than an alternative in making decisions by different stakeholders such as analysts, investors, and auditors.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "c49d923ad8e1d37550ded15d180b3ee2",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "decision tree",
      "random forest"
    ],
    "stage1_timestamp": "2025-05-15T02:17:01.764493"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究使用机器学习方法预测公司财务绩效，特别是通过分析年度报告中的披露语气来改进预测模型。虽然涉及金融数据的分析，但其核心应用并不直接属于衍生品定价、金融风险管理或投资组合管理中的任何一个领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究使用机器学习方法预测公司财务绩效，特别是通过分析年度报告中的披露语气来改进预测模型。虽然涉及金融数据的分析，但其核心应用并不直接属于衍生品定价、金融风险管理或投资组合管理中的任何一个领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:41:08.192175"
}