{
  "paper": {
    "id": 1515,
    "title": "RETRACTED: A Machine Learning Algorithm for Supplier Credit Risk Assessment Based on Supply Chain Management (Retracted Article)",
    "abstract": "In today's complex and ever-changing world, a distribution network in lending impact analysis is an evaluation of a client's procedures, rules, and financial well-being to evaluate as considerable risk and it provides to the contracting company. A creditor's capability to pay the current lender's obligations is considered while doing a lender's threat assessment. Traditionally, it refers to the concern that the borrower may not be able to collect the sequence and interest. The challenges in lenders' threat assessment are a lack of adequate data storage and retrieval, problematic delays caused by a lack of access to the relevant data at the right time, extended lead times that lead their shipments at risk, and demand for speedier deliveries. This paper introduces a machine learning-based linear regression algorithm (ML-LRA) for supplier credit risk (SCR) assessment based on supply chain management (SCM) in credit risk frameworks that depend significantly on modeling ML. Regression models are logistical constraints that can be used to simulate the impacts of multiple variables on a customer's creditworthiness. The chain of distribution forecasting tool assesses specific decisions based on assumptions in variability. As a result of the findings in this study, it can be assumed that ML-LR approaches have a significant role in a variety of business processes such as supplier selection, risk prediction along with the supply chain, and demand and sales estimation. Finally, the study's consequences for the most critical constraints and obstacles are examined to enhance the supply chain management system and ensure overall system sustainability.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "c06826f71368a38b83f7478e45fd4dbf",
    "relevant_keywords": [
      "machine learning",
      "regression",
      "neural network",
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T02:04:19.993790"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用机器学习算法进行供应商信用风险评估，这直接关联到金融风险管理中的信用风险分析。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是使用机器学习算法进行供应商信用风险评估，这直接关联到金融风险管理中的信用风险分析。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:48:23.696033"
}