{
  "paper": {
    "id": 2098,
    "title": "A real time clustering and SVM based price-volatility prediction for optimal trading strategy",
    "abstract": "Financial return on investments and movement of market indicators are fraught with uncertainties and a highly volatile environment that exists in the global market. Equity markets are heavily affected by market unpredictability and maintaining a healthy diversified portfolio with minimum risk is undoubtedly crucial for any investment made in such assets. Effective price and volatility prediction can highly influence the course of the investment strategy with regard to such a portfolio of equity instruments. In this paper a novel SOM based hybrid clustering technique is integrated with support vector regression for portfolio selection and accurate price and volatility predictions which becomes the basis for the particular trading strategy adopted for the portfolio. The research considers the top 102 stocks of the NSE stock market (India) to identify set of best portfolios that an investor can maintain for risk reduction and high profitability. Short term stock trading strategy and performance indicators are developed to assess the validity of the predictions with regard to actual scenarios. (C) 2013 Elsevier B.V. All rights reserved.",
    "year": 2014,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "aaad87ba29fa15452cca3c36c76abd58",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "unsupervised learning",
      "regression",
      "support vector machine",
      "SVM",
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T02:10:59.087360"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是使用SOM聚类和支持向量回归进行价格和波动性预测，目的是为了优化投资组合选择和交易策略，这直接应用于投资组合管理领域。论文明确提到目标是识别最佳投资组合以降低风险并提高盈利能力，属于投资组合管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是使用SOM聚类和支持向量回归进行价格和波动性预测，目的是为了优化投资组合选择和交易策略，这直接应用于投资组合管理领域。论文明确提到目标是识别最佳投资组合以降低风险并提高盈利能力，属于投资组合管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:44:24.233753"
}