{
  "paper": {
    "id": 1591,
    "title": "Go/No-Go Decision Model for Owners Using Exhaustive CHAID and QUEST Decision Tree Algorithms",
    "abstract": "Go/no-go execution decisions are one of the most important strategic decisions for owners during the early stages of construction projects. Restructuring the process of decision-making during these early stages may have sustainable results in the long run. The purpose of this paper is to establish proper go/no-go decision-tree models for owners. The decision-tree models were developed using Exhaustive Chi-square Automatic Interaction Detector (Exhaustive CHAID) and Quick, Unbiased, Efficient Statistical Tree (QUEST) algorithms. Twenty-three go/no-go key factors were collected through an extensive literature review. These factors were divided into four main risk categories: organizational, project/technical, legal, and financial/economic. In a questionnaire distributed among the construction professionals, the go/no-go variables were asked to be ranked according to their perceived significance. Split-sample validation was applied for testing and measuring the accuracy of the Exhaustive CHAID and QUEST models. Moreover, Spearman's rank correlation and analysis of variance (ANOVA) tests were employed to identify the statistical features of the 100 responses received. The result of this study benchmarks the current assessment models and develops a simple and user-friendly decision model for owners. The model is expected to evaluate anticipated risk factors in the project and reduce the level of uncertainty. The Exhaustive CHAID and QUEST models are validated by a case study. This paper contributes to the current body of knowledge by identifying the factors that have the biggest effect on an owner's decision and introducing Exhaustive CHAID and QUEST decision-tree models for go/no-go decisions for the first time, to the best of the authors' knowledge. From the sustainability viewpoint, this study is significant since the decisions of the owner, based on a rigorous model, will yield sustainable and efficient projects.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "122c3c6f7a4297416e596097588aa76c",
    "relevant_keywords": [
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T02:05:08.207211"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是建筑项目中业主的决策模型，虽然涉及金融/经济风险因素，但其核心应用领域是建筑项目管理而非特定的金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是建筑项目中业主的决策模型，虽然涉及金融/经济风险因素，但其核心应用领域是建筑项目管理而非特定的金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:47:56.793593"
}