{
  "paper": {
    "id": 3266,
    "title": "Composite forecasting approach, application for next-day electricity price forecasting",
    "abstract": "Accurate forecasting of electricity prices can provide significant benefits to energy suppliers when allocating their assets and to energy consumers for defining an optimal portfolio. There are numerous methods that efficiently support the forecasting of time series, such as electricity prices, which have high volatility. However, the performance of these approaches varies depending on data sets and operational conditions. In this work, the concept of composite forecasting is presented and implemented in a retrospective study, in real industrial forecasting conditions to show the potential of forecast performance improvement and comparable high consistency of a forecast performance across different 'Day Peak' and-Day Base' electricity price data sets for different seasons. As individual methods support vector regression, artificial neural networks and ridge regression are implemented. The forecast performances of these methods are evaluated and compared with their forecast combination using different error measures. The results show that composite forecasting processes with 'inverse root mean squared error' combination approach can generate, on average, a more accurate and robust forecast than using an individual methods or other combination schemas. (C) 2017 Elsevier B.V. All rights reserved.",
    "year": 2017,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "d4a1c39e69c5d6a822b573c770dee556",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "regression",
      "support vector machine",
      "SVM",
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T01:15:26.125815"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究电力价格的预测方法，虽然提到了资产分配和投资组合优化，但其核心技术和应用场景集中在能源市场的价格预测，并未直接涉及衍生品定价、金融风险管理或投资组合管理等金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究电力价格的预测方法，虽然提到了资产分配和投资组合优化，但其核心技术和应用场景集中在能源市场的价格预测，并未直接涉及衍生品定价、金融风险管理或投资组合管理等金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:10:30.230869"
}