{
  "paper": {
    "id": 1205,
    "title": "Firm-level climate change risk and adoption of ESG practices: a machine learning prediction",
    "abstract": "PurposeBy combining the notion of prospect theory with advanced machine learning algorithms, this study aims to predict whether financial institutions (FIs) adopt a reactive stance when they perceive climate change as a risk, consequently leading to the adoption of environmental, social and governance (ESG) practices to avoid this risk. Prospect theory assumes that decision-makers react quickly when decisions are framed as a risk or threat rather than as an opportunity.Design/methodology/approachWe used a sample of 168 FIs across 27 countries and seven regions over the period 2003-2020. To conduct our empirical investigation, we compared the prediction accuracy of various machine learning algorithms.FindingsOur findings suggest that out of 12 machine learning algorithms, AdaBoost, Gradient Boosting and XGBoost have the most precision in predicting whether FIs react to climate change risk in adopting ESG practices. This study also tested the overall climate change risk and risks associated with physical, opportunity and regulatory shocks of climate change. We observed that risks associated with physical and regulatory shocks significantly impact the adoption of ESG practices, supporting prospect theory predictions.Practical implicationsThe insights of this study provide important implications for policymakers. Specifically, policymakers must take into account the risk posed by climate change in the corporate decision-making process, as it directly influences a firm's adoption of corporate actions (ESG practices).Originality/valueTo the best of our knowledge, this is the first study to investigate the firm-level climate change risk and adoption of ESG practices from a prospect theory perspective using novel machine learning algorithms.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "8285d9f8d1a889ae20f7c5f94dd545ef",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T01:59:56.388503"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究金融机构如何应对气候变化风险并采纳ESG实践，虽然涉及金融领域，但其核心技术是机器学习预测，并未直接应用于衍生品定价、金融风险管理或投资组合管理等特定金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究金融机构如何应对气候变化风险并采纳ESG实践，虽然涉及金融领域，但其核心技术是机器学习预测，并未直接应用于衍生品定价、金融风险管理或投资组合管理等特定金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:50:56.566563"
}