{
  "paper": {
    "id": 3902,
    "title": "Controlling the in-service welding parameters for T-shape steel pipes using neural network",
    "abstract": "One of the most common practices in petrochemical and power generation industries is in-service welding, and the possibility of a catastrophic event known as burn-through in this process may lead to financial or even human losses. To reduce the risk of burn-through, it is necessary to simulate the process and study the effects of controlling parameters. In this paper; firstly, a finite element based numerical model is developed using a model updating method and experimental data. The model is employed to simulate the in-service welding of a T-shape steel pipe connection. Then, the effects of the main parameters on this process such as heat input, welding speed, pipe thickness, fluid flow and especially material properties are investigated. Finally, the experimental data together with a large set of results produced by the numerical simulation are used to compose a user-friendly computer code based on the neural network algorithms to predict the temperature levels in the critical points for different welding conditions. The output of this code can be used in the industrial environment to prevent burn-through accidents during the in-service welding.",
    "year": 2019,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "355e1d41fbb888c8faf9867875dba225",
    "relevant_keywords": [
      "neural network",
      "deep learning",
      "backpropagation",
      "BP"
    ],
    "stage1_timestamp": "2025-05-15T02:30:58.384875"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究在役焊接过程中参数控制的神经网络应用，以防止烧穿事故，其核心技术和应用场景属于工业工程领域，与金融研究领域无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究在役焊接过程中参数控制的神经网络应用，以防止烧穿事故，其核心技术和应用场景属于工业工程领域，与金融研究领域无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:34:44.989983"
}