{
  "paper": {
    "id": 338,
    "title": "Mean-variance portfolio optimization with deep learning based-forecasts for cointegrated stocks",
    "abstract": "Most mean-variance (MV) models construct a portfolio based on nonstationary stocks. This study presents a new MV model constructed using stationary portfolios composed of cointegrated stocks. The expected return of this new model is predicted by using machine learning models, such as support vector machine, random forest, and attention-based long short-term memory (LSTM) network. The proposed model is evaluated using data on stocks in the CSI 300 and the S&P 500, with 42 features over 8 years from May 4, 2012 to August 4, 2020. The empirical results show that the portfolio constructed based on the stationary portfolios in both the Chinese and the US stock markets delivers significant profits. Further, the attention-based LSTM network can more accurately model the spread return using technical indicators, financial investment information, and lagged returns, and can successfully select pairs of cointegrated stocks for constructing a more profitable MV portfolio, than can conventional machine learning models. Using the attention-based LSTM to predict 20-day return movement results in model accuracy of up to 92.59% for the CSI 300 and 88.52% for the S&P 500, and a corresponding Sharpe ratio of 9.31 and 2.77, respectively.",
    "year": 2022,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "5e87fa4fcb2744e934ae613ae8cf4082",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "support vector machine",
      "SVM",
      "neural network",
      "deep learning",
      "long short-term memory",
      "LSTM",
      "attention mechanism"
    ],
    "stage1_timestamp": "2025-05-15T00:42:00.511234"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是使用机器学习模型（如支持向量机、随机森林和基于注意力的LSTM网络）来预测协整股票的预期回报，并构建均值-方差（MV）投资组合。研究的主要目标是优化投资组合的构建和选择，以提高盈利能力，这直接属于投资组合管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是使用机器学习模型（如支持向量机、随机森林和基于注意力的LSTM网络）来预测协整股票的预期回报，并构建均值-方差（MV）投资组合。研究的主要目标是优化投资组合的构建和选择，以提高盈利能力，这直接属于投资组合管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:31:42.422315"
}