{
  "paper": {
    "id": 2158,
    "title": "Patient Cost-Sharing and Utilization of Breast Cancer Diagnostic Imaging by Patients Undergoing Subsequent Testing After a Screening Mammogram",
    "abstract": "IMPORTANCE Out-of-pocket costs (OOPCs) have been largely eliminated for screening mammography. However, patients still face OOPCs when undergoing subsequent diagnostic tests after the initial screening, which represents a potential barrier to those who require follow-up testing after initial testing. OBJECTIVE To examine the association between the degree of patient cost-sharing and the use of diagnostic breast cancer imaging after undergoing a screening mammogram. DESIGN, SETTING, AND PARTICIPANTS This retrospective cohort study used medical claims from Optum's deidentified Clinformatics Data Mart Database, a commercial claims database derived from a database of administrative health claims for members of large commercial and Medicare Advantage health plans. The large commercially insured cohort included female patients aged 40 years or older with no prior history of breast cancer undergoing a screening mammogram examination. Data were collected from January 1, 2015, to December 31, 2017, and analysis was conducted from January 2021 to September 2022. EXPOSURES A k-means clustering machine learning algorithm was used to classify patient insurance plans by dominant cost-sharing mechanism. Plan types were then ranked by OOPCs. MAIN OUTCOMES AND MEASURES A multivariable 2-part hurdle regression model was used to examine the association between patient OOPCs and the number and type of diagnostic breast services undergone by patients observed to undergo subsequent testing. RESULTS In our sample, 230845 women (220023 [95.3%] aged 40 to 64 years; 16810 [7.3%] Black, 16398 [7.1%] Hispanic, and 164702 [71.3%] White) underwent a screening mammogram in 2016. These patients were covered by 22828 distinct insurance plans associated with 6025741 enrollees and 44911473 distinct medical claims. Plans dominated by coinsurance were found to have the lowest mean (SD) OOPCs ($945 [$1456]), followed by balanced plans ($1017 [$1386]), plans dominated by copays ($1020 [$1408]), and plans dominated by deductibles ($1186 [$1522]). Women underwent significantly fewer subsequent breast imaging procedures in dominantly copay (24 [95% CI, 11-37] procedures per 1000 women) and dominantly deductible (16 [95% CI, 5-28] procedures per 1000 women) plans compared with coinsurance plans. Patients from all plan types underwent fewer breast magnetic resonance imaging (MRI) scans than patients in the lowest OOPC plan (balanced, 5 [95% CI, 2-12] MRIs per 1000 women; copay, 6 [95% CI, 3-6] MRI per 100 women; deductible, 6 [95% CI, 3-9] MRIs per 1000 women. CONCLUSIONS AND RELEVANCE Despite policies designed to remove financial barriers to access for breast cancer screening, significant financial barriers remain for women at risk of breast cancer.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "c5aa2f75a3f865c724d84c851c088e62",
    "relevant_keywords": [
      "machine learning",
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T02:11:40.639129"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究患者成本分担与乳腺癌诊断影像使用之间的关系，属于医疗健康领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究患者成本分担与乳腺癌诊断影像使用之间的关系，属于医疗健康领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:44:04.610297"
}