{
  "paper": {
    "id": 437,
    "title": "Deep Learning for Systemic Risk Measures",
    "abstract": "The aim of this paper is to study a new methodological framework for systemic risk measures by applying deep learning method as a tool to compute the optimal strategy of capital allocations. Under this new framework, systemic risk measures can be interpreted as the minimal amount of cash that secures the aggregated system by allocating capital to the single institutions before aggregating the individual risks. This problem has no explicit solution except in very limited situations. Deep learning is increasingly receiving attention in financial modelings and risk management and we propose our deep learning based algorithms to solve both the primal and dual problems of the risk measures, and thus to learn the fair risk allocations. In particular, our method for the dual problem involves the training philosophy inspired by the well-known Generative Adversarial Networks (GAN) approach and a newly designed direct estimation of Radon-Nikodym derivative. We close the paper with substantial numerical studies of the subject and provide interpretations of the risk allocations associated to the systemic risk measures. In the particular case of exponential preferences, numerical experiments demonstrate excellent performance of the proposed algorithm, when compared with the optimal explicit solution as a benchmark.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "deep learning",
    "cache_key": "2931e4f8f21742673a3d636118c6a87b",
    "relevant_keywords": [
      "deep learning",
      "neural network",
      "representation learning",
      "backpropagation",
      "BP",
      "hidden layer",
      "Generative Adversarial Networks",
      "GAN"
    ],
    "stage1_timestamp": "2025-05-15T01:38:17.379336"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on developing a deep learning framework for systemic risk measures and capital allocation strategies, which are core aspects of financial risk management. The study aims to compute optimal capital allocations to secure the aggregated financial system, a primary concern in risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on developing a deep learning framework for systemic risk measures and capital allocation strategies, which are core aspects of financial risk management. The study aims to compute optimal capital allocations to secure the aggregated financial system, a primary concern in risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:03:37.468111"
}