{
  "paper": {
    "id": 57,
    "title": "Credit risk assessment using the factorization machine model with feature interactions",
    "abstract": "The accuracy of credit risk evaluation is crucial for the profitability of any financial institution. The factorization machine is a widely available model that can effectively be utilized for classification or regression through appropriate feature transformation. In this article, we apply the factorization machine model to the field of credit risk assessment. Since some features of the credit risk assessment data are not numerical, one-hot encoding is used, resulting in sparse training data. However, the computational complexity of the factorization machine is polynomial. To illustrate the effectiveness of the factorization machine credit risk assessment model and compare its performance with other classification approaches such as logical regression, support vector machine, k-nearest neighbors, and artificial neural network, we conduct numerical experiments on four real-world credit risk evaluation datasets. The experimental results demonstrate that the proposed factorization machine credit risk assessment model achieves higher accuracy compared to other machine-learning models on real-world datasets and is computationally more efficient. Therefore, the factorization machine model can be considered as a suitable candidate for credit risk assessment.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "a26eae16ea70423d00e79261dd5f6820",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "regression",
      "support vector machine",
      "SVM",
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T01:46:03.909928"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on applying the factorization machine model to credit risk assessment, which is a key aspect of financial risk management. The study aims to improve the accuracy of credit risk evaluation, a critical component in managing financial risks for institutions.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on applying the factorization machine model to credit risk assessment, which is a key aspect of financial risk management. The study aims to improve the accuracy of credit risk evaluation, a critical component in managing financial risks for institutions.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:01:12.763171"
}