{
  "paper": {
    "id": 1574,
    "title": "The Association Between the Disclosure and the Realization of Information Security Risk Factors",
    "abstract": "Firms often disclose information security risk factors in public filings such as 10-K reports. The internal information associated with disclosures may be positive or negative. In this paper, we evaluate how the nature of the disclosed security risk factors, believed to represent the firm's internal information regarding information security, is associated with future breach announcements reported in the media. For this purpose, we build a decision tree model, which classifies the occurrence of future security breaches based on the textual contents of the disclosed security risk factors. The model is able to accurately associate disclosure characteristics with breach announcements about 77% of the time. We further explore the contents of the security risk factors using text-mining techniques to provide a richer interpretation of the results. The results show that the disclosed security risk factors with risk-mitigation themes are less likely to be related to future breach announcements. We also investigate how the market interprets the nature of information security risk factors in annual reports. We find that the market reaction following the security breach announcement is different depending on the nature of the preceding disclosure. Thus, our paper contributes to the literature in information security and sheds light on how market participants can better interpret security risk factors disclosed in financial reports at the time when financial reports are released.",
    "year": 2013,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "82c9957e400b094b329d34db3383cec7",
    "relevant_keywords": [
      "decision tree",
      "classification"
    ],
    "stage1_timestamp": "2025-05-15T02:05:08.114983"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究信息安全风险因素的披露与未来安全漏洞公告之间的关联，以及市场对这些披露的反应。虽然涉及风险因素，但其核心内容属于信息安全和市场反应分析，并未直接应用于衍生品定价、金融风险管理或投资组合管理等金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究信息安全风险因素的披露与未来安全漏洞公告之间的关联，以及市场对这些披露的反应。虽然涉及风险因素，但其核心内容属于信息安全和市场反应分析，并未直接应用于衍生品定价、金融风险管理或投资组合管理等金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:47:58.318509"
}