{
  "paper": {
    "id": 1121,
    "title": "RETRACTED: Decision support model of e-commerce enterprise investment based on deep learning algorithm (Retracted Article)",
    "abstract": "According to the current situation and future trend of e-commerce investment market research at home and abroad, combined with the established research objectives, this paper studies and analyzes the existing methods of investment quality evaluation. This paper puts forward the modeling idea of the evaluation index system of investment decision quality, and takes the deep neural network as the modeling tool and python as the simulation tool to complete the establishment of the investment decision support model of e-commerce listed companies and get the experimental results. In this paper, based on the deep learning portfolio replication algorithm, the features of the portfolio model are extracted by the automatic encoder to realize the portfolio replication. First, the definition of deep learning model and the framework of model training will be given. Then, a process of trestle automatic encoder model will be introduced, and then the detailed process of portfolio replication algorithm based on deep learning will be explained in detail. Finally, the trained model is used to evaluate the samples of the test set, and the results are good, which shows that the index evaluation system is feasible and effective.",
    "year": 2023,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "7eaa3ed6f5796241ce2509937c0887cb",
    "relevant_keywords": [
      "deep learning",
      "neural network",
      "autoencoder",
      "representation learning",
      "feature learning",
      "feature representation"
    ],
    "stage1_timestamp": "2025-05-15T00:52:00.364537"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是基于深度学习的投资组合复制算法，旨在通过自动编码器提取投资组合模型的特征，实现投资组合的复制。这直接应用于投资组合管理领域，而非衍生品定价或金融风险管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是基于深度学习的投资组合复制算法，旨在通过自动编码器提取投资组合模型的特征，实现投资组合的复制。这直接应用于投资组合管理领域，而非衍生品定价或金融风险管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:24:00.714648"
}