{
  "paper": {
    "id": 2219,
    "title": "Leveraging momentum clustering and PID control for enhanced portfolio management",
    "abstract": "Efficient wealth management in dynamic financial environments is crucial for maximizing returns and mitigating risk. Therefore, this study presents an adaptive portfolio management strategy that combines momentum-based clustering, a Proportional-Integration-Derivative (PID) controller, and efficient frontier (EF) analysis to construct optimal portfolios in dynamic financial environments. A novel integration of a PID controller dynamically adjusts the asset weights to address the limitations of static optimization methods. EF analysis is then employed to identify portfolios with optimal risk-return trade-offs. Our dynamic strategy demonstrates competitive performance compared to conventional benchmarks. From 2017 to 2023, the approach yielded a cumulative return of 135.5%, surpassing Standard and Poor's 500 (46.66%), Russell's 2000 Index (11.47%) and NASDAQ (67.88%). These findings suggest that the integration of clustering techniques and PID controllers offers a promising approach for portfolio management. IMPACT STATEMENTThis research presents a novel framework integrating momentum clustering and PIDcontrol into portfolio management, leveraging a decade of S&P 500 stock data. Bycombining technical indicators, rolling factor betas, and dynamic optimization, thestrategy demonstrates superior adaptability to varying market conditions. The incorp-oration of advanced metrics, such as Sharpe and Sortino ratios, and efficient frontiermodeling ensures rigorous evaluation of performance. This approach outperforms tra-ditional benchmarks like the S&P 500 and DJIA and provides a scalable and robustsolution for achieving optimal risk-adjusted returns. The findings contribute signifi-cantly to the fields of quantitative finance and algorithmic trading by offering a meth-odology that bridges static optimization with real-time adaptability, addressing thechallenges of economic cyclicality and market volatility.",
    "year": 2025,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "3f1204493ce74fc96f0b3bbe9cc1f2d3",
    "relevant_keywords": [
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T02:12:50.952910"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是结合动量聚类和PID控制器来优化投资组合的构建和动态调整，旨在实现最优的风险-回报权衡，这直接属于投资组合管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是结合动量聚类和PID控制器来优化投资组合的构建和动态调整，旨在实现最优的风险-回报权衡，这直接属于投资组合管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:43:41.671328"
}