{
  "paper": {
    "id": 4898,
    "title": "Sparse estimation within Pearson's system, with an application to financial market risk",
    "abstract": "Pearson's system is a rich class of models that includes many classical univariate distributions. It comprises all continuous densities whose logarithmic derivative can be expressed as a ratio of quadratic polynomials governed by a vector beta of coefficients. The estimation of a Pearson density is challenging, as small variations in beta can induce wild changes in the shape of the corresponding density f beta. The authors show how to estimate beta and f beta effectively through a penalized likelihood procedure involving differential regularization. The approach combines a penalized regression method and a profiled estimation technique. Simulations and an illustration with S & P 500 data suggest that the proposed method can improve market risk assessment substantially through value-at-risk and expected shortfall estimates that outperform those currently used by financial institutions and regulators.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "8365a8db68e5a742eb8dd7ef7becf28f",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:42:04.908890"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on improving market risk assessment through value-at-risk and expected shortfall estimates, which are key components of financial risk management. The application to S&P 500 data further supports its relevance to this domain.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on improving market risk assessment through value-at-risk and expected shortfall estimates, which are key components of financial risk management. The application to S&P 500 data further supports its relevance to this domain.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:31:32.920775"
}