{
  "paper": {
    "id": 2796,
    "title": "Superquantile regression with applications to buffered reliability, uncertainty quantification, and conditional value-at-risk",
    "abstract": "The paper presents a generalized regression technique centered on a superquantile (also called conditional value-at-risk) that is consistent with that coherent measure of risk and yields more conservatively fitted curves than classical least-squares and quantile regression. In contrast to other generalized regression techniques that approximate conditional superquantiles by various combinations of conditional quantiles, we directly and in perfect analog to classical regression obtain superquantile regression functions as optimal solutions of certain error minimization problems. We show the existence and possible uniqueness of regression functions, discuss the stability of regression functions under perturbations and approximation of the underlying data, and propose an extension of the coefficient of determination R-squared for assessing the goodness of fit. The paper presents two numerical methods for solving the error minimization problems and illustrates the methodology in several numerical examples in the areas of uncertainty quantification, reliability engineering, and financial risk management. Published by Elsevier B.V.",
    "year": 2014,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "53fd1ae3271a33717943d0b166ed0577",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:19:08.475417"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on superquantile regression, which is directly related to conditional value-at-risk (CVaR), a key concept in financial risk management. The methodology is illustrated in financial risk management applications, indicating its primary relevance to this field.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on superquantile regression, which is directly related to conditional value-at-risk (CVaR), a key concept in financial risk management. The methodology is illustrated in financial risk management applications, indicating its primary relevance to this field.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:40:08.878183"
}