{
  "paper": {
    "id": 5,
    "title": "Multiagent-based deep reinforcement learning framework for multi-asset adaptive trading and portfolio management",
    "abstract": "The highly dynamic nature of stock markets has motivated researchers to propose various supervised learning models to assist investors to optimize financial performance. Machine learning models have been used to predict price trends, and approaches have been proposed for portfolio management. However, these studies focus on only one kind of financial issue, and the methods proposed exhibit poor generalizability. We address these problems with a multi-agent portfolio adaptive trading framework based on reinforcement learning to create an automated trading system with the best trading strategy that can be achieved by long-short situation judgment and adaptive capital allocation. We use the TD3 algorithm in the multi-agent algorithm to mitigate the overestimation and overfitting exhibited by traditional value functions and improve training stability. Experimental results show that the proposed framework outperforms single-agent reinforcement learning algorithms while achieving more stable returns.",
    "year": 2024,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "4e30460998406d6a3ce55abf31927ede",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "reinforcement learning",
      "deep learning",
      "neural network",
      "representation learning"
    ],
    "stage1_timestamp": "2025-05-15T00:38:16.204905"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是基于多智能体深度强化学习的框架，用于多资产自适应交易和投资组合管理。论文明确提到其目标是创建一个自动化交易系统，通过长短情况判断和自适应资本分配来实现最佳交易策略，这直接属于投资组合管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是基于多智能体深度强化学习的框架，用于多资产自适应交易和投资组合管理。论文明确提到其目标是创建一个自动化交易系统，通过长短情况判断和自适应资本分配来实现最佳交易策略，这直接属于投资组合管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:34:28.578651"
}