{
  "paper": {
    "id": 537,
    "title": "A new financial risk prediction model based on deep learning and quasi-oppositional coot algorithm",
    "abstract": "Incorporating ground-breaking technologies such as deep learning (DL) has revolutionized predictive modelling in the rapidly evolving landscape of the finance sector. DL approaches, capable of extracting complex patterns from vast data collections, become an efficient approach for predicting financial trends. By integrating the complex neural network architecture with comprehensive datasets, including investor sentiment, market indicators, and economic variables, finance experts have introduced prediction models well known for their ability to capture the nuanced dynamics of financial markets with remarkable performance. Incorporating DL approaches within the finance sector provided the basis for more informed decision-making, enabling institutions, investors, and analysts to capitalize on emerging opportunities with greater confidence and precision and navigate market volatility. This study develops a novel quasi-oppositional coot algorithm with a deep learningbased predictive method on the financial sector (QOCODL-PMFC) technique. The QOCODL-PMFC technique aims to perform a prediction process on the financial sector. The QOCODL-PMFC method applies min-max normalization to measure the input dataset into a meaningful format to achieve this. Next, the QOCODL-PMFC method designs the QOCO technique for selecting an optimal set of features. The QOCODL-PMFC technique applies the attention bidirectional gated recurrent unit (ABiGRU) model for the prediction process. The Harris Hawks Optimization (HHO) model is utilized to boost the performance of the ABiGRU network. The simulation evaluation of the QOCODL-PMFC technique is tested under a benchmark finance dataset. The experimental values of the QOCODL-PMFC technique exhibit a minimal MSE of 0.7452 over other models.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "deep learning",
    "cache_key": "1a086520da2ea3cf5392b49780775542",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "neural network",
      "representation learning",
      "backpropagation",
      "hidden layer",
      "recurrent neural network",
      "long short-term memory",
      "LSTM",
      "attention mechanism"
    ],
    "stage1_timestamp": "2025-05-15T01:39:38.264555"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是开发一种基于深度学习和优化算法的金融风险预测模型（QOCODL-PMFC），旨在通过分析市场指标、投资者情绪和经济变量等数据来预测金融趋势和应对市场波动，这直接属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是开发一种基于深度学习和优化算法的金融风险预测模型（QOCODL-PMFC），旨在通过分析市场指标、投资者情绪和经济变量等数据来预测金融趋势和应对市场波动，这直接属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:02:49.770311"
}