{
  "paper": {
    "id": 2767,
    "title": "A synthetic factor approach to the estimation of value-at-risk of a portfolio of interest rate swaps",
    "abstract": "In this paper we decompose the interest rate swap yield curves of 10 major currencies into their common factors and find that the first two factors, interpreted as parallel shift and rotation, explain between 97.1% and 98.6% of the variation in the interest rate swap rates across all 10 currencies. The main contribution of the paper however is that we then model these two factors as simplified synthetic factors so that they may be used to develop an innovative approach to the computation of Value-at-Risk (VaR) for a portfolio of interest rate swaps. (C) 2000 Elsevier Science B.V. All rights reserved. JEL classification: G13; G15; G21; G28.",
    "year": 2000,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "47837367daaa36924c1a7025c4905ad0",
    "relevant_keywords": [
      "principal components analysis"
    ],
    "stage1_timestamp": "2025-05-15T01:10:16.488938"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on developing an innovative approach to compute Value-at-Risk (VaR) for a portfolio of interest rate swaps, which is a key technique in financial risk management. The use of principal components analysis to model factors affecting swap rates is directly applied to risk assessment rather than pricing or portfolio construction.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on developing an innovative approach to compute Value-at-Risk (VaR) for a portfolio of interest rate swaps, which is a key technique in financial risk management. The use of principal components analysis to model factors affecting swap rates is directly applied to risk assessment rather than pricing or portfolio construction.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:13:11.865004"
}