{
  "paper": {
    "id": 2270,
    "title": "The application of neural network model in predicting the future trend of an individual stock-taking Taiwan Stock Market for example",
    "abstract": "How to effectively anticipate the correct future trends of the stock market are the most important job and critical issue to solve for the investors. Many the stock investors sometimes endure huge losses Caused by the rapid upturn or downturn trends in a short period of time due to the their wrong anticipation. The purpose of the research is to use the data, gathered before the stock having a big raise or decline, to predict the future trend of an individual stock, and try to reduce the risk in the investment. In this Study, we Will try to apply the technology of Neural Network to Taiwan's stock market within the period of time from Jan 1990 to Feb 2008 to observe those stocks whose prices had over 150% fluctuations on the market, and build Lip models according to the financial basic data and closing prices gathered 180 (lays before the individual stock hit the big Upturn (or downturn) to predict its future direction. Finally, We Will use the average revenue to evaluate the effects. The experiment result has shown that the average revenue calculated by the Neural Network is higher than the average market earnings.",
    "year": 2008,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "d28623cdd50cc8a569401cca43a0fadc",
    "relevant_keywords": [
      "machine learning",
      "neural network",
      "deep learning",
      "backpropagation",
      "BP",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T02:13:31.746431"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究使用神经网络模型预测个股的未来趋势，目的是帮助投资者减少投资风险。虽然涉及金融领域，但并未明确属于衍生品定价、金融风险管理或投资组合管理中的任何一个特定领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究使用神经网络模型预测个股的未来趋势，目的是帮助投资者减少投资风险。虽然涉及金融领域，但并未明确属于衍生品定价、金融风险管理或投资组合管理中的任何一个特定领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:43:21.339398"
}