{
  "paper": {
    "id": 3169,
    "title": "Pan-African banks, banking interconnectivity: A new systemic risk measure in the WAEMU",
    "abstract": "This paper examines the existence of potential systemic risk in the banking sector of the West African Economic and Monetary Union (WAEMU) by using hand-collected bank-level data from all WAEMU countries for 2000-2017. One original aspect of our paper is the estimation of probabilities of default, in conjunction with the CIMDO method (Consistent Information Multivariate Density Optimizing) and the use of clustering techniques. We find that most of the banks have a very low probability of default, but there is a high joint probability of default for most pairs of banks. Therefore, there are seeds of systemic risk in the WAEMU: if the financial strength of large banking groups deteriorates, there could be contagion effects that could weaken the union. The use of quantile estimation has helped to determine banks' characteristics that may explain the systemic risk.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "bd342cdd3e66277e51b28295188a19e1",
    "relevant_keywords": [
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T02:23:33.498375"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on estimating probabilities of default and assessing systemic risk in the banking sector of the WAEMU, which are key aspects of financial risk management. The use of clustering techniques and the CIMDO method to analyze joint probabilities of default and potential contagion effects further supports its application in this domain.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on estimating probabilities of default and assessing systemic risk in the banking sector of the WAEMU, which are key aspects of financial risk management. The use of clustering techniques and the CIMDO method to analyze joint probabilities of default and potential contagion effects further supports its application in this domain.\"\n}\n```"
  },
  "timestamp": "2025-05-20T14:22:34.604380"
}