{
  "paper": {
    "id": 6320,
    "title": "Analysis and Classification of SQL Injection Vulnerabilities and Attacks on Web Applications",
    "abstract": "Web applications interact with the back-end database to retrieve data as and when requested by the user. Web applications (Like e-commerce, banking, shopping, trading, blogs etc.) are the backbone of today's online business industry. For activities like paying of bills & merchandize information must be kept safe with these web applications but unfortunately there is no guarantee of integrity and confidentially of information. The global exposure of these applications makes them prone to the attacks because of presence of vulnerabilities. These security vulnerabilities continue to infect the web applications through injection attacks. SQL injection attacks (SQLIA's) are one of the top most threat in database centric web application and SQL injections vulnerabilities(SQLIV's) are the most serious Vulnerability types. SQLIA allows the attacker to gain control over the database of an application resulting in financial fraud, Leak of confidential data, network hacking, deleting database, theft and many more to count. In this paper we have discussed the classification of SQL injection attacks and also analysis is done on basis of risk associated with each attack.",
    "year": 2014,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "f5d047fee9467dab935742f066fe3894",
    "relevant_keywords": [
      "classification"
    ],
    "stage1_timestamp": "2025-05-15T02:57:07.666236"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要讨论SQL注入攻击的分类和分析，其核心内容是网络安全和数据库安全，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要讨论SQL注入攻击的分类和分析，其核心内容是网络安全和数据库安全，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:27:55.226778"
}