{
  "paper": {
    "id": 493,
    "title": "Research on measurement of supply chain finance credit risk based on Internet of Things",
    "abstract": "This article first expounds the concept of supply chain finance and its credit risk, describes the hierarchical structure of the Internet of Things and its key technologies, and combines the unique functions of the Internet of Things technology and the business process of the inventory pledge financing model to design the supply chain financial model based on the Internet of Things. Then it studies the credit risk assessment under the supply chain financial model based on the Internet of Things, and uses the support vector machine algorithm and Logistic regression method to establish a credit risk measurement model considering the subject rating and debt rating. Finally, an example analysis shows that the credit risk measurement model has a high accuracy rate for determining whether small and medium-sized enterprises in the supply chain financial model based on the Internet of Things are trustworthy. This will facilitate the revision and improvement of the existing credit evaluation system and improve the accuracy of measuring the current financial risk of supply chain. This research adopts the Internet of Things to measure financial credit risk in supply chain and provides a reference for the following researches.",
    "year": 2019,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "0c36d35e42cdb0cd2352c5b426ca4eac",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "regression",
      "support vector machine",
      "SVM"
    ],
    "stage1_timestamp": "2025-05-15T01:51:31.301062"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心研究是基于物联网技术的供应链金融信用风险评估，使用支持向量机算法和Logistic回归方法建立信用风险测量模型，这直接涉及金融风险管理中的信用风险测量和评估。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心研究是基于物联网技术的供应链金融信用风险评估，使用支持向量机算法和Logistic回归方法建立信用风险测量模型，这直接涉及金融风险管理中的信用风险测量和评估。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:57:37.088192"
}