{
  "paper": {
    "id": 1880,
    "title": "A novel methodology for perception-based portfolio management",
    "abstract": "Selecting and investing in stock market with right proportions is one of the major challenges. Majority of the investors end up losing their invested equity capital due to uncertainty in the market. The present study provides a novel framework for novice investors to construct portfolio based on multicriteria decision making techniques under fuzzy environment. The scores obtained from these techniques were used to introduce two non-dimensional parameters for categorization of risky and non-risky assets. Three perceptions portfolios were constructed based on the proposed non-dimensional parameters along with fractional lion clustering algorithm. In order to demonstrate the proposed framework, an illustrative application is included in equity portfolio selection. The returns and risks of these perception based portfolios are compared to major Index funds for validating the efficiency and are found to overpower the Index funds with significant margins by maintaining the risk comparable to Index funds. Further, Markowitz based efficient frontier is plotted for better understanding of optimal returns and risk for perception based investment.",
    "year": 2022,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "10bbcd1bfd46a91ed2b74195abb95ae9",
    "relevant_keywords": [
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T01:00:27.428814"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文提出了一种基于多准则决策技术和模糊环境的新颖框架，用于构建投资组合，并比较了基于感知的投资组合与主要指数基金的回报和风险。这直接涉及投资组合管理的核心问题，即资产选择和风险回报优化。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文提出了一种基于多准则决策技术和模糊环境的新颖框架，用于构建投资组合，并比较了基于感知的投资组合与主要指数基金的回报和风险。这直接涉及投资组合管理的核心问题，即资产选择和风险回报优化。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:18:19.289023"
}