{
  "paper": {
    "id": 575,
    "title": "Explainable Model of Credit Risk Assessment Based on Convolutional Neural Networks",
    "abstract": "Credit Risk Assessment estimates the probability of loss due to a borrower's failure to repay a loan or credit. Therefore, one of the principal challenges of financial institutions is to lower the losses generated by leading financial resources to possible default clients. Current models for Credit Risk Assessment used by the industry are based on Logistic regression (LR), thanks to their operational efficiency and interpretability. However, Deep Learning (DL) Algorithms have become more attractive than conventional Machine Learning due to their best general accuracy. However, Models for Credit Risk Assessment based on DL have a problem because their complexity makes them difficult for humans to interpret. Additionally, international regulations for financial institutions require that models be interpretable. In this work, we propose the use of a model based on Convolutional Neural Networks (CNN) and SHapley Additive exPlanations (SHAP) to generate a more accurate and explainable model than LR models. In order to demonstrate its efficacy, we use four datasets commonly used to benchmark classification algorithms for credit scoring. The results show that the method proposed is more accurate than LR for large datasets (more than 5900 samples), with an improvement in accuracy up to 12.3%.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "cc993ffc71f0878d83c015afab5c7554",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "neural network",
      "deep learning",
      "convolutional neural network",
      "CNN"
    ],
    "stage1_timestamp": "2025-05-15T01:52:49.410307"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用卷积神经网络和SHAP方法进行信用风险评估，这直接关系到金融机构对信用风险的管理和控制，属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"该论文的核心技术是使用卷积神经网络和SHAP方法进行信用风险评估，这直接关系到金融机构对信用风险的管理和控制，属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:56:41.754968"
}