{
  "paper": {
    "id": 426,
    "title": "Design and Research of Accounting Automation Management System Based on Swarm Intelligence Algorithm and Deep Learning",
    "abstract": "the current research, the application verification of traditional algorithms in actual accounting management is insufficient, and deep learning data processing capabilities need to be fully optimized in complex accounting scenarios. Given the challenges of efficiency and accuracy faced by the current accounting industry in the context of big data, this study creatively combines the swarm intelligence algorithm and deep learning technology to design and implement an efficient and accurate accounting automation management system. The research aims to investigate the potential of swarm intelligence algorithms and deep learning techniques in developing an automated accounting management system, with a focus on improving efficiency, accuracy, and scalability. Key research questions include exploring the optimal configuration of swarm intelligence algorithms for accounting tasks and assessing the performance of deep learning models in automating various accounting processes. Through experimental verification, the system is tested with the financial data of a large enterprise for three consecutive years. The results show that the system can significantly shorten the time of financial statement generation by 65%, reduce the error rate to less than 0.5%, and increase the accuracy of abnormal data recognition by as much as 90%. These data not only reflect the significant improvement of the efficiency and accuracy of the system but also prove its great potential in early warning of financial risk, providing intelligent and automated solutions for the accounting industry.",
    "year": 2025,
    "source": "WOS",
    "area": "financial_risk",
    "method": "deep learning",
    "cache_key": "fb35fab79295297c3f81bf6a51ad059e",
    "relevant_keywords": [
      "deep learning",
      "neural network",
      "representation learning",
      "backpropagation",
      "BP",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T01:38:17.322345"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究会计自动化管理系统，虽然提到了财务风险预警，但其核心技术（群体智能算法和深度学习）主要应用于会计流程的自动化和优化，而非衍生品定价、金融风险管理或投资组合管理等特定金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究会计自动化管理系统，虽然提到了财务风险预警，但其核心技术（群体智能算法和深度学习）主要应用于会计流程的自动化和优化，而非衍生品定价、金融风险管理或投资组合管理等特定金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:03:37.987967"
}