{
  "paper": {
    "id": 9170,
    "title": "A NOVEL METHOD FOR EARLY DIAGNOSIS OF ALZHEIMER'S DISEASE BASED ON PSEUDO ZERNIKE MOMENT FROM STRUCTURAL MRI",
    "abstract": "Alzheimer's disease (AD) is a progressive neurodegenerative disorder and the most common type of dementia among older people. The number of patients with AD will grow rapidly each year and AD is the fifth leading cause of death for those aged 65 and older. In recent years, one of the main challenges for medical investigators has been the early diagnosis of patients with AD because an early diagnosis can provide greater opportunities for patients to be eligible for more clinical trials and they will have enough time to plan for future, medical and financial decisions. An established risk factor for AD is mild cognitive impairment (MCI) which is described as a transitional state between normal aging and AD patients. Hence an accurate and reliable diagnosis of MCI can be very effective and helpful for early diagnosis of AD. Therefore in this paper we present a novel and efficient method based on pseudo Zernike moments (PZMs) for the diagnosis of MCI individuals from AD and healthy control (HC) groups using structural MRI. The proposed method uses PZMs to extract discriminative information from the MR images of the AD, MCI, and HC groups. Two types of artificial neural networks, which are based on pattern recognition and learning vector quantization (LVQ) networks, were used to classify the information extracted from the MRIs. We worked with 500 MRIs from the database of the Alzheimer's Disease Neuroimaging Initiative (ADNI 1 1.5T). The 1 slice of 500 MRIs used in this study included 180 AD patients, 172 MCI patients, and 148 HC individuals. We selected 50 percent of the MRIs randomly for use in training the classifiers, 25 percent for validation and we used 25 percent for the testing phase. The technique proposed here yielded the best overall classification results between AD and MCI (accuracy 94.88%, sensitivity 94.18%, and specificity 95.55%), and for pairs of the MCI and HC (accuracy 95.59%, sensitivity 95.89% and specificity 95.34%). These results were achieved using maximum order 30 of PZM and the pattern recognition network with the scaled conjugate gradient (SCG) back-propagation training algorithm as a classifier. (C) 2015 IBRO. Published by Elsevier Ltd. All rights reserved.",
    "year": 2015,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "ba4e2320a4f4a7679a9f0658cc999fe6",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "neural network",
      "backpropagation",
      "BP"
    ],
    "stage1_timestamp": "2025-05-15T03:26:25.901194"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究基于伪Zernike矩和人工神经网络的阿尔茨海默病早期诊断方法，其核心技术应用于医学影像分析和疾病诊断，与金融领域无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究基于伪Zernike矩和人工神经网络的阿尔茨海默病早期诊断方法，其核心技术应用于医学影像分析和疾病诊断，与金融领域无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:25:12.494340"
}