{
  "paper": {
    "id": 46,
    "title": "Systemic Financial Risk Forecasting with Decomposition-Clustering-Ensemble Learning Approach: Evidence from China",
    "abstract": "Establishing a scientifically effective systemic financial risk early warning model is of great significance for prudently mitigating systemic financial risks and enhancing the efficiency of financial supervision. Based on the measurement of systemic financial risk and the network sentiment index of 47 financial institutions, this study adopted the decomposition-reconstruction-integration approach, utilizing techniques such as extreme-point symmetric empirical mode decomposition (ESMD), empirical mode decomposition (EMD), variational mode decomposition (VMD), hierarchical clustering, fast independent component analysis (FastICA), attention mechanism, bidirectional long short-term memory neural network (BiLSTM), support vector regression (SVR), and their combination, to construct a systemic financial risk prediction model. The empirical results demonstrate that decomposing and reconstructing relevant indicators before predicting systemic financial risks can enhance prediction accuracy. Among the proposed models, the ESMD-HFastICA-BiLSTM-Attention model exhibits superior performance in systemic financial risk early warning.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "5107596405f5bbbc26384815b5f4465b",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "unsupervised learning",
      "regression",
      "support vector machine",
      "SVM",
      "clustering",
      "principal components analysis",
      "neural network",
      "deep learning",
      "long short-term memory",
      "LSTM",
      "attention mechanism"
    ],
    "stage1_timestamp": "2025-05-15T01:46:03.873298"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on constructing a systemic financial risk early warning model using advanced machine learning techniques, which directly addresses the identification and mitigation of financial risks, falling under the domain of Financial Risk Management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on constructing a systemic financial risk early warning model using advanced machine learning techniques, which directly addresses the identification and mitigation of financial risks, falling under the domain of Financial Risk Management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:01:14.421022"
}