{
  "paper": {
    "id": 3079,
    "title": "On the development and application of a self-organizing feature map-based patent map",
    "abstract": "Recently, the range of R&D management has expanded to include management of technological assets such as technology information, product/process data, and patents. Among others, patent map (PM) has been paid increasing attention by both practitioners and researchers alike in R&D management. However, the limitation of conventional PM has been recognized, as the size of patent database becomes voluminous and the relationship among attributes becomes complex. Thus, more sophisticated data-mining tools are required to make full use of potential information from patent databases. In this paper, we propose an exploratory process of developing a self-organizing feature map (SOFM)-based PM that visualizes the complex relationship among patents and the dynamic pattern of technological advancement. The utility of SOFM, vis-a-vis other tools, is highlighted as the size and complexity of the database increase since it can reduce the amount of data by clustering and visualize the reduced data onto a lower-dimensional display simultaneously. Specifically., three types of PM, technology vacuum map, claim point map, technology portfolio map, are suggested. The proposed maps may be used in monitoring technological change, developing new products, and managing intellectual property.",
    "year": 2002,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "4827f63960c32f05efa6d39547803fc2",
    "relevant_keywords": [
      "unsupervised learning",
      "clustering",
      "neural network",
      "feature representation"
    ],
    "stage1_timestamp": "2025-05-15T01:13:09.906492"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究基于自组织特征映射的专利地图开发与应用，用于技术监控、新产品开发和知识产权管理，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究基于自组织特征映射的专利地图开发与应用，用于技术监控、新产品开发和知识产权管理，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:11:30.772697"
}