{
  "paper": {
    "id": 731,
    "title": "Stock Movement Prediction Using Machine Learning Based on Technical Indicators and Google Trend Searches in Thailand",
    "abstract": "Machine learning for stock market prediction has recently been popular for identifying stock selection strategies and providing market insights. In this study, we adopted machine learning algorithms to analyze technical indicators, and Google Trends search terms based on the Thai stock market. This study uses three datasets, which are technical indicators, Google Trends search terms, and a combination of the two. The objectives were to study and identify the factors in stock selection, develop and evaluate portfolio selection models using keyword proxies from the three datasets mentioned, and compare the performance of the selected algorithms. In the prediction process, we discovered that the combination of technical indicators and Google Trends search terms while applying Logistic Regression, Random Forest, and Extreme Gradient Boosting (XGBoost) exhibited the highest ROC curves. For success prediction rate and annualized return, Random Forest and XGBoost were almost similar but still different. While XGBoost performs well during a period of market critical conditions (COVID-19), Random Forest performs marginally better than XGBoost during normal market conditions in terms of average success rate.",
    "year": 2023,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "9976201ae85c4380aee9e36999752801",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "regression",
      "decision tree",
      "neural network",
      "deep learning",
      "representation learning",
      "backpropagation",
      "BP",
      "hidden layer",
      "dropout regularization"
    ],
    "stage1_timestamp": "2025-05-15T00:47:18.632068"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心研究内容是使用机器学习算法（如Logistic Regression、Random Forest和XGBoost）分析技术指标和Google Trends搜索词，以预测股票走势并开发投资组合选择模型。这直接涉及投资组合管理的领域，因为研究目标是识别股票选择因素并评估投资组合模型的性能。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心研究内容是使用机器学习算法（如Logistic Regression、Random Forest和XGBoost）分析技术指标和Google Trends搜索词，以预测股票走势并开发投资组合选择模型。这直接涉及投资组合管理的领域，因为研究目标是识别股票选择因素并评估投资组合模型的性能。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:28:20.974251"
}