{
  "paper": {
    "id": 684,
    "title": "RETRACTED: Risk Assessment of Government Debt Based on Machine Learning Algorithm (Retracted Article)",
    "abstract": "Government debt risk is an important factor affecting macroeconomic stability and public expectation. The key to its prevention and control lies in early warning and early prevention. This paper builds an effective government debt risk assessment system based on machine learning algorithm. According to forming the performance of local government debt risk and its internal and external influencing factors, this study applies the analytic hierarchy process, entropy method, and BP neural network method to construct the local government risk assessment index system, which includes the primary and secondary indexes including the explicit debt risk, the contingent implicit debt risk, and the financial and economic operation risk. Using this system, this study carries on the government debt risk comprehensive weight assignment, the fiscal revenue forecast, the default probability calculation, the safety scale forecast, and finally the government debt risk assessment of the validity analysis. The system can provide signal guidance and policy reference for finance to cope with risks in advance, arrange the priority order of debt repayment, optimize the structure of fiscal revenue and expenditure, etc.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "7d4eabdf2c7fc84fd9d4a959bf9ad5ae",
    "relevant_keywords": [
      "machine learning",
      "neural network",
      "backpropagation",
      "BP"
    ],
    "stage1_timestamp": "2025-05-15T01:53:59.356840"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要研究基于机器学习算法的政府债务风险评估系统，包括违约概率计算和风险预警，这属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文主要研究基于机器学习算法的政府债务风险评估系统，包括违约概率计算和风险预警，这属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:55:51.106181"
}