{
  "paper": {
    "id": 997,
    "title": "A self-organizing map clustering adaptive artificial neural network model for analysis critical success factors in different phases of MTO projects case study: electrical equipment manufacturer and supplier in Iran",
    "abstract": "PurposeThe purpose of this paper is to investigate the benefit of critical success factors (CSFs) clustering in different phases of make-to-order (MTO) projects and develop standards for management.Design/methodology/approachThis study is based on a questionnaire survey. First of all, collecting data by structured interviews, relying on a questionnaire and second from leader contractors who are active in the engineering and steel industry (in Iran). So, the requirements and objective of the research are presented to the top management of MTO projects to gain their support in data collection. Then 20 CSFs were identified by the literature review so a questionnaire survey was prepared for the CSFs assessment and interview with the experts. Finally analyzing the importance and performance of CSFs in project phases and cluster them in different project phases with self-organizing map as one of the artificial neural network (ANN) approaches due to high predictive accuracy. Review the research result with the top management of MTO project and examine the results obtained from neural networks and validation indices.FindingsCluster analysis shows that the implementation phase is the most important stage in MTO organizations and the other phases like feasibility and start-up, design and planning, delivery and end-phase should be also considered as effective phases in determining the level of organization performance. Different industries with additional data at different periodic times will verify the result. Furthermore, testing the other ANN model will improve risk analysis and could shift this classification approach to a regression type.Research limitations/implicationsThe main limitation of the research is related to the sample. Research findings are limited to the time of data collection so validity is limited to the mentioned time. Different industries with additional data will verify the result. Furthermore, testing different ANN models such as K-MEANS, non-negative matrix factorization (NMF) analyses will improve risk analysis and could meet different classification results to find gaps.Practical implicationsIn this paper, CSF and project phase dimensions are viewed together which is necessary to meet better results for simplifying social and economic benefits. Merge the new findings and latest technologies could prepare the best results and enable managers to create a better framework or implement key factors for minimizing waste.Originality/valueThis paper moves the definition of MTO organizations beyond measuring cost, complexity and financial variables by clustering CSFs in different phases of projects. So, the results enable managers to use this concept in their daily production to minimize waste and could be implemented to efficiently choose factors.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "3332197696e318d68b003c9e2330e629",
    "relevant_keywords": [
      "unsupervised learning",
      "clustering",
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T01:57:29.936909"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是在制造订单（MTO）项目中关键成功因素（CSFs）的聚类分析，以及如何通过自组织映射（SOM）神经网络模型来优化项目管理。虽然论文提到了风险分析，但这是指项目管理中的风险，而非金融风险管理。论文的核心技术和研究成果并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是在制造订单（MTO）项目中关键成功因素（CSFs）的聚类分析，以及如何通过自组织映射（SOM）神经网络模型来优化项目管理。虽然论文提到了风险分析，但这是指项目管理中的风险，而非金融风险管理。论文的核心技术和研究成果并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:52:44.199394"
}