{
  "paper": {
    "id": 6540,
    "title": "What Drives Profit Income in Mexico's Main Banks? Evidence Using Machine Learning",
    "abstract": "Historically, the banking system has been critical to the development of economies by addressing funds efficiently-from customer savings and investors to the productive activities of people and companies, financing consumer goods and current expenses, housing, infrastructure projects and providing liquidity to the market. However, it must be transformed to respond to emerging demands in society for better financial products and services with a positive impact on living conditions and well-being. To achieve this, banks must create economic value-that is to say, banks should create profits in a sustained manner-in order to also create social value and thus generate shared value. The purpose of this study was twofold. The first aim was to identify the main factors that contributed to the majority of Mexican banking profits in the period from 2003 to 2021; the second aim of the study was to provide an innovative metric of banking performance. Using supervised machine learning algorithms and Principal Component Analysis, two prediction models were tested, and two banking performance indices were defined. The findings show that Random Forest is a reliable profit prediction model with a lower mean absolute error between the predicted yearly profit and losses and the actual data. There are no significant ranking position differences between the two performance indices. The first performance index obtained is novel due to its simplicity, since it is built on the basis of five values associated with commercial banking activity. In Mexico, no similar studies have been published. The indicator most widely used by regulators worldwide is the CAMELS index, which is a weighted average of the capital adequacy level, asset quality, management capacity, profitability, liquidity, and sensitivity to market risk. Its scale of 1 to 5 is useful for identifying the robustness and solvency of a bank, but not necessarily its capacity to generate profits. This approach might encourage banks to remain aware of their potential to create shared value and to develop competitive strategies to increase benefits for stakeholders.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "4852ce1e0c5d8bf891405aa8e29c68cc",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "regression",
      "decision tree",
      "principal components analysis"
    ],
    "stage1_timestamp": "2025-05-15T02:59:07.526535"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究墨西哥主要银行的利润驱动因素，并开发了一种新的银行绩效指标。虽然使用了机器学习技术，但其核心应用是银行绩效评估和利润预测，并不直接涉及衍生品定价、金融风险管理或投资组合管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究墨西哥主要银行的利润驱动因素，并开发了一种新的银行绩效指标。虽然使用了机器学习技术，但其核心应用是银行绩效评估和利润预测，并不直接涉及衍生品定价、金融风险管理或投资组合管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T14:23:01.134143"
}