{
  "paper": {
    "id": 358,
    "title": "Deep Learning-Based Intelligent Image Recognition and Its Applications in Financial Technology Services",
    "abstract": "The financial technology service industry involves a large number of image and text information processing tasks. By automatically processing images and text information, financial institutions can greatly reduce labor costs, improve overall operational efficiency, and help financial institutions identify and predict risks more accurately, thereby improving risk management capabilities. The existing image symbol recognition and scene text detection methods may be affected in terms of recognition accuracy when processing complex scenes, low-resolution images or texts affected by obstacles, distortions and other factors. To this end, this study conducts an in-depth study on the application of deep learning-based intelligent image recognition in financial technology services. It elaborates the application scenarios of image symbol recognition and scene text detection in financial technology services. The ASTER model is improved, and the combination of attention mechanism sequential decoding can effectively capture local information and global dependencies in the feature sequence, thereby improving the recognition accuracy of the image symbol recognition model. By focusing on the center point position information of the text, pixels with the same center point are aggregated to reduce the interference between adjacent texts to some extent, achieving more accurate text segmentation. Experimental results validate the effectiveness of the method in this study.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "deep learning",
    "cache_key": "2bb0a57d57c2aefbcbcb44f96d36c294",
    "relevant_keywords": [
      "deep learning",
      "neural network",
      "attention mechanism",
      "convolutional neural network",
      "CNN",
      "representation learning",
      "feature learning",
      "feature representation"
    ],
    "stage1_timestamp": "2025-05-15T01:36:59.880297"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要研究基于深度学习的智能图像识别技术在金融科技服务中的应用，特别是通过自动处理图像和文本信息来帮助金融机构更准确地识别和预测风险，从而提高风险管理能力。虽然论文未明确提及衍生品定价或投资组合管理，但其核心应用场景与金融风险管理直接相关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文主要研究基于深度学习的智能图像识别技术在金融科技服务中的应用，特别是通过自动处理图像和文本信息来帮助金融机构更准确地识别和预测风险，从而提高风险管理能力。虽然论文未明确提及衍生品定价或投资组合管理，但其核心应用场景与金融风险管理直接相关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:03:40.725256"
}