{
  "paper": {
    "id": 4068,
    "title": "Extraction of Knowledge with Population-Based Metaheuristics Fuzzy Rules Applied to Credit Risk",
    "abstract": "One of the goals of financial institutions is to reduce credit risk. Consequently they must properly select customers. There are a variety of methodologies for credit scoring, which analyzes a wide variety of personal and financial variables of the potential client. These variables are heterogeneous making that their analysis is long and tedious. This paper presents an alternative method that, based on the subject information, offers a set of classification rules with three main characteristics: adequate precision, low cardinality and easy interpretation. This is because the antecedent consists of a small number of attributes that can be modeled as fuzzy variables. This feature, together with a reduced set of rules allows obtaining useful patterns to understand the relationships between data, and make the right decisions for the financial institutions. The smaller the number of analyzed variables of the potential customer, the simpler the model will be. In this way, credit officers may give an answer to the loan application in the shorter time, achieving a competitive advantage for the financial institution. The proposed method has been applied to two databases from the UCI repository, and a database from a credit unions cooperative in Ecuador. The results are satisfactory, as highlighted in the conclusions. Some future lines of research are suggested.",
    "year": 2018,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "211edf5694e98b6f56b41d3c35101886",
    "relevant_keywords": [
      "machine learning",
      "classification"
    ],
    "stage1_timestamp": "2025-05-15T02:33:03.361904"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on reducing credit risk through a method for credit scoring, which is a key aspect of financial risk management. The proposed technique aims to improve the selection of customers by analyzing personal and financial variables, directly addressing credit risk mitigation.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on reducing credit risk through a method for credit scoring, which is a key aspect of financial risk management. The proposed technique aims to improve the selection of customers by analyzing personal and financial variables, directly addressing credit risk mitigation.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:34:18.796160"
}