{
  "paper": {
    "id": 272,
    "title": "Credit Risk Evaluation Using: Least Squares Support Vector Machine with Mixture of Kernel",
    "abstract": "Credit risk evaluation under the background of big data has been the major focus of financial and banking industry due to recent financial crises. Recent studies have revealed that emerging modern optimization techniques are advantageous to statistical models for credit risk evaluation, such as LS-SVM. In this paper, a least squares support vector machine with mixture kernel (LS-SVM-MK) is proposed to solve the problem of the traditional LS-SVM model, such as the loss of sparseness and robustness. Thus that will result in slow testing speed and poor generalization performance. The revision model LS-SVM-MK is equivalent to solve a linear equation set with deficient rank just like the over complete problem in independent component analysis. A minimum of 1-penalty based object function is chosen to get the sparse and robust solution. Some credit card datasets are used to demonstrate the effectiveness of this model. The experimental results show that LS-SVM-MK can obtain a small number of features and improve the generalization ability of LS-SVM.",
    "year": 2016,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "e29c2e3d8852a96ffd82d27466d6cc36",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM",
      "feature learning"
    ],
    "stage1_timestamp": "2025-05-15T01:49:04.533857"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文提出了一种改进的最小二乘支持向量机模型（LS-SVM-MK）用于信用风险评估，这是金融风险管理中的一个重要应用领域。论文明确提到信用风险评估在金融和银行业的重要性，并通过信用卡数据集验证了模型的有效性。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"该论文提出了一种改进的最小二乘支持向量机模型（LS-SVM-MK）用于信用风险评估，这是金融风险管理中的一个重要应用领域。论文明确提到信用风险评估在金融和银行业的重要性，并通过信用卡数据集验证了模型的有效性。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:59:30.581802"
}