{
  "paper": {
    "id": 1437,
    "title": "Predicting Chain's Manufacturing SME Credit Risk in Supply Chain Finance Based on Machine Learning Methods",
    "abstract": "Supply chain finance is an effective way to solve the financial problems of small and medium-sized manufacturing enterprises, and the assessment of credit risk is one of the key issues in supply chain financing. However, traditional credit risk assessment models cannot truly reflect the credit status of financing companies. In recent years, scholars working in this field have proposed using machine learning methods to predict the credit risk of supply chain enterprises, achieving good results. Nonetheless, there is no consensus on which approach is the most suitable for manufacturing companies. This study took small and medium-sized manufacturing enterprises as the research object, selected risk evaluation indicators according to the characteristics of the small and medium-sized manufacturing enterprises, and built a credit risk evaluation system. On this basis, we selected SMEs on China's stock market from 2015 to 2020 as the sample data and evaluated corporate credit risk based on four commonly used machine learning algorithms. Then, combined with the evaluation results, a partial dependence plot method was used to visually analyze the important indicators. The results showed that a credit risk evaluation system for supply chain finance for manufacturing SMEs could be composed of the profile of the financing companies, the asset status of the financing companies, the profile of the core companies, and the operation of supply chains. The use of a random forest algorithm made it possible to more accurately assess the credit risk of manufacturing supply chain finance. Since the impacts of different indicators on the evaluation results were quite different, supply chain enterprises and financial service institutions should formulate corresponding strategies according to specific situations.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "85f71c223e82db5ff573981d8da00468",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "decision tree",
      "random forest"
    ],
    "stage1_timestamp": "2025-05-15T02:03:00.684978"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用机器学习方法（如随机森林算法）来评估供应链金融中的信用风险，这直接属于金融风险管理的范畴。论文的研究目标是构建一个信用风险评估系统，以更准确地预测中小制造企业的信用风险，这是金融风险管理中的关键问题。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是使用机器学习方法（如随机森林算法）来评估供应链金融中的信用风险，这直接属于金融风险管理的范畴。论文的研究目标是构建一个信用风险评估系统，以更准确地预测中小制造企业的信用风险，这是金融风险管理中的关键问题。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:49:02.947328"
}