{
  "paper": {
    "id": 289,
    "title": "Online Portfolio Selection of Fuzzy Mean Regression Strategy Considering Investor Sentiment Based on Text Data",
    "abstract": "Investors are often affected by emotion, cognition, and other psychological factors in stock trading when making decisions. At present, people can use machine learning and other technologies to obtain a massive amount of text data from the Internet to mine information related to investor behavior and sentiment. Building intelligent online portfolio trading strategies that consider investor sentiment has become an important topic and key challenge in the financial field. Therefore, this paper explores how to use text data to depict investor sentiment, fuzzifies historical stock price data, designs a new weight transfer equation, and finally obtains a novel fuzzy mean regression strategy that considers investor sentiment based on text data. We conduct empirical tests on this strategy by using the stock price data selected from CSI300 constituent stocks, as well as the text data of investors' opinions on the internet. The results show that the strategy proposed in this study has a higher Calmar ratio than other mean regression strategies previously studied.",
    "year": 2024,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "d489c43b111028beaa3c4796ab12ca02",
    "relevant_keywords": [
      "machine learning",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T00:41:04.937765"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "The paper focuses on designing an online portfolio trading strategy that incorporates investor sentiment derived from text data, which is a core aspect of portfolio management. The empirical tests and the strategy's performance metrics (e.g., Calmar ratio) further confirm its application in this domain.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Portfolio Management\"],\n  \"justification\": \"The paper focuses on designing an online portfolio trading strategy that incorporates investor sentiment derived from text data, which is a core aspect of portfolio management. The empirical tests and the strategy's performance metrics (e.g., Calmar ratio) further confirm its application in this domain.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:32:10.528054"
}