{
  "paper": {
    "id": 259,
    "title": "An optimizing utility for Portfolio Selection based on Optimal values computed using ANN, NSGA-II and Machine learning technique",
    "abstract": "An optimizing utility for computing the values of derived economic factors of Portfolio selection is described in this paper. The significance of appropriate computing values of these factors has been felt because of the risk-constrained solution of portfolio selection. The classical Lagrangian multiplier method has been extended in the paper, using ANN and NSGA-II algorithm for computing weights used in the cost equations describing these economic factors. A mathematical formulation of the equations using portfolio selection parameters with computed values of weights is provided. A machine learning tool is given next for classifying values of coefficients of variations. Finally, a comparison of the ANN computations of weights with weights computed using NSGA-II is provided. This approach can be advantageous for the portfolio decision-making process.",
    "year": 2019,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "845acdb8138c053bc24f20bb766a3a1d",
    "relevant_keywords": [
      "machine learning",
      "classification",
      "neural network",
      "ANN"
    ],
    "stage1_timestamp": "2025-05-15T00:41:04.758572"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心内容是开发一种优化工具，用于计算投资组合选择中的经济因素值，并讨论了风险约束下的投资组合选择解决方案。论文中提到的ANN和NSGA-II算法用于计算成本方程中的权重，这些权重用于描述投资组合选择的经济因素。此外，论文还提供了一个机器学习工具用于分类变异系数值，并比较了不同方法计算的权重。这些内容明确指向投资组合管理领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心内容是开发一种优化工具，用于计算投资组合选择中的经济因素值，并讨论了风险约束下的投资组合选择解决方案。论文中提到的ANN和NSGA-II算法用于计算成本方程中的权重，这些权重用于描述投资组合选择的经济因素。此外，论文还提供了一个机器学习工具用于分类变异系数值，并比较了不同方法计算的权重。这些内容明确指向投资组合管理领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:32:17.218512"
}