{
  "paper": {
    "id": 7627,
    "title": "Development of a Multilingual Web-Based Food Frequency Questionnaire for Adults in Switzerland",
    "abstract": "Dietary assessment is a major challenge in epidemiological research and is associated with a high time and financial burden. Automated food frequency questionnaires (FFQs) have the potential to rapidly collect dietary intake data in large studies while reducing human error risk during data processing. We developed a semiquantitative, multilingual, electronic FFQ for real-time dietary intake assessment in the Swiss adult population, called Swiss eFFQ. The iterative development process involved stages of content identification, construction, pretesting, translation, and adaptation of the FFQ. Using 24 h dietary recalls from 2085 participants aged 18-75 years from a nationally representative survey, we conducted a stepwise regression analysis to identify foods contributing to >90% of the variance in intakes of energy and six nutrients. All 118 foods identified in the overall cohort or in any of the Swiss linguistic regions were selected and standardized to define the comprehensive 83-item food list, covering >90% of the intake of key nutrients in the entire study population. Once validated, the Swiss eFFQ can be used to classify individuals based on their habitual diets. The methodology described in this paper enhances the transparency of the Swiss eFFQ and may help researchers to develop multilingual dietary assessment tools for other populations.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "292310dd6d163e643ac50a61ee40bbd9",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T03:10:32.998732"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是多语言网络食物频率问卷的开发及其在瑞士成人饮食评估中的应用，与衍生品定价、金融风险管理或投资组合管理等金融领域无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是多语言网络食物频率问卷的开发及其在瑞士成人饮食评估中的应用，与衍生品定价、金融风险管理或投资组合管理等金融领域无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:26:14.836448"
}