{
  "paper": {
    "id": 6897,
    "title": "Predictors for readmission following primary total hip and total knee arthroplasty",
    "abstract": "Background: Readmission following total joint arthroplasty has become a closely watched metric for many hospitals in the United States due to financial penalties imposed by Centers for Medicare and Medicaid Services. The purpose of this study was to identify both preoperative and postoperative reasons for readmission within 30 days following primary total hip and total knee arthroplasty (TKA). Methods: Retrospective data were collected for patients who underwent elective primary total hip arthroplasty (THA; CPT code 27130) and TKA (27447) from 2008 to 2013 at our institution. The sample was separated into readmitted and nonreadmitted cohorts. Demography, comorbidities, Charlson comorbidity index (CCI), operative parameters, readmission rates, and causes of readmission were compared between the groups using univariate and multivariate regression analysis. Results: There were 42 (3.4%) and 28 (2.2%) readmissions within 30 days for THA and TKA, respectively. The most common cause of readmission within 30 days following total joint arthroplasty was infection. Trauma was the second most common reason for readmission of a THA while wound dehiscence was the second most common cause for readmission following TKA. With univariate regression, there were multiple associated factors for readmission among THA and TKA patients, including body mass index, metabolic equivalent (MET), and CCI. Multivariate regression revealed that hospital length of stay was significantly associated with 30-day readmission after THA and TKA. Conclusion: Patient comorbidities and preoperative functional capacity significantly affect 30-day readmission rate following total joint arthroplasty. Adjustments for these parameters should be considered and we recommend the use of CCI and METs in risk adjustment models that use 30-day readmission as a marker for quality of patient care.",
    "year": 2020,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "f0fc3e847ff2505e5a3d527cd13bf649",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T03:02:41.291509"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是医疗领域的再入院预测，虽然使用了回归分析等统计方法，但其应用场景和核心技术与金融领域无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是医疗领域的再入院预测，虽然使用了回归分析等统计方法，但其应用场景和核心技术与金融领域无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:27:07.099008"
}