{
  "paper": {
    "id": 847,
    "title": "Privacy-Constrained Biometric System for Non-Cooperative Users",
    "abstract": "With the consolidation of the new data protection regulation paradigm for each individual within the European Union (EU), major biometric technologies are now confronted with many concerns related to user privacy in biometric deployments. When individual biometrics are disclosed, the sensitive information about his/her personal data such as financial or health are at high risk of being misused or compromised. This issue can be escalated considerably over scenarios of non-cooperative users, such as elderly people residing in care homes, with their inability to interact conveniently and securely with the biometric system. The primary goal of this study is to design a novel database to investigate the problem of automatic people recognition under privacy constraints. To do so, the collected data-set contains the subject's hand and foot traits and excludes the face biometrics of individuals in order to protect their privacy. We carried out extensive simulations using different baseline methods, including deep learning. Simulation results show that, with the spatial features extracted from the subject sequence in both individual hand or foot videos, state-of-the-art deep models provide promising recognition performance.",
    "year": 2019,
    "source": "WOS",
    "area": "financial_risk",
    "method": "deep learning",
    "cache_key": "f88a25881302168b2559ff86c9284f9c",
    "relevant_keywords": [
      "deep learning",
      "neural network",
      "feature representation",
      "representation learning"
    ],
    "stage1_timestamp": "2025-05-15T01:43:20.642134"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究隐私约束下的生物识别系统，特别是针对非合作用户的自动识别问题，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究隐私约束下的生物识别系统，特别是针对非合作用户的自动识别问题，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:02:01.854028"
}