{
  "paper": {
    "id": 916,
    "title": "Project portfolio designing under risk",
    "abstract": "Project portfolio designing is a dynamic multi-criteria decision-making problem under risk. The paper presents an approach for dynamic project portfolio management based on the Analytic Network Process (ANP) model. The ANP model consists of four basic clusters ( projects, resources, criteria, time) with their elements and influences. An important factor of the proposed ANP model is time. The ANP method is suitable for the determination of priorities in network systems where there are different types of dependencies between the elements of the system. In each time period, the portfolio of projects is reviewed in line with the strategic objectives of the organization. Management may decide to initiate new projects, but it is not so easy to predict what new projects will appear in the future. The organization must decide under risk whether to assign all available resources to present proposals or to reserve a portion of the funds unused for some time and wait for better alternatives that may occur later. We propose to use a decision tree with multiple criteria and interactive multi-criteria analysis for solving this problem.",
    "year": 2019,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "f5281284f52e082b66fd96c567552c80",
    "relevant_keywords": [
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T00:49:36.336600"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文主要研究项目组合设计中的动态多准则决策问题，特别是在风险条件下的资源分配和项目选择，这与投资组合管理的核心问题高度相关。论文提出的ANP模型和决策树方法旨在优化项目组合，符合投资组合管理的定义。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文主要研究项目组合设计中的动态多准则决策问题，特别是在风险条件下的资源分配和项目选择，这与投资组合管理的核心问题高度相关。论文提出的ANP模型和决策树方法旨在优化项目组合，符合投资组合管理的定义。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:26:39.054553"
}