{
  "paper": {
    "id": 3235,
    "title": "Advance and case studies of the DAICOX framework for automated design of multi-sensor intelligent measurement systems",
    "abstract": "In this paper, we report on the advance and application of our DAICOX system conceived for the automated and transparent design of integrated intelligent multi-sensor measurement applications. The current implementation allows the front to back design from raw sensory data to decision making. In particular, novelty or One-Class Classification (OCC) methods, improved assessment functionality, and automated design of feature computation by multi-objective optimization techniques to complete the processing chain complement the system. Two representative applications, i. e., basic food analysis and magnetic localization, have been selected as case studies with existing manual solutions to demonstrate and assess the applicability of the conceived architecture and its implementation. DAICOX reduced the design time by 98.62%, while increasing the recognition rate by 5.21% in the first case study and 0.71% in the second case study. The optimized solution can now be deployed to a run time system. In future work, extension of the method portfolio, self-x functionality, and public-domain availability are aspired.",
    "year": 2016,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "f2cfc044b6b1ade0fa04316b7c0a083a",
    "relevant_keywords": [
      "classification",
      "feature learning",
      "feature representation"
    ],
    "stage1_timestamp": "2025-05-15T01:14:55.064727"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要讨论了DAICOX系统在自动化设计和优化多传感器智能测量系统中的应用，案例研究涉及食品分析和磁定位，并未提及任何与金融领域相关的应用或技术。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要讨论了DAICOX系统在自动化设计和优化多传感器智能测量系统中的应用，案例研究涉及食品分析和磁定位，并未提及任何与金融领域相关的应用或技术。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:10:32.188590"
}