{
  "paper": {
    "id": 2822,
    "title": "Surveillance of Parimutuel Wagering Integrity Using Expert Systems and Machine Learning",
    "abstract": "Parimutuel wagering is a significant source of revenue for many state governments. MonitorPlus is a surveillance system for parimutuel operators and regulators. Using industry expertise and best practices, MonitorPlus examines each and every wager and account transaction for evidence of fraud, crime, and money laundering. Alerts are generated in real-time. In forensic discovery mode, MonitorPlus is designed to collaborate with skilled analysts to discover more complex suspicious wagering patterns. MonitorPlus utilizes machine learning, so its risk profiles are current: its knowledge base improves with time. Each alert is accompanied by an automatically generated, rule-based explanation. This is critically important if an event rises to the level where legal action is required. Our development and deployment strategy is based on a new paradigm of a secure surveillance utility, where real-time alerts and data-intensive forensics support multiple regulatory jurisdictions. We believe this surveillance paradigm can be applied to other application domains such as lotteries, casinos, online gaming, and financial services.",
    "year": 2010,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "c3d229d1fc2eeca6c3a943c8c5e18e2f",
    "relevant_keywords": [
      "machine learning"
    ],
    "stage1_timestamp": "2025-05-15T02:19:46.600701"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是利用专家系统和机器学习监控博彩行业的欺诈和洗钱行为，虽然提到了金融服务的潜在应用，但其核心技术并未明确应用于衍生品定价、金融风险管理或投资组合管理等特定金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是利用专家系统和机器学习监控博彩行业的欺诈和洗钱行为，虽然提到了金融服务的潜在应用，但其核心技术并未明确应用于衍生品定价、金融风险管理或投资组合管理等特定金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:39:46.454940"
}