{
  "paper": {
    "id": 3441,
    "title": "Ensemble of Technical Analysis and Machine Learning for Market Trend Prediction",
    "abstract": "Over the last twenty years, researchers and practitioners have attempted in many ways to effectively predict market trends. Till date, however, no satisfactory solution has been found. Many approaches have been applied to predict market trends, from technical analysis to fundamental analysis passing through sentiment analysis. A promising research direction is to exploit market technical indicators together with market sentiments extracted from social media for predicting market directional movements. In this paper, we propose a new approach that leverages technical analysis to predict market directional movements. In particular, we aim to predict the directional movement of the NASDAQ's most capitalized stocks by solving a classification problem. The results on real-world data show that our proposal achieves interesting performance when predicting the market directional movements. This work focuses on forecasting a portfolio of different stocks, instead of concentrating on a single stock which most of the works in this field do. Furthermore, the proposed model is able to solve the issue of skewed classes through the use of appropriate data balancing techniques.",
    "year": 2018,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "3d23325e7de16c4a320cbb10959b9564",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "feature representation"
    ],
    "stage1_timestamp": "2025-05-15T01:17:25.405401"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是利用机器学习和技术分析预测市场趋势，特别是针对NASDAQ的高市值股票组合的方向性运动。这直接关联到投资组合管理中的资产选择和时机决策。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是利用机器学习和技术分析预测市场趋势，特别是针对NASDAQ的高市值股票组合的方向性运动。这直接关联到投资组合管理中的资产选择和时机决策。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:09:44.234461"
}