{
  "paper": {
    "id": 1620,
    "title": "CURRENT CHALLENGES AND PROSPECTS OF MANAGEMENT OF LOAN PORTFOLIO QUALITY IN WARTIME: THE CASE OF UKRAINE",
    "abstract": "The purpose of the study is to develop effective ways to solve the problems of managing the quality of the loan portfolio of the Ukrainian banking sector in the context of the financial crisis caused by the russian-Ukrainian war. In the course of the study, such scientific methods as fundamental provisions of the credit portfolio theory, multifactor regression analysis, extrapolation, trend analysis, mathematical programming, etc. have been used. A methodical approach to the study of contemporary problems and prospects of loan portfolio quality management under martial law, consisting in modelling the profitability of the Ukrainian banking sector, taking into account the quality of the loan portfolio, has been proposed. This approach is implemented by constructing a two-factor power regression equation; forecasting with the establishment of confidence intervals and the development of 3 forecast scenarios (realistic, pessimistic and optimistic); solving the target function to maximize the profit of the banking sector, taking into account the restrictions formed on the basis of forecasting results. It has been determined that an increase in the volume of the bank loan portfolio by 1% leads to an increase in bank revenue by 3.1%, while an increase in the volume of non-performing loans by 1% leads to a 0.28% reduction in revenues of the banking sector of Ukraine. According to the results of medium-term forecasting and optimization, it has been proved that the maximum growth of bank revenues by 60.4%, compared to 2022, is possible with an increase in the loan portfolio by 18.9%, a reduction of non-performing loans by 26% and a reduction of their share in the loan portfolio by 13.9%. It has been justified that the key condition for maximising bank revenues is the soonest termination of the russian-Ukrainian war and further expansion of effective government concessional lending programs.",
    "year": 2023,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "ae62e87ae1eae07da4bcfdc1fc251725",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T00:57:46.871413"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk",
      "Portfolio Management"
    ],
    "justification": "该论文主要研究乌克兰银行业在战争背景下的贷款组合质量管理，涉及信用风险管理和贷款组合优化，属于金融风险管理和投资组合管理的范畴。论文使用了回归分析、预测模型和数学编程等方法来解决贷款组合的质量和收益问题，这些技术直接应用于金融风险管理和投资组合管理的实践。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\", \"投资组合管理\"],\n  \"justification\": \"该论文主要研究乌克兰银行业在战争背景下的贷款组合质量管理，涉及信用风险管理和贷款组合优化，属于金融风险管理和投资组合管理的范畴。论文使用了回归分析、预测模型和数学编程等方法来解决贷款组合的质量和收益问题，这些技术直接应用于金融风险管理和投资组合管理的实践。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:19:43.436152"
}