{
  "paper": {
    "id": 3982,
    "title": "The Relationship Between a Campus Food Pantry and Academic Success at a Public University",
    "abstract": "Food insecurity (FI) is associated with lower academic performance in university students. This research aimed to describe the relationship between a campus food pantry and academic performance, describe the characteristics of student pantry shoppers (PSs), and develop a model to predict academic success. Researchers obtained student pantry swipes and university data (2021-2022 academic year) to generate a dataset for grade point average (GPA) (N = 23,896) and a subset of PS sociodemographic data (N = 852). Variables (cumulative or term GPA) differed based on models. Explanatory variables were biological sex, age, frequency of pantry shopping, classification, Pell Grant eligibility, college, athlete status, citizenship, residency, ethnicity/race, honors, and first-generation status. The analysis included the two-sample t-test, logistic and multiple regression, and the least absolute shrinkage and selection operator (LASSO). There was no difference (t(921.8) = 0.518, p = 0.60) in the cumulative GPA between PSs (M = 3.001 [0.808]) and non-pantry shoppers (NPSs) (M = 3.016 [0.874]). In the fall term, PSs (M = 3.018 [1.012] earned a higher GPA (t(581.69) = -2.235, p = 0.03) than NPSs (M = 2.919 [1.123]). Pantry shoppers achieved academic success despite exhibiting risk factors for FI, including first-generation status, being of the female sex, and financial need. Targeted multicomponent campus programs are needed to provide food assistance to students at risk for FI.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "39c5ea7f9abba5c7f22f7e5427cfa7d9",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:31:58.629275"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究校园食品储藏室与学生学业成绩之间的关系，使用了回归分析等统计方法，但其研究内容与衍生品定价、金融风险管理或投资组合管理无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究校园食品储藏室与学生学业成绩之间的关系，使用了回归分析等统计方法，但其研究内容与衍生品定价、金融风险管理或投资组合管理无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:34:42.960402"
}