{
  "paper": {
    "id": 691,
    "title": "Portfolio model for analyzing human resources: An approach based on neuro-fuzzy modeling and the simulated annealing algorithm",
    "abstract": "This paper presents a new model for developing a human resources portfolio based on a neuro-fuzzy approach. The adaptive neural network is constructed based on the Boston Consulting Group (BCG) portfolio matrix. The adaptive neural network was established by applying the simulated annealing algorithm. The model enables decision makers to evaluate and assess human resources potential in accordance with the environment and its circumstances. The purpose of creating this model is to enable insight into the existing potential and plan assets to improve and promote the employees' potential in a company. The model allows the priorities of the suggested strategies to be defined, which eliminates one of the flaws of the classic BCG portfolio matrix. In this neuro-fuzzy model the input variables are described using fuzzy sets that are represented by Gaussian functions. Using expert reasoning a unique knowledge base is formed which enables employees to be scheduled by strategies. The portfolio model is tested in a realistic industrial environment. (C) 2017 Elsevier Ltd. All rights reserved.",
    "year": 2017,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "125779ea4e2662f9028e3e239115ef82",
    "relevant_keywords": [
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T00:47:18.427963"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是人力资源组合模型，虽然使用了投资组合管理的术语和方法（如BCG矩阵），但其应用场景是人力资源管理和员工潜力评估，而非金融领域的投资组合管理。因此，不属于上述任何金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是人力资源组合模型，虽然使用了投资组合管理的术语和方法（如BCG矩阵），但其应用场景是人力资源管理和员工潜力评估，而非金融领域的投资组合管理。因此，不属于上述任何金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:28:29.600755"
}