{
  "paper": {
    "id": 3474,
    "title": "Volatility Episodes and Patterns in Currency Returns",
    "abstract": "Portfolio management under episodes of high volatility spurs difficult decision-making for asset managers in the pursuit of risk minimization as benefits from international diversification become less relevant. Dynamics of currencies under such developments add a new layer of risk. A clear description of the reaction of currencies to volatility shocks perceived in capital markets is therefore important for the success of risk management undertakings. Our paper studies the persistence of the impact of volatility changes on currencies, to enhance the prediction needed for international portfolio risk management. Our analysis focuses on the highest ranked currencies in terms of over-the-counter (OTC) foreign exchange turnover according to the latest Triennial Central Bank Survey of the Bank of International Settlements (2019). We use daily bilateral rates of 29 currencies against the US dollar collected from FRED (Federal Reserve Economic Data) and Pacific Exchange Rate Service. Our approach identifies high-volatility episodes in financial markets based on VIX, which is a widely used indicator of global financial market volatility, between January 1999 and December 2019. Specifically, we investigate the behaviour of exchange rates against the US dollar during these episodes of volatility in financial markets, by considering the first four moments of currency return distribution in a Statistical Clustering methodological framework. We find that, overall, currency returns have a rather homogeneous behaviour in turbulent times, which generates difficulties in distinguishing separate asset classes in the foreign exchange market. We cannot distinguish separate asset classes in the foreign exchange market based on currency return distributions, but knowing that currency returns exhibit similar patterns may prove to be useful for portfolio managers for designing their active investing and/or hedging strategies in a highly correlated world.",
    "year": 2020,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "aa2550300176f1b6899ed76b87b88db0",
    "relevant_keywords": [
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T02:26:48.466348"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk",
      "Portfolio Management"
    ],
    "justification": "该论文研究了高波动时期货币回报的行为，旨在增强国际投资组合风险管理的预测能力，并讨论了这些发现对投资组合经理设计主动投资和/或对冲策略的潜在用途。这直接关联到金融风险管理和投资组合管理领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\", \"投资组合管理\"],\n  \"justification\": \"该论文研究了高波动时期货币回报的行为，旨在增强国际投资组合风险管理的预测能力，并讨论了这些发现对投资组合经理设计主动投资和/或对冲策略的潜在用途。这直接关联到金融风险管理和投资组合管理领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:36:25.593469"
}