{
  "paper": {
    "id": 2562,
    "title": "A systematic analysis for maritime accidents causation in Chinese coastal waters using machine learning approaches",
    "abstract": "Maritime safety is critical as many maritime accidents involve catastrophic consequences, including both fatalities and financial loss. To identify the factors which caused maritime accidents and provide a comprehensive suggestion for maritime administrators and mariners, a data-driven Bayesian Network (BN) is developed to analyse the major accidents records in the Chinese coastal waters by using an advanced machine learning approach. For this aim, the statistical interactions among causation factors identified from major accidents records are paired to construct the BN. Then the obtained BN is validated through a two-step validation process and a comparison analysis to demonstrate its superiorities in reliability and efficiency. The results revealed the importance of different risk influencing factors and the critical scenarios in the coastal waters. The small general cargo ships are the riskiest of in the coastal waters of China. While, bad weather conditions often lead to catastrophic accidents and minor accidents often happen in waters with low traffic density. The research findings could provide useful guidance to support risk preventions, and advance the maritime safety management system in coastal waters.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "8879bee0e040d97e971a0b8fcdd473db",
    "relevant_keywords": [
      "machine learning",
      "Bayesian Network",
      "data-driven"
    ],
    "stage1_timestamp": "2025-05-15T02:16:32.732343"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是海事事故的原因分析及其预防措施，使用了机器学习和贝叶斯网络技术，但其应用场景是海事安全管理，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是海事事故的原因分析及其预防措施，使用了机器学习和贝叶斯网络技术，但其应用场景是海事安全管理，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:41:10.003877"
}