{
  "paper": {
    "id": 3139,
    "title": "Deep Multilayer Perceptron Neural Network for the Prediction of Iranian Dam Project Delay Risks",
    "abstract": "Construction delays are among the industry's most significant challenges, especially in the infrastructure sector, where delays can have serious socio-economic consequences. Recently, advances in deep learning (DL) have opened up new possibilities for tackling complex issues more efficiently. This study aims to evaluate the potential of deep neural networks in predicting the level of delay in Iranian dam construction projects. As the first step, 65 delay risk factors were identified through a comprehensive literature review and interviews. Then risk scores for 53 completed dam projects in Iran were determined through a questionnaire survey. Subsequently, the most significant latent features were extracted using principal component analysis (PCA). The resultant variables were combined with two project characteristics to develop the input dataset. Finally, the resulting dataset was used to develop a deep multilayer perceptron neural network (MLP-NN) model to predict project delays. The prediction performance of the deep-MLP model was then evaluated and compared to that of the best delay prediction models found in previous studies. The three-times repeated stratified five-fold cross-validation results demonstrated that the proposed deep-NN model outperformed all previous approaches for delay prediction on all performance metrics. This study also explores the effectiveness of combining delay risk factors with project characteristics to train the predictive model. According to the results, adding project characteristic factors to the training dataset significantly improved the prediction performance of deep-MLP. The work presented here can assist managers of future dam constructions in the early stages of the project in selecting and prioritizing projects within a portfolio and allocating a sufficient buffer to ensure the project's timely completion.",
    "year": 2023,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "8a0e7c933f0c2d78463e6e2f7ae0f18c",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "deep learning",
      "neural network",
      "principal components analysis",
      "feature learning",
      "representation learning",
      "backpropagation",
      "BP",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T01:13:45.330831"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究使用深度神经网络预测伊朗大坝建设项目的延迟风险，其应用领域是建筑工程管理而非金融研究。虽然提到了项目组合选择，但这属于项目管理范畴，与金融领域的投资组合管理无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究使用深度神经网络预测伊朗大坝建设项目的延迟风险，其应用领域是建筑工程管理而非金融研究。虽然提到了项目组合选择，但这属于项目管理范畴，与金融领域的投资组合管理无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:11:27.454587"
}