{
  "paper": {
    "id": 474,
    "title": "A representation-learning approach for insurance pricing with images",
    "abstract": "Unstructured data are a promising new source of information that insurance companies may use to understand their risk portfolio better and improve the customer experience. However, these novel data sources are difficult to incorporate into existing ratemaking frameworks due to the size and format of the unstructured data. This paper proposes a framework to use street view imagery within a generalized linear model. To do so, we use representation learning to extract an embedding vector containing useful information from the image. This embedding is dense and low dimensional, making it appropriate to use within existing ratemaking models. We find that there is useful information included in street view imagery to predict the frequency of claims for certain types of perils. This model can be used as in a ratemaking framework but also opens the door to future empirical research on attempting to extract which characteristics within the image leads to increased or decreased predicted claim frequencies. Throughout, we discuss the practical difficulties (technical and social) of using this type of data for insurance pricing.",
    "year": 2024,
    "source": "WOS",
    "area": "portfolio",
    "method": "deep learning",
    "cache_key": "ef4cb289799c6420f547ade2c3fa5575",
    "relevant_keywords": [
      "machine learning",
      "representation learning",
      "feature learning",
      "feature representation",
      "neural network",
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T00:36:26.512691"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究保险定价中使用图像数据的表示学习方法，虽然涉及风险管理概念，但其核心应用领域是保险定价而非金融风险管理、衍生品定价或投资组合管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究保险定价中使用图像数据的表示学习方法，虽然涉及风险管理概念，但其核心应用领域是保险定价而非金融风险管理、衍生品定价或投资组合管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:34:56.762479"
}