{
  "paper": {
    "id": 1561,
    "title": "PREDICTIVE ANALYTIC DASHBOARD FOR DESALTER AND CRUDE DISTILLATION UNIT",
    "abstract": "Desalter and crude distillation unit is an equipment used for desalting of salt and other impurities to minimize corrosion during the crude oil refining process. This study presents the predictive analysis of data from desalter and crude distillation unit. Artificial Neural Network (ANN) algorithm is used with R programming language for the forecasting. The corrosion rate was identified by using Multiple Linear Regression Analysis (MLRA). The objective was to develop a predictive analysis model by incorporating ANN and MLRA using parameters from the desalter, the crude distillation unit data and the corrosion rate. ANN is used to forecast data while MLRA is used to find the corrosion rate. A dashboard system was developed to visualize the propose analysis. The proposed predictive analytical model was validated within the proposed dashboard system. This predictive dashboard is to aid the corrosion engineer to make decision on replacing pipeline on estimated time to avoid financial losses and risk.",
    "year": 2017,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "6ac9391965f9eae18ed5360cb5b74044",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "regression",
      "neural network",
      "backpropagation",
      "BP"
    ],
    "stage1_timestamp": "2025-05-15T02:04:20.146839"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是利用人工神经网络和多元线性回归分析来预测原油精炼过程中的腐蚀率，并开发了一个仪表板系统来辅助腐蚀工程师决策。虽然提到了避免财务损失和风险，但其核心应用领域是工业过程优化和腐蚀管理，而非金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是利用人工神经网络和多元线性回归分析来预测原油精炼过程中的腐蚀率，并开发了一个仪表板系统来辅助腐蚀工程师决策。虽然提到了避免财务损失和风险，但其核心应用领域是工业过程优化和腐蚀管理，而非金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:48:19.232924"
}