{
  "paper": {
    "id": 669,
    "title": "News Sentiment and the Risk of a Stock Price Crash Risk: Based on Financial Dictionary Combined BERT-DCA",
    "abstract": "This study combines a financial knowledge dictionary and pretraining method based on BERT (Bidirectional Encoder Representation from Transformers) to construct a deep learning model for identifying stock news sentiments. The study then calculates the sentiment metrics of all stocks and analyzes the impact of news sentiment on the risk of a stock price crash and its heterogeneity. The results show that stocks with more positive sentiment metrics have a higher risk of crash in the following year. We also investigate the information intermediation and investor sentiment channels by which news sentiment affects the risk of a crash. The results show that more net insider sales, lower information transparency, and less analyst coverage amplify the impact of news sentiment on future crash risk, which is consistent with the information intermediation channel. Additionally, more retail investor positions, more active investor sentiment, and divergence between analysts' opinions and news amplify the impact of news sentiment on the risk of a future stock price crash, which is consistent with the investor sentiment channel.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "deep learning",
    "cache_key": "e541ac9a4877f15ad56244974c2730d4",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "neural network",
      "representation learning",
      "BERT",
      "Large Language Model",
      "LLM"
    ],
    "stage1_timestamp": "2025-05-15T01:41:29.772941"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用BERT和深度学习模型分析新闻情感对股票价格崩盘风险的影响，并探讨了信息中介和投资者情绪渠道。这些研究内容直接关联到金融风险管理中的市场风险识别和预测。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是使用BERT和深度学习模型分析新闻情感对股票价格崩盘风险的影响，并探讨了信息中介和投资者情绪渠道。这些研究内容直接关联到金融风险管理中的市场风险识别和预测。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:02:28.485510"
}