{
  "paper": {
    "id": 2007,
    "title": "An Empirical Study of Stock Return and Investor Sentiment Based on Text Mining and LSTM",
    "abstract": "Based on the development of social network and big data, we adopt the unstructured text-based investors' comment data mining from the stock bar forum, and use long short-term memory neural network for text sentiment analysis to build a more accurate investor sentiment indicator. Based on this indicator, an empirical study on the component stocks of the GEM Composite Index is conducted to explore the impact of investor sentiment on stock return. Through a full sample stock selection test, we find that the performance of the portfolio based on investor sentiment indicator performs significantly better than the benchmark. Further more, compared with the basic Fama-French three factor model, the goodness of fit and significance of the asset pricing model with investor sentiment factor added are both improved, indicating that the investor sentiment index we constructed can capture the investors' sentiment in the market well, and has a good explanatory power for stock return.",
    "year": 2019,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "ae86b4472cf5b31b38ca7be502585766",
    "relevant_keywords": [
      "machine learning",
      "neural network",
      "deep learning",
      "long short-term memory",
      "LSTM"
    ],
    "stage1_timestamp": "2025-05-15T01:02:10.187072"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是基于文本挖掘和LSTM构建投资者情绪指标，并用于构建投资组合。研究结果表明，基于该情绪指标的投资组合表现显著优于基准，这直接涉及投资组合管理的领域。论文未提及衍生品定价或金融风险管理的具体应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是基于文本挖掘和LSTM构建投资者情绪指标，并用于构建投资组合。研究结果表明，基于该情绪指标的投资组合表现显著优于基准，这直接涉及投资组合管理的领域。论文未提及衍生品定价或金融风险管理的具体应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:17:46.627623"
}