{
  "paper": {
    "id": 455,
    "title": "Predicting Risk through Artificial Intelligence Based on Machine Learning Algorithms: A Case of Pakistani Nonfinancial Firms",
    "abstract": "AI (artificial intelligence) is a significant technological advancement that has everyone buzzing about its incredible potential. The current research study evaluates the influence of supervised artificial intelligence techniques, i.e., machine learning techniques on the nonfinancial firms of Pakistan and focuses on the practical application of AI techniques for the accurate prediction of corporate risks which in turn will lead to the automation of corporate risk management. So, in this study, we used financial ratios for accurate risk assessment and for the automation of corporate risk management by developing machine learning algorithms using techniques, namely, random forest, decision tree, naive Bayes, and KNN. A secondary data collection technique will be used. For this purpose, we collected annual data of nonfinancial companies in Pakistan for the period ranging from 2006 to 2020, and the data are analyzed and tested through Python software. Our results prove that AI techniques can accurately predict risk with minimum error values, and among all the techniques used, the random forest technique outperforms as compared to the rest of the techniques.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "ea2357dbe4336edafe55d0c1733e6dbc",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "decision tree",
      "random forest",
      "naive Bayes",
      "KNN"
    ],
    "stage1_timestamp": "2025-05-15T01:50:52.700217"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on the application of machine learning techniques for the accurate prediction of corporate risks and the automation of corporate risk management, which falls under the domain of Financial Risk Management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on the application of machine learning techniques for the accurate prediction of corporate risks and the automation of corporate risk management, which falls under the domain of Financial Risk Management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:58:00.559347"
}