{
  "paper": {
    "id": 2091,
    "title": "Do lower environmental, social, and governance (ESG) rated companies have higher systemic impact? Empirical evidence from Europe and the United States",
    "abstract": "In recent years, companies have increasingly been characterized by environmental, social, and governance (ESG) scores, and investors and academics have raised questions concerning financial performance and investment risks. Now, as the European Banking Authority has acknowledged that ESG risks can potentially impact the economic and financial system, the debate on systemic risk has gained traction. Understanding the relationship between ESG merit and systemic risk is of utmost importance for the stability of the economic and financial system, still, research is limited. Relying on real-world European and United Stated data, we quantify systemic risk by means of QL-CoVaR. Empirical analyses of the entire period from 2007 to 2021 show that companies with high ESG scores tend to exhibit low QL-CoVaR values indicating a positive effect of ESG scores. Such evidence is confirmed by clustering the individual companies into ESG portfolios and focusing on COVID-19. Additional insights using the individual pillars are also provided.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "08c1a8f7dce6e6e3d1b4ed72888d6a8c",
    "relevant_keywords": [
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T02:10:59.056177"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心研究内容是探讨ESG评分与系统性风险（systemic risk）之间的关系，并使用QL-CoVaR方法来量化系统性风险。这直接涉及金融风险管理领域，特别是系统性风险的评估和管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心研究内容是探讨ESG评分与系统性风险（systemic risk）之间的关系，并使用QL-CoVaR方法来量化系统性风险。这直接涉及金融风险管理领域，特别是系统性风险的评估和管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:44:24.839503"
}