{
  "paper": {
    "id": 907,
    "title": "Forecasting recovery rates on non-performing loans with machine learning",
    "abstract": "We compare the performance of a wide set of regression techniques and machine-learning algorithms for predicting recovery rates on non-performing loans, using a private database from a European debt collection agency. We find that rule-based algorithms such as Cubist, boosted trees, and random forests perform significantly better than other approaches. In addition to loan contract specificities, predictors that refer to the bank recovery process - prior to the portfolio's sale to a debt collector - are also shown to enhance forecasting performance. These variables, derived from the time series of contacts to defaulted clients and client reimbursements to the bank, help all algorithms better identify debtors with different repayment ability and/or commitment, and in general those with different recovery potential. (C) 2020 International Institute of Forecasters. Published by Elsevier B.V. All rights reserved.",
    "year": 2021,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "0cb79719591d9426fcaed3a112845ddc",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "regression",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T00:49:36.300409"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on predicting recovery rates on non-performing loans using machine learning techniques, which is directly related to credit risk assessment and management, a key component of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on predicting recovery rates on non-performing loans using machine learning techniques, which is directly related to credit risk assessment and management, a key component of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:26:40.892762"
}