{
  "paper": {
    "id": 1253,
    "title": "HYBRID MULTIVARIATE ADAPTIVE REGRESSION SPLINES CREDIT RISK ASSESSMENT MODEL CONSIDERING BUSINESS CYCLE",
    "abstract": "The paper presents hybrid statistical enterprises classification model that combines multivariate adaptive regression splines and logistic regression methods. According to 11 financial ratios the model allows to predict the default of a company in 1 year. The hybrid approach allowed to increase the sensitivity of model from 90% to 92% while the overall classification accuracy remained the same 96,92% as in logistic regression model. In addition this model considers the business cycle effect on different industry sectors credit risk. Analyzing 5 factors of industry sectors performance the model highlighted the sectors that are very sensitive to the changes in macroeconomic conditions. That can help banks to make lending decisions aiming to reduce the possible loss.",
    "year": 2013,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "1f798a78ffb2110b39dcacdc16575646",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:00:30.646398"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on developing a hybrid model to predict company defaults and assess credit risk, which are key components of financial risk management. The model's application in helping banks make lending decisions to reduce potential losses further supports its relevance to this domain.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on developing a hybrid model to predict company defaults and assess credit risk, which are key components of financial risk management. The model's application in helping banks make lending decisions to reduce potential losses further supports its relevance to this domain.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:50:34.065059"
}