{
  "paper": {
    "id": 1845,
    "title": "ANALYZING POLITICAL AND SYSTEMIC DETERMINANTS OF FINANCIAL RISK IN LOCAL GOVERNMENTS",
    "abstract": "Studies have shown that political variables can influence the volume of government debt and have recommended investigating the joint effects of diverse factors on the risk of local government default. Considering the relation between economic management and political constraints, this paper examines the joint influence of political and systemic factors on the risk of loan default by Spanish local governments. To do so, we analyze 148 city councils for the period 2006-2011, using a logit model with panel data and an artificial neural network. The empirical results indicate that the financial risk of local governments is affected both by political factors specific to each case and, simultaneously, by systemic variables for the country. Specifically, political variables such as the mayor not having economics-related university studies, the under-representation of female councilors in the municipal corporation, municipal government by a party with a progressive ideology, and ideological alignment between the municipal and the regional government are all associated with greater financial risk. Moreover, rising national unemployment, an increased sovereign risk premium, the impact of the electoral cycle, and that of declining economic growth are all factors that may increase the risk of default. The findings presented are of great potential interest for governments, managers, national and international fiscal authorities, financial regulators, and citizens at large, because an understanding of the significance of these variables can help authorities make appropriate decisions to prevent and/or overcome problems related to municipal insolvency.",
    "year": 2020,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "452dfc65d02618c584f61f9801458290",
    "relevant_keywords": [
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T02:08:03.981623"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文研究了政治和系统性因素对地方政府贷款违约风险的影响，使用了logit模型和人工神经网络来分析金融风险，这属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文研究了政治和系统性因素对地方政府贷款违约风险的影响，使用了logit模型和人工神经网络来分析金融风险，这属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:45:53.579262"
}