{
  "paper": {
    "id": 1555,
    "title": "Takeover prediction using forecast combinations",
    "abstract": "The ability to identify likely takeover targets at an early stage should provide investors with valuable information, enabling them to profit by investing in potential target firms. In this paper we contribute to the takeover forecasting literature by suggesting the combination of probability forecasts as an alternative method of improving the forecast accuracy in takeover prediction and realizing improved economic returns from portfolios made up of predicted targets. Forecasts from several non-linear forecasting models, such as logistic and neural network models and a combination of them, are used to determine the methodology that best reduces the out-of-sample misclassification error. We draw two general conclusions from our results. First, the forecast combination method outperforms the single models, and should therefore be used to improve the accuracy of takeover target predictions. Second, we demonstrate that an investment in a portfolio of the combined predicted targets results in significant abnormal returns being made by an investor, in the order of up to double the market benchmark return when using a portfolio of manageable size. (C) 2013 Published by Elsevier B.V. on behalf of International Institute of Forecasters.",
    "year": 2013,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "af6f2a6e30f1da499ff7760f8e8b11b7",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T00:57:12.629995"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是使用预测组合方法来提高收购目标的预测准确性，并展示了如何通过投资于预测目标组合来获得显著的超额回报。这直接涉及投资组合的构建和管理，以实现优于市场基准的回报，因此属于投资组合管理领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是使用预测组合方法来提高收购目标的预测准确性，并展示了如何通过投资于预测目标组合来获得显著的超额回报。这直接涉及投资组合的构建和管理，以实现优于市场基准的回报，因此属于投资组合管理领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:20:12.442165"
}