{
  "paper": {
    "id": 796,
    "title": "Conservative or Aggressive? Confidence-Aware Dynamic Portfolio Construction",
    "abstract": "Indicator-based investing is a popular investment strategy driven by technical analysis for the stock market, the key issue of which is to construct portfolios from technical indicators. Due to the high volatility and non-stationary of the stock market, the effectiveness of an indicator, however, varies largely across different periods, which has made it necessary to dynamically adjust indicator-based investing. In this paper, we propose a confidence-based calibration approach for dynamic portfolio construction. The major intuition behind is to tune a more concentrated portfolio when the indicator yields higher confidence otherwise a relatively equal-weighted one. To seek a maximized long-term profit, we further propose to integrate learning the confidence (i.e., future effectiveness) of an indicator into a unified portfolio construction approach powered by a recurrent reinforcement learning framework. Compared with the traditional indicator investing strategies, our confidence-based calibrated indicator of investing can obtain significantly higher returns with lower risks.",
    "year": 2019,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "b9c8cfedf61ca70933f317b5e44d4e63",
    "relevant_keywords": [
      "reinforcement learning",
      "recurrent neural network",
      "long short-term memory",
      "LSTM"
    ],
    "stage1_timestamp": "2025-05-15T00:48:22.269927"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "The paper focuses on dynamic portfolio construction using a confidence-based calibration approach and reinforcement learning, which is directly related to the optimization and management of investment portfolios.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Portfolio Management\"],\n  \"justification\": \"The paper focuses on dynamic portfolio construction using a confidence-based calibration approach and reinforcement learning, which is directly related to the optimization and management of investment portfolios.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:27:48.922471"
}