{
  "paper": {
    "id": 6058,
    "title": "A Novel Approach for Portfolio Optimization Using Fuzzy AHP Based on Gustafson Kessel Clustering Algorithm",
    "abstract": "Portfolio management involves modeling risk-return relationships. However, the diverse factors impacting financial markets introduce uncertainty into future portfolio selection. The aim of this study is to propose a portfolio selection model to assist investors in creating the most suitable investment plan in the financial market uncertainty. In this context, a preliminary reduction step is applied to the stocks using the Gustafson-Kessel (GK) algorithm, a fuzzy clustering method, to select portfolio stocks. Later, trapezoidal fuzzy numbers (TrFNs) were defined instead of triangular fuzzy numbers (TFNs) used in the Constrained Fuzzy Analytic Hierarchy Process (AHP) for portfolio selection problems. By using new fuzzy numbers, the weights of the criteria were obtained as TrFNs. Then, a linear programming problem was modeled using the weights of the obtained criteria as a TrFN. For this purpose, a method available in the literature was used that uses price variables in the objective function as TFNs. In this study, a linear programming model that uses these variables as TrFNs is proposed as an alternative to the method that uses the price variables in the objective function as TFNs. In this proposed model, the weights obtained from the Constrained Fuzzy AHP using TrFNs are used as price variables in the objective function of the created linear programming problem. Proposed model then applied to the 48- month return data set of stocks in the Istanbul Stock Exchange 100 (ISE100) index to determine which stocks the investor should choose and the investment rates investor should make in these stocks. In addition, in order to examine the effectiveness of the proposed model within the scope of the study, portfolio distributions were obtained with different portfolio optimization methods using the same data set and the results were compared.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "5d482a438cec6c2c7905ef39410c889d",
    "relevant_keywords": [
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T02:54:03.535862"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心内容是提出了一种基于模糊AHP和Gustafson-Kessel聚类算法的投资组合优化方法，旨在帮助投资者在金融市场不确定性下选择最合适的投资组合。论文的研究目标和实验设计都明确指向投资组合管理领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Portfolio Management\"],\n  \"justification\": \"该论文的核心内容是提出了一种基于模糊AHP和Gustafson-Kessel聚类算法的投资组合优化方法，旨在帮助投资者在金融市场不确定性下选择最合适的投资组合。论文的研究目标和实验设计都明确指向投资组合管理领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:28:55.241356"
}