{
  "paper": {
    "id": 222,
    "title": "Financial Risk Evaluation of Chinese Commercial Banks Using Projection Pursuit Clustering",
    "abstract": "The evaluation model using a projection pursuit clustering (PPC) model is established and applied to evaluate the financial risk (FR) of Chinese Commercial Banks (CCBs) from 2008 to 2011. Firstly, we put forward an evaluation index system for the FR of CCBs, and we use its single-index assessment criteria to generate sufficient samples. Secondly, we discuss and examine the PPC model with a new optimization objective function. The new function could overcome the drawbacks of the traditional PPC model. Thirdly, we solve the model and obtain the real global optimum applying an improved particle swarm optimization algorithm. Finally, our case study shows that the established PPC model and its five sub-models are applicable to evaluate the financial risk of CCBs. According to our study, the financial risk situations of CCBs basically lie in the Proper-safety levels during 2008 to 2011. The operation risk is the highest among the five aspects of FR, and the development risk ranks next to it. In terms of the 14 listed CCBs, the financial risk of ICBC remains almost unchanged, and BN has the greatest change: from the Safety level to the Risk level.",
    "year": 2013,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "09188ca764d509a8587e39bb738f3671",
    "relevant_keywords": [
      "clustering",
      "principal components analysis"
    ],
    "stage1_timestamp": "2025-05-15T01:48:30.658538"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on establishing an evaluation model using projection pursuit clustering to assess the financial risk of Chinese Commercial Banks, which directly pertains to the domain of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on establishing an evaluation model using projection pursuit clustering to assess the financial risk of Chinese Commercial Banks, which directly pertains to the domain of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:59:55.327674"
}