{
  "paper": {
    "id": 781,
    "title": "INVESTIGATION OF ALGORITHMIC TRADING MODELS FOR SHARES OF THE DRUG MANUFACTURING INDUSTRY",
    "abstract": "Algorithmic trading models are now widely used in investment decision-making. By grounding these models in scientific knowledge, investors can obtain efficient results in financial markets. During the COVID-19 outbreak, the drug manufacturing industry has received substantial attention from investors. The purpose of our research is to form an investment portfolio using an algorithmic trading model in the drug manufacturing industry. The model covers the entire process of portfolio formation: market analysis, selection of industry, selection of particular stocks, data mining, forecasting and investment decision-making. Three portfolios - maximum return, minimum risk and maximum Sharpe ratio - are constructed and compared across two periods. Portfolios formed using deep learning forecasting outperformed the index in more cases than did portfolios created using the Monte Carlo simulation. Portfolio formation using algorithmic trading models is suitable for individual investors, can be easily automated using the computer application and can not only be applied to one industry but diversified across various sectors.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "deep learning",
    "cache_key": "82237ba9675f7c47e037343f1ac2f9a8",
    "relevant_keywords": [
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T01:42:44.424529"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是使用算法交易模型构建投资组合，包括市场分析、股票选择、数据挖掘和预测等步骤，并比较了不同投资组合的表现。这些内容明确属于投资组合管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是使用算法交易模型构建投资组合，包括市场分析、股票选择、数据挖掘和预测等步骤，并比较了不同投资组合的表现。这些内容明确属于投资组合管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:02:23.890691"
}