{
  "paper": {
    "id": 1649,
    "title": "An Intelligent Hybrid Cloud-Based ANP and AI Model for Development Site Selection",
    "abstract": "Property development site selection decisions typically rely on traditional on-premises information systems that use model-driven multivariate linear regression approaches to predict dwelling prices for a given set of development criteria. However, traditional on-premises structures have limited the flexibility and accessibility of systems. Meanwhile, prediction errors frequently occur in the appraisal model because of noisy data and incomprehensive analysis. This paper proposes a cloud-based integrated property site selection platform that aims to improve the performance of property site selection. This platform integrates an analytical network process (ANP) framework with a data-driven real estate appraisal model to analyse site selection in the Melbourne suburban area. First, data-driven approaches that are solely contingent on predicted price data can alleviate model uncertainties via data mining A comparative analysis was conducted of data-driven models to select the best predictive algorithm from among linear regression, ridge regression, regression tree, random forest, k-nearest neighbor, support vector regression and artificial neural network approaches. The random forest achieved the best score in the forecast accuracy test, indicating that houses in the southern metropolitan area have the highest potential. Second, ten dwelling candidates were used in the ANP decision model. Following measurement using strategic criteria and Benefit, Cost and Risk merits, the results of the ANP model differed from those of the traditional appraisal model, and non-financial considerations were found to be the primary drivers of selection.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "56f81a33e06b0044ca348eb97186d264",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "regression",
      "support vector machine",
      "SVM",
      "decision tree",
      "neural network",
      "random forest"
    ],
    "stage1_timestamp": "2025-05-15T02:05:42.615402"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究房地产开发的选址决策，虽然使用了机器学习模型进行价格预测，但其核心应用领域是房地产选址而非金融研究领域中的衍生品定价、金融风险管理或投资组合管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究房地产开发的选址决策，虽然使用了机器学习模型进行价格预测，但其核心应用领域是房地产选址而非金融研究领域中的衍生品定价、金融风险管理或投资组合管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:47:18.798821"
}