{
  "paper": {
    "id": 4661,
    "title": "High-frequency Growth-at-Risk of China: the Role of Macro-financial Environment",
    "abstract": "High-frequency macro-financial environment variables provide more useful information and are efficient in predicting the low-frequency GDP growth rate. To this end, we extend the traditional Growth-at-Risk (GaR) into a high-frequency GaR (HF-GaR). In this extension, we construct three high-frequency macro-financial environment indices using a mixed frequency dynamic factor model and then use a mixed data sampling-quantile regression method to measure China's daily GaR from Jan 1, 2000, to Sep 30, 2024. The evidence shows that our HF-GaR has favorable prediction performance, with quantile mean absolute error and quantile root square error values less than 0.1 and is significantly superior to the traditional GaR at the 1% level for most quantiles. Additionally, HF-GaR can offer early warning of economic downturns, especially predicting China's GDP growth rate at the 5% quantile less than 0 in 2020Q1. Moreover, we conduct a counterfactual scenario analysis and find that the conditional quantile of GDP growth rate changes as the macro-financial environment tightens or loosens. Finally, we also validated that the HF-GaR model is equally applicable in other economies.",
    "year": 2025,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "8e54ae1bd95c26a7a05796ef7c85389f",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:39:27.084222"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是构建高频宏观金融环境指数并用于预测GDP增长率的极端风险（Growth-at-Risk），这属于金融风险管理中宏观经济风险监测和预警的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是构建高频宏观金融环境指数并用于预测GDP增长率的极端风险（Growth-at-Risk），这属于金融风险管理中宏观经济风险监测和预警的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:32:21.005424"
}