{
  "paper": {
    "id": 4596,
    "title": "Bayesian Time-Varying Quantile Forecasting for Value-at-Risk in Financial Markets",
    "abstract": "Recently, advances in time-varying quantile modeling have proven effective in financial Value-at-Risk forecasting. Some well-known dynamic conditional autoregressive quantile models are generalized to a fully nonlinear family. The Bayesian solution to the general quantile regression problem, via the Skewed-Laplace distribution, is adapted and designed for parameter estimation in this model family via an adaptive Markov chain Monte Carlo sampling scheme. A simulation study illustrates favorable precision in estimation, compared to the standard numerical optimization method. The proposed model family is clearly favored in an empirical study of 10 major stock markets. The results that show the proposed model is more accurate at Value-at-Risk forecasting over a two-year period, when compared to a range of existing alternative models and methods.",
    "year": 2011,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "075b179a28802176cf2c47a4b0698d1c",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:38:56.391729"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on Value-at-Risk (VaR) forecasting, which is a key technique in financial risk management. The proposed Bayesian time-varying quantile model is specifically designed to improve the accuracy of VaR predictions, as evidenced by the empirical study on stock markets.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on Value-at-Risk (VaR) forecasting, which is a key technique in financial risk management. The proposed Bayesian time-varying quantile model is specifically designed to improve the accuracy of VaR predictions, as evidenced by the empirical study on stock markets.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:32:22.147708"
}