{
  "paper": {
    "id": 2531,
    "title": "Clustering with Bregman divergence in factoring business",
    "abstract": "In this contribution we characterize the customers of factoring company (in the factoring business there are two types of subject - client (supplier) who sells his receivables and customer (he is the primary debtor)). While the factoring company has enough information about its clients (credit report based on financial and non-financial data), about customers there are only few characteristics. But the risk of non-payment lies on the customers. Thereby, it is important to find some common similarities among the customers. This is done here by clustering with Bregman divergence. In the second section we describe shortly the principle of factoring business and in Section 4 possible customers' characteristics (turnover through factoring, pay morale, yield, per cent of offsets, etc.) The third section introduces Bregman divergence (definition and basic properties). Then we describe the procedure for clustering and apply it to the data about customers. The procedure was written in VBA MS Excel. We used data form the year 2007 and 2009 to answer additional question: is the structure of factoring customers same in the economic boom and in the depression?",
    "year": 2010,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "6d06ac25bbfcd2155288f8c1f272ebc7",
    "relevant_keywords": [
      "clustering",
      "unsupervised learning"
    ],
    "stage1_timestamp": "2025-05-15T02:16:32.635192"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用Bregman散度进行聚类分析，目的是识别保理业务中客户的共同特征以评估其支付风险。这直接涉及信用风险评估，属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是使用Bregman散度进行聚类分析，目的是识别保理业务中客户的共同特征以评估其支付风险。这直接涉及信用风险评估，属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:41:34.132790"
}