{
  "paper": {
    "id": 3323,
    "title": "Auditor-Client Compatibility and Audit Firm Selection",
    "abstract": "We examine auditor switching conditional on the compatibility of clients and their auditors using a unique text-based measure of similarity of financial disclosures. We find clustering of clients within an audit firm based on this measure. We find that clients with the lowest similarity scores are significantly more likely (9.4%-10.6%) to switch auditors, and will change to an audit firm to which they are more similar. Regarding the effect on audit quality, we find that discretionary accruals are lower when similarity is higher. However, accounting restatements are more likely when text disclosures that are unaudited business description, and management discussion and analysis (MD&A) are more similar. We find no such similarity effect for the audited footnotes. Finally, we find that firms that are more similar are less likely to receive a going concern opinion (GCO), but the GCO reporting decision is more accurate. It is unclear if this reflects higher or lower audit quality since firms that are candidates for a GCO are intrinsically different from the average firm in an auditor's portfolio due to their financial distress. One implication of these results is that auditors might have greater involvement in the quality of the text disclosures that are currently not audited.",
    "year": 2016,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "43567fbea501ba735d0821cf79c456a5",
    "relevant_keywords": [
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T01:15:54.791483"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究审计师与客户之间的兼容性及其对审计质量的影响，并未涉及衍生品定价、金融风险管理或投资组合管理等金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究审计师与客户之间的兼容性及其对审计质量的影响，并未涉及衍生品定价、金融风险管理或投资组合管理等金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:10:11.827712"
}