{
  "paper": {
    "id": 2947,
    "title": "Expected median of a shifted Brownian motion: Theory and calculations",
    "abstract": "Financial derivatives linked to the median, the 50%-th percentile of an occupation measure of a stochastic process, have not been extensively studied in realistic models of financial markets, as such derivatives simply did not exist until recently. The Libor reform changed that, as valuing a vast number of financial contracts in the final years before the Libor cessation announcement required calculating the expected value of the median of the time series of Libor versus the risk-free rate spreads, part of which were yet unknown and, thus, stochastic. Numerically-efficient algorithms for calculating the fair value of the median that incorporate both the historical observations and the future dynamics of the spreads in a realistic model have already been studied by Piterbarg. In this paper, we go significantly further and develop methods for calculating the expected value of the median in a model of a Brownian motion with a time-dependent shift where, critically, we do not assume that the historical part of the time series is long enough to make the realized median an a.s. bounded random variable. A whole new approach is required in this case, and we combine a newly-established linearization property of the expected median in the large volatility limit, a universal white noise approximation, and novel Machine Learning techniques to derive a general, numerically efficient algorithm for approximating the expected median across a wide range of model parameters. Theoretical advances and practical solutions to topical problems are presented. Various extensions are discussed.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "47927e6a709a04f99326c71182af12fe",
    "relevant_keywords": [
      "machine learning"
    ],
    "stage1_timestamp": "2025-05-15T02:20:48.250818"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Derivatives Pricing"
    ],
    "justification": "该论文的核心技术是开发一种计算预期中位数的数值高效算法，这在金融领域直接应用于与中位数相关的金融衍生品定价，特别是在Libor改革背景下对金融合约的估值。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"衍生品定价\"],\n  \"justification\": \"该论文的核心技术是开发一种计算预期中位数的数值高效算法，这在金融领域直接应用于与中位数相关的金融衍生品定价，特别是在Libor改革背景下对金融合约的估值。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:39:18.842193"
}