{
  "paper": {
    "id": 698,
    "title": "Research on the Application of Intelligent Computing and Trustworthy Machine Learning in Financial Complex Systems",
    "abstract": "The complexity of financial systems and the rapid increase in data volume are making the use of intelligent computing and trustworthy machine learning more important in finance. This paper discusses how intelligent computing can be applied within complex financial systems and takes a deeper look at the theory behind trustworthy machine learning and how it is used in finance. By combining the structure of complex networks with the computing power of machine learning, the paper also explores the inner workings of large neural networks and considers how to apply the theory of dynamic systems to the tuning of these networks, to improve intelligent computing in complex financial systems. Experiments based on the scientific intelligence + machine conjecture approach were carried out for risk assessment and market forecasting. The results show that these technologies can improve how financial institutions manage risk, help investors get more reliable information about market trends, and meet the transparency needed for regulatory compliance. The use of intelligent computing and trustworthy machine learning in complex financial systems points to a future with lots of potential for innovation and new opportunities.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "a1e83179b4976dee7ae50b064bf173cc",
    "relevant_keywords": [
      "machine learning",
      "neural network",
      "deep learning",
      "representation learning",
      "backpropagation",
      "BP",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T01:53:59.427847"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文讨论了智能计算和可信机器学习在复杂金融系统中的应用，特别是通过实验进行了风险评估和市场预测，这直接关联到金融风险管理领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文讨论了智能计算和可信机器学习在复杂金融系统中的应用，特别是通过实验进行了风险评估和市场预测，这直接关联到金融风险管理领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:55:49.317075"
}