{
  "paper": {
    "id": 604,
    "title": "Systemic risk contagion of green and Islamic markets with conventional markets",
    "abstract": "Financial markets are exposed to extreme uncertain circumstances escalating their tail risk. Sustainable, religious, and conventional markets represent three different markets with various characteristics. Motivated with this, the current study measures the tail connectedness between sustainable, religious, and conventional investments by employing a neural network quantile regression approach from December 1, 2008 to May 10, 2021. The neural network recognized religious and conventional investments with maximum exposure to tail risk following the crisis periods reflecting strong diversification benefits of sustainable assets. The Systematic Network Risk Index spots Global Financial Crisis, European Debt Crisis, and COVID-19 pandemic as intensive events yielding high tail risk. The Systematic Fragility Index ranks the stock market in the pre-COVID period and Islamic stocks during the COVID sample as the most susceptible markets. Conversely, the Systematic Hazard Index nominates Islamic stocks as the chief risk contributor in the system. Given these, we portray various implications for policymakers, regulatory bodies, investors, financial market participants, and portfolio managers to diversify their risk using sustainable/green investments.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "e777054f5d3633e18dd3fbeffd99b61e",
    "relevant_keywords": [
      "neural network",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:52:49.551067"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk",
      "Portfolio Management"
    ],
    "justification": "该论文主要研究可持续、宗教和传统投资之间的尾部风险传染性，并提出了系统性风险指数，这直接涉及金融风险管理。此外，论文还讨论了多样化风险的投资策略，为投资组合管理提供了见解。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\", \"投资组合管理\"],\n  \"justification\": \"该论文主要研究可持续、宗教和传统投资之间的尾部风险传染性，并提出了系统性风险指数，这直接涉及金融风险管理。此外，论文还讨论了多样化风险的投资策略，为投资组合管理提供了见解。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:56:38.066688"
}