{
  "paper": {
    "id": 5147,
    "title": "Systemic risk in international stock markets: Role of the oil market",
    "abstract": "This study aims to investigate the possible systemic risk from the oil market and to assess the risk contagions of oil price shocks that have negative consequences for international stock markets. A pseudo out-of-sample forecasting exercise is applied in this study. The symmetric and asymmetric delta conditional value at risk (Delta CoVaR) approach recently proposed by Adrian and Brunnermeier (2016) on the basis of a quantile regression is also used. This novel methodology allows a measure of contagion risk related to the oil market to be identified. Then, whether the risk contribution for a given market is significant is detected when distinguishing between tail events driven by financial factors, economic fundamentals, or both. The results from the use of both in-sample and out-of-sample tests in the empirical work show that international risk spillovers are significantly affected by oil price shocks. Further, the predictability of systemic risk spillovers based on the oil market is robust during positive (or negative) oil return periods and high (or low) market volatility periods over long time horizons and is not covered by past Delta CoVaR information. Therefore, oil market returns are stated as being effective predictors of international systemic risk.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "9bc0f9a89f97bafbd5c512dfb642b246",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:44:43.958670"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on measuring systemic risk and risk contagions from oil price shocks to international stock markets using Delta CoVaR methodology, which is a tool for assessing financial risk. The study's primary objective is to understand and predict risk spillovers, a core aspect of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on measuring systemic risk and risk contagions from oil price shocks to international stock markets using Delta CoVaR methodology, which is a tool for assessing financial risk. The study's primary objective is to understand and predict risk spillovers, a core aspect of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:31:08.112390"
}