{
  "paper": {
    "id": 3712,
    "title": "MODELING AND FORECASTING FINANCIAL PERFORMANCE OF A BUSINESS: STATISTICAL AND ECONOMETRIC APPROACH",
    "abstract": "By employing statistical methods, econometric modeling and forecasting financial indices this study attempts to analyze financial performance of a typical Russian company operating in consumer goods industry. Financial data for analysis has been obtained in the statements of the company for 2016-2018 and are presented as monthly time series. The approach to empirical research adopted for this study is a mixed time series methodology based on methods to detect trends and abnormal observations, tests for stationarity, graphical analysis of autocorrelation function and partial autocorrelation function, methods of constructing and assessment of econometric models, and the comparison of forecast capabilities of constructed models. This research offers multiple regression model of dependence of profit on other financial indices. To forecast profit and other indices autoregressive moving average model is also examined in this study. Constructed models were applied to test forecasts of profit. The findings demonstrated the advantages of forecasting based on multifactor linear regression model. The point and interval forecasts for upcoming period are presented. The findings of this study demonstrate that there is no positive dynamics of monthly profit, however, there is no risk of bankruptcy as well. The second major finding was that the negative influence of increased net cost, decreased production and sales volumes could cause the decrease in profit during the period forecasted. (c) 2019 Published by Future Academy www.FutureAcademy.org.UK",
    "year": 2019,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "6f93074779af5fdab1f24d358faf5b0f",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:29:00.237886"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要关注企业财务绩效的建模和预测，使用了统计和计量经济学方法，但并未涉及衍生品定价、金融风险管理或投资组合管理等特定金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要关注企业财务绩效的建模和预测，使用了统计和计量经济学方法，但并未涉及衍生品定价、金融风险管理或投资组合管理等特定金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:35:32.681261"
}