{
  "paper": {
    "id": 1090,
    "title": "Prediction of stock market characteristics using neural networks",
    "abstract": "International stocks trading, currency and derivative contracts play an increasingly important role for many investors. Neural network is playing a dominant role in predicting the trends in stock markets and in currency speculation. In most economic applications, the success rate using neural networks is limited to 70-80%. By means of the new approach of GMDH (Group Method of Data Handling) neural network predictions can be improved further by 10-15%. It was observed in our study, that using GMDH for short, noisy or inaccurate data sample resulted in the best-simplified model. In the GMDH model accuracy of prediction is higher and the structure is simpler than that of the usual full physical model. As an example, prediction of the activity on the stock exchange in New York was considered. On the basis of observations in the period of Jan '95 to July '98, several variables of the stock market (S&P 500, Small Cap, Dow Jones etc.) were predicted. A model portfolio using various stocks (Amgen, Merck, Office depot etc.) was built and its performance was evaluated based on neural network forecasting of the closing prices. Comparison of results was made with various neural network models such as Multilayer Perceptrons with Back Propagation, and the GMDH neural network. Variations of GMDH were studied and analysis of their performance is reported in the paper.",
    "year": 1999,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "98ac498a6ec72d2dec63b65758bc6cdf",
    "relevant_keywords": [
      "machine learning",
      "neural network",
      "deep learning",
      "backpropagation",
      "BP",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T00:52:00.292735"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文主要研究使用神经网络（特别是GMDH方法）预测股票市场趋势和构建模型投资组合，并评估其表现。这些内容直接关联到投资组合管理的核心任务，即资产选择和组合优化。虽然提到了衍生品合约，但论文的核心应用是股票市场预测和组合构建，而非衍生品定价或风险管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文主要研究使用神经网络（特别是GMDH方法）预测股票市场趋势和构建模型投资组合，并评估其表现。这些内容直接关联到投资组合管理的核心任务，即资产选择和组合优化。虽然提到了衍生品合约，但论文的核心应用是股票市场预测和组合构建，而非衍生品定价或风险管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:24:43.146572"
}