{
  "paper": {
    "id": 1577,
    "title": "A multivariate approach for the simultaneous modelling of market risk and credit risk for cryptocurrencies",
    "abstract": "This paper proposes a set of models which can be used to estimate the market risk for a portfolio of crypto-currencies, and simultaneously to estimate also their credit risk using the Zero Price Probability (ZPP) model by Fantazzini et al. (Comput Econ 31(2):161-180, 2008), which is a methodology to compute the probabilities of default using only market prices. For this purpose, both univariate and multivariate models with different specifications are employed. Two special cases of the ZPP with closed-form formulas in case of normally distributed errors are also developed using recent results from barrier option theory. A backtesting exercise using two datasets of 5 and 15 coins for market risk forecasting and a dataset of 42 coins for credit risk forecasting was performed. The Value-at-Risk and the Expected Shortfall for single coins and for an equally weighted portfolio were calculated and evaluated with several tests. The ZPP approach was used for the estimation of the probability of default/death of the single coins and compared to classical credit scoring models (logit and probit) and to a machine learning algorithm (Random Forest). Our results reveal the superiority of the t-copula/skewed-t GARCH model for market risk, and the ZPP-based models for credit risk.",
    "year": 2020,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "3066418745e2218eebe6c6f1d3424ade",
    "relevant_keywords": [
      "machine learning",
      "classification",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T00:57:12.702862"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是同时建模市场风险和信用风险，特别是使用Value-at-Risk和Expected Shortfall来评估风险，并比较不同模型在信用风险预测中的表现。这些内容明确属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是同时建模市场风险和信用风险，特别是使用Value-at-Risk和Expected Shortfall来评估风险，并比较不同模型在信用风险预测中的表现。这些内容明确属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:20:07.913347"
}