{
  "paper": {
    "id": 2423,
    "title": "Research on Risk Prediction Model of Internet Finance Based on Cloud Computing",
    "abstract": "With the rapid development of the Internet, the traditional Internet financial risk prediction methods can no longer meet the needs of individuals and enterprises, so the concept of cloud computing arises at the historic moment. Cloud computing has subverted the traditional financial risk prediction method and has been widely studied and applied for its distributed, dynamic and autonomous characteristics. How to efficiently and reasonably schedule the resources of cloud data center and improve the accuracy of financial risk prediction is the focus of current research. How to quantify financial risk and financial risk early warning is one of the urgent problems to be solved. Under the framework of cloud computing, this paper combines the feature extraction and data weighting to study the user's basic attribute data and a large number of downloaded APP types. After that, linear regression with penalty is used to construct the prediction model to improve insolvency. The accuracy of customer default judgment can realize local optimization, so as to improve the prediction and control of hidden risks of customer commercial bank loans and greatly reduce the default risk of bank loans.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "e4d8c745ac063927272f97ec435707d0",
    "relevant_keywords": [
      "regression",
      "feature learning",
      "feature representation"
    ],
    "stage1_timestamp": "2025-05-15T02:15:26.953057"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是构建一个基于云计算的金融风险预测模型，旨在提高客户违约判断的准确性，并降低银行贷款的违约风险，这明显属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是构建一个基于云计算的金融风险预测模型，旨在提高客户违约判断的准确性，并降低银行贷款的违约风险，这明显属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T14:22:35.281123"
}