{
  "paper": {
    "id": 3279,
    "title": "Factors Affecting Bankruptcy Risks of Firms: Evidence from Listed Companies on Vietnamese Stock Market",
    "abstract": "This study aims to investigate the influence of internal factors on the bankruptcy risk of an enterprise through a sample of 439 companies listed on the Vietnamese stock exchange. The research collected secondary data from annual audited financial statements from 2008 to 2019 of listing companies. Using two different regression models with two dependent variables, six independent and control variables, we discovered that three of the model's six factors, namely return on total assets, current payment rate, and financial leverage, influence the risk of bankruptcy and account for 86.78% of the variations in firm bankruptcy risk. Financial leverage has the opposite effect on the Z-score index, increasing the risk of bankruptcy of listed firms. Return on total assets and current ratio have a positive impact on the Z-score index, reducing the risk of bankruptcy of listed companies. The findings also revealed that there is no evidence that the size of a corporation, its fixed asset investment ratio, or the size of an auditing firm have an impact on the Z-score index. These findings provide crucial evidence for business owners and managers, as well as shareholders making future capital investment decisions. Our findings can be applied to other businesses in Vietnam and similar jurisdictions.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "82a00a525dc2611dd00557fe7c09df52",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:24:39.615560"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on analyzing factors affecting bankruptcy risks of firms, which is a key aspect of financial risk management. The study uses regression models to assess the impact of various financial indicators on bankruptcy risk, providing insights for business owners and managers to mitigate such risks.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on analyzing factors affecting bankruptcy risks of firms, which is a key aspect of financial risk management. The study uses regression models to assess the impact of various financial indicators on bankruptcy risk, providing insights for business owners and managers to mitigate such risks.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:37:19.426892"
}