{
  "paper": {
    "id": 8,
    "title": "Neural Network Model for Efficient portfolio Management and Time Series Forecasting",
    "abstract": "Prediction tasks are often carried out efficiently by soft computing methods. This paper presents how techniques in machine learning and soft computing areas can be easily applied to problems in computational finance. One such prevalent problems is that of portfolio allocation. The typical case is that of predicting stocks with high returns and allocating them to the basket of portfolios. This process is known as the stock selection in portfolio construction. It is about this problem, the paper is designed to address with the help of machine learning task especially one of the supervised learning methods, Artificial Neural Networks. Once this task is accomplished, to find out an efficient portfolio, among a basket of financial portfolios, applied various approaches. One such approach is to compute the minimum variance portfolio subject to the target return. This is the basis of Mean variance theory put forward by Markowitz. Based on this approach the neural network is trained to attain an efficient portfolio. A specific market (India-BSE, NSE) and a particular asset (such as a stock market) are focused.",
    "year": 2020,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "b17465f771e1137c5b1de721969596cd",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "neural network",
      "backpropagation",
      "BP"
    ],
    "stage1_timestamp": "2025-05-15T00:38:16.217411"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是使用人工神经网络进行股票选择和投资组合构建，特别是通过最小方差组合来实现高效投资组合，这直接对应于投资组合管理领域。论文明确提到了Markowitz的均值方差理论，并应用于特定市场的股票组合优化。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Portfolio Management\"],\n  \"justification\": \"该论文的核心技术是使用人工神经网络进行股票选择和投资组合构建，特别是通过最小方差组合来实现高效投资组合，这直接对应于投资组合管理领域。论文明确提到了Markowitz的均值方差理论，并应用于特定市场的股票组合优化。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:34:27.714151"
}