{
  "paper": {
    "id": 1671,
    "title": "FORECASTING SYSTEMIC RISK OF CHINA'S BANKING INDUSTRY BY PARTIAL DIFFERENTIAL EQUATIONS MODEL AND COMPLEX NETWORK",
    "abstract": "The monitoring and controlling of systemic risk have increasingly become the focus of attention in the financial field. It is important and difficult to accurately forecast systemic financial risk. In this paper, we propose a spatio-temporal partial differential equation model to describe the systemic risk of China's Banking Industry based on network, clustering, and real date of 24 China's A-share listed banks. The model considers the combined influence of local risk and transboundary contagion effects, and the prediction relative accuracy is up to 95%. Simulation results confirm that strict joint control measures, the timeliness of central bank intervention, and differences in bank strategies are efficient for reducing systemic risk. To our knowledge, this is the first paper to apply a PDE model to forecast systemic financial risk.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "b0ee71380683c66590623cff5bf15d01",
    "relevant_keywords": [
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T02:06:22.397863"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on forecasting systemic risk in China's banking industry using a partial differential equations model and complex network analysis, which is directly related to financial risk management. The study aims to monitor and control systemic financial risk, a key concern in risk management, rather than derivatives pricing or portfolio management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on forecasting systemic risk in China's banking industry using a partial differential equations model and complex network analysis, which is directly related to financial risk management. The study aims to monitor and control systemic financial risk, a key concern in risk management, rather than derivatives pricing or portfolio management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:47:17.406484"
}