{
  "paper": {
    "id": 1229,
    "title": "Research on Efficiency in Credit Risk Prediction Using Logistic-SBM Model",
    "abstract": "Network lending, an innovative financial lending product, is separated from traditional financial media and implemented on the Internet platform. We study the credit risk prediction of online loan based on risk efficiency analysis. Moreover, we put forward the concept of borrower risk efficiency and apply it to risk prediction. The main task of this study is to establish risk efficiency characteristics on the basis of referring to various risk characteristics and carry out risk prediction after passing the screening of a series of features. The framework is realized by combining logistic regression and slack-based measure (SBM), and feature selection and verification are carried out through machine learning and statistics. Firstly, the efficiency risk characteristics are extracted and the risk efficiency is calculated by MaxDEA. Secondly, the features are screened and verified by Python. Then, the efficiency value obtained by SBM method is used as a new index for the training and testing of logistic model together with the initial related indexes. Moreover, in order to prove the effectiveness of the proposed credit risk prediction control scheme based on risk efficiency, the research compares the prediction before and after adding the risk efficiency feature. The simulation results demonstrated that the logistic-SBM model is more suitable for credit risk prediction than the commonly used logistic method, which realized the efficient prediction of credit risk based on the logistic-SBM model. Finally, some suggestions are put forward to China's regulatory authorities and the platform itself to control the credit risk of Internet lending industry.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "e2d1923695785fbe4d1ee3e2c35a66ba",
    "relevant_keywords": [
      "machine learning",
      "classification",
      "feature learning",
      "feature representation"
    ],
    "stage1_timestamp": "2025-05-15T02:00:30.517428"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心研究内容是信用风险预测，特别是针对网络借贷平台的借款人信用风险效率分析。通过结合逻辑回归和松弛基测度（SBM）方法，建立风险效率特征并进行风险预测，这直接属于金融风险管理领域。论文的研究目标和应用场景明确指向信用风险的控制和预测，而非衍生品定价或投资组合管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"该论文的核心研究内容是信用风险预测，特别是针对网络借贷平台的借款人信用风险效率分析。通过结合逻辑回归和松弛基测度（SBM）方法，建立风险效率特征并进行风险预测，这直接属于金融风险管理领域。论文的研究目标和应用场景明确指向信用风险的控制和预测，而非衍生品定价或投资组合管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:50:54.482345"
}