{
  "paper": {
    "id": 1566,
    "title": "The predictive accuracy of Sukuk ratings; Multinomial Logistic and Neural Network inferences",
    "abstract": "The development of Sukuk market as the alternative to the existing conventional bond market has risen the issue of rating the Sukuk issuance. These credit ratings fulfill a key function of information transmission in capital market. Moreover, Basel Committee for Banking Supervision has now instituted capital charges for credit risk based on credit ratings. Basel II framework allowed the bank to establish capital adequacy requirements based on ratings provided by external credit rating agencies or determine rating of its investment internally for more advance approach. For these reasons, ratings are considered important by issuers, investors, and regulators alike. This study provides an empirical foundation for the investors to estimate the ratings assigned using the approach from several rating agencies and past researches on bond ratings. It tries to compare the accuracy of two logistic models; Multinomial Logistic Regression and Neural Network to create a model of rating probability from several financial variables. (C) 2015 Elsevier B.V. All rights reserved.",
    "year": 2015,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "512b6d05c3be7afde2ba52472bcd4b25",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "neural network",
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T02:05:08.078618"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要研究使用Multinomial Logistic Regression和Neural Network模型预测Sukuk的信用评级，这直接关系到信用风险的评估和管理，属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文主要研究使用Multinomial Logistic Regression和Neural Network模型预测Sukuk的信用评级，这直接关系到信用风险的评估和管理，属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:47:59.200898"
}