{
  "paper": {
    "id": 890,
    "title": "The use of predictive analytics in finance",
    "abstract": "Statistical and computational methods are being increasingly integrated into Decision Support Systems to aid management and help with strategic decisions. Researchers need to fully understand the use of such techniques in order to make predictions when using financial data. This paper therefore presents a method based literature review focused on the predictive analytics domain. The study comprehensively covers classification, regression, clustering, association and time series models. It expands existing explanatory statistical modelling into the realm of computational modelling. The methods explored enable the prediction of the future through the analysis of financial time series and cross-sectional data that is collected, stored and processed in Information Systems. The output of such models allow financial managers and risk oversight professionals to achieve better outcomes. This review brings the various predictive analytic methods in finance together under one domain. (c) 2022 The Authors. Publishing services by Elsevier B.V. on behalf of KeAi Communications Co. Ltd. This is an open access article under the CC BY license (http://creativecommons.org/licenses/by/4.0/).",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "ec3b280d2b67a3981d30bc4f5c4f1fe7",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "unsupervised learning",
      "classification",
      "regression",
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T01:56:17.560899"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要关注预测分析方法的综述，包括分类、回归、聚类等技术在金融数据中的应用，但并未明确指出这些技术具体应用于衍生品定价、金融风险管理或投资组合管理等特定领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要关注预测分析方法的综述，包括分类、回归、聚类等技术在金融数据中的应用，但并未明确指出这些技术具体应用于衍生品定价、金融风险管理或投资组合管理等特定领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:53:55.239852"
}