{
  "paper": {
    "id": 975,
    "title": "Predicting Default Loans Using Machine Learning (OptiML)",
    "abstract": "Credit risk management is essential to financial institutions as it directly affects business results. Although artificial intelligence (AI) and machine learning are not new, microcredit organizations are shy in accepting these methods in their credit risk assessment process and still use standard credit scoring methods based on linear calculation of a small number of indicators. This scoring model gives mixed and unreliable results. Machine learning, on the other hand, offers a much broader view of a client and can be used to manage not only credit risk, but other business risks too. As this paper demonstrates, prediction using machine learning models is very high but depends on the quality of the data. Several algorithms (to be more specific - BigML's OptiML) were used to identify the best suited for the lending business.",
    "year": 2019,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "092ecd84c25bb52c39b421181ad2eb76",
    "relevant_keywords": [
      "machine learning",
      "classification",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T01:57:29.826597"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on using machine learning models to predict default loans, which is a key aspect of credit risk management, a subfield of financial risk management. The study aims to improve the accuracy of credit risk assessment, directly addressing financial risk management challenges.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on using machine learning models to predict default loans, which is a key aspect of credit risk management, a subfield of financial risk management. The study aims to improve the accuracy of credit risk assessment, directly addressing financial risk management challenges.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:53:04.689608"
}