{
  "paper": {
    "id": 1029,
    "title": "Construction of Enterprise Financial Early Warning Model Based on Logistic Regression and BP Neural Network",
    "abstract": "At present, the number of enterprises in financial crisis in China is rising sharply, and the ability of enterprises to resist risks is generally weak. Therefore, it is necessary to establish a corporate financial crisis early warning system, to detect the signs of corporate financial crisis before it arrives and to inform managers in advance, so that effective measures can be taken as soon as possible to eliminate hidden dangers. This paper selects the two-year data of 40 companies from 2017 to 2019 as training samples and the data of 20 companies as prediction samples. After testing, 12 index variables that can reflect the financial problems of energy companies are finally selected as the basis for modeling. Then, we use Logistic and BP neural network modeling, respectively, to study and compare the data from 2017 to 2019 to predict the financial risk in the following year. The results show that the BP neural network model in the two models is better than the Logistic model in terms of fitting degree or prediction accuracy for enterprise financial early warning. Therefore, the BP neural network model has a better effect and is more suitable for the practical application of enterprises in China.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "a701936ddea260a99869f935c4a95b6b",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "neural network",
      "backpropagation",
      "BP",
      "sigmoid",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T01:58:08.477604"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用Logistic回归和BP神经网络构建企业财务预警模型，旨在提前发现企业财务危机的迹象并通知管理者，这属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"该论文的核心技术是使用Logistic回归和BP神经网络构建企业财务预警模型，旨在提前发现企业财务危机的迹象并通知管理者，这属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:52:41.259949"
}