{
  "paper": {
    "id": 2353,
    "title": "Early warning model and prevention of regional financial risk integrated into legal system",
    "abstract": "In order to improve the laws and regulations of the financial system, in the construction of laws and regulations, the traditional financial risk Early Warning (EW) model is optimized. The financial prevention and control measures with legal protection are implemented to warn the financial risks, which plays an important role in the construction of the rule of law in the Financial Market (FM) and the establishment of financial risk prevention and control laws and regulations. This paper combines the deep learning model and the Markov regime Switching Vector Auto Regression (MS-VAR) model and constructs a regional financial risk EW model from the following aspects: macroeconomic operation EW indicators, regional economic risk EW indicators, regional financial institution risk EW indicators. The model is empirically researched and analyzed. The results show that the fluctuation trend of the macroeconomic pressure index in the time series is relatively large, and the overall fluctuation of the regional economic pressure index is small, and fluctuates around 0 in most periods. After the financial crisis, local governments stepped up their supervision of non-performing corporate and household loans. From 2011 to 2018, the non-performing loan ratio began to decline, and the overall fluctuation of the regional financial comprehensive stress index was small, fluctuating around 0. Due to the lack of legal regulation, from the perspective of the regional economy, the risk level is more likely to change from low risk to moderate risk, while the risk status is less likely to change from high risk to moderate risk. From the perspective of regional financial institutions, the probabilities of maintaining low risk and moderate risk are 0.98 and 0.97, respectively, which is stronger than maintaining the stability of high risk. From the perspective of the state transition of the regional financial risk composite index, the probability of maintaining low risk and high risk is 0.97 and 0.93, which is higher than maintaining the stability of medium risk. The Deep Learning (DL) regional financial risk EW MS-VAR model has strong risk prediction ability. The model can better analyze the conversion probability of regional financial risk EW index and has better risk EW ability. This paper enhances the role of legal systems in financial risk prevention and control. The regional financial risk EW model incorporating financial legal indicators can better describe the regional financial risk level, and the EW results are basically consistent with the actual situation. In order to effectively prevent financial risks and ensure the safety of the financial system, it is recommended that the government improve local debt management, improve financial regulations and systems, and improve the legislative level of financial legal supervision.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "71b5a5e359d7819eeb22b6660c44c93e",
    "relevant_keywords": [
      "deep learning",
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T02:14:19.673738"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要研究区域金融风险的早期预警模型，结合深度学习和MS-VAR模型来预测和分析金融风险，并探讨了法律体系在金融风险防控中的作用，这明显属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文主要研究区域金融风险的早期预警模型，结合深度学习和MS-VAR模型来预测和分析金融风险，并探讨了法律体系在金融风险防控中的作用，这明显属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:42:55.973829"
}