{
  "paper": {
    "id": 1873,
    "title": "Interpretable Operational Risk Classification with Semi-Supervised Variational Autoencoder",
    "abstract": "Operational risk management is one of the biggest challenges nowadays faced by financial institutions. There are several major challenges of building a text classification system for automatic operational risk prediction, including imbalanced labeled/unlabeled data and lacking interpretability. To tackle these challenges, we present a semi-supervised text classification framework that integrates multi-head attention mechanism with Semi-supervised variational inference for Operational Risk Classification (SemiORC). We empirically evaluate the framework on a real-world dataset. The results demonstrate that our method can better utilize unlabeled data and learn visually interpretable document representations. SemiORC also outperforms other baseline methods on operational risk classification.",
    "year": 2020,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "595a038f55868a92cd04008b80224221",
    "relevant_keywords": [
      "machine learning",
      "semi-supervised learning",
      "classification",
      "neural network",
      "deep learning",
      "representation learning",
      "autoencoder",
      "attention mechanism"
    ],
    "stage1_timestamp": "2025-05-15T02:08:38.973304"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on operational risk classification, which is a key component of financial risk management in financial institutions. The proposed method aims to improve the prediction and interpretability of operational risks, directly addressing challenges in this specific area of financial risk.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on operational risk classification, which is a key component of financial risk management in financial institutions. The proposed method aims to improve the prediction and interpretability of operational risks, directly addressing challenges in this specific area of financial risk.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:45:31.135542"
}