{
  "paper": {
    "id": 1403,
    "title": "An Application of Locally Linear Model Tree Algorithm for Predictive Accuracy of Credit Scoring",
    "abstract": "Economical crisis in recent years leads the banks to pay more attention to credit risk assessment. Financial institutes have used various kinds of decision support systems, to reduce their credit risk. Credit scoring is one of the most important systems that have been used by the banks and financial institutes. In this paper, an application of locally linear model tree (LOLIMOT) algorithm was experimented to improve the predictive accuracy of credit scoring. Using the Australian credit data from UCI machine learning database repository, the algorithm was found an increase in predictive accuracy in comparison with some other well-known methods in the credit scoring area. The experiments also indicate that LOLIMOT get the best result in terms of average accuracy and type I and II error.",
    "year": 2011,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "f2ab9bf93c1dc3a6730779b00dc73f8d",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T02:02:22.765861"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on improving the predictive accuracy of credit scoring using the LOLIMOT algorithm, which is directly related to assessing and managing credit risk—a key aspect of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on improving the predictive accuracy of credit scoring using the LOLIMOT algorithm, which is directly related to assessing and managing credit risk—a key aspect of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:49:05.805913"
}