{
  "paper": {
    "id": 3429,
    "title": "Use and access in the new ecology of public messaging",
    "abstract": "The use of social media and other communication technologies have created a new ecology of public messaging. As it is a core task of government to inform its residents about risks, public managers and emergency managers, specifically, must understand this new ecology if they are to effectively communicate with the public. A challenge of this new media environment is the differential access of members of the community to various technologies. Partial proportional odds regression (PPO) provides a strategy that is useful to separate effects of access from effects of use. This article illustrates the use of PPO regression to separate access and use effects based on a survey which followed a series of severe weather events in the spring of 2016. The survey includes an address-based sample of residents in the state of Oklahoma to ask about the use of various communication technologies to share information about the weather system (among other subjects). We find that age and work status are related to access while income, gender, race and exposure to extreme weather are related to use of various communication media. This information provides emergency managers with a stronger foundation for developing a portfolio of information options for their communities.",
    "year": 2022,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "b4a66e09e19d7793db88b0e06a42ff1d",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:16:55.573547"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是公共信息传播的新生态，特别是关于紧急情况下信息传播的技术使用和访问差异。虽然使用了回归分析技术，但其应用场景是公共管理和紧急情况沟通，与金融领域无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是公共信息传播的新生态，特别是关于紧急情况下信息传播的技术使用和访问差异。虽然使用了回归分析技术，但其应用场景是公共管理和紧急情况沟通，与金融领域无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:09:45.315917"
}