{
  "paper": {
    "id": 355,
    "title": "An Adaptive Neuro-Fuzzy System for Stock Portfolio Analysis",
    "abstract": "We propose an adaptive neuro-fuzzy inference system (ANFIS) for stock portfolio return prediction. Previous work has shown that portfolio optimization can be improved by using predicted stock earnings rather than historical earnings. We show that predicted portfolio returns can be improved by using ANFIS and taking as input a variety of technical and fundamental attributes about various indices of the stock market. To generate membership functions, we use a robust noise rejection-clustering algorithm. The neuro-fuzzy model is tested on portfolios constituted from the Tehran Stock Exchange. In our experiments, the proposed method performs better in predicting the portfolio return than the classical Markowitz portfolio optimization method, a multiple regression, a neural network, and the Sugeno-Yasukawa method. (C) 2010 Wiley Periodicals, Inc.",
    "year": 2011,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "ec7c1ea2f33303d51dbf2119e2aa81e5",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "neural network",
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T00:42:32.478010"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "The paper focuses on using an adaptive neuro-fuzzy inference system (ANFIS) for stock portfolio return prediction and compares its performance with classical portfolio optimization methods like the Markowitz model. This clearly indicates that the primary application is in the field of Portfolio Management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Portfolio Management\"],\n  \"justification\": \"The paper focuses on using an adaptive neuro-fuzzy inference system (ANFIS) for stock portfolio return prediction and compares its performance with classical portfolio optimization methods like the Markowitz model. This clearly indicates that the primary application is in the field of Portfolio Management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:31:38.277653"
}