{
  "paper": {
    "id": 3912,
    "title": "Legion: Automatically Pushing the Envelope of Multi-GPU System for Billion-Scale GNN Training",
    "abstract": "Graph neural network(GNN) has been widely applied in real-world applications, such as product recommendation in e-commerce platforms and risk control in financial management systems. Several cache-based GNN systems have been built to accelerate GNN training in a single machine with multiple GPUs. However, these systems fail to train billion-scale graphs efficiently, which is a common challenge in the industry. In this work, we propose Legion, a system that automatically pushes the envelope of multi-GPU systems for accelerating billion-scale GNN training. First, we design a hierarchical graph partitioning mechanism that significantly improves the multi-GPU cache performance. Second, we build a unified multi-GPU cache that helps to minimize the PCIe traffic incurred by caching both graph topology and features with the highest hotness. Third, we develop an automatic cache management mechanism that adapts the multi-GPU cache plan according to the hardware specifications and various graphs to maximize the overall training throughput. Evaluations on various GNN models and multiple datasets show that Legion supports training billion-scale GNNs in a single machine and significantly outperforms the state-of-the-art cache-based systems on small graphs.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "676ec406e48e1368e9e018603b197ffe",
    "relevant_keywords": [
      "machine learning",
      "neural network",
      "deep learning",
      "representation learning"
    ],
    "stage1_timestamp": "2025-05-15T02:30:58.401841"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是多GPU系统加速大规模图神经网络训练的技术，虽然提到金融管理系统中的风险控制作为应用示例之一，但论文的核心技术并未专门针对金融风险管理、衍生品定价或投资组合管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是多GPU系统加速大规模图神经网络训练的技术，虽然提到金融管理系统中的风险控制作为应用示例之一，但论文的核心技术并未专门针对金融风险管理、衍生品定价或投资组合管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:34:44.693751"
}