{
  "paper": {
    "id": 1390,
    "title": "Credit Risk Evaluation Model Development Using Support Vector Based Classifiers",
    "abstract": "This article presents a study on development of credit risk evaluation model using Support Vector Machines based classifiers, such as linear SVM, stochastic gradient descent based SVM, LibSVM, Core Vector Machines (CVM), Ball Vector Machines (BVM) and other. Discriminant analysis was applied for evaluation of financial instances and dynamic formation of bankruptcy classes. The possibilities of feature selection application were also researched by applying correlation-based feature subset evaluator and Tabu search. This research showed that different SVM classifiers produced similar results, including Core Vector Machines based classifier. Yet proper selection of classifier and its parameters remains an important problem.",
    "year": 2011,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "c144f69261cd6d854544d1f1f1281090",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM",
      "feature learning"
    ],
    "stage1_timestamp": "2025-05-15T02:02:22.743872"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on developing a credit risk evaluation model using Support Vector Machines, which is directly related to assessing and managing financial risks, specifically credit risk, a key component of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on developing a credit risk evaluation model using Support Vector Machines, which is directly related to assessing and managing financial risks, specifically credit risk, a key component of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:49:24.977651"
}