{
  "paper": {
    "id": 6626,
    "title": "Characteristics of individuals at risk of malnutrition in Thailand: an investigation focusing on income insecurity",
    "abstract": "Without understanding the characteristics of disadvantaged individuals who are at risk of malnutrition, it is impossible for policymakers to develop and implement effective policies to combat malnourishment among individuals facing income insecurity. With an accurate picture of who is at the greatest risk, policymakers will be able to target the most vulnerable population and develop interventions tailored to their needs. However, there is a dearth of research in Thailand which presents such characteristics and makes it more difficult to design appropriate policy interventions. This study we applied a logit regression model on data collected by Food and Agriculture Organization (FAO) in 2021 (n = 981). The findings of this study indicate that gender, age, place of residence, educational attainment, and family composition are all strong predictors of access to adequate nutrition among those who are financially disadvantaged. Specifically, we observed that women aged 30-44 years old are 11.5% more likely to not have access to adequate nutrition due to financial constraints compared to those aged 18-29 years old. In consideration of these important predictors, policymakers are recommended to take bold steps including these aforementioned factors while formulating strategies and policy interventions to address malnutrition among the financially disadvantaged.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "3e268f896fa9b789c22708b92225803b",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T03:00:04.967459"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究泰国收入不安全人群的营养不良风险特征，应用回归模型分析社会人口因素对营养获取的影响，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究泰国收入不安全人群的营养不良风险特征，应用回归模型分析社会人口因素对营养获取的影响，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:27:32.143416"
}