{
  "paper": {
    "id": 1324,
    "title": "Model of Investment Risk Prediction Based on Neural Network and Data Mining Technique for Construction Project",
    "abstract": "The operating status of a construction project is disclosed periodically in investment risks. As a result, investors usually only get information about the investment risks, an employer may be in after the formal financial statement has been published. If the employer executives intentionally package financial statements with the purpose of hiding the actual status of the constructive project, then investors will have even less chance of obtaining the real financial information. To improve the accuracy of the investment risk prediction, risk ratios, non-risk ratios, and factor analysis had been used to extract adaptable variables. Moreover, the neural network and data mining technique were used to build the investment risk prediction model. The empirical experiment with a total of risk and non-risk ratios and projects as the initial samples obtained a satisfactory result, which testifies for the feasibility and validity of our proposed methods for the investment risks prediction of constructive project.",
    "year": 2008,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "42d42c88924d22160347ed6343b896e4",
    "relevant_keywords": [
      "neural network",
      "deep learning",
      "representation learning",
      "backpropagation",
      "BP",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T02:01:44.722333"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用神经网络和数据挖掘技术构建投资风险预测模型，旨在提高对建设项目投资风险的预测准确性。这直接涉及金融风险管理领域，特别是投资风险评估和预测。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是使用神经网络和数据挖掘技术构建投资风险预测模型，旨在提高对建设项目投资风险的预测准确性。这直接涉及金融风险管理领域，特别是投资风险评估和预测。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:49:49.174607"
}