{
  "paper": {
    "id": 6507,
    "title": "Easier Said than Done: Predicting Downside Risks to House Prices in Croatia",
    "abstract": "House price dynamics are particularly interesting for macroprudential policymakers due to their effects on financial stability and future macroeconomic performance. As the main goal of macroprudential policy is to mitigate systemic risks, it is essential to monitor the central tendency of future house price growth dynamics and focus on downside risks and their possible materialisation. This research, the first of its kind applied to the Croatian housing market, tries to identify and capture the main drivers of house price -at -risk (HaR) for the period between 2002Q1 and 2022Q3. It also predicts downside risks to future real house price growth. Based on the quantile regression results, we conclude that downside risks on housing market have increased in recent years. The approach is found to be insightful to monitor the uncertainty of the forecasts and decomposing the drivers to house price forecasting. Our results have implications for a range of policies that influence housing markets.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "7e59d12c01161080d11f0209eb3c6976",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:58:34.313727"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on predicting downside risks to house prices and their implications for financial stability, which is a key aspect of financial risk management, particularly in the context of macroprudential policy.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on predicting downside risks to house prices and their implications for financial stability, which is a key aspect of financial risk management, particularly in the context of macroprudential policy.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:27:52.819098"
}