{
  "paper": {
    "id": 2818,
    "title": "Contribution of artificial intelligence for understanding animal rabies epidemiology in Morocco: What are the perspectives of an innovative and predictive approaches?",
    "abstract": "Rabies is a major zoonotic disease legally notifiable in Morocco and elsewhere. Given the burden of rabies and its impact on public health, several national control programs have been implemented since 1986, without achieving their expected objectives. The aim of this study was to design a predictive analysis of rabies in Morocco. The expected outcome was the construction of probabilistic diagrams that can guide actions for the integrated control of this disease, involving all stakeholders, in the country. Such modeling is an essential step in operational epidemiology to optimize expenditure of public funds allocated to the integrated strategy for fighting this disease. The methodology employed combined the use of geospatial analysis tools (kriging) and artificial intelligence models (Machine Learning). In order to investigate the link between the risk of rabies within a territorial municipality (commune) and its socio-economic situation, the following data were analyzed: (1) health data: reported animal cases of rabies between 2004 and 2021 and data obtained through the ArcGIS kriging tool (Geospatial data); (2) demographic and socio-economic data. We compared several Machine Learning models. Of these, the Imbalanced-Xgboost model associated with kriging yielded the best results. After optimizing this model, we mapped our results for better visualization. The obtained results complement and consolidate previous study in this field with greater accuracy, showing a strong correlation between a commune's socio-economic status, its geographical location and its risk level of rabies. From this, 399 out of the 1546 communes have been identified as high-risk areas, accounting for 25.8% of the total number of communes. Under this risk-based approach, the results of these analyses make it practical to take targeted decisions for rabies prevention and control, as well as canine population control, in a territorial commune according to its risk level. Such an approach allows obvious optimized distribution of financial resources and adaptation of the control actions to be taken. The study highlights also the importance of using innovative technologies to refine epidemiological approaches and fill gaps in field data. Through this study, we hope to contribute to eradication of rabies in Morocco by providing reliable data and practical recommendations for control actions against rabies.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "1e17bc7c0f80c05767dc4fd0ed67289a",
    "relevant_keywords": [
      "machine learning",
      "classification",
      "regression",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T02:19:46.591221"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究利用机器学习和地理空间分析工具预测摩洛哥的狂犬病风险，并优化公共卫生资源的分配。虽然使用了机器学习技术，但其应用领域是公共卫生和流行病学，而非金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究利用机器学习和地理空间分析工具预测摩洛哥的狂犬病风险，并优化公共卫生资源的分配。虽然使用了机器学习技术，但其应用领域是公共卫生和流行病学，而非金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:39:46.783825"
}