{
  "paper": {
    "id": 3501,
    "title": "On the use of high frequency measures of volatility in MIDAS regressions",
    "abstract": "Many empirical studies link mixed data frequency variables such as low frequency macroeconomic or financial variables with high frequency financial indicators' volatilities, especially within a predictive regression model context The objective of this paper is threefold: First, we relate the standard Least Squares (IS) regression model with high frequency volatility predictors, with the corresponding Mixed Data Sampling Nonlinear LS (MIDAS-NLS) regression model (Ghysels et al., 2005, 2006), and evaluate the properties of the regression estimators of these models. We also consider alternative high frequency volatility measures as well as various continuous time models using their corresponding relevant higher order moments to further analyze the properties of these estimators. Second, we derive the relative MSE efficiency of the slope estimator in the standard IS and MIDAS regressions, we provide conditions for relative efficiency and present the numerical results for different continuous time models. Third, we extend the analysis of the bias of the slope estimator in standard LS regressions with alternative realized measures of risk such as the Realized Covariance, Realized beta and the Realized Skewness when the true DGP is a MIDAS model. (C) 2016 Elsevier B.V. All rights reserved.",
    "year": 2016,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "d1c551ea55ed45b93d59b827bea9ed85",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:26:48.585138"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要研究高频波动率测量在混合数据抽样回归模型中的应用，并分析了不同风险测量方法（如Realized Covariance, Realized beta等）的估计性质。这些内容与金融风险管理密切相关，特别是对市场风险的测量和预测。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文主要研究高频波动率测量在混合数据抽样回归模型中的应用，并分析了不同风险测量方法（如Realized Covariance, Realized beta等）的估计性质。这些内容与金融风险管理密切相关，特别是对市场风险的测量和预测。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:36:24.265318"
}