{
  "paper": {
    "id": 5150,
    "title": "COVID-19 Infection Risk Among Previously Uninfected Adults: Development of a Prognostic Model",
    "abstract": "BackgroundFew models exist that incorporate measures from an array of individual characteristics to predict the risk of COVID-19 infection in the general population. The aim was to develop a prognostic model for COVID-19 using readily obtainable clinical variables. MethodsOver 74 weeks surveys were periodically administered to a cohort of 1381 participants previously uninfected with COVID-19 (June 2020 to December 2021). Candidate predictors of incident infection during follow-up included demographics, living situation, financial status, physical activity, health conditions, flu vaccination history, COVID-19 vaccine intention, work/employment status, and use of COVID-19 mitigation behaviors. The final logistic regression model was created using a penalized regression method known as the least absolute shrinkage and selection operator. Model performance was assessed by discrimination and calibration. Internal validation was performed via bootstrapping, and results were adjusted for overoptimism. ResultsOf the 1381 participants, 154 (11.2%) had an incident COVID-19 infection during the follow-up period. The final model included six variables: health insurance, race, household size, and the frequency of practicing three mitigation behavior (working at home, avoiding high-risk situations, and using facemasks). The c-statistic of the final model was 0.631 (0.617 after bootstrapped optimism-correction). A calibration plot suggested that with this sample the model shows modest concordance with incident infection at the lowest risk. ConclusionThis prognostic model can help identify which community-dwelling older adults are at the highest risk for incident COVID-19 infection and may inform medical provider counseling of their patients about the risk of incident COVID-19 infection.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "5907339afd2dc268a7670fc85d738e74",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:44:43.967289"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是COVID-19感染的预测模型，涉及的是流行病学和公共卫生领域，并未提及或应用于任何金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是COVID-19感染的预测模型，涉及的是流行病学和公共卫生领域，并未提及或应用于任何金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:31:08.052159"
}