{
  "paper": {
    "id": 4456,
    "title": "Determinants of Household Vulnerability in Networks with Formal Insurance and Informal Risk-Sharing",
    "abstract": "Effective risk management is key to strengthening the resilience of the most vulnerable. Insurance products can help achieve this goal. Yet, in particular in low-income countries, not all can afford the regular premiums. Instead, informal risk-sharing within social networks plays a crucial role in protecting against unpredictable environmental shocks such as droughts and floods. However, this support may not reach households in need if income is heterogeneously distributed and poor households are not connected to those with sufficient resources to share. To study the determinants of vulnerability to extreme events when insurance is available but not affordable to all, we aggregate outcomes of an empirically informed agent-based model in a regression model. We show that not only a household's own financial situation is important for shock resilience, but also the household's position in the network and the financial situation of connected households. We demonstrate the transferability of our results by achieving high prediction accuracy for an empirical risk-sharing network of a village in the Philippines. The study demonstrates how model-based results can help detect vulnerable households. This can be used to develop a reliable identification tool to leverage external support and effectively target subsidies for different types of shocks.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "c4d7320514962812c252c8035068b760",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:37:16.972626"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究家庭在正式保险和非正式风险分担网络中的脆弱性，关注的是低收入国家的风险管理和家庭韧性，并未涉及衍生品定价、金融风险管理或投资组合管理等金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究家庭在正式保险和非正式风险分担网络中的脆弱性，关注的是低收入国家的风险管理和家庭韧性，并未涉及衍生品定价、金融风险管理或投资组合管理等金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:32:56.052723"
}