{
  "paper": {
    "id": 4033,
    "title": "Intraday imbalance optimization: incentives and impact of strategic intraday bidding behavior",
    "abstract": "Intraday markets are crucial to balance supply and demand in the very short-term, up to delivery. They are often designed as continuous auctions with a pay-as-bid pricing mechanism. While several studies assess trading strategies to balance different types of portfolios, they normally do not consider the incentives of the imbalance prices for portfolio management. This paper analyzes a strategy of taking positions in the German intraday market based on expected imbalance prices and examines its impact on system stability. Using a logistic regression model, it is possible to accurately predict the direction of the overall system balance and to apply a profitable trading strategy. For a period from 01/07/2017 to 30/06/2019, the strategy outperforms a simple approach by EUR 47 000 per MW. However, this behavior would predominantly not have been system supportive due to biased imbalance price incentives. These are asymmetric price spreads and insufficiently low imbalance prices compared to intraday prices. An efficient intraday price constraint would partly solve the problem. The overall share of system supportive imbalance positions would raise by ten percentage points. In situations with high system wide imbalances, up to three-quarters of the positions would stabilize the system. These findings are important for regulation in Germany and other countries with a single imbalance pricing as they provide an indication for crucial points of the imbalance pricing rules to incite appropriate market behavior.",
    "year": 2022,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "81015ed52f98659a3c9071db0ca08a89",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:23:07.409721"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文主要研究日内市场中的交易策略，基于预期的不平衡价格进行头寸管理，并分析其对系统稳定性的影响。这属于投资组合管理的范畴，因为它涉及如何在特定市场条件下优化和管理投资组合。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文主要研究日内市场中的交易策略，基于预期的不平衡价格进行头寸管理，并分析其对系统稳定性的影响。这属于投资组合管理的范畴，因为它涉及如何在特定市场条件下优化和管理投资组合。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:08:21.119432"
}