{
  "paper": {
    "id": 2295,
    "title": "Nonparametric machine learning models for predicting the credit default swaps: An empirical study",
    "abstract": "Credit default swap which reflects the credit risk of a firm is one of the most frequently traded credit derivatives. In this paper, we conduct a comprehensive study to verify the predictive performance of non parametric machine learning models and two conventional parametric models on the daily credit default swap spreads of different maturities and different rating groups, from AA to C. The whole period of data set used in this study runs from January 2001 to February 2014, which includes the global financial crisis period when the credit risk of firms were very high. Through experiments, it is shown that most nonparametric models used in this study outperformed the parametric benchmark models in terms of prediction accuracy as well as the practical hedging measures irrespective of the different credit ratings of the firms and the different maturities of their spreads. Especially, artificial neural networks showed better performance than the other parametric and nonparametric models. (C) 2016 Elsevier Ltd. All rights reserved.",
    "year": 2016,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "3f908ec157cb9b5dfff4d9caeefa3aa9",
    "relevant_keywords": [
      "machine learning",
      "neural network",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:13:31.867273"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Derivatives Pricing",
      "Financial Risk"
    ],
    "justification": "该论文研究了信用违约互换（CDS）的预测模型，CDS是一种信用衍生品，因此涉及衍生品定价。同时，CDS用于衡量和管理信用风险，这属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"衍生品定价\", \"金融风险管理\"],\n  \"justification\": \"该论文研究了信用违约互换（CDS）的预测模型，CDS是一种信用衍生品，因此涉及衍生品定价。同时，CDS用于衡量和管理信用风险，这属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:43:19.819971"
}