{
  "paper": {
    "id": 2621,
    "title": "Several multi-criteria programming methods for classification",
    "abstract": "In this paper, we propose a general optimization-based model for classification. Then we show that some well-known optimization based methods for classification. which were developed by Shi et al. [Data mining in credit card portfolio management: a multiple criteria decision making approac. In: Koksalan M, Zionts S,editors. Multiple criteria decision making, in the new millenium. Berlin : Springer: 2001. p. 427-36] and Freed and G I over [A linear programming approach tot tic discriminant problem. Decision Sciences 1981: 12: 68-79: Simple but powerful goal programming models for discriminant problems. European Journal of Operational Research 1981: 7: 44-60]. are special cases of our model. Moreover. three new models, MCQP (multi-criteria indefinite quadratic programming). MCCQP (multi-criteria concave quadratic programming) and MCVQP (multi-criteria convex programming), are developed based on the general model. We also propose algorithms for MCQP and MCCQP respectively. Then we apply these models to three real-life problems: credit card accounts, VIP mail-box and social endowment insurance classification. Extensive experiments are done to compare the efficiency of these methods. (C) 2007 Elsevier Ltd. All rights reserved.",
    "year": 2009,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "6e1e4691241f3d6d774c09f40123e764",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification"
    ],
    "stage1_timestamp": "2025-05-15T01:08:41.958701"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究多准则编程方法在分类问题中的应用，虽然提到了信用卡账户分类的应用，但并未明确指出其核心技术应用于衍生品定价、金融风险管理或投资组合管理等特定金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究多准则编程方法在分类问题中的应用，虽然提到了信用卡账户分类的应用，但并未明确指出其核心技术应用于衍生品定价、金融风险管理或投资组合管理等特定金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:13:41.098180"
}