{
  "paper": {
    "id": 1568,
    "title": "Comparison of Early-warning Methods on Both Logistic Regression Analysis Model and Factor Analysis Model",
    "abstract": "Risk prevention is vital for scientific decision-making and sustainable development of enterprises. It has been proved practically to be effective that the operating situation of enterprises is diagnosed based on the financial indexes. This paper is aimed at mineral resources listed companies in China. Indexes which reflecting the profitability, growth ability, solvency, cash flow capacity and operating capacity of the enterprise operating situation are determined according to the classification settings of CSMAR Financial Index Analysis Database of Listed Companies in China; and then the early-warning models of factor analysis method and Logistic regression method are constructed by screening of 19 ST listed companies and 57 non ST companies from 2010 to 2014 as the sample data, and the early-warning effects of the these two models are compared. The outcome of the empirical research shows that Logistic regression analysis method is more effective than factor analysis method in the forecasting business crisis or financial difficulties, and then this paper put forward five policy suggestions for preventing business risks.",
    "year": 2017,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "23234c85605fd4143c1fdcc51e649046",
    "relevant_keywords": [
      "classification",
      "regression",
      "principal components analysis"
    ],
    "stage1_timestamp": "2025-05-15T02:05:08.085981"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要研究企业财务风险的早期预警模型，通过Logistic回归和因子分析方法预测企业财务困境，这属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文主要研究企业财务风险的早期预警模型，通过Logistic回归和因子分析方法预测企业财务困境，这属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:47:58.969323"
}