{
  "paper": {
    "id": 49,
    "title": "A Computational Intelligence based Approach to Telecom Customer Classification for Value Added Services",
    "abstract": "Customer classification is an imperative task for any organization catering to different market segments. In telecom industry it becomes even more important to identify which value added services(VAS) would be successful with a given customer segment. VAS provide a flexible revenue model that can be customized to different customer segments based on several attributes such as usage and preferences. Selecting and customizing VAS provides a wide canvas to the operators for maximizing their returns on the customer portfolio. Computational intelligence techniques such as Artificial Neural Network (ANN) and Support Vector Machine (SVM) have been successfully used for data mining and machine learning. These techniques provide a mathematical framework for identifying customers profiles and patterns in large datasets that representing the customers' data and their preferences. In this paper, we propose a methodology using SVM and ANN techniques to classify telecom customer data and identify the VAS best suited for the customer segment. We test our results with the SVM yielding high prediction accuracy for the unknown public test data with Radial Basis Function(RBF) Kernel using grid search technique.",
    "year": 2013,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "8e9551d9e4bd4d8a5795c69dcb6bfbe8",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM",
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T00:38:56.927840"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究使用计算智能技术（如SVM和ANN）对电信客户进行分类，以确定最适合客户群体的增值服务（VAS）。虽然涉及客户分类和收益最大化，但并未明确应用于衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究使用计算智能技术（如SVM和ANN）对电信客户进行分类，以确定最适合客户群体的增值服务（VAS）。虽然涉及客户分类和收益最大化，但并未明确应用于衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:34:00.583818"
}