{
  "paper": {
    "id": 1663,
    "title": "Dtree: An Online Visualization Platform for Decision Analysis",
    "abstract": "This paper discusses the conceptualization and design of Dtree, an online visualization platform for conducting decision-tree-based decision analysis. Dtree aims to bring the functions of abstracting decision question, sophisticated math analysis of decision scenarios, and interactive visualization of the analysis output under a single coherent system in a web environment. We conceptualized a spiral and rising process of data-model-knowledge cycle emphasizing the interactivity, through a form of interactive report/webpage, of the model analysis output that bridges the gap and enable the cross-feeding between knowledge and data in an iterative manner. In visualization design of Dtree, we obey a couple of principles such as easy tree navigation and simplified control of analytical functions in order to optimize its usability. Furthermore, we also outline the technical implementation of Dtree, for both the front end and the back end. Finally, the functionalities of Dtree are demonstrated with a real-world application in medical industry. We believe that our experiment with realization of an online decision analytical program adds great value to the existing portfolio of decision making analysis toolbox.",
    "year": 2015,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "1fd347436a4f209227da7198abceef82",
    "relevant_keywords": [
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T00:58:18.336932"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要介绍了一个用于决策分析的在线可视化平台Dtree，其应用场景集中在决策树分析和交互式可视化，并未明确指出或暗示其在衍生品定价、金融风险管理或投资组合管理等金融领域的应用。论文的示例应用是在医疗行业，与金融领域无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要介绍了一个用于决策分析的在线可视化平台Dtree，其应用场景集中在决策树分析和交互式可视化，并未明确指出或暗示其在衍生品定价、金融风险管理或投资组合管理等金融领域的应用。论文的示例应用是在医疗行业，与金融领域无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:19:37.633296"
}