{
  "paper": {
    "id": 647,
    "title": "Data Analysis for the Management of Delinquent Portfolios in Virtual Contact Centers",
    "abstract": "Introduction: virtual contact centers providing BPO services have experienced exponential growth in the customer service, sales, and collections sectors in recent years. This expansion has driven a continuous search for greater operational efficiency and effectiveness in user management, especially in the context of portfolio recovery and optimizing management task times. Objective: the objective of this study is to analyze historical data using exploratory data analysis and machine learning models to identify strategies that improve operational effectiveness, specifically in terms of the number of portfolios recovered and the time required to complete management tasks. Methodology: the methodology follows the data lifecycle framework for machine learning projects, covering six stages: from data acquisition to model implementation. Exploratory analysis was applied to understand patterns in the data, and machine learning models were implemented to predict and improve portfolio management performance. Results: the results were compared with the rule-based model currently used by the company and a manual management approach based on the analysts' experience. The results demonstrate a 21.8% improvement in effectiveness compared to manual management and a 519.51% improvement over the existing rule-based model. Conclusions: the study shows that the implementation of machine learning models can significantly enhance operational efficiency in virtual contact centers, greatly surpassing traditional rule-based approaches and manual management. These results highlight the potential of artificial intelligence to transform user management in the BPO services industry, improving both portfolio recovery and task execution times.",
    "year": 2025,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "34b3a654077e21922d58391f56576b33",
    "relevant_keywords": [
      "machine learning",
      "classification",
      "regression",
      "decision tree",
      "neural network",
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T00:46:24.381358"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究虚拟联络中心中拖欠投资组合的管理优化，虽然提到了投资组合（portfolio）一词，但这里的投资组合指的是客户服务或催收的业务组合，而非金融领域的投资组合管理。论文的核心技术是机器学习在运营效率提升中的应用，与衍生品定价、金融风险管理或投资组合管理无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究虚拟联络中心中拖欠投资组合的管理优化，虽然提到了投资组合（portfolio）一词，但这里的投资组合指的是客户服务或催收的业务组合，而非金融领域的投资组合管理。论文的核心技术是机器学习在运营效率提升中的应用，与衍生品定价、金融风险管理或投资组合管理无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:28:58.343813"
}