{
  "paper": {
    "id": 4091,
    "title": "Research on characterization and prediction of bond risk factors based on machine learning: evidence from the China",
    "abstract": "Introduction The scale of default on credit bonds in China has been expanding. Credit bond defaults not only increase the financing costs of enterprises but also affect the efficiency of debt issuance and even lead to the spread of risks in the financial market. Accurately identifying bond default risks, clarifying the characteristics of bond defaults, and understanding the default risk mechanism are of crucial importance.Methods This paper takes corporate credit bonds as the research object and analyzes bond defaults from both macro and micro perspectives. From a macro perspective, it confirms the logical transmission between macro factors and bond defaults through causal relationships and grasps the overall characteristics of bond defaults by combining association rule mining and descriptive statistical research methods. Bonds are divided into a risk-free bond group and a risky bond group, and association rules are mined in four dimensions: the bond issuance region of the enterprise, whether the issuer is listed, the attributes of the issuing enterprise, and whether the enterprise bond is guaranteed. Based on these rules, a cross-analysis of bond risk factors is conducted. From a micro perspective, taking each bond as the research object, a bond default identification system is established, and default predictions are made based on the ensemble learning algorithm. The important characteristics of default bonds are analyzed from the perspective of whether the issuer is a state-owned enterprise, and further cause difference analysis is conducted.Results The results show that M1 and M2 have an impact on bond defaults, and the ensemble machine learning algorithm can accurately predict bond default risks and obtain key factors for bond risk identification. It is reasonable to choose macro indicators to predict bond defaults.Discussion Based on the experimental conclusions, this paper discusses and analyzes the bond risk evolution process and the reasons for risk concentration in certain industries, which is helpful for a comprehensive understanding of bond default risks. Our research can provide tool references and guidance for risk management in the actual bond market.",
    "year": 2025,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "e5059669112f39b0577fbb538a130770",
    "relevant_keywords": [
      "machine learning",
      "ensemble learning",
      "classification"
    ],
    "stage1_timestamp": "2025-05-15T02:33:03.457459"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心研究内容是使用机器学习方法（如集成学习）来识别和预测债券违约风险，并分析债券风险因素的特征和机制。这些内容直接关联到金融风险管理中的信用风险识别和预测，旨在帮助市场参与者更好地管理债券投资中的风险。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心研究内容是使用机器学习方法（如集成学习）来识别和预测债券违约风险，并分析债券风险因素的特征和机制。这些内容直接关联到金融风险管理中的信用风险识别和预测，旨在帮助市场参与者更好地管理债券投资中的风险。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:34:17.945090"
}