{
  "paper": {
    "id": 60,
    "title": "Reinforcement learning about asset variability and correlation in repeated portfolio decisions",
    "abstract": "Lay investors construct portfolios that are often not efficient and fail to take the correlation of assets into account. The present work examines whether providing people with a learning opportunity makes them sensitive to the correlation between assets. In two studies, where participants repeatedly allocated their endowment to three assets with feedback, participants changed their portfolio over time dependent on the asset correlation. To model learning about relevant characteristics of a portfolio, we developed reinforcement learning models that take learning about asset variability and correlation into account. We demonstrated via out-of-sample predictions that these models explain portfolio allocations better than basic reinforcement learning models, a static 1/N diversification strategy, and the mean-variance model using sample means, variances, and correlation. Hence, experiencing returns can help investors take asset correlations into account. The principles of reinforcement learning are a cognitively plausible and descriptively valid framework for understanding repeated portfolio allocations. (C) 2021 The Author(s). Published by Elsevier B.V.",
    "year": 2021,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "ced3b522ba0239ba7abde1acc5a573dc",
    "relevant_keywords": [
      "reinforcement learning"
    ],
    "stage1_timestamp": "2025-05-15T00:38:56.968407"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文主要研究投资者如何通过强化学习模型来优化资产配置，考虑资产的相关性和变异性，这直接属于投资组合管理的范畴。论文的实验设计和模型验证都围绕如何改进投资组合的构建和调整，而非衍生品定价或金融风险管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文主要研究投资者如何通过强化学习模型来优化资产配置，考虑资产的相关性和变异性，这直接属于投资组合管理的范畴。论文的实验设计和模型验证都围绕如何改进投资组合的构建和调整，而非衍生品定价或金融风险管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:33:57.708351"
}