{
  "paper": {
    "id": 124,
    "title": "A novel deep learning framework: Prediction and analysis of financial time series using CEEMD and LSTM",
    "abstract": "Deep learning is well-known for extracting high-level abstract features from a large amount of raw data without relying on prior knowledge, which is potentially attractive in forecasting financial time series. Long short-term memory (LSTM) networks are deemed as state-of-the-art techniques in sequence learning, which are less commonly applied to financial time series predictions, yet inherently suitable for this domain. We propose a novel methodology of deep learning prediction, and based on this, construct a deep learning hybrid prediction model for stock markets-CEEMD-PCA-LSTM. In this model, complementary ensemble empirical mode decomposition (CEEMD), as a sequence smoothing and decomposition module, can decompose the fluctuations or trends of different scales of time series step by step, generating a series of intrinsic mode functions (IMFs) with different characteristic scales. Then, with retaining the most of information on raw data, PCA reduces dimension of the decomposed IMFs component, eliminating the redundant information and improving prediction response speed. After that, high-level abstract features are separately fed into LSTM networks to predict closing price of the next trading day for each component. Finally, synthesizing the predicted values of individual components is utilized to obtain a final predicted value. The empirical results of six representative stock indices from three types of markets indicate that our proposed model outperforms benchmark models in terms of predictive accuracy, i.e., lower test error and higher directional symmetry. Leveraging key research findings, we perform trading simulations to validate that the proposed model outperforms benchmark models in both absolute profitability performance and risk-adjusted profitability performance. Furthermore, model robustness test unveils the more stable robustness compared to benchmark models. (C) 2020 Elsevier Ltd. All rights reserved.",
    "year": 2020,
    "source": "WOS",
    "area": "financial_risk",
    "method": "deep learning",
    "cache_key": "fe812cd214e2c598a30aafbaf1b6e282",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "neural network",
      "long short-term memory",
      "LSTM",
      "principal components analysis",
      "feature learning",
      "feature representation",
      "representation learning"
    ],
    "stage1_timestamp": "2025-05-15T01:34:25.361691"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究使用深度学习方法预测股票市场的收盘价，并进行了交易模拟以验证模型的盈利能力。虽然涉及金融市场，但并未明确指出其核心技术应用于衍生品定价、金融风险管理或投资组合管理等特定领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究使用深度学习方法预测股票市场的收盘价，并进行了交易模拟以验证模型的盈利能力。虽然涉及金融市场，但并未明确指出其核心技术应用于衍生品定价、金融风险管理或投资组合管理等特定领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:04:08.533597"
}