{
  "paper": {
    "id": 1391,
    "title": "Smart Robotic Strategies and Advice for Stock Trading Using Deep Transformer Reinforcement Learning",
    "abstract": "The many success stories of reinforcement learning (RL) and deep learning (DL) techniques have raised interest in their use for detecting patterns and generating constant profits from financial markets. In this paper, we combine deep reinforcement learning (DRL) with a transformer network to develop a decision transformer architecture for online trading. We use data from the Saudi Stock Exchange (Tadawul), one of the largest liquid stock exchanges globally. Specifically, we use the indices of four firms: Saudi Telecom Company, Al-Rajihi Banking and Investment, Saudi Electricity Company, and Saudi Basic Industries Corporation. To ensure the robustness and risk management of the proposed model, we consider seven reward functions: the Sortino ratio, cumulative returns, annual volatility, omega, the Calmar ratio, max drawdown, and normal reward without any risk adjustments. Our proposed DRL-based model provided the highest average increase in the net worth of Saudi Telecom Company, Saudi Electricity Company, Saudi Basic Industries Corporation, and Al-Rajihi Banking and Investment at 21.54%, 18.54%, 17%, and 19.36%, respectively. The Sortino ratio, cumulative returns, and annual volatility were found to be the best-performing reward functions. This work makes significant contributions to trading regarding long-term investment and profit goals.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "f101f9fdd8cfa063cf5cec43280f9fb7",
    "relevant_keywords": [
      "machine learning",
      "reinforcement learning",
      "deep learning",
      "neural network",
      "representation learning",
      "attention mechanism"
    ],
    "stage1_timestamp": "2025-05-15T02:02:22.744873"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是使用深度强化学习和Transformer网络进行在线股票交易决策，并考虑了多种风险调整后的奖励函数，如Sortino比率和最大回撤等，这些都属于投资组合管理的范畴。论文的研究目标是提高长期投资和利润，而不是衍生品定价或金融风险管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是使用深度强化学习和Transformer网络进行在线股票交易决策，并考虑了多种风险调整后的奖励函数，如Sortino比率和最大回撤等，这些都属于投资组合管理的范畴。论文的研究目标是提高长期投资和利润，而不是衍生品定价或金融风险管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:49:24.907027"
}