{
  "paper": {
    "id": 2071,
    "title": "Reexamination of capital asset pricing model (CAPM): An application of quantile regression",
    "abstract": "Capital asset pricing model (CAPM) plays a very important role in risky asset evaluation. This paper tries to explore the important aspect in CAPM, which is perfect linear relationship assumption between return and market portfolio risk and further discusses the application of CAPM. Empirical evidence shows that the model in ordinary least squares (OLS) supports the positive relationship between systematic risk and return. However, by quantile regression (QR) analysis, not all relationships between systematic risk and return are positive. For lower quantiles, the relationship is not significantly positive although the positive relationship is concluded for higher quantiles. To sum it up, it is not always sustainable for a positive relationship between systematic risk and return. Besides, non-parametric estimations show that the linear assumption between market portfolio risk and return in CAPM is suspicious. Therefore, we find that the two important associated assumptions, which are positive and linear relationships between market portfolio risk and return, do not necessarily exist.",
    "year": 2011,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "ce11af6a0f23ffefb274d65742243d44",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:02:32.899551"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文主要探讨资本资产定价模型（CAPM）在资产回报与市场组合风险之间的关系，并应用分位数回归进行分析。CAPM是投资组合管理中的核心理论之一，用于评估资产风险和预期回报，因此该论文的研究属于投资组合管理领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文主要探讨资本资产定价模型（CAPM）在资产回报与市场组合风险之间的关系，并应用分位数回归进行分析。CAPM是投资组合管理中的核心理论之一，用于评估资产风险和预期回报，因此该论文的研究属于投资组合管理领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:17:21.738090"
}