{
  "paper": {
    "id": 552,
    "title": "Modeling the Behavior of the Stock Market with an Artificial Immune System",
    "abstract": "This study analyzes the effectiveness of an Artificial Immune System (AIS) to model and predict the movements of the stock market. To aid in this research the AIS models are compared with a k-Nearest Neighbors (kNN) algorithm, an artificial neural network (ANN) and a benchmark market portfolio to compare simulated trading results. The analysis shows that the AIS produced overall accuracy results of 67% over a 20 year test period and that the increased complexity of the model was warranted by the statistically significant superior results when compared to the simpler instance-based approach of kNN. The accuracy results were comparable to those obtained from training the ANN and the trading results outperformed the market benchmark, providing evidence that the stock market had a degree of predictability during the time period of 1989-2008. In general the practice of using the natural immune system to inspire a learning algorithm has been established as a viable alternative to modeling the stock market when implementing a supervised learning approach.",
    "year": 2010,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "ca3b2d227154db7c186bea3ab0e46933",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "neural network",
      "artificial neural network"
    ],
    "stage1_timestamp": "2025-05-15T00:45:01.268227"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是使用人工免疫系统（AIS）来建模和预测股票市场的走势，并与市场基准进行比较，以评估模拟交易结果。这直接关联到投资组合管理领域，因为其目标是优化投资决策和超越市场基准表现。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是使用人工免疫系统（AIS）来建模和预测股票市场的走势，并与市场基准进行比较，以评估模拟交易结果。这直接关联到投资组合管理领域，因为其目标是优化投资决策和超越市场基准表现。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:29:57.707820"
}