{
  "paper": {
    "id": 1573,
    "title": "Evaluation and identification of potential high-value patents in the field of integrated circuits using a multidimensional patent indicators pre-screening strategy and machine learning approaches",
    "abstract": "Early identification of high-value patents has strategic and technological importance to firms, in-stitutions, and governments. This study demonstrates the usefulness of the machine learning (ML) method for automatically evaluating and identifying potential high-value patents. The study col-lected 31,463 patents in the integrated circuits sector using the DII platform and used them to conduct experiments using five standard ML models. A multidimensional value indicator portfo-lio was established to measure patents' legal, technological, competitiveness, and scientific values and construct feature vector space. The portfolio also formed a part of the pre-screening strategy providing a valid positive sample for identifying potential high-value patents. The results suggest that the multidimensional patent indicator portfolio effectively measured patent values. amongst all indicators, patent family size (legal value), first citation speed (technological value), forward citations and extended patent family size (competitiveness value), length of the patent document, non-patent reference count, and patent citation count (scientific value) play a significant inform-ing role in identifying potential high-value patents. The proposed first-citation speed indicator proved valuable for measuring patents' technological value. The Random Forest model had the best overall performance in classifying and recognizing potential high-value patents(PHVPs) with accuracy and precision rates above 95%.",
    "year": 2023,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "e677e26f57642b65b6568eaa6812b82e",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "decision tree",
      "Random Forest"
    ],
    "stage1_timestamp": "2025-05-15T00:57:12.697281"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究使用机器学习方法评估和识别集成电路领域的高价值专利，其核心技术和应用场景与衍生品定价、金融风险管理或投资组合管理无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究使用机器学习方法评估和识别集成电路领域的高价值专利，其核心技术和应用场景与衍生品定价、金融风险管理或投资组合管理无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:20:08.921066"
}