{
  "paper": {
    "id": 8089,
    "title": "Superficial and subterranean soil erosion in Tabasco, tropical Mexico:: Development of a decision tree modeling approach",
    "abstract": "Tropical countries suffer from a lack of financial resources to monitor and model sources and outcomes of soil degradation and, therefore, a scarcity of data. In this study it was tried to model superficial and subterranean water erosion based on basic environmental variables such as geological formation, soil type or vegetation cover - data which are potentially available even in developing countries. Different forms of water erosion and karst or pseudokarst formations in Tabasco, Southeastern Mexico were estimated. The study region (3500 km(2)) consists of plain and hilly areas with an annual precipitation ranging from 2000 to 4000 turn. Main land use form is rangeland. The area is geologically composed of sedimentary rocks, limestone, sandstone and conglomerates. Collecting data by field observations over the entire study area a cartography of different soil loss forms such as rill and gully erosion, mass movement, sinkholes and tunnels was created including field data from available maps of geological formation, soil type, precipitation and former land use 20 years ago. Additionally, data collected in the field such as actual land use, vegetation cover and inclination were added. In the entire study area 1039 sites were affected by soil erosion with 2435 single manifestations of soil erosion. 482 sites were found with one gully each, 57 sites with erosion rills with a total of 416, 392 sites with one mass movement each, 85 sites with sinkholes with a total of 1122, and 23 sites with one tunnel each. Rendzic Leptosols over Oligocene limestone are strongly affected by sinkholes and tunnels in regions with inclinations of less than 5'. This phenomenon is explained by karstic and pseudokarstic formation. Superficial erosion forms are mainly found on rendzic Leptosols over shale sandstone and on eutric or peli-eutric Vertisols on Andesit in areas with inclinations between 5 and 300. The application of classification trees allowed to successfully predict the occurrence of sinkholes and tunnels (degree of agreement between prediction and observation: very good to excellent). Even in areas with scarce data-bases this could allow for easy identification of high-risk areas. Predictive success of the occurrence of the different forms of superficial soil losses, however, is low. Superficial erosion seems to be mainly caused by more specific pedological factors. Nevertheless, automated induction of classification trees can be a valuable tool for preliminary data analysis and hypothesis generation in areas with lack of local expertise and can guide erosion risk mapping and soil conservation planning. (c) 2007 Elsevier B.V All rights reserved.",
    "year": 2007,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "c6310a69231f22c5bacc84bdcf7af17e",
    "relevant_keywords": [
      "decision tree",
      "classification"
    ],
    "stage1_timestamp": "2025-05-15T03:15:09.371458"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究土壤侵蚀的建模和预测，使用决策树和分类技术来分析环境变量对土壤侵蚀的影响。虽然论文中提到了决策树和分类技术，但这些技术并未应用于任何金融领域，而是用于环境科学和土壤保护。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究土壤侵蚀的建模和预测，使用决策树和分类技术来分析环境变量对土壤侵蚀的影响。虽然论文中提到了决策树和分类技术，但这些技术并未应用于任何金融领域，而是用于环境科学和土壤保护。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:25:54.331801"
}