{
  "paper": {
    "id": 2205,
    "title": "Sectoral risk assessment with particular emphasis on export enterprises in Poland",
    "abstract": "The article presents a methodological framework for the analysis of sectoral risk and an evaluation of the financial condition on sectors level. In addition, the hypothesis was verified that the financial constraints of enterprises affect decisions making by prospective exporters and sales in foreign markets. The empirical analysis was based on the individual data from different sources (from the years 2005 to 2016), which are: balance sheet and profit and loss account (Statistical Office), financial and behavioural data. The evaluation consists of two parts. The first part presents the financial strength depending on the net value of enterprises. The financial strength defines the financial capacity of enterprise. The second part presents Probability of Default (PD) model. The statistical model is built on logistic regression model, and produces an estimate of the annual PD of the assessed company. Based on the results of the evaluation of the risk associated with the financial condition of enterprises, it was found that SMEs faced a higher risk. The lowest risk of bankruptcy was observed in the pharmaceutical industry and the highest risk of bankruptcy - in the mining sector. Exporters were characterised by better financial equipment.",
    "year": 2018,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "c833178e397537afa70334748ef4de91",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:12:17.465769"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on sectoral risk assessment and the evaluation of financial conditions, including the development of a Probability of Default (PD) model using logistic regression. These are core components of financial risk management, specifically in the context of credit risk assessment.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on sectoral risk assessment and the evaluation of financial conditions, including the development of a Probability of Default (PD) model using logistic regression. These are core components of financial risk management, specifically in the context of credit risk assessment.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:43:42.337823"
}