{
  "paper": {
    "id": 7593,
    "title": "Predicting Student-Teachers Dropout Risk and Early Identification: A Four-Step Logistic Regression Approach",
    "abstract": "Student-teachers' dropout is a complicated and serious issue in the learning process, with its attendant negative implications on students, academic institutions, economic resources, and society. This study investigated the composite and relative impact of personal (student), academic and socioeconomic predictive variables on student-teacher dropout. The study improves the early identification of at-risk student-teachers by developing a model that optimizes predictability. We used questionnaires and adopted a four-step logistic regression procedure on a sample of 1723 student-teachers in public teachers training colleges (TTCs) of a least-developed country (LDC). The study confirmed twin academic performance and aspirations factors as the highest predictors of student-teacher attrition. Academic reasons for choosing TTC were significant, as vocational motivation and goals established by student-teachers early in their education help prevent dropout. Contrary to expectations, student-teachers' cultural values, parents' level of education, and cost of financing education had no significant impact on dropout decisions. This is most likely due to the Government's financial support for student-teachers in LDCs and the widespread belief that higher education can improve one's social and economic status. The findings indicate that early identification and dropout prevention efforts should integrate various support services to foster a healthy learning and retention environment.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "783b73a321f9b7bc781023474feeb3bc",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T03:10:05.613721"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究学生教师辍学风险的预测和早期识别，使用了逻辑回归方法，但其应用场景是教育领域，与衍生品定价、金融风险管理或投资组合管理无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究学生教师辍学风险的预测和早期识别，使用了逻辑回归方法，但其应用场景是教育领域，与衍生品定价、金融风险管理或投资组合管理无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:26:15.310311"
}