{
  "paper": {
    "id": 2869,
    "title": "Supplier selection model with contingency planning for supplier failures",
    "abstract": "We consider the optimal allocation of demand across a set of suppliers given the risk of supplier failures. We assume items sourced are used in multiple facilities and can be purchased from multiple suppliers with different cost and reliability characteristics. Suppliers have production flexibility that allows them to deliver a contingency quantity in case other suppliers fail. Costs considered include supplier fixed costs and variable costs per unit, while failure to deliver to a demand point results in a particular financial loss. The model utilizes the decision tree approach to consider all the possible states of nature when one or more suppliers fail, as well as expand the traditional transportation problem. Unlike other supplier selection models, this model considers contingency planning in the decision process, minimizing the total network costs. This results in a base allocation to one or more of the available suppliers and a state of nature specific delivery contingency plan from the suppliers to each demand point. A numerical example, as well as sensitivity analysis, is presented to illustrate the model and provide insights. (C) 2013 Elsevier Ltd. All rights reserved.",
    "year": 2013,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "1513a2061355080449b83dc4c6b2059b",
    "relevant_keywords": [
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T02:20:16.806295"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究供应商选择与应急计划，涉及供应链管理和运营决策，并未明确指出其在衍生品定价、金融风险管理或投资组合管理等金融领域的应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究供应商选择与应急计划，涉及供应链管理和运营决策，并未明确指出其在衍生品定价、金融风险管理或投资组合管理等金融领域的应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:39:43.992383"
}