{
  "paper": {
    "id": 2082,
    "title": "Random forest tree classification algorithm for predicating loan",
    "abstract": "A loan is the amount of money you receive from a bank or any other financial institution in exchange for a commitment to repay the principal amount with added interest after a specific time period. Profit or a loss of a bank largely depends on the factor of loan repayment of every borrower. Thus, the recovery of every loan granted is a major contributing parameter in the financial statement of every bank. Considering, the exponential increase in the no of people applying for bank loans, a bank must carefully analyze different attributes of every customer before granting its most valuable while limited asset. Our proposed model takes into consideration the loan grant given to people in the previous years by mining them and the mined patterns were used to train our model. Our paper, uses a machine learning model for predicting whether a loan can be approved for an applicant thereby efficiently reducing the risk involved in financial organizations or banks in the form of defaulters. Copyright (c) 2022 Elsevier Ltd. All rights reserved. Selection and peer-review under responsibility of the scientific committee of the International Conference on Innovation and Application in Science and Technology.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "0c130a6281dc4e736c19a3b371e2bbae",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T02:10:59.023127"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用随机森林分类算法预测贷款批准与否，旨在减少银行或金融机构因贷款违约而面临的风险，这直接关联到金融风险管理中的信用风险管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是使用随机森林分类算法预测贷款批准与否，旨在减少银行或金融机构因贷款违约而面临的风险，这直接关联到金融风险管理中的信用风险管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:44:25.448963"
}