{
  "paper": {
    "id": 339,
    "title": "PREDICTING FINANCIAL DISTRESS FOR ROMANIAN COMPANIES",
    "abstract": "Using a moderately large number of financial ratios, we tried to build models for classifying the companies listed on the Bucharest Stock Exchange into low and high risk classes of financial distress. We considered four classification techniques: Support Vector Machines, Decision Trees, Bayesian logistic regression and Fisher linear classifier, out of which the first two proved to have the highest prediction accuracy. Classifiers were trained and tested on randomly drown samples and on four different databases built starting from the initial financial indicators. As the literature related to the topic on Romanian data is very scarce, our study, by using a variety of methods and combining feature selection and principal components analysis, brings a new approach to predicting financial distress for Romanian companies.",
    "year": 2018,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "39667607ba3ad4f907aece209e96237c",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM",
      "decision tree",
      "principal components analysis"
    ],
    "stage1_timestamp": "2025-05-15T01:49:41.051939"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on predicting financial distress for companies using machine learning techniques, which is directly related to assessing and managing financial risks, a core aspect of Financial Risk Management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on predicting financial distress for companies using machine learning techniques, which is directly related to assessing and managing financial risks, a core aspect of Financial Risk Management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:59:02.293847"
}