{
  "paper": {
    "id": 3163,
    "title": "Risks factors and regression model for risk calculation of anesthesiologic intervention in topical and intracameral cataract surgery",
    "abstract": "PURPOSE: To determine risk factors for anesthesiologist intervention during routine cataract surgery performed with topical and intracameral anesthesia and establish a regression model to identify high-risk patients. SETTING: Department of Ophthalmology, Clinica Universidad de Navarra, Pamplona, Spain. DESIGN: Prospective case series. METHODS: After cataract surgery at an ambulatory surgical center, anesthesia personnel completed a questionnaire to determine adverse medical events and risk factors related to anesthesiologist intervention. A Poisson regression model was used to calculate the interventional risks. Bootstrapping was performed for internal model validation. RESULTS: Of the 1010 cases, 50 (4.95%) required anesthesiologist intervention. Univariate analysis identified an association between anesthesiologist intervention and hypertension (P<.001), psychiatric history (P=.002), initial systolic blood pressure (P<.001), surgical duration (P=.001), and diabetes (P=.018). Scores were obtained using the following proposed regression model equation: (-8.68 + 0.33 x sex [men, 0; women, 1] + -0.02 x age [years] + 0.68 x hypertensive history [no, 0; yes, 1] + 1.18 x psychiatric background [no, 0; yes, 1] + 0.04 x initial systolic blood pressure [mm Hg]). The area under the receiver-operating curve was 0.803 (95% confidence interval [CI], 0.721-0.886). The area under the curve found in the validation method was 0.813 (95% CI, 0.727-0.887). CONCLUSION: Hypertension was the main risk factor for anesthesiologist intervention. The regression model discriminated between patients at lower and higher risk for intraoperative intervention for monitored anesthesia care. The probability of anesthesiologist intervention was 11.7 times higher when the model obtained a high score. Financial Disclosure: No author has a financial or proprietary interest in any material or method mentioned. J Cataract Refract Surg 2012; 38:2144-2153 (C) 2012 ASCRS and ESCRS",
    "year": 2012,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "d1a729e0596dd7368e1e69b28a4560f1",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:23:33.452311"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究麻醉师干预的风险因素和回归模型，应用于眼科手术领域，与金融研究领域无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究麻醉师干预的风险因素和回归模型，应用于眼科手术领域，与金融研究领域无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:38:05.272673"
}