{
  "paper": {
    "id": 339,
    "title": "Project selection in project portfolio management: An artificial neural network model based on critical success factors",
    "abstract": "While a growing body of literature focuses in detecting and analyzing the main reasons affecting project success, the use of these results in project portfolio management is still under investigation. Project critical success factors (CSFs) can serve as the fundamental criteria to prevent possible causes of failures with an effective project selection process, taking into account company strategic objectives, project manager's experience and the competitive environment. This research proposes an innovative methodology to help managers in assessing projects during the selection phase. The paper describes the design, development and testing stages of a decision support system to predict project performances. An artificial neural network (ANN), scalable to any set of CSFs, classifies the level of project's riskiness by extracting the experience of project managers from a set of past successful and unsuccessful projects. (C) 2015 Elsevier Ltd. APM and IPMA. All rights reserved.",
    "year": 2015,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "c4d8387c43d7ad0dcfc2475df2cf4ed2",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "neural network",
      "backpropagation",
      "BP",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T00:42:00.512630"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究项目组合管理中的项目选择问题，使用人工神经网络来预测项目风险，虽然涉及风险管理，但属于项目管理领域而非金融风险管理或投资组合管理。论文未提及衍生品定价或金融投资组合相关内容。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究项目组合管理中的项目选择问题，使用人工神经网络来预测项目风险，虽然涉及风险管理，但属于项目管理领域而非金融风险管理或投资组合管理。论文未提及衍生品定价或金融投资组合相关内容。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:31:42.133628"
}