{
  "paper": {
    "id": 1095,
    "title": "Assessment of financial condition of companies using neural networks",
    "abstract": "The paper presents the new automatic method of assessment of the financial condition of companies using neural networks. The aim of this assessment is to determine the insolvency risk of company. This information is important for worldwide transactions at which the insurance institution must assess the level of insurance risk of the import-export transaction. On the basis of this assessment the insurer can determine the insolvency of each side of transaction and decide of the height of the insurance. The paper will present an automatic method of such assessment by applying neural networks as the classifiers. The important part of this task is the optimal selection of the diagnostic features, on the basis of which the neural network will undertake the final decision and final classification of the company to the proper group. This is done by the neural classifiers.",
    "year": 2011,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "5c10941a0962dac3e08522a858cf1a87",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "neural network",
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T01:58:43.445727"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on assessing the financial condition of companies to determine insolvency risk, which is a key aspect of financial risk management, particularly in the context of insurance risk assessment for transactions.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on assessing the financial condition of companies to determine insolvency risk, which is a key aspect of financial risk management, particularly in the context of insurance risk assessment for transactions.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:52:01.511021"
}