{
  "paper": {
    "id": 4068,
    "title": "The E-Morph Assay: Identification and characterization of environmental chemicals with estrogenic activity based on quantitative changes in cell-cell contact organization of breast cancer cells",
    "abstract": "Adverse health effects that are caused by endocrine disrupting chemicals (EDCs) in the environment, food or consumer products are of high public concern. The identification and characterization of EDCs including substances with estrogenic activity still necessitates the use of animal testing as most of the approved alternative test methods only address single mechanistic events of endocrine activity. Therefore, novel human-relevant in vitro assays covering more complex functional endpoints of adversity, including hormone-related tumor formation and progression, are needed. This study describes the development and evaluation of a novel high-throughput screening-compatible assay called E-Morph Assay. This image-based phenotypic screening assay facilitates robust predictions of the estrogenic potential of environmental chemicals using quantitative changes in the cell cell contact morphology of human breast cancer cells as a novel functional endpoint. Based on a classification model, which was developed using six reference substances with known estrogenic activity, the E-Morph Assay correctly classified an additional set of 11 reference chemicals commonly used in OECD Test Guidelines and the U.S. EPA ToxCast program. For each of the tested substances, a relative ER bioactivity score was derived that allowed their grouping into four main categories of estrogenic activity, i.e. 'strong' (>0.9; four substances, i.e. natural hormones or pharmaceutical products), 'moderate' (0.9-0.6; six substances, i.e. phytoestrogens and Bisphenol AF), 'weak' (<0.6; three substances, i.e Bisphenol S, B, and A), and 'negative' (0.0; four substances). The E-Morph Assay considerably expands the portfolio of test methods providing the possibility to characterize the influence of environmental chemicals on estrogen-dependent tumor progression.",
    "year": 2021,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "8d8cb418e24151f78c720f5fe09a468d",
    "relevant_keywords": [
      "classification"
    ],
    "stage1_timestamp": "2025-05-15T01:23:27.350066"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究一种名为E-Morph Assay的新型体外检测方法，用于识别和表征具有雌激素活性的环境化学物质，与金融领域无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究一种名为E-Morph Assay的新型体外检测方法，用于识别和表征具有雌激素活性的环境化学物质，与金融领域无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:08:19.582922"
}