{
  "paper": {
    "id": 250,
    "title": "Machine learning based methods for ratemaking health care insurance",
    "abstract": "In insurance, proposing an accurate premium that is adjusted to the insured risk profile allows companies to better manage their portfolios and to be more competitive. Machine learning methods have recently been adopted for various improvements in insurance ratemaking, especially in the automobile industry. These models are specifically used to mine potential data information and to build a predictive model for a variable of interest using explanatory variables. In this paper, we aim to provide a pricing method for ratemaking individual healthcare insurance contracts using machine learning algorithms that are applied to a Tunisian healthcare insurance portfolio. We start with a simple Classification and Regression Tree, and we work toward more advanced methods that are Random Forest, Extreme gradient boosting, Support Vector Regression, and Artificial Neural network regression model. The predictive performance of these non-parametric methods is compared with the standard generalized linear model. Our results showed the applicability of machine learning in the healthcare insurance market and that the XGBoost algorithm outperforms the predictive capacity of the classical generalized linear model.",
    "year": 2024,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "8363684eda357b5ce5228f6b9b92058c",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "regression",
      "support vector machine",
      "SVM",
      "decision tree",
      "neural network",
      "random forest",
      "XGBoost"
    ],
    "stage1_timestamp": "2025-05-15T00:41:04.738338"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是医疗保险的定价方法，虽然涉及风险管理和定价，但这些内容属于保险领域而非特定的金融研究领域（如衍生品定价、金融风险管理或投资组合管理）。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是医疗保险的定价方法，虽然涉及风险管理和定价，但这些内容属于保险领域而非特定的金融研究领域（如衍生品定价、金融风险管理或投资组合管理）。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:32:19.595673"
}