{
  "paper": {
    "id": 1104,
    "title": "Segmenting German housing markets using principal component and cluster analyses",
    "abstract": "Purpose Germany has a polycentric city structure. This paper aims to reduce complexity of this structure and to find a reliable classification scheme of German housing markets at city level based on 17 relevant market parameters. Design/methodology/approach This paper uses a two-step clustering algorithm combining k-means with Ward's method to develop the classification scheme. The clustering process is preceded by a principal component analysis to merely retain the most important dimensions of the market parameters. The robustness of the results is investigated with a bootstrapping method. Findings It is found that German residential markets can best be segmented into four groups. Geographic contiguity plays a specific role, but is not a main factor. Our bootstrapping analysis identifies the majority of pairwise city relations (88.5%) to be non-random. Research limitations/implications A deeper discussion concerning the most relevant market parameters is required. The stability of the clusters is to be re-investigated in the future, as the bootstrapping analysis indicates that some clusters are more homogeneous than others. Practical implications The developed classification scheme provides insights into opportunities and risks associated with specific city groups. The findings of this study can be used in portfolio management to reduce unsystematic investment risks and to formulate investment strategies. Originality/value To the best of the authors' knowledge, this is the first paper to offer insights into the German housing markets which applies principal component, cluster and bootstrapping analyses in a sole integrated approach.",
    "year": 2022,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "ae11e2cb9a2ef5bba34c78f32b2f5808",
    "relevant_keywords": [
      "unsupervised learning",
      "classification",
      "clustering",
      "principal components analysis"
    ],
    "stage1_timestamp": "2025-05-15T00:52:00.335892"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的主要研究成果是开发了一种德国住宅市场的分类方案，并明确指出这些发现可以用于投资组合管理，以减少非系统性投资风险并制定投资策略。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的主要研究成果是开发了一种德国住宅市场的分类方案，并明确指出这些发现可以用于投资组合管理，以减少非系统性投资风险并制定投资策略。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:24:40.056473"
}