{
  "paper": {
    "id": 3295,
    "title": "An assessment of agricultural residue resources for liquid biofuel production in China",
    "abstract": "The increasing importance of lignocellulosic biomass as a renewable energy source has led to an acute need for reliable and detailed information on its assessment, consumption and supply. With the passage of China's legislative targets for renewable portfolio standards, agricultural residue resources have the potential for an increasing role in meeting liquid fuels demand in China. An assessment of current and near future agricultural residue resources (including agricultural crop residues and secondary agricultural processing residues) in China at national scale was conducted. This paper gave the theoretical quantity, collectable quantity, usable quantity and potential quantity for liquid biofuel production of agricultural residues in China. The spatial and seasonal distributions of crop residues were analyzed. The theoretical output of crop residues in China at national scale in the near future were forecasted by means of an artificial neural network (ANN) model. The availability of agricultural residues in China was presented, as a result, the potential of liquid biofuels from agricultural residues was discussed. The ANN predicted results have shown that the theoretical output of crop residues in China at national scale will be up to 930.8 million tons in 2015. About 44 million tons per year of bioethanol or 131 million tons per year of bio-oil would have been produced, if the total usable output of agricultural crop residues were used to produce bioethanol through biochemical conversion process or bio-oil through fast pyrolysis, which could replace 26.9 million tons of gasoline or 58.2 million tons of diesel at national scale in 2015, respectively. The above results will be helpful for commercialization of bioenergy industry and their market-oriented development strategy, so as to accelerate the development of industrialization of biofuel technologies. (C) 2015 Elsevier Ltd. All rights reserved.",
    "year": 2015,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "e1279108ef2867b2a679ab5796667fe7",
    "relevant_keywords": [
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T01:15:54.692735"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究农业残留物资源在生物燃料生产中的应用，使用了人工神经网络模型预测作物残留物的理论产量。虽然涉及预测模型，但其应用领域是能源生产和农业资源评估，与金融研究领域无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究农业残留物资源在生物燃料生产中的应用，使用了人工神经网络模型预测作物残留物的理论产量。虽然涉及预测模型，但其应用领域是能源生产和农业资源评估，与金融研究领域无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:10:13.344560"
}