{
  "paper": {
    "id": 3679,
    "title": "Strategic participation in competitive electricity markets: Internal versus sectorial data analysis",
    "abstract": "Current approaches for risk management in energy market participation mostly refer to portfolio optimization for long-term planning, and stochastic approaches to deal with uncertainties related to renewable energy generation and market prices variation. Risk assessment and management as integrated part of actual market negotiation strategies is lacking from the current literature. This paper addresses this gap by proposing a novel model for decision support of players' strategic participation in electricity market negotiations, which considers risk management as a core component of the decision-making process. The proposed approach addresses the adaptation of players' behaviour according to the participation risk, by combining the two most commonly used approaches of forecasting in a company's scope: the internal data analysis, and the external, or sectorial, data analysis. The internal data analysis considers the evaluation of the company's evolution in terms of market power and profitability, while the sectorial analysis addresses the assessment of the competing entities in the market sector using a K-Means-based clustering approach. By balancing these two components, the proposed model enables a dynamic adaptation to the market context, using as reference the expected prices from competitor players, and the market price prediction by means of Artificial Neural Networks (ANN). Results under realistic electricity market simulations using real data from the Iberian electricity market operator show that the proposed approach is able to outperform most state-of-the-art market participation strategies, reaching a higher accumulated profit, by adapting players' actions according to the participation risk.",
    "year": 2019,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "ffa7dcc6d3028fc03741226bc824dd38",
    "relevant_keywords": [
      "unsupervised learning",
      "clustering",
      "neural network",
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T01:19:26.260097"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究电力市场中的战略参与和风险管理，虽然涉及风险管理和决策支持，但其应用场景是电力市场而非金融领域。论文的核心技术并未应用于衍生品定价、金融风险管理或投资组合管理等金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究电力市场中的战略参与和风险管理，虽然涉及风险管理和决策支持，但其应用场景是电力市场而非金融领域。论文的核心技术并未应用于衍生品定价、金融风险管理或投资组合管理等金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:09:13.456798"
}