{
  "paper": {
    "id": 1262,
    "title": "Prediction of Systemic Risk Contagion Based on a Dynamic Complex Network Model Using Machine Learning Algorithm",
    "abstract": "It is well known that the interbank market is able to effectively provide financial liquidity for the entire banking system and maintain the stability of the financial market. In this paper, we develop an innovative complex network approach to simulate an interbank network with systemic risk contagion that takes into account the balance sheet of each bank, from which we can identify if the financial institutions have sufficient capital reserves to prevent risk contagion. Cascading defaults are also generated in the simulation according to different crisis-triggering (targeted defaults) methods. We also use machine learning techniques to identify the synthetic features of the network. Our analysis shows that the topological factors and market factors in the interbank network have significant impacts on the risk spreading. Overall, this paper provides a scientific method for policy-makers to select the optimal management policy for handling systemic risk.",
    "year": 2020,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "95afdfc5ffb8f9065f9038ea4f9971cf",
    "relevant_keywords": [
      "machine learning",
      "feature learning",
      "feature representation"
    ],
    "stage1_timestamp": "2025-05-15T02:00:30.690167"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on simulating systemic risk contagion in the interbank market using a dynamic complex network model and machine learning techniques, which is directly related to identifying and managing financial risks, thus falling under Financial Risk Management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on simulating systemic risk contagion in the interbank market using a dynamic complex network model and machine learning techniques, which is directly related to identifying and managing financial risks, thus falling under Financial Risk Management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:50:33.287326"
}