{
  "paper": {
    "id": 486,
    "title": "Healthcare fraud detection using primitive sub peer group analysis",
    "abstract": "Healthcare fraud is a significant problem greatly affecting the quality of healthcare services. Manual auditing of insurance claims extends to the delay in finding fraudulent behaviors causing huge financial loss and also putting the patients' health conditions at risk. Since the past decade, the automation of fraud detection using machine learning techniques has become a prominent research topic. Several automated fraud detection systems using machine learning techniques have been proposed so far. However, developing a healthcare fraud detection system that is adaptive to the systematic changes is still missing. Therefore, in this article, we develop primitive sub peer group analysis (PSPGA) for identifying the suspicious behaviors in health insurance claims. PSPGA is inspired by peer group analysis, a popular unsupervised learning technique, which identifies suspicious behaviors based on local pattern analysis. PSPGA distinguishes between the concept drifts and the sudden drifts and flags the sudden drifts as fraudulent. Moreover, PSPGA makes the fraud detection system adaptive to the concept drifts by considering the updates for peer groups over time.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "f8103d513baf7fbee803983c5f9e7bd5",
    "relevant_keywords": [
      "machine learning",
      "unsupervised learning",
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T01:51:31.278938"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究医疗保健欺诈检测，使用机器学习技术识别健康保险索赔中的可疑行为，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究医疗保健欺诈检测，使用机器学习技术识别健康保险索赔中的可疑行为，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T14:22:34.882342"
}