{
  "paper": {
    "id": 3341,
    "title": "CVAR HEDGING USING QUANTIZATION-BASED STOCHASTIC APPROXIMATION ALGORITHM",
    "abstract": "In this paper, we investigate a method based on risk minimization to hedge observable but nontradable source of risk on financial or energy markets. The optimal portfolio strategy is obtained by minimizing dynamically the conditional value-at-risk (CVaR) using three main tools: a stochastic approximation algorithm, optimal quantization, and variance reduction techniques (importance sampling and linear control variable), as the quantities of interest are naturally related to rare events. As a first step, we investigate the problem of CVaR regression, which corresponds to a static portfolio strategy where the number of units of each tradable assets is fixed at time 0 and remains unchanged till maturity. We devise a stochastic approximation algorithm and study its a.s. convergence and weak convergence rate. Then, we extend our approach to the dynamic case under the assumption that the process modeling the nontradable source of risk and financial assets prices is Markovian. Finally, we illustrate our approach by considering several portfolios in connection with energy markets.",
    "year": 2016,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "fb98ec1a5128522b32c139977fd30c71",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:25:13.733809"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk",
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是动态最小化条件风险价值（CVaR）以优化投资组合策略，这直接涉及金融风险管理和投资组合管理。论文还讨论了静态和动态投资组合策略，进一步证实了其在投资组合管理中的应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\", \"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是动态最小化条件风险价值（CVaR）以优化投资组合策略，这直接涉及金融风险管理和投资组合管理。论文还讨论了静态和动态投资组合策略，进一步证实了其在投资组合管理中的应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:36:51.594595"
}