{
  "paper": {
    "id": 822,
    "title": "The implementation of leisure tourism enterprise management system based on deep learning",
    "abstract": "The foremost part of the leisure tourism enterprise management system is evaluated and studied to explore the financial risk of leisure tourism enterprise and find the loopholes in enterprise risk management. First, the current financial risk management of tourism enterprises is evaluated, using the solvency of corporate finance, capital structure, operating efficiency, and profitability as indexes. Then, the backpropagation neural network (BPNN) model is constructed through the neural network in deep learning. Consequently, the BPNN algorithm model is used to identify and address risks and analyze the financial risks in the risk management system of leisure tourism enterprises. The results show that the shareholders' equity ratio has a great influence on the financial security of tourism enterprises; most of the tourism enterprises have a good financial situation, and most of them do not have large financial risk, and most of them can counter the debt risk properly. Thus, the BPNN model can effectively improve the efficiency and quality of the risk management system in traditional tourism enterprises. The results can help tourism enterprises utilize the enterprise management system better.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "77e74441cfc6342cc5b7998cfd4f4b37",
    "relevant_keywords": [
      "deep learning",
      "neural network",
      "backpropagation",
      "BP"
    ],
    "stage1_timestamp": "2025-05-15T01:55:41.542720"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用深度学习中的BP神经网络模型来识别和分析休闲旅游企业的财务风险，并改进其风险管理系统的效率和质量。这直接涉及金融风险管理领域，特别是企业财务风险的评估和管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是使用深度学习中的BP神经网络模型来识别和分析休闲旅游企业的财务风险，并改进其风险管理系统的效率和质量。这直接涉及金融风险管理领域，特别是企业财务风险的评估和管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:54:18.905353"
}