{
  "paper": {
    "id": 93,
    "title": "A Comparative Study of Classification Methods in Financial Risk Detection",
    "abstract": "Early detection of financial risks can help credit grantors and institutions to establish appropriate policies for credit products, reduce losses and increase revenue. In recent years, the application of data mining techniques, such as classification and clustering, in financial risk detection has drawn interest from academic researchers and industry practitioners. The performance of classification methods varied with different datasets. No single method has been found to be superior over others for all datasets. The goal of this paper is to provide comparative analysis of the ability of a selection of popular classification methods to predict financial risk. The outcome of this study can help financial institutions select appropriate classifiers for their specific tasks.",
    "year": 2008,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "6a2a1eb58e91709947d4cfd8ddcd46e1",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "clustering",
      "support vector machine",
      "SVM",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T01:46:39.587953"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on the comparative analysis of classification methods for predicting financial risks, which is a core aspect of financial risk management, particularly in credit risk assessment.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on the comparative analysis of classification methods for predicting financial risks, which is a core aspect of financial risk management, particularly in credit risk assessment.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:01:08.030903"
}