{
  "paper": {
    "id": 2264,
    "title": "An effective league championship algorithm for the stochastic multi-period portfolio optimization problem",
    "abstract": "The Multi-Period Portfolio Optimization (MPPO) models have been introduced to overcome the weaknesses of the single-period models via considering a dynamic optimization system. However, considering the nonlinear nature of the problem and rapid growth of the size complexity with increase in the number of periods and scenarios, this study is devoted to developing a novel League Championship Algorithm (LCA) to maximize the mean variance function of the portfolio subject to different constraints. A Vector Auto-Regression (VAR) model was developed to estimate the return on risky assets in different time periods and to simulate different scenarios of the rate of return, accordingly. Besides, we proved a valid upper bound of the objective function based on the idea of using surrogate relaxation of constraints. Our computational results based on sample data collected from S&P 500 and 10-year T. bond indices indicated that the quality of portfolios, in terms of the mean variance measure, obtained by LCA was 10 to 20 percent better than that by the commercial software. It seems promising that our method can be a suitable tool for solving a variety of portfolio optimization problems. (C) 2020 Sharif University of Technology. All rights reserved.",
    "year": 2020,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "f72dc5800560001666dd358145ffc511",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:05:04.485799"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "The paper focuses on developing a novel League Championship Algorithm (LCA) for solving the Multi-Period Portfolio Optimization (MPPO) problem, aiming to maximize the mean variance function of the portfolio under various constraints. This directly pertains to the field of Portfolio Management, as it involves dynamic optimization of investment portfolios over multiple periods.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Portfolio Management\"],\n  \"justification\": \"The paper focuses on developing a novel League Championship Algorithm (LCA) for solving the Multi-Period Portfolio Optimization (MPPO) problem, aiming to maximize the mean variance function of the portfolio under various constraints. This directly pertains to the field of Portfolio Management, as it involves dynamic optimization of investment portfolios over multiple periods.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:15:58.221530"
}