{
  "paper": {
    "id": 934,
    "title": "A pruned GA-BPNN model for project portfolio benefit evaluation considering ambidexterity",
    "abstract": "Purpose - Project portfolio benefit (PPB) evaluation is crucial for project portfolio management decisions. However, PPB is complex in composition and affected by synergy and ambidexterity. Ignoring these characteristics can result in inaccurate assessments, impeding the management and optimization of benefit. Considering the above complexity of PPB evaluation, this study aims to propose a refined PPB evaluation model to provide decision support for organizations. Design/methodology/approach - A back propagation neural network optimized via genetic algorithm and pruning algorithm (P-GA-BPNN) is constructed for PPB evaluation. First, the benefit evaluation criteria are established. Second, the inputs and expected outputs for model training and testing are determined. Then, based on the optimization of BPNN via genetic algorithm and pruning algorithm, a PPB evaluation model is constructed considering the impacts of ambidexterity and synergy on PPB. Finally, a numerical example was applied to validate the model. Findings - The results indicate that the proposed model can be used for effective PPB evaluation. Moreover, it shows superiority in terms of MSE and fitting effect through extensive comparative experiments with BPNN, GA-BPNN, and SVM models. The robustness of the model is also demonstrated via data random disturbance experiment and 10-cross-validation. Therefore, the proposed model could serve as a valuable decision-making tool for PPB management. Originality/value - This study extends prior research by integrating the impacts of synergy and ambidexterity on PPB when conducting PPB evaluation, which facilitates to manage and enhance PPB. Besides, the structural redundancy of existing assessment methods is solved through the dynamic optimization of the network structure via the pruning algorithm, enhancing the effectiveness of PPB decision-making tools.",
    "year": 2024,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "4c8a9812e7e5250530511a9edba8bb13",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "neural network",
      "backpropagation",
      "BP",
      "support vector machine",
      "SVM"
    ],
    "stage1_timestamp": "2025-05-15T00:49:36.411589"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究项目组合效益评估模型，虽然提到了组合管理，但属于项目管理领域而非金融投资组合管理。论文未涉及衍生品定价或金融风险管理的内容。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究项目组合效益评估模型，虽然提到了组合管理，但属于项目管理领域而非金融投资组合管理。论文未涉及衍生品定价或金融风险管理的内容。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:25:56.069985"
}