{
  "paper": {
    "id": 3446,
    "title": "An Application of Ensemble Random Forest Classifier for Detecting Financial Statement Manipulation of Indian Listed Companies",
    "abstract": "A rising incident of financial frauds in recent time has increased the risk of investor and other stakeholders. Hiding of financial losses through fraud or manipulation in reporting, hence, resulted in the erosion of considerable wealth of their stakeholders. In fact, a number of global companies like WorldCom, Xerox, and Enron and a number of Indian companies such as Satyam, Kingfisher, and Deccan Chronicle had committed fraud in financial statement by manipulation. Hence, it is imperative to create an efficient and effective framework for detection of financial fraud. This can be helpful to regulators, investors, governments, and auditors as preventive steps in avoiding any possible financial fraud cases. In this context, increasing number of researchers these days have started focusing on developing systems, models, and practices to detect fraud in early stage to avoid any attrition of investor's wealth and to reduce the risk of financing. In the current study, the researcher has attempted to explore the various 42 modeling techniques to detect Fraudulent Financial Statements (FFS). To perform the experiment, researcher has chosen 86 FFS and 92 non-Fraudulent Financial Statements (non-FFS) of manufacturing firms. The data were taken from Bombay Stock Exchange for the dimension of 2008-2011. Auditor's report is considered for classification of FFS and non-FFS companies. T-test was applied to 31 important financial ratios, and 10 significant variables were taken into consideration for data mining techniques. 86 FFS and 92 non-FFS during 2008-2017 were taken for testing dataset. Researcher has trained the model using datasets. Then, the trained model was applied to the testing dataset for the accuracy check. Random forest gives the best accuracy. Here, modified random forest model was developed with improved accuracy.",
    "year": 2019,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "3e8d07047887f1706225f55087a05570",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "decision tree",
      "random forest"
    ],
    "stage1_timestamp": "2025-05-15T02:26:09.210518"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究使用随机森林分类器检测财务报表操纵，虽然涉及金融领域，但其核心技术并未直接应用于衍生品定价、金融风险管理或投资组合管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究使用随机森林分类器检测财务报表操纵，虽然涉及金融领域，但其核心技术并未直接应用于衍生品定价、金融风险管理或投资组合管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:36:26.388162"
}