{
  "paper": {
    "id": 7170,
    "title": "Prevalence of and Racial Differences in Pterygium A Multiethnic Population Study in Asians",
    "abstract": "Purpose: To describe the prevalence and risk factors of pterygium in a multiethnic Asian population and to examine racial differences. Design: Population-based study in Singapore, located 1 degrees north of the equator. Participants: Data were analyzed from 8906 participants from 3 population-based studies of Malays, Indians, and Chinese persons 40 years of age and older conducted between 2004 and 2011. Methods: Standardized slit-lamp examinations were performed by trained study ophthalmologists to examine the anterior segment for evidence of pterygium. Every subject underwent standardized systemic and ocular examinations, interviewer-administered questionnaires, and blood investigations for risk factor assessment. Regression and principle component analysis models were constructed to study the relationship of race and other factors to pterygium. Main Outcome Measures: Any pterygium and severe (grade 3 or opaque) pterygium. Results: The overall prevalence of any pterygium was 10.1% (n = 900), of which severe pterygium was seen in 1.6% (n = 142). The prevalence of any pterygium was more common in Malays (15.5%) than Chinese (7.0%; P<0.001) or Indians (7.0%; P<0.001). Multivariate analysis revealed increasing age (P<0.001), male gender (P<0.001), Malay race (P<0.001), and having a poorer education level (P<0.001) as significant factors for any pterygium. Race contributed significantly to presence of any pterygium (41%; P<0.001) or presence in both eyes (33%; P<0.001) compared with other risk factors. Severe pterygium was associated with outdoor occupation (P<0.02), but race was not a significant risk factor in multivariate analysis. Conclusions: This population-based study in Asian persons of different races living in the same geographical location at the equator indicated that race is a significant risk factor for pterygium, with Malays having higher prevalence than Indians and Chinese, while controlling for other risk factors. Financial Disclosure(s): The author(s) have no proprietary or commercial interest in any materials discussed in this article. Ophthalmology 2012;119:1509-1515 (C) 2012 by the American Academy of Ophthalmology.",
    "year": 2012,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "3eb45d46ec3a35b33dda5b4934ce90f7",
    "relevant_keywords": [
      "principal components analysis"
    ],
    "stage1_timestamp": "2025-05-15T03:06:01.114390"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究翼状胬肉的流行病学特征和种族差异，属于医学领域，与金融研究领域无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究翼状胬肉的流行病学特征和种族差异，属于医学领域，与金融研究领域无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:26:40.186545"
}