{
  "paper": {
    "id": 604,
    "title": "Study of Potential Impact of Wind Energy on Electricity Price Using Regression Techniques",
    "abstract": "This paper seeks to investigate the impact analysis of wind energy on electricity prices in an integrated renewable energy market, using regression models. This is especially important as wind energy is hard to predict and its integration into electricity markets is still in an early stage. Price forecasting has been performed with consideration of wind energy generation to optimize energy portfolio investment and create an efficient energy-trading landscape. It provides an insight into future market trends which allow traders to price their products competitively and manage their risks within the volatile market. Through the analysis of an available dataset from the Austrian electricity market, it was found that the Decision Tree (DT) regression model performed better than the Linear Regression (LR), Random Forest (RF), and Least Absolute Shrinkage Selector Operator (LASSO) models. The accuracy of the model was evaluated using the Mean Absolute Error (MAE), Root Mean Squared Error (RMSE), and Mean Absolute Percentage Error (MAPE). The MAE values considering wind energy generation and without wind energy generation for the Decision Tree model were found to be lowest (2.08 and 2.20, respectively) among all proposed models for the available dataset. The increasing deployment of wind energy in the European grid has led to a drop in prices and helped in achieving energy security and sustainability.",
    "year": 2023,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "2d52475667798a59440a00180e4d38b2",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "regression",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T00:45:39.100592"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究风能对电力价格的影响，并利用回归模型进行价格预测，虽然提到了优化能源投资组合和管理市场风险，但其核心应用场景是能源市场而非特定的金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究风能对电力价格的影响，并利用回归模型进行价格预测，虽然提到了优化能源投资组合和管理市场风险，但其核心应用场景是能源市场而非特定的金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:29:27.148330"
}