{
  "paper": {
    "id": 3045,
    "title": "Parametric and neural methods for cost estimation of process vessels",
    "abstract": "this paper, a comparison is made between artificial neural networks and parametric functions for estimating the manufacturing cost of large-sized and complex-shaped pressure vessels in engineer-to-order manufacturing systems. In the case of large equipment built to customer's design, in fact, it is hard to estimate the production cost owing to the wide variability of vessel's size and configuration and the often scarce previous experience with similar units. However, when cost estimates are to be used for bidding purposes, a poor accuracy may have detrimental financial consequences. A cost overestimation bears the risk of making the firm uncompetitive and losing a customer, while underestimating the cost leads to winning a contract but incurring a financial loss. Furthermore, a precise knowledge of prospective resources utilization is critical for project management purposes when passing to the actual manufacture phase. The developed methods were tested with reference to a world leading manufacturer in 68 case studies with very encouraging results. In fact both techniques greatly outperformed the manual estimation methods currently adopted which suffered from an average estimation error of 26%, with maximum values of +81 % and -60%. The parametric function method, instead, enabled a reduction of the average estimation error to about 12%, with extreme values within the +33% range, while the neural network approach allowed to further reduce the average error to less than 9% with a +33% to -22% variability range. In this application, therefore, the neural network proved to be better suited than the parametric model, presumably owing to the better mapping capabilities. Such results are quite satisfactory considering the kind of production context, the scarcity of historical data and the severity of the considered application. In this paper, the procedure used to develop the two estimating methods is described and the obtained performances are evaluated in comparison with the manual method, also discussing the merits and limitations of the analysed approaches. (C) 2007 Elsevier B.V. All rights reserved.",
    "year": 2008,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "85797811ec585959921a2baa3345a4cb",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "neural network",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:21:52.261339"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究使用人工神经网络和参数函数来估算大型复杂形状压力容器的制造成本，其应用场景是工程制造领域的成本估算，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究使用人工神经网络和参数函数来估算大型复杂形状压力容器的制造成本，其应用场景是工程制造领域的成本估算，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:38:32.104999"
}