{
  "paper": {
    "id": 9023,
    "title": "Determinants of decision-making among ever-married women in Indian households: A cross-sectional study based on binary logistic regression and multinomial logistic regression",
    "abstract": "Empowerment of women is intrinsically linked to their participation in household decision-making, a crucial component for achieving gender equality and improving family well-being. Women's decision-making is frequently cited as a proxy for empowerment and recognized as goal 5 of sustainable development goals. It remains a significant challenge in Indian households to achieve gender parity and poor concentration has been given in the studies of the Indian context. This study evaluates the types of decision-making among ever-married women in Indian households by investigating the socio-demographic factors that influence their role in household decisions. Utilizing data from the National Family Health Survey-5 (2019-21), which includes a sample of 51,758 women aged 15-49 years. This study employs a bivariate analysis to explore the association between predictive factors and women's decision-making status. Before implementing a valid conclusion of multinomial logistic regression dealing with multinomial outcome variables, such as independent, joint, and dependent decisions, binary logistic regression was applied in the context of binary outcomes, specifically not making decisions alone and making decisions alone. Results reveal that only 3% of women make decisions independently. In contrast, 15% of women relied on dependently making decisions, and a majority of 82% of respondents reported jointly making decisions within their households. The conclusive model reveals that the likelihood of independent decision-making relative to joint decisions for rural women in India is 25% lower than for urban women, while dependent decision-making is 23% more often in rural areas than in urban ones as compared to jointly made decisions. Working women were 1.52 times more likely to make independent decisions, apart from that, the result indicates that 25% lower relative risk (RRR = 0.75, 95% CI = 0.69-0.81) of dependent decisions compared to joint ones. In contrast to the poorest households, women in the richest households are 42% less likely to make decisions independently as opposed to jointly. Regional variations are also evident, compared to women in northern regions, women from the South had the highest prevalence of independent decision-making power than joint decisions, with a relative risk ratio of 2.53 (RRR = 2.53, 95% CI= 2.04-3.14) and the lowest in central regions (RRR = 0.92, 95% CI= 0.73-1.17). Age emerges as a significant factor, compared to jointly making decisions, individuals in the age group of 35-45 have a relative risk ratio of 1.44 (RRR = 1.44, 95% CI= 1.18-1.77), and women over 45 years of 1.67 (RRR = 1.67, 95% CI=1.30-2.13) times greater autonomy than those in the age group below 25. Furthermore, compared to their counterparts who do not consume substances, women whose husbands do so have 1.44 (RRR = 1.44, 95% CI= 1.27-1.64) times higher probability of autonomy in making decisions relative to decisions made jointly. The study underscores the necessity for comprehensive educational programs, financial literacy workshops, improvement of transportation and healthcare decision-making, and region-specific cultural interventions among discriminatory castes by improving employment scenarios. Especially for rural women under the 25-age group can be a significant step in household decisions toward attaining gender equality.",
    "year": 2025,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "87fc80c18059f95c92d5c5601ca0c1a0",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T03:24:54.879485"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究印度已婚妇女在家庭决策中的角色及其影响因素，使用了二元逻辑回归和多项逻辑回归等统计方法，但其研究内容与衍生品定价、金融风险管理或投资组合管理等金融领域无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究印度已婚妇女在家庭决策中的角色及其影响因素，使用了二元逻辑回归和多项逻辑回归等统计方法，但其研究内容与衍生品定价、金融风险管理或投资组合管理等金融领域无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:25:13.025259"
}