{
  "paper": {
    "id": 3003,
    "title": "Modern finance through quantum computing-A systematic literature review",
    "abstract": "Human intellectual restlessness originates from the need for knowledge of the modern world. The financial world is struggling to prototype accurate and fast data at low risk. The quantum approach to finance can support this desire. The goal of this paper is to provide a comprehensive review of the literature on how quantum computing can be used in finance. This research aims to expose an architecture of the state of the art in quantum finance. In terms of methodology, the PSALSAR framework was used to conduct this systematic literature review. The selection procedure followed the PRISMA guidelines and was applied in two databases (Web of Science and Scopus) without time limit. In total, 94 out of 1646 articles were included for data extraction and assessment of content evaluation covering the period 2001-2023. The current review of quantum finance literature is structured around the following themes: journals, research methods, tested data series, research topics in quantum finance, and future research directions. Within the financial sector, quantum computing is used in three main areas: simulation, optimization, and machine learning. These areas are supported by algorithms that have been created in recent years. Finally, we propose to highlight the benefits and the applications of quantum finance and to stimulate the interest in the future prospects of the debates.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "c05fbdc52e6c7ed25e3b2d1cb350b7e7",
    "relevant_keywords": [
      "machine learning"
    ],
    "stage1_timestamp": "2025-05-15T02:21:19.294261"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文是一篇关于量子计算在金融中应用的系统性文献综述，涵盖了模拟、优化和机器学习三个主要领域，但并未明确指出其核心技术或研究成果主要应用于衍生品定价、金融风险管理或投资组合管理等特定金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文是一篇关于量子计算在金融中应用的系统性文献综述，涵盖了模拟、优化和机器学习三个主要领域，但并未明确指出其核心技术或研究成果主要应用于衍生品定价、金融风险管理或投资组合管理等特定金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:39:17.095730"
}