{
  "paper": {
    "id": 96,
    "title": "Boosting Financial Market Prediction Accuracy With Deep Learning and Big Data: Introducing the CCL Model",
    "abstract": "The accuracy of financial market trend prediction directly impacts investors' decisions and financial institutions' risk management, making it a focal point of research in the financial domain. While traditional statistical methods lay the foundation for market forecasting, they still face limitations in handling complex, nonlinear, and non-stationary financial time series data with accuracy and adaptability. Time series analysis plays a pivotal role in financial market prediction, revealing historical patterns and future trends within the data. Addressing the limitations of existing methods, this study proposes a deep learning-based CEEMDAN-CNN-LSTM model. Leveraging the CEEMDAN decomposition method to capture the multi-frequency components of time series, CNN extracts spatial features, and LSTM learns temporal dependencies. Experimental results demonstrate that the performance of the CEEMDAN-CNN-LSTM model surpasses traditional models on standardized evaluation metrics such as RMSE, MAE, and MAPE across four major financial datasets.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "deep learning",
    "cache_key": "a4207e905f05282b4d90441b87b50d31",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "neural network",
      "convolutional neural network",
      "CNN",
      "long short-term memory",
      "LSTM",
      "representation learning"
    ],
    "stage1_timestamp": "2025-05-15T01:33:49.047843"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究金融市场趋势预测，虽然与投资决策和风险管理相关，但并未明确指出其核心技术应用于衍生品定价、金融风险管理或投资组合管理等特定领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究金融市场趋势预测，虽然与投资决策和风险管理相关，但并未明确指出其核心技术应用于衍生品定价、金融风险管理或投资组合管理等特定领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:04:45.035573"
}