{
  "paper": {
    "id": 4285,
    "title": "Research on the Application of DM Technology with RF in Enterprise Financial Audit",
    "abstract": "Data mining (DM), as a new technology in the information age, is applied to modern audit work, which is more effective than traditional audit methods. In view of the problems existing in traditional tax audit methods, such as the huge amount of audit data, limited knowledge and experience of auditors, and difficult tracking of audit data, this paper uses computer-aided audit technology to collect, clean up, convert, and analyze data, comprehensively uses data warehouse technology, pattern recognition method, data analysis method, and anomaly detection theory as research methods, and makes a comprehensive study on tax affairs. Then, a random forest (RF) algorithm is used to establish the classification and identification model of audit risk. Second, based on the RF algorithm, the audit early warning framework of accounts receivable and payable in enterprise financial sharing mode is constructed, and the financial data and business data in enterprise financial sharing mode are extracted by using big data technology. The comparison of the results shows that the RF model has higher prediction accuracy and better robustness, which can better improve the antirisk ability of listed companies in China.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "2fb72e3b0964453dfaff58bf5d255e11",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T02:35:26.271713"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究数据挖掘和随机森林算法在企业财务审计中的应用，特别是税务审计和应收账款/应付账款的审计预警框架。虽然涉及风险管理，但属于企业财务审计领域，而非金融风险管理、衍生品定价或投资组合管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究数据挖掘和随机森林算法在企业财务审计中的应用，特别是税务审计和应收账款/应付账款的审计预警框架。虽然涉及风险管理，但属于企业财务审计领域，而非金融风险管理、衍生品定价或投资组合管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:33:50.772812"
}