{
  "paper": {
    "id": 2360,
    "title": "ASSESSING THE SYSTEMIC RISK BETWEEN AMERICAN AND EUROPEAN FINANCIAL SYSTEMS",
    "abstract": "The present study focuses on the analysis of systemic risk in the American and European financial systems for the period from 20 August 2004 to 28 February 2014. The global crisis in 2007 has brought attention to the urgent need to understand the systemic risk issues and the stability of financial systems along with their actors. To assess systemic risk. Adrian and Brunnermeier (2011) advocated the use of conditional value-at-risk (CoVaR) methodology in integrating quantile regression. Instead of the value-at-risk (VaR), which is unable to detect systemic risk, we seek to use the CoVaR methodology to calculate the systemic risk levels of the United States and European markets. In the light of related findings, we conclude that the insurance sector contributes most to the systemic risk in the USA. while in the Eurozone, it is the financial services sector that is highly interconnected with systemic risk.",
    "year": 2020,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "e15e4b7dfbe9853c0c8f206f2943af85",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:14:19.682616"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on assessing systemic risk in financial systems using the CoVaR methodology, which is a technique specifically designed for measuring and managing financial risk, particularly systemic risk. This falls squarely under the domain of Financial Risk Management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on assessing systemic risk in financial systems using the CoVaR methodology, which is a technique specifically designed for measuring and managing financial risk, particularly systemic risk. This falls squarely under the domain of Financial Risk Management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:42:55.501047"
}