{
  "paper": {
    "id": 1661,
    "title": "Leveraging Cloud Computing to Convert the Non-Intrusive Load Monitor into a Powerful Framework for Grid-Responsive Buildings",
    "abstract": "This paper describes how the non-intrusive load monitoring technique can be applied to develop a powerful framework for grid-responsive buildings, particularly in the small commercial and residential sector. Specifically, recent advances have made it cost-effective to monitor a number of electrical circuits in a building using low-cost embedded platforms that can send their data to cloud-computing and data-storage services. This approach significantly reduces the effort required to deploy and commission monitoring solutions, specifically because the cloud allows one to create a large library of load patterns and it provides a powerful platform for computation. This approach thus solves one of the major challenges in power monitoring and energy management, which has been the development of robust unsupervised learning algorithms that eliminate the need for costly human involvement. The cloud also provides an opportunity to learn fault patterns and to predict the performance of individual building systems. This paper describes the unsupervised training that can be performed in the cloud using intuition about the underlying physics of major load devices. It also describes how load on-off patterns can be used for fault detection as well as load prediction and control and the deployment of powerful algorithms for a large data set obtained across a large portfolio is discussed.",
    "year": 2016,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "58d438f875274aea65657be6da088ff4",
    "relevant_keywords": [
      "unsupervised learning",
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T00:58:18.326661"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要讨论了非侵入式负载监控技术在电网响应建筑中的应用，涉及云计算和无监督学习算法，但并未提及任何与衍生品定价、金融风险管理或投资组合管理相关的应用或研究目标。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要讨论了非侵入式负载监控技术在电网响应建筑中的应用，涉及云计算和无监督学习算法，但并未提及任何与衍生品定价、金融风险管理或投资组合管理相关的应用或研究目标。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:19:38.073615"
}