{
  "paper": {
    "id": 145,
    "title": "A novel prediction model based on long short-term memory optimised by dynamic evolutionary glowworm swarm optimisation for money laundering risk",
    "abstract": "The accurate prediction of money laundering risk is conducive to the risk prevention, and its task implies the characteristics of time series. Long short-term memory (LSTM) is widely developed in time series problems, but its parameters need to be optimised for delivering good predictive capacity. In this work, a novel bio-inspired algorithm, named dynamic evolutionary glowworm swarm optimisation (DEGSO), is designed. DEGSO employs adaptive step-size strategy, dynamic evolutionary mechanism, and directional mutation mechanism for improving the search performance. The money laundering risk is identified via a combination of DEGSO and LSTM (DEGSO-LSTM). DEGSO is wielded to optimise the main parameters of LSTM. Numerical results on four test functions indicate that DEGSO delivers better performance. Performance test results demonstrate that DEGSO-LSTM performs better than other state-of-the-art approaches. DEGSO-LSTM also attains satisfactory results in money laundering risk prediction, and its potential as a solution to financial fraud risk prediction.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "deep learning",
    "cache_key": "211a1e2a1565945dd7ad7a8ebed57f5d",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "neural network",
      "long short-term memory",
      "LSTM"
    ],
    "stage1_timestamp": "2025-05-15T01:34:25.433334"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是优化LSTM模型用于预测洗钱风险，这属于金融风险管理中的操作风险范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是优化LSTM模型用于预测洗钱风险，这属于金融风险管理中的操作风险范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:04:07.654243"
}