{
  "paper": {
    "id": 24,
    "title": "A hybrid unsupervised machine learning model with spectral clustering and semi-supervised support vector machine for credit risk assessment",
    "abstract": "In credit risk assessment, unsupervised classification techniques can be introduced to reduce human resource expenses and expedite decision-making. Despite the efficacy of unsupervised learning methods in handling unlabeled datasets, their performance remains limited owing to challenges such as imbalanced data, local optima, and parameter adjustment complexities. Thus, this paper introduces a novel hybrid unsupervised classification method, named the two-stage hybrid system with spectral clustering and semi-supervised support vector machine (TSC-SVM), which effectively addresses the unsupervised imbalance problem in credit risk assessment by targeting global optimal solutions. Furthermore, a multi-view combined unsupervised method is designed to thoroughly mine data and enhance the robustness of label predictions. This method mitigates discrepancies in prediction outcomes from three distinct perspectives. The effectiveness, efficiency, and robustness of the proposed TSC-SVM model are demonstrated through various real-world applications. The proposed algorithm is anticipated to expand the customer base for financial institutions while reducing economic losses.",
    "year": 2025,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "94aac351646e3767e606d2d8fa2f67d6",
    "relevant_keywords": [
      "machine learning",
      "unsupervised learning",
      "semi-supervised learning",
      "classification",
      "support vector machine",
      "SVM",
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T01:46:03.780230"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on developing a hybrid unsupervised machine learning model for credit risk assessment, which is a key aspect of financial risk management. The proposed method aims to improve the robustness and efficiency of credit risk evaluation, directly addressing challenges in risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on developing a hybrid unsupervised machine learning model for credit risk assessment, which is a key aspect of financial risk management. The proposed method aims to improve the robustness and efficiency of credit risk evaluation, directly addressing challenges in risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:01:33.733195"
}