{
  "paper": {
    "id": 3340,
    "title": "A Hybrid Technological Innovation Text Mining, Ensemble Learning and Risk Scorecard Approach for Enterprise Credit Risk Assessment",
    "abstract": "Enterprise credit risk assessment models typically use financial-based information as a predictor variable, relying on backward-looking historical information rather than forward-looking information for risk assessment. We propose a novel hybrid assessment of credit risk that uses technological innovation information as a predictor variable. Text mining techniques are used to extract this information for each enterprise. A combination of random forest and extreme gradient boosting are used for indicator screening, and finally, risk scorecard based on logistic regression is used for credit risk scoring. Our results show that technological innovation indicators obtained through text mining provide valuable information for credit risk assessment, and that the combination of ensemble learning from random forest and extreme gradient boosting combinations with logistic regression models outperforms other traditional methods. The best results achieved 0.9129 area under receiver operating characteristic. In addition, our approach provides meaningful scoring rules for credit risk assessment of technology innovation enterprises.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "c132aca66e9c65ec022976c4b5c0d5fe",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "regression",
      "decision tree",
      "feature learning",
      "feature representation"
    ],
    "stage1_timestamp": "2025-05-15T02:25:13.721222"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术应用于企业信用风险评估，这属于金融风险管理的范畴。论文提出了一种结合文本挖掘、集成学习和风险评分卡的方法来评估信用风险，并展示了其在技术创新企业信用风险评估中的有效性。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术应用于企业信用风险评估，这属于金融风险管理的范畴。论文提出了一种结合文本挖掘、集成学习和风险评分卡的方法来评估信用风险，并展示了其在技术创新企业信用风险评估中的有效性。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:36:51.706443"
}