{
  "paper": {
    "id": 2117,
    "title": "Research on the Construction of Financial Risk Early Warning Model Based on Association Rule Algorithm",
    "abstract": "The focal point of this paper centers around the methodology and procedure of constructing a financial risk warning model using association rule algorithms. By selecting relevant financial indicators, conducting data processing, and employing fuzzy association rule data mining algorithms, the warning model is constructed. Through comparative experiments on a real financial dataset, the performance of this model is compared with logistic regression models and bagging ensemble models in terms of risk warning accuracy, recall rates, and F1 values. The experimental results demonstrate that the financial risk warning model based on association rule algorithms possesses a higher predictive accuracy and feasibility, holding great potential for wide application in practical corporate management.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "9992eea42d9ded4dc3e1fe7e4e3e9fdd",
    "relevant_keywords": [
      "machine learning",
      "classification",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T02:11:40.501552"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on constructing a financial risk early warning model using association rule algorithms, which is directly related to identifying and managing financial risks, a core aspect of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on constructing a financial risk early warning model using association rule algorithms, which is directly related to identifying and managing financial risks, a core aspect of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:44:06.218762"
}