{
  "paper": {
    "id": 4842,
    "title": "Linear discriminant analysis and logistic regression for default probability prediction: the case of an Italian local bank",
    "abstract": "This paper presents methods to estimate the probability of default (PD), a crucial parameter in bank credit risk management, rating estimation and loan pricing. Based on a sample of 505 firms from the loan portfolio of an Italian local bank and using financial indicators, we develop a linear discriminant model for predicting firm default, and we use logistic regression to directly estimate PD. The results highlight that both estimated models can correctly classify over 95% of sampled firms. However, the logistic model performs better in reducing type I error. Notably, the logistic model provides the PD estimate that is most in line with the bank's estimate of ex post PD. The results are robust to several checks. Therefore, in small banks, logistic regression represents a useful tool for estimating firm PD and for improving pricing and credit monitoring strategies.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "a21fd5f4db02503147faf48f76d2d546",
    "relevant_keywords": [
      "supervised learning",
      "classification",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:41:32.762090"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on estimating the probability of default (PD) for firms, which is a critical component in credit risk management. The methods developed (linear discriminant analysis and logistic regression) are used to improve pricing and credit monitoring strategies, directly addressing financial risk management concerns.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on estimating the probability of default (PD) for firms, which is a critical component in credit risk management. The methods developed (linear discriminant analysis and logistic regression) are used to improve pricing and credit monitoring strategies, directly addressing financial risk management concerns.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:31:55.839383"
}