{
  "paper": {
    "id": 3825,
    "title": "Image Semantic Analysis and Understanding",
    "abstract": "Image understanding is widely used in many areas like satellite imaging, robotic technologies, sensory networks, medical and biomedical imaging, intelligent transportation systems, etc. But it is difficult by traditional image processing. Recently semantic analysis has become an active research topic aimed at resolving the gap between low level image features and high level semantics which is a promoting approach in image understanding. This talk highlights the sophisticated methodologies of image semantic analysis, including discriminative, generative, cognitive methodology. Discriminative methodology is a data driven and uses classical machine learning, such as Kernel function, ensemble method, multi-instance, etc. Generative methodology is model driven and utilizes graphical models with text semantic analysis and each note with conceptual definition. Cognitive methodology can achieve four levels of generic computer vision functionalities: detection, localization, recognition, and understanding which are very useful for semantic knowledge exploration and image understanding. The feature binding computational model proposed by the Intelligence Science Laboratory will be presented in this talk. People understand the nature of the image scene is through the internal syntactic structure of image. Originally syntactic structure of the sentence is generated through a series of production rules that the words are divided into a number of interrelated terms portfolio, reflecting the constraints between words within syntactic relations. Image parsing studies the image semantics directly. An image with certain hierarchical entities can be represented by and-or graph, that is, the parse tree. Syntactic reasoning with and-or graphs usually adopts a top-down and bottom-up strategy. Semantic Web technology promotes the development of image semantic analysis. In particular, the Web Ontology Language OWL provides a rich syntactic structure of semantics for image syntactic description in which different ontologies have explicit knowledge of dependencies, different text by OWL ontology mapping connected with high reusability. In terms of OWL and-or graphs are usually converted to RDF format. The semantic representation of image syntactic structure will achieve image-text standardized output possible. In this talk event exploring will be used to illustrate the procedure and principle ideas of visual syntax analysis which is easy to catch the scenic context. This talk also concerns granular computing which is a new viewpoint and will impact on image understanding. We have proposed a tolerant granular space model and applied it to image processing. Finally, the directions for further research on image semantic analysis and understanding will be pointed out and discussed.",
    "year": 2010,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "36ae58e5bbc0ac0756a17daa05014c0a",
    "relevant_keywords": [
      "machine learning",
      "classification",
      "feature learning",
      "feature representation",
      "neural network",
      "deep learning",
      "representation learning"
    ],
    "stage1_timestamp": "2025-05-15T01:21:08.261029"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要讨论图像语义分析和理解的技术方法，包括机器学习、生成模型和认知方法等，但并未提及这些技术在衍生品定价、金融风险管理或投资组合管理等金融领域的应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要讨论图像语义分析和理解的技术方法，包括机器学习、生成模型和认知方法等，但并未提及这些技术在衍生品定价、金融风险管理或投资组合管理等金融领域的应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:08:47.275393"
}