{
  "paper": {
    "id": 1740,
    "title": "Towards a Crime Hotspot Detection Framework for Patrol Planning",
    "abstract": "By monitoring crime incidence with quantitative techniques, many studies have shown that it is possible to improve decision making through pattern recognition and prediction. In a smart city scenario, such approaches can be used to compose analytical background to improve resource allocation. This work presents a novel framework to improve patrol planning that precisely provides places and times that are likely to be more dangerous than short-term average using a portfolio of machine learning algorithms. Our approach follows an algorithm-as-a-service architecture (AaaS), providing insights to existing public safety systems and platforms. The service comprises the broader ROTA framework, a robust public safety platform devised for the ongoing smart cities initiative of Natal, Brazil. Results of an experimental evaluation provided insights about spatial granularity effects on the performance of the estimators adopted. Furthermore, an evaluation on algorithm selection demonstrates its outcomes on the hotspot detection task.",
    "year": 2018,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "9b01e7c30652aed280b63f4c75bce091",
    "relevant_keywords": [
      "machine learning",
      "classification",
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T00:59:22.885217"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究犯罪热点检测框架，用于巡逻规划，其核心技术应用于公共安全领域，而非金融领域。虽然提到了'portfolio of machine learning algorithms'，但这里的'portfolio'指的是算法组合，而非金融投资组合。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究犯罪热点检测框架，用于巡逻规划，其核心技术应用于公共安全领域，而非金融领域。虽然提到了'portfolio of machine learning algorithms'，但这里的'portfolio'指的是算法组合，而非金融投资组合。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:19:10.751850"
}