{
  "paper": {
    "id": 660,
    "title": "A Systematic Literature Review of Volatility and Risk Management on Cryptocurrency Investment: A Methodological Point of View",
    "abstract": "In this study, we explore the research published from 2009 to 2021 and summarize what extant literature has contributed in the last decade to the analysis of volatility and risk management in cryptocurrency investment. Our samples include papers published in journals ranked across different fields in ABS ranked journals. We conduct a bibliometric analysis using VOSviewer software and perform a literature review. Our findings are presented in terms of methodologies used to model cryptocurrencies' volatility and also according to their main findings pertaining to volatility and risk management in those assets and using them in portfolio management. Our research indicates that the models that consider the Markov-switching regime seem to be more consensual among the authors, and that the best machine learning technique performances are hybrid models that consider the support vector machines (SVM). We also argue that the predictability of volatility, risk reduction, and level of speculation in the cryptocurrency market are improved by the leverage effects and the volatility persistence.",
    "year": 2022,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "7bb1d1f019ba3b4b7c19d06a8f8ad128",
    "relevant_keywords": [
      "machine learning",
      "support vector machine",
      "SVM"
    ],
    "stage1_timestamp": "2025-05-15T00:46:24.433062"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk",
      "Portfolio Management"
    ],
    "justification": "该论文主要探讨了加密货币投资的波动性和风险管理，并提到了使用这些资产进行投资组合管理。研究重点在于风险管理和投资组合的应用，而非衍生品定价。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\", \"投资组合管理\"],\n  \"justification\": \"该论文主要探讨了加密货币投资的波动性和风险管理，并提到了使用这些资产进行投资组合管理。研究重点在于风险管理和投资组合的应用，而非衍生品定价。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:28:54.811469"
}