{
  "paper": {
    "id": 2678,
    "title": "Credit Scoring Based on the Set-Valued Identification Method",
    "abstract": "Credit scoring is one of the key problems in financial risk managements. This paper studies the credit scoring problem based on the set-valued identification method, which is used to explain the relation between the individual attribute vectors and classification for the credit worthy and credit worthless lenders. In particular, system parameters are estimated by the set-valued identification algorithm based on a given recognition criteria. In order to illustrate the efficiency of the proposed method, practical experiments are conducted for credit card applicants of Australia and credit card holders from Taiwan, respectively. The empirical results show that the set-valued model has a higher prediction accuracy on both small and large numbers of data set compared with logistic regression model. Furthermore, parameters estimated by the set-valued identification method are more stable, which provide a meaningful and logical explanation for extracting factors that influence the borrowers' credit scorings.",
    "year": 2020,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "14755e3d4515ac8f8d76d08ae75ce268",
    "relevant_keywords": [
      "classification",
      "feature representation"
    ],
    "stage1_timestamp": "2025-05-15T02:18:06.154192"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on credit scoring, which is a key aspect of financial risk management, specifically in assessing the creditworthiness of borrowers to mitigate default risks.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on credit scoring, which is a key aspect of financial risk management, specifically in assessing the creditworthiness of borrowers to mitigate default risks.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:40:39.629930"
}