{
  "paper": {
    "id": 535,
    "title": "An adaptive sequential-filtering learning system for credit risk modeling",
    "abstract": "Credit risk and business failure classification and prediction are a major topic in financial risk management and corporate finance decision making. In this work, an adaptive sequential-filtering learning system for credit risk modeling. It is basically a three-stage sequential system for credit risk and business failure classification is presented. First, different statistical filters are applied separately to perform a preselection of relevant patterns. Second, genetic algorithms are applied to preselected patterns for refinement purpose. Finally, structural risk minimization approach based on support vector machine uses refined patterns for prediction purpose. We used three credit databases and two data partition schemes: (i) random split with 80% for learning and 20% testing, and (ii) tenfold cross-validation technique. Results from all three data sets and for all partition techniques show the effectiveness of the proposed adaptive sequential-filtering learning system for credit risk modeling against single support vector machines each with specific statistical filter-based patterns. In addition, it outperformed various models validated on the same databases. It is concluded that the presented adaptive sequential system is promising for credit risk monitoring.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "3fb8e0fc4f8b191ea534d8e6f6ee171f",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM",
      "feature learning"
    ],
    "stage1_timestamp": "2025-05-15T01:52:12.247255"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on developing an adaptive sequential-filtering learning system specifically for credit risk modeling, which is a key aspect of financial risk management. The research aims to improve classification and prediction of credit risk and business failure, directly addressing risk assessment and mitigation in financial contexts.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on developing an adaptive sequential-filtering learning system specifically for credit risk modeling, which is a key aspect of financial risk management. The research aims to improve classification and prediction of credit risk and business failure, directly addressing risk assessment and mitigation in financial contexts.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:57:05.289328"
}