{
  "paper": {
    "id": 4027,
    "title": "Conditional Value-at-Risk and Average Value-at-Risk: Estimation and Asymptotics",
    "abstract": "We discuss linear regression approaches to the estimation of law-invariant conditional risk measures. Two estimation procedures are considered and compared; one is based on residual analysis of the standard least-squares method, and the other is in the spirit of the M-estimation approach used in robust statistics. In particular, value-at-risk and average value-at-risk measures are discussed in detail. Large sample statistical inference of the estimators is derived. Furthermore, finite sample properties of the proposed estimators are investigated and compared with theoretical derivations in an extensive Monte Carlo study. Empirical results on the real data (different financial asset classes) are also provided to illustrate the performance of the estimators.",
    "year": 2012,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "2b92d9ec38b9fa036eab440a9c5222ab",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:32:27.497217"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on the estimation of conditional risk measures, specifically Value-at-Risk (VaR) and Average Value-at-Risk (AVaR), which are key tools in financial risk management. The empirical results on financial asset classes further support its application in this domain.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on the estimation of conditional risk measures, specifically Value-at-Risk (VaR) and Average Value-at-Risk (AVaR), which are key tools in financial risk management. The empirical results on financial asset classes further support its application in this domain.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:34:20.011831"
}