{
  "paper": {
    "id": 2789,
    "title": "Fuzzy Value-at-Risk Forecasts Using a Novel Data-Driven Neuro Volatility Predictive Model",
    "abstract": "Quantitative finance has been evolving over last aI decades and combining randomness and fuzziness of the parameters has found growing interest among researchers to solve forecasting problems. Superiority of the fuzzy forecasting method over the minimum mean square forecasting had been demonstrated for fuzzy coefficient (linear as well as nonlinear) time series models in Thavaneswaran et al. [5], However, many proposed fuzzy forecasting methods remain difficult to use in practice and there is a need for data-driven approach to fit the fuzzy coefficient volatility models. A neural network (NN) system can uniformly approximate any real nonlinear function on a compact domain to any degree of accuracy. Artificial NN (ANNs) have been applied to finance problems such as stock index prediction and bankruptcy prediction. In this paper, we introduce a novel direct data-driven neuro predictive model for conditional volatility and study the fuzzy value-at-risk (VaR) forecasts. We apply this model to forecast VaR with actual financial data. Our model shows considerable promise as a decision making and risk managing tool.",
    "year": 2019,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "2428b050a9aecea5736aec4a57313165",
    "relevant_keywords": [
      "neural network",
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T02:19:08.462240"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on developing a novel data-driven neuro predictive model for conditional volatility and specifically studies fuzzy value-at-risk (VaR) forecasts, which is a key tool in financial risk management. The application to actual financial data for VaR forecasting further confirms its primary application in risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on developing a novel data-driven neuro predictive model for conditional volatility and specifically studies fuzzy value-at-risk (VaR) forecasts, which is a key tool in financial risk management. The application to actual financial data for VaR forecasting further confirms its primary application in risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:40:09.413632"
}