{
  "paper": {
    "id": 7621,
    "title": "EVALUATING THE CREDIT RISK OF SMEs USING MIXED METHOD APPROACH: EVIDENCE FROM INDIA",
    "abstract": "Purpose: This paper attempts to identify the key drivers of default on a dataset of 112 Indian SMEs spanning over the years 2014-2020 using the mixed method approach.Design/Methodology/ Approach: For the quantitative analysis, logit model is applied with ratings as dependent variable and size of firm, profitability, solvency, operational efficiency and liquidity ratios as independent variables. In the second stage of analysis, content analysis is done to identify keywords and themes from a select sample of annual reports of the SMEs to validate if the key default drivers as identified by our logistic regression can be validated by the thematic analysis.Findings: The empirical findings reveal that profitability (operating profit margin, net profit margin, return on equity), liquidity (receivables turnover), asset efficiency, solvency (net worth to total assets, market capitalization to total debt) and size (log of total assets) are significant predictors of default. Key themes of operational efficiency, financial performance, management quality and strategic decisions are significant which are in sync with our findings from logit model and validateOriginality/ Value: The significant variables identified by mixed method approach would help SMEs to formulate a strategy to reduce credit risk and can be used by lenders to forewarn against impending default.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "bf6047f961115d4b1938f1a701ab150d",
    "relevant_keywords": [
      "classification",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T03:10:32.982824"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on identifying key drivers of default for SMEs using a mixed method approach, which is directly related to assessing and managing credit risk, a core aspect of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on identifying key drivers of default for SMEs using a mixed method approach, which is directly related to assessing and managing credit risk, a core aspect of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:26:14.941679"
}