{
  "paper": {
    "id": 207,
    "title": "The use of data mining and neural networks for forecasting stock market returns",
    "abstract": "It has been widely accepted by many studies that non-linearity exists in the financial markets and that neural networks can be effectively used to uncover this relationship. Unfortunately, many of these studies fail to consider alternative forecasting techniques, the relevance of input variables, or the performance of the models when using different trading strategies. This paper introduces an information gain technique used in machine learning for data mining to evaluate the predictive relationships of numerous financial and economic variables. Neural network models for level estimation and classification are then examined for their ability to provide an effective forecast of future values. A cross-validation technique is also employed to improve the generalization ability of several models. The results show that the trading strategies guided by the classification models generate higher risk-adjusted profits than the buy-and-hold strategy, as well as those guided by the level-estimation based forecasts of the neural network and linear regression models. (c) 2005 Elsevier Ltd. All rights reserved.",
    "year": 2005,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "23bf4a3f622b128eab05fb80c6e272d4",
    "relevant_keywords": [
      "machine learning",
      "classification",
      "regression",
      "neural network",
      "backpropagation",
      "BP"
    ],
    "stage1_timestamp": "2025-05-15T01:47:53.089745"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文主要研究使用数据挖掘和神经网络预测股票市场回报，并评估不同交易策略的表现，这属于投资组合管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文主要研究使用数据挖掘和神经网络预测股票市场回报，并评估不同交易策略的表现，这属于投资组合管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T14:24:44.456158"
}