{
  "paper": {
    "id": 4340,
    "title": "Sustainable Risk Assessment through the Analysis of Financial Losses from Third-Party Damage in Bridge Construction",
    "abstract": "Due to the recent introduction of innovative construction methods and technologies, construction projects increasingly require sustainability in their high degrees of specialization and complex work processes. This is due to a wide variety of new risk factors associated with construction projects that can lead to extensive and severe damage. When an accident occurs during a construction project, it can cause material, property, or bodily damage not only within the actual construction site but also outside, affecting third parties. This study analyzed the record of such third-party damage and the subsequent financial losses in bridge construction management, to identify the objective and quantified relationship of risk indicators related to the damage and losses. In order to assess the actual losses in construction projects, we adopted the loss claim payout data as recorded and provided by a major Korean insurance company, and conducted a multiple regression analysis to identify the loss indicators and to develop a loss estimation model. In this study, the analysis of the data indicated that the superstructure type, the foundation type, floods, and company ranking by the amount of the contract were the four statistically significant risk indicators that affected financial losses from third-party damage, among the nine variables used as independent variables, which included the superstructure type, foundation type, superstructure construction method, maximum span length, floods, typhoons, total construction cost, total construction period, and company ranking. As this study focused on identifying the risk factors and producing a loss assessment model quantified in numerical values, the results provide important references for assessing and minimizing the risks to third parties and the consequential financial losses in bridge construction, while promoting sustainability objectives.",
    "year": 2020,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "47845511c6d96197faded8f735c1d40a",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:36:05.215883"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究桥梁建设中的第三方损害风险评估和损失估计模型，虽然涉及金融损失分析，但其核心应用领域是建筑工程风险管理，而非特定的金融研究领域如衍生品定价、金融风险管理或投资组合管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究桥梁建设中的第三方损害风险评估和损失估计模型，虽然涉及金融损失分析，但其核心应用领域是建筑工程风险管理，而非特定的金融研究领域如衍生品定价、金融风险管理或投资组合管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:33:21.128575"
}