{
  "paper": {
    "id": 3396,
    "title": "Network structure analysis of the Brazilian interbank market",
    "abstract": "In this paper, we provide a detailed analysis of the roles financial institutions play within the Brazilian interbank marker using a network-based approach. We present a novel methodology to assess how compliant networks are to being perfect core-periphery structures. The approach is flexible; allowing for the identification of multiple cores in networks. We verify that the interbank network presents a high disassortative mixing pattern, suggesting preferential attachment of highly connected financial institutions to others with few connections. We use the clustering coefficient-to assess the substitutability of financial institutions. We find that large banking institutions are counterparties that are easily substitutable in normal times. We uncover that the rich-club effect is strongly present in the community comprising the large banking institutions, as they normally form near-clique structures. Since they play the role of liquidity providers in the interbank market, this interconnectedness effectively endows the network With robuStness, as participants that are with liquidity issues can easily substitute counterparties that are liquidity suppliers. This substitutability will likely vanish.during periods of stress, increasing systemic risk and the likelihood-of cascade failures. (C) 2016 Elsevier B.V. All rights reserved.",
    "year": 2016,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "2931d91b3d2051ff46f2f7fb449f5305",
    "relevant_keywords": [
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T02:25:40.212758"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要分析了巴西银行间市场的网络结构，研究了金融机构之间的连接模式及其在流动性提供和系统性风险中的作用，这直接关联到金融风险管理领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文主要分析了巴西银行间市场的网络结构，研究了金融机构之间的连接模式及其在流动性提供和系统性风险中的作用，这直接关联到金融风险管理领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:36:50.100116"
}