{
  "paper": {
    "id": 241,
    "title": "Intelligent algorithm of optimal investment model under stochastic interest rate and stochastic volatility",
    "abstract": "Financial mathematics, an interdisciplinary subject between mathematics and finance, is the application of mathematics in the financial field, which carries mainly out the quantitative analysis and research of financial issues by mathematical theories and methods. The idea of financial mathematics is adopted to study investment. First of all, an investment risk prediction model is designed based on cluster analysis-hybrid genetic algorithm and integrated improved support vector machine, and AdaBoost-support vector machine and clustering-AdaBoost support vector machine, the model is fully analyzed and verified. Combining the ways of more than half random sampling, the imbalance state is adjusted and reduced. Then the idea of integrated learning is used to cope further the data imbalance state and improve the classifier's attention to a few classes. Finally, the algorithm is tested. The results show that this algorithm effectively reduces the cost of accidental injury.",
    "year": 2019,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "7d07ed0b6474c9575a481dfbf48feb8f",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM",
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T01:48:30.756808"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文研究了在随机利率和随机波动率下的最优投资模型，并设计了投资风险预测模型，这属于投资组合管理的范畴。论文的核心技术应用于投资决策和风险管理，与投资组合管理直接相关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文研究了在随机利率和随机波动率下的最优投资模型，并设计了投资风险预测模型，这属于投资组合管理的范畴。论文的核心技术应用于投资决策和风险管理，与投资组合管理直接相关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:59:52.519867"
}