{
  "paper": {
    "id": 5102,
    "title": "Risk adjustment for people with chronic conditions in private sector health plans",
    "abstract": "Background. Although the problem of adverse selection into more generous health insurance plans has been the focus of previous work, risk adjustment systems have only recently begun to be implemented to blunt its effect. Objectives. This study examines the ability of the leading risk adjustment systems to predict health core expenditures for people with chronic conditions, using claims and enrollment data from 2 large employers. Research design. Predictive errors and total financial losses/gains are compared for different risk adjustment approaches (primarily hierarchical condition categories [HCCs] and adjusted clinical groups) for several chronic conditions. Results. One of the best performing risk adjustment systems was a regression-based HCC method, which had an average under-prediction error rate of 9% or 6%, depending on the employer. In comparison, more typical actuarial risk adjustments based on just age, gender, and prevailing area wages lead to a prediction error of at least 50%. We did not find evidence that payments for particular chronic conditions would be consistently and significantly under- or overestimated. Conclusion. The leading risk adjustment approaches substantially reduce the incentives for adverse selection but do not eliminate them.",
    "year": 2003,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "a76d8ea0cbfb511b4456ac4924825e66",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:44:11.079794"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究健康保险中的风险调整系统，用于预测和管理慢性病患者的医疗支出，虽然涉及风险管理，但属于健康保险领域而非金融风险管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究健康保险中的风险调整系统，用于预测和管理慢性病患者的医疗支出，虽然涉及风险管理，但属于健康保险领域而非金融风险管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:31:09.325344"
}