{
  "paper": {
    "id": 4536,
    "title": "Determinants of Corporate Indebtedness in Portugal: An Analysis of Financial Behaviour Clusters",
    "abstract": "Corporate indebtedness is a powerful tool in determining a company's financial health with impacts on its image and reputation. The main objective of this research is to study the determining factors in corporate indebtedness in Portugal. It also has the secondary objectives of creating clusters of companies' behaviour in relation to the use of credit and verifying their differences in relation to the characteristics of the companies. It uses a quantitative methodology based on a questionnaire survey of 1957 Portuguese companies. The results of the factor analysis show the formation of six determining factors in corporate indebtedness, namely the negotiating relationship with banks, financing, cycle and indebtedness, company operating performance, guarantees used to obtain bank financing and financing risk analysis as well as secondary forms of bank financing. The application of cluster analysis to the six factors formed led to the classification of companies into three clusters: the resilient financial cluster, the operational excellence cluster and the strategic financial cluster. There are several statistically significant differences in the corporate financing factors in relation to the clusters to which they belong. The evidence of the factors and clusters explaining company financing provides insights for improving credit access practices and for implementing public policies that facilitate access to credit and promote economic development.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "93d454f206b59b1ce1a01de076db924a",
    "relevant_keywords": [
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T02:38:20.369909"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究企业负债的决定因素和财务行为聚类，虽然涉及金融风险分析，但其核心内容并不直接涉及衍生品定价、金融风险管理或投资组合管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究企业负债的决定因素和财务行为聚类，虽然涉及金融风险分析，但其核心内容并不直接涉及衍生品定价、金融风险管理或投资组合管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:32:54.172267"
}