{
  "paper": {
    "id": 2460,
    "title": "A HYBRID MULTIPLE CRITERIA DECISION-MAKING MODEL FOR INVESTMENT DECISION MAKING",
    "abstract": "Investments are accompanied by risks. How investors choose the right investment tools to assist in the selection of investment targets is a topic, worth exploring. Therefore, this study aimed to develop an investment decision-making process to deal with this issue. Firstly, we proposed a globalized modified grey relational analysis to select the representative indicators including the financial indicators and risk measurement indicators. Then we combined financial and risk evaluation indicators, and divided companies into low, moderate and high-risk groups through the grey clustering analysis. Finally, Vlse Kriterijumska Optimizacija Kompromisno Resenje (VIKOR) combined with the grey entropy weighting method was applied to business performance evaluation and sorting of each grouping. In order to verify this study, a combination of 21 financial ratios and four risk indicators was utilized in order to verify the evaluation and decision-making process in the operating performance of 62 listed opto-electronics companies in Taiwan. The results of ranking the operating performance for each group can be made available to company managers as a reference in order to enhance competitiveness and business performance. The results can also be used as the basis for decision-making to aid investors who are facing many investment portfolios.",
    "year": 2014,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "5e72d478a9ad3d3998af65c20b3ea716",
    "relevant_keywords": [
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T02:15:27.118769"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是开发一个投资决策过程，包括选择金融和风险指标、分组评估公司风险，并对各组的经营绩效进行排序。这些技术直接应用于投资组合的选择和管理，旨在帮助投资者在面对多种投资组合时做出决策。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是开发一个投资决策过程，包括选择金融和风险指标、分组评估公司风险，并对各组的经营绩效进行排序。这些技术直接应用于投资组合的选择和管理，旨在帮助投资者在面对多种投资组合时做出决策。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:42:26.524673"
}