{
  "paper": {
    "id": 304,
    "title": "The Odd Log-Logistic Weibull-G Family of Distributions with Regression and Financial Risk Models",
    "abstract": "A new generalization of the Weibull-G family is proposed with two extra shape parameters. The mathematical properties are derived in great detail. Using the Weibull and normal distributions as baseline distributions, two models are introduced. The first model is a location-scale regression model based on a new extension of the Weibull distribution. The second model is a new two-step financial risk model to forecast the daily value at risk. The flexibility and applicability of the proposed models are investigated by means of five real data sets on the lifetime and financial returns. Empirical findings of the study show that proposed models work well and produce better results than other well-known models for financial risk modeling and censored lifetime data analysis.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "9b5214001cdbeb5ef5cebb38037b297b",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:49:04.682200"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper introduces a new two-step financial risk model to forecast the daily value at risk, which is a core technique in financial risk management. The empirical findings also highlight its application in financial risk modeling, demonstrating better results compared to other models.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper introduces a new two-step financial risk model to forecast the daily value at risk, which is a core technique in financial risk management. The empirical findings also highlight its application in financial risk modeling, demonstrating better results compared to other models.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:59:26.330603"
}