{
  "paper": {
    "id": 1943,
    "title": "Fuzzy Multicriteria ABC Supplier Classification in Global Supply Chain",
    "abstract": "The determination of the optimal purchasing strategy in enterprise that is a part of global supply chain could be performed in two steps. In step one, a classification of potential suppliers is performed in order to determine the optimal portfolio of suppliers. This is delivered by using the fuzzy multicriteria proposed ABC classification method. Uncertainties in relative importance of criteria and their values are described by linguistic expressions. Modelling of linguistic expressions is based on the fuzzy sets theory. In the second step, ranking of optimal portfolio of suppliers is performed by using the modified ELECTRE method. The obtained results represent valuable input for determining the long time purchasing strategy and building partnership with the best suppliers. The developed two-step model is verified on real life data. The obtained results indicate good compliance with the opinions management in this type of industry. It is worth to mention that the proposed model can be easily extended and adopted to the analysis of other issues of management which could be applicable in different research areas.",
    "year": 2016,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "a5fb34a010515946b77be00fa6f0b51a",
    "relevant_keywords": [
      "classification"
    ],
    "stage1_timestamp": "2025-05-15T01:01:41.572308"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是全球供应链中供应商的分类和优化采购策略，使用了模糊多准则ABC分类方法和改进的ELECTRE方法。虽然提到了'投资组合'一词，但这是指供应商的组合，而非金融资产的投资组合管理。论文的核心技术并未应用于衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是全球供应链中供应商的分类和优化采购策略，使用了模糊多准则ABC分类方法和改进的ELECTRE方法。虽然提到了'投资组合'一词，但这是指供应商的组合，而非金融资产的投资组合管理。论文的核心技术并未应用于衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:18:11.177802"
}