{
  "paper": {
    "id": 1170,
    "title": "Investigating the determinants of money laundering risk",
    "abstract": "PurposeWith the growing interconnectedness of global markets brought about by globalization and technological innovation, there is a heightened worldwide risk of money laundering, posing a considerable negative impact on economies and social equality. Therefore, the primary purpose of this research is to examine factors that underpin the pervasiveness of money laundering risk. Design/methodology/approachBy using a cross-section sample of 84 countries, the study uses ordered logit and multinomial logit regression to test and explain the role of main and varied determinants of money laundering risk covering countries' economic, social, regulatory and corporate environment. FindingsThe authors conclude that, overall, the macroeconomic indicators are less relevant in influencing money laundering risk than the other factors adopted from the Basel report. Nonetheless, the volume of exports and the exchange rate were robust in both the ordered and multinomial regression analyses alongside financial secrecy, auditing standards and corporate transparency. While more financial secrecy and a higher volume of exports were found to increase this risk, the other variables showed a negative relationship. The authors further conclude that it is mostly less secrecy, more transparency and better auditing that could gradually transform a high-risk country into medium risk. Practical implicationsThis study recommends the implementation of publicly accessible ownership registries to address the issues around secrecy, transparency and auditing misconducts. Additionally, the general strengthening of laws and policies in these three domains is also necessary alongside the application of current technologies, such as machine learning, for the detection of money laundering. Originality/valueThe authors believe this study uses advanced econometric techniques rarely used in the literature on money laundering. Separating the impact of economic and social/regulatory is also valuable",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "bba49984a8c060f7b95e8362dc0984d1",
    "relevant_keywords": [
      "machine learning"
    ],
    "stage1_timestamp": "2025-05-15T01:59:56.251551"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究洗钱风险的决定因素，虽然涉及金融领域，但其核心内容并不直接涉及衍生品定价、金融风险管理或投资组合管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究洗钱风险的决定因素，虽然涉及金融领域，但其核心内容并不直接涉及衍生品定价、金融风险管理或投资组合管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:51:38.667129"
}