{
  "paper": {
    "id": 4715,
    "title": "Exploring spatial dynamics of trauma and substance use among suicide deaths in the United States (2017-2021)",
    "abstract": "BackgroundSuicide remains a significant cause of death in the United States. Traumatic events, such as experiences of violence, financial loss, and mental illness, significantly increase an individual's risk of suicide. Substance use, often used as a coping mechanism for trauma, frequently occurs alongside these events. Geographic patterns of trauma and substance use may reveal underlying factors that contribute to suicide rates across the nation.MethodsData from the National Violent Death Reporting System (NVDRS), collected between 2017 and 2021, was used to examine spatial relationships between traumatic events and substance use among suicides. Spatial autocorrelation was used to assess global spatial dependence of traumatic events among suicide deaths. Additionally, hot spot analyses were conducted to pinpoint regions with significantly elevated or reduced experiences of trauma. Colocation analyses were conducted to identify areas where traumatic events and substance use co-occur spatially.ResultsTraumatic events among suicides exhibited geographic clustering. Spatial clusters of traumatic events were identified in specific regions across the U.S. and its territories. Hot spots were predominantly observed in Western and Midwestern areas, while more cold spots were found in Southern regions. Additionally, colocation analysis revealed that Midwestern counties had a higher likelihood of experiencing traumatic events in conjunction with substance use history among suicide decedents.ConclusionClustering patterns may provide insight on underlying mechanisms that have significant impacts on suicide outcomes. The colocation analysis helps reveal patterns of spatial clustering, shedding light on potential risk factors or shared characteristics in those areas. By examining both global and local spatial patterns, researchers gain insights into the distribution of trauma and substance use-related incidents and their association with suicide.",
    "year": 2025,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "e39402d2dcacd24dcacfc34ac0a00e85",
    "relevant_keywords": [
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T02:40:27.850239"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究自杀事件中创伤和物质使用的空间动态，属于公共卫生和社会科学领域，与衍生品定价、金融风险管理或投资组合管理无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究自杀事件中创伤和物质使用的空间动态，属于公共卫生和社会科学领域，与衍生品定价、金融风险管理或投资组合管理无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:32:19.527140"
}