{
  "paper": {
    "id": 1858,
    "title": "Impact of digital finance development based on k-means clustering algorithm on alleviating financing constraints of IoT technology companies",
    "abstract": "This study is developed to analyse the effect of alleviating the financing constraints of internet of things technology innovation enterprises under the development of digital finance based on the k-means clustering algorithm. Using the k-means clustering algorithm, the risk level of 'financing of IoT innovation enterprises' is classified. The Bayesian network is created according to the results of the k-means clustering algorithm. Then, the accuracy is predicted and the implementation of digital financial development effectively alleviates the financing constraints of technology innovative enterprises. In addition, the effect on digital financial development is more obvious when the enterprises are nonstate-owned technological innovation enterprises. For enterprises with lower quality of internal control, the effect is more obvious. And when the degree of market competition is low, the effect is more obvious. The research has certain reference value to further reduce the financing cost of science and technology innovation enterprises.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "7cb1cdfbfb304f65e28c899099ae62ea",
    "relevant_keywords": [
      "unsupervised learning",
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T02:08:04.051730"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究数字金融发展对物联网技术公司融资约束的缓解作用，使用了k-means聚类算法和贝叶斯网络进行风险分类和预测。虽然涉及金融风险分类，但核心应用场景是企业融资约束缓解，不属于衍生品定价、金融风险管理或投资组合管理等特定金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究数字金融发展对物联网技术公司融资约束的缓解作用，使用了k-means聚类算法和贝叶斯网络进行风险分类和预测。虽然涉及金融风险分类，但核心应用场景是企业融资约束缓解，不属于衍生品定价、金融风险管理或投资组合管理等特定金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:45:32.201700"
}