{
  "paper": {
    "id": 160,
    "title": "Resource allocation neural network in portfolio selection",
    "abstract": "Portfolio selection is a resource allocation problem in a finance market. The investor's asset optimization requires the distribution of a set of capital (resources) among a set of entities (assets) with the trade-off between risk and return. The ANN with nonlinear capability is proven to solve a large-scale complex problem effectively. It is suitable to solve NP-hard resource allocation problem. However, the traditional ANN model cannot guarantee the summation of produced investment weight always preserves 100% in output layer. This article introduces a resource allocation neural network model to optimize investment weight of portfolio. This model will dynamically adjust the investment weight as a basis of 100% of summing all of asset weights in the portfolio. The experimental results demonstrate the feasibility of optimal investment weights and superiority of ROI of buy-and-hold trading strategy compared with benchmark Taiwan Stock Exchange (TSE). (c) 2007 Elsevier Ltd. All rights reserved.",
    "year": 2008,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "a51e44b09b3135ae36586e0e8494a98e",
    "relevant_keywords": [
      "machine learning",
      "neural network",
      "deep learning",
      "backpropagation",
      "BP",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T00:40:02.088023"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是资源分配神经网络模型，用于优化投资组合中的资产权重分配，明确针对投资组合管理问题。论文的研究目标和实验设计都集中在如何动态调整投资权重以实现最优投资组合，这直接属于投资组合管理领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Portfolio Management\"],\n  \"justification\": \"该论文的核心技术是资源分配神经网络模型，用于优化投资组合中的资产权重分配，明确针对投资组合管理问题。论文的研究目标和实验设计都集中在如何动态调整投资权重以实现最优投资组合，这直接属于投资组合管理领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:33:17.497491"
}