{
  "paper": {
    "id": 5345,
    "title": "The Poisson Regression Analysis for Occurrence of Floods",
    "abstract": "Currently, flood risk can be considered as the most serious threat, mainly in areas and countries where hardly any other natural risks occur. In order to analyze this kind of natural disaster, it is necessary to examine the long-term development of its occurrence around the world as well as its financial and other consequences. The main objective of the research was to apply Poisson regression on flood occurrence as the dependent variable. The set of explanatory variables under consideration was tested and subsequently the final model was determined. Poisson regression model, which is a generalized linear model, was chosen as a computing model. Using it guarantees consistent results when working with variables with non-normal data distribution (skewed and discrete). Thus OLS estimator cannot work and is replaced by MLE estimator. Consequently, confidence intervals of estimated parameters and all model results can be received. The research resulted in selecting the Poisson regression model with an estimated and significant parameter. Moreover, sample sets of selected countries were compared and evaluated in terms of overall intensity of flood occurrence. (C) 2015 The Authors. Published by Elsevier B.V.",
    "year": 2015,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "5dd94a0eb5fab03d50a77cd359950e61",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:46:44.936364"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究洪水发生的Poisson回归分析，虽然提到了金融后果，但核心技术并未应用于衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究洪水发生的Poisson回归分析，虽然提到了金融后果，但核心技术并未应用于衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:30:32.678660"
}