{
  "paper": {
    "id": 1239,
    "title": "A comprehensive decision support system for stock investment decisions",
    "abstract": "The stock market is of paramount importance to modern society. Decision support in this sense must consider multiple criteria and be able to deal with the different stages involved. We propose a comprehensive Decision Support System for investing in the stock market that addresses the three main aspects of stock portfolio management: price forecasting, stock selection and portfolio optimization. An artificial neural network and fundamental analysis are used during the first stage of the system to forecast future stock prices. Differential evolution and fundamental analysis are used to select the most plausible stocks in the second stage. Finally, genetic algorithms and statistical analysis are used to build the most preferred portfolio in the third stage. Back-testing is used in experiments considering historical returns of the stocks in the S&P's 500 index. The proposed approach is compared to several benchmarks (average of the market, market index, contemporary approaches) in several contexts (actual returns, Sharpe ratio, Sortino ratio). The results show that the proposed system outperformed the benchmarks with statistical significance in most scenarios, including different market trends. The results suggest that the proposed system has the potential to be a good alternative to existing methods.",
    "year": 2022,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "8699731838ea650c81d46261bf5e1a5b",
    "relevant_keywords": [
      "neural network",
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T00:53:10.038501"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文提出了一种全面的决策支持系统，专注于股票投资决策的三个主要方面：价格预测、股票选择和投资组合优化。这些内容明确指向投资组合管理领域，特别是通过使用人工神经网络、差分进化和遗传算法等技术来优化投资组合。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文提出了一种全面的决策支持系统，专注于股票投资决策的三个主要方面：价格预测、股票选择和投资组合优化。这些内容明确指向投资组合管理领域，特别是通过使用人工神经网络、差分进化和遗传算法等技术来优化投资组合。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:22:15.753295"
}