{
  "paper": {
    "id": 238,
    "title": "Applying Kernel Logistic Regression in Data Mining to Classify Credit Risk",
    "abstract": "Credit risk evaluation is an interesting and important data mining problem in financial analysis domain. This problem domain, do require estimable class probabilities as well as accurate classification method. One of classification methods in the kernel-machine techniques and data mining communities that allows non linear probabilistic classification, transparent reasoning, and competitive discriminative ability is Kernel Logistic Regression. Kernel Logistic Regression model is a kernelized version of Logistic Regression, which well known classification method in the field of statistical learning. The parameters Of kernel model are given by the solution of a convex optimization problem, that can be found using the efficient Iteratively Re-weighted Least Squares (IRLS) algorithm. In this paper, we investigated the classification performance of applying Kernel Logistic Regression to classify risk credit problem. The result demonstrated that Kernel Logistic Regression has good accuracy to evaluate credit risk, comparable with another well known kernel machine, Support Vector Machine.",
    "year": 2008,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "24fe76ba2d7239dfe9bf6813b277df81",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM"
    ],
    "stage1_timestamp": "2025-05-15T01:48:30.744955"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是应用核逻辑回归（Kernel Logistic Regression）进行信用风险分类，这直接涉及金融风险管理中的信用风险评估。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"该论文的核心技术是应用核逻辑回归（Kernel Logistic Regression）进行信用风险分类，这直接涉及金融风险管理中的信用风险评估。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:59:52.994074"
}