{
  "paper": {
    "id": 7604,
    "title": "Cytomegalovirus in Australian blood donors: seroepidemiology and seronegative red blood cell component inventories",
    "abstract": "BACKGROUND: Cytomegalovirus (CMV) can lead to severe disease in high-risk subpopulations. To prevent transfusion-transmitted CMV in these patient groups, the Australian Red Cross Blood Service maintains inventories of CMV-seronegative fresh blood components. STUDY DESIGN AND METHODS: Donor demographic data and CMV seroscreening results for all blood donations and blood components issued in Australia between financial years (FYs) 2008/09 to 2012/13 inclusive were obtained. Population estimates were also extracted for the calculation of age-weighted seroprevalence estimates. Linear regression was used to model trends in red blood cell (RBC) component acquisition and demand. RESULTS: The estimated age-weighted seroprevalence of CMV in 20- to 69-year old Australians was 76.12 +/- 0.13%, with higher seroprevalence in females and older age groups. Seroprevalence decreased over the study period, while the demand for CMV-seronegative RBC components increased. It was predicted that component acquisition may be insufficient by FY 2017/18 if current trends persist. CONCLUSION: These findings represent an evaluation of CMV seroepidemiology in Australia and form a basis to predict the future status of CMV-seronegative RBC component inventories. The results will serve to guide Blood Service operations and inform current international debate on CMV-safe blood components.",
    "year": 2016,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "5cf530143bef1ad24a61c00822aa72c5",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T03:10:05.663201"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究巨细胞病毒（CMV）在澳大利亚献血者中的血清流行病学及血清阴性红细胞成分库存管理，属于医学和公共卫生领域，与金融研究领域无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究巨细胞病毒（CMV）在澳大利亚献血者中的血清流行病学及血清阴性红细胞成分库存管理，属于医学和公共卫生领域，与金融研究领域无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:26:15.210636"
}