{
  "paper": {
    "id": 85,
    "title": "RETRACTED: Early Warning of Financial Risk Based on K-Means Clustering Algorithm (Retracted Article)",
    "abstract": "The early warning of financial risk is to identify and analyze existing financial risk factors, determine the possibility and severity of occurring risks, and provide scientific basis for risk prevention and management. The fragility of financial system and the destructiveness of financial crisis make it extremely important to build a good financial risk early-warning mechanism. The main idea of the K-means clustering algorithm is to gradually optimize clustering results and constantly redistribute target dataset to each clustering center to obtain optimal solution; its biggest advantage lies in its simplicity, speed, and objectivity, being widely used in many research fields such as data processing, image recognition, market analysis, and risk evaluation. On the basis of summarizing and analyzing previous research works, this paper expounded the current research status and significance of financial risk early-warning, elaborated the development background, current status and future challenges of the K-means clustering algorithm, introduced the related works of similarity measure and item clustering, proposed a financial risk indicator system based on the K-means clustering algorithm, performed indicator selection and data processing, constructed a financial risk early-warning model based on the K-means clustering algorithm, conducted the classification of financial risk types and optimization of financial risk control, and finally carried out an empirical experiments and its result analysis. The study results show that the K-means clustering method can effectively avoid the subjective negative impact caused by artificial division thresholds, continuously optimize the prediction process of financial risk and redistribute target dataset to each cluster center for obtaining optimized solution, so the algorithm can more accurately and objectively distinguish the state interval of different financial risks, determine risk occurrence possibility and its severity, and provide a scientific basis for risk prevention and management. The study results of this paper provide a reference for further researches on financial risk early-warning based on K-means clustering algorithm.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "586513681f61425fd94253d80080252c",
    "relevant_keywords": [
      "unsupervised learning",
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T01:46:39.576947"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是基于K-means聚类算法构建金融风险预警模型，旨在识别和分析金融风险因素，确定风险发生的可能性和严重性，为风险预防和管理提供科学依据。这明确属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是基于K-means聚类算法构建金融风险预警模型，旨在识别和分析金融风险因素，确定风险发生的可能性和严重性，为风险预防和管理提供科学依据。这明确属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:01:09.157994"
}