{
  "paper": {
    "id": 1713,
    "title": "Construction of Risk Prediction Models for Enterprise Finance Sharing Operations Using K-Means and C4.5 Algorithms",
    "abstract": "The evaluation of financial sharing centres in enterprises typically relies on outdated financial data, lacks comprehensive assessment, and presents risks such as employee misconduct. To address these challenges, we propose a risk prediction model for enterprise financial sharing operations based on the K-means clustering algorithm for performance evaluation and the C4.5 algorithm for managing employee risks. Our approach enhances the accuracy and objectivity of performance evaluation while improving the efficiency of personnel risk management. Results indicate that the K-means algorithm classifies employee performance into five levels, facilitating comprehensive performance evaluation. Furthermore, through risk management optimisation, accuracy and recall rates increase to 0.905 and 0.890, respectively. The proposed risk prediction model achieves high accuracy rates of 90.5% and 92.4% in the training and test sets, respectively. Practical application of our methodology and model in A Group's financial sharing centre demonstrates their effectiveness and potential for enhancing the operation and management of enterprise financial sharing centres.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "e658662bba510052e1c6075b0d81aec3",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "unsupervised learning",
      "classification",
      "decision tree",
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T02:06:52.628980"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用K-means和C4.5算法构建企业财务共享操作的风险预测模型，旨在提高员工风险管理的效率和准确性，这属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是使用K-means和C4.5算法构建企业财务共享操作的风险预测模型，旨在提高员工风险管理的效率和准确性，这属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:46:57.724954"
}