{
  "paper": {
    "id": 1122,
    "title": "A new VIKOR-based in-sample-out-of-sample classifier with application in bankruptcy prediction",
    "abstract": "Nowadays, business analytics has become a common buzzword in a range of industries, as companies are increasingly aware of the importance of high quality predictions to guide their pro-active planning exercises. The financial industry is amongst those industries where predictive analytics techniques are widely used to predict both continuous and discrete variables. Conceptually, the prediction of discrete variables comes down to addressing sorting problems, classification problems, or clustering problems. The focus of this paper is on classification problems as they are the most relevant in risk-class prediction in the financial industry. The contribution of this paper lies in proposing a new classifier that performs both in-sample and out-of-sample predictions, where in-sample predictions are devised with a new VIKOR-based classifier and out-of-sample predictions are devised with a CBR-based classifier trained on the risk class predictions provided by the proposed VIKOR-based classifier. The performance of this new non-parametric classification framework is tested on a dataset of firms in predicting bankruptcy. Our findings conclude that the proposed new classifier can deliver a very high predictive performance, which makes it a real contender in industry applications in finance and investment.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "4e57dbab017abab918e0e644dbbd3c6d",
    "relevant_keywords": [
      "classification",
      "supervised learning"
    ],
    "stage1_timestamp": "2025-05-15T01:59:21.585031"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on developing a new classifier for predicting bankruptcy, which is a key aspect of financial risk management, particularly in assessing credit risk and corporate default probabilities.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on developing a new classifier for predicting bankruptcy, which is a key aspect of financial risk management, particularly in assessing credit risk and corporate default probabilities.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:51:58.967612"
}