{
  "paper": {
    "id": 317,
    "title": "Classification of Credit Dataset Using Improved Particle Swarm Optimization Tuned Radial Basis Function Neural Networks",
    "abstract": "Credit risk assessment is acting as a survival weapon in almost every financial institution. It involves an in-depth and sensitive analysis of various economic, social, demographic, and other pertinent data provided by the customers and about the customers for building a more accurate and robust electronic finance system. The classification problem is one of the primary concerns in the process of analyzing the gamut of data; however, its complexity has ignited us to use machine learning-based approaches. In this paper, radial basis function neural network (RBFNN) with particle swarm optimization (RBFNN + PSO) and improved particle swarm optimization tuned radial basis function neural network (RBFNN + IMPSO) learning algorithms have been studied and compared their effectiveness for credit risk assessment. The experimental findings draw a clear line between the proposed model and traditional learning algorithms. Moreover, the proposed method is very promising vis-a-vis of individual classifiers.",
    "year": 2020,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "480a4d0a548c10b308a675aa359ee7b8",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "neural network",
      "radial basis function",
      "particle swarm optimization"
    ],
    "stage1_timestamp": "2025-05-15T01:49:40.953583"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on credit risk assessment using machine learning techniques, which is a key aspect of financial risk management in financial institutions.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on credit risk assessment using machine learning techniques, which is a key aspect of financial risk management in financial institutions.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:59:05.354694"
}