{
  "paper": {
    "id": 735,
    "title": "Mitigating long-term financial risk for large customers via a hybrid procurement strategy considering power purchase agreements",
    "abstract": "In facing urgent climate issues, large electricity customers committed to the RE100 initiative, aiming to transition entirely to renewable energy sources (RES). However, they encounter significant challenges in managing the unpredictability of RES generation and the volatility of market prices. This study unveils a groundbreaking hybrid procurement model that integrates Power Purchase Agreements (PPAs) with Battery Energy Storage Systems (BESS) to mitigate these financial risks through a novel method. Employing a sophisticated Mixed Integer Linear Programming (MILP) model alongside an innovative deep learning forecast for long-term PPAs planning, we present a unique solution that significantly boosts financial returns and enhances risk mitigation for large electricity customers. Validated with real-world data across three distinct customer profiles, our model demonstrates a notable increase in expected Net Present Value (NPV) by up to 13.58% compared to traditional strategies and improved earnings stability under adverse market conditions. Our proposed study not only charts a path toward more effective long-term RES procurement strategies but also provides large electricity customers with a strategic framework to skillfully navigate the complexities of the electricity market in alignment with their sustainability commitments.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "deep learning",
    "cache_key": "ac8b708ab6554fa8751079773866e873",
    "relevant_keywords": [
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T01:42:05.372414"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是开发一种混合采购模型，结合电力购买协议（PPAs）和电池储能系统（BESS），以减轻大型电力客户面临的财务风险。研究重点在于通过优化和预测技术来管理市场价格的波动性和可再生能源发电的不确定性，这直接关联到金融风险管理领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是开发一种混合采购模型，结合电力购买协议（PPAs）和电池储能系统（BESS），以减轻大型电力客户面临的财务风险。研究重点在于通过优化和预测技术来管理市场价格的波动性和可再生能源发电的不确定性，这直接关联到金融风险管理领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:02:25.639012"
}