{
  "paper": {
    "id": 667,
    "title": "Impact of Baggingon MLP Classifier for Credit Evaluation",
    "abstract": "Credit risk is one of the critical and the major challenges faced by banks. Its evaluation is an important factor in decision making for grant of credit. The accuracy in credit risk evaluation techniques adds to the profitability of banks and avoids financial loss. Data Mining has played a very significant role in evaluating credit risk. Multi-Layer Perception Neural Network has been used individually and in combination with other machine learning or statistical techniques to build very efficient hybrid classifiers for credit risk evaluation. In this study, three different models are developed - Single MLP model, Feature Selection based MLP model and Bagging based hybrid MLP model. The results shows that the accuracy of single MLP classifier is significantly enhanced by using suitable feature selection method and is further enhanced by using the ensemble based bagging technique on MLP. The results also revealed that 70:30percentagesplit of dataset contributed to the performance of all the classifiers.",
    "year": 2016,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "278c5841e2d51ea4dce65bc7ec6a40e0",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "neural network",
      "deep learning",
      "backpropagation",
      "BP",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T01:53:59.295846"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要研究使用多层感知神经网络（MLP）及其改进模型（如基于Bagging的混合MLP模型）进行信用风险评估，这直接属于金融风险管理中的信用风险管理范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"该论文主要研究使用多层感知神经网络（MLP）及其改进模型（如基于Bagging的混合MLP模型）进行信用风险评估，这直接属于金融风险管理中的信用风险管理范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:55:53.313371"
}