{
  "paper": {
    "id": 335,
    "title": "Binary Classification and Data Analysis for Modeling Calendar Anomalies in Financial Markets",
    "abstract": "This paper studies on the Day-of-the-week effect by means of several binary classification algorithms in order to achieve the most effective and efficient decision trading support system. This approach utilizes the intelligent data-driven model to predict the influence of calendar anomalies and develop profitable investment strategy. Advanced technology, such as time-series feature extraction, machine learning, and binary classification, are used to improve the system performance and make the evaluation of trading simulation trustworthy. Through experimenting on the component stocks of S&P 500, the results show that the accuracy can achieve 70% when adopting two discriminant feature representation methods, including multi-day technical indicators and intra-day trading profile. The binary classification method based on LDA-Linear Prior kernel outperforms than other learning techniques and provides the investor a stable and profitable portfolios with low risk. In addition, we believe this paper is a FinTech example which combines advanced interdisciplinary researches, including financial anomalies and big data analysis technology.",
    "year": 2016,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "3d8f2cf9b5ae88b2bf300f97be10d696",
    "relevant_keywords": [
      "machine learning",
      "classification",
      "feature representation",
      "feature learning"
    ],
    "stage1_timestamp": "2025-05-15T01:49:41.034080"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术应用于预测日历异常对金融市场的影响，并开发盈利的投资策略，最终目标是构建稳定且低风险的投资组合。这直接关联到投资组合管理领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术应用于预测日历异常对金融市场的影响，并开发盈利的投资策略，最终目标是构建稳定且低风险的投资组合。这直接关联到投资组合管理领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:59:02.901174"
}