{
  "paper": {
    "id": 185,
    "title": "Flexibility-based generation maintenance scheduling in presence of uncertain wind power plants forecasted by deep learning considering demand response programs portfolio",
    "abstract": "The special characteristics of renewable energy resources, such as non-emission and low operating costs, have increased the penetration rate of renewable energy resources in the power system. However, the variability nature of renewable energy resources has led to some challenges in power system studies. Therefore, system flexibility has been taken into account, which plays a key role in dealing with renewable energy resources uncertainty. On the other hand, generation maintenance scheduling is one of the most important and effective programs for short-term studies of the power system. It seems necessary to implement a flexibility-based generation maintenance scheduling in order to achieve more flexible operation as a consequence of providing flexible resources. Here, a novel framework for flexibility-based multi-objective generation maintenance scheduling associated with a portfolio of demand response programs is introduced. Hence, a system flexibility index has been applied in this paper. Moreover, a portfolio of multifarious demand response programs as a negawatt resource has been applied as a provider of flexibility from demand-side point of view. In this paper, direct load control, real-time pricing, and emergency demand response programs are implemented as flexibility providers through comprehensive modelling of DRPs. Herein, proper modeling and forecasting of renewable energy resources production will increase the scheduling accuracy. Hence, the uncertainty of wind power plants is considered by deep learning methodology in Python. Reducing costs such as operation and maintenance costs, leveling the reserve margin and increasing flexibility index are regarded as multifarious objectives of flexibilitybased generation maintenance scheduling. Due to the good handling of large-scale, non-convex and nonproportional objective functions, the augmented epsilon constraint method is utilized to evaluate flexibilitybased multi-objective generation maintenance scheduling. According to the results, the system flexibility has been improved without increasing costs. Several analyses are carried out on a modified IEEE-RTS 24 bus to trace the capability of the proposed structure.",
    "year": 2022,
    "source": "WOS",
    "area": "portfolio",
    "method": "deep learning",
    "cache_key": "46fe36a6b323a7dcb06c40fd22cc7204",
    "relevant_keywords": [
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T00:33:06.178358"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究电力系统中的可再生能源调度和维护计划，涉及深度学习和需求响应程序组合，但其核心应用领域是电力系统优化，而非金融领域的衍生品定价、金融风险管理或投资组合管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究电力系统中的可再生能源调度和维护计划，涉及深度学习和需求响应程序组合，但其核心应用领域是电力系统优化，而非金融领域的衍生品定价、金融风险管理或投资组合管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:35:32.305190"
}