{
  "paper": {
    "id": 668,
    "title": "Hedging global currency risk: A dynamic machine learning approach",
    "abstract": "We propose a dynamic method to hedge foreign exchange risk of international equity portfolios. The method is based on the currency return forecasts derived from a set of alternative machine learning models, built on the main factor components of the currency return time series. To illustrate our method, we take the perspective of a US portfolio manager investing in a global equity portfolio of developing and developed economies. The analysis of several model performance indicators, back-tested on data from 27 October 2008 to 30 December 2022, allows to conclude that accurate predictions of global currency factor returns, such as those obtained with non linear machine learning models, can improve currency risk hedging of global equity portfolios.",
    "year": 2024,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "312612853a1eb6d3e34b42e3e2c722a0",
    "relevant_keywords": [
      "machine learning",
      "regression",
      "principal components analysis",
      "feature representation"
    ],
    "stage1_timestamp": "2025-05-15T00:46:24.472224"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk",
      "Portfolio Management"
    ],
    "justification": "The paper focuses on hedging foreign exchange risk in international equity portfolios using machine learning models, which directly addresses financial risk management. Additionally, the context of a US portfolio manager investing in global equities indicates relevance to portfolio management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\", \"Portfolio Management\"],\n  \"justification\": \"The paper focuses on hedging foreign exchange risk in international equity portfolios using machine learning models, which directly addresses financial risk management. Additionally, the context of a US portfolio manager investing in global equities indicates relevance to portfolio management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:28:52.430455"
}