{
  "paper": {
    "id": 129,
    "title": "A Deep Learning Model for ERP Enterprise Financial Management System",
    "abstract": "With the advent of the information age, the need for information technology construction is beginning to be realized when working in corporate financial management. The application of ERP systems to financial management has become a major trend in the development of modern society. This can help companies collect financial information in real time and analyze and process the obtained information. This paper first gives the significance and models of the ERP financial management system. Then, a financial risk prediction model based on a deep learning model is designed. The method proposes an improved temporal convolutional network-long and short-term memory network (TCN_LSTM) structure and introduces an optimization algorithm to optimize the parameters of the deep learning model. Finally, several benchmark models and evaluation methods are used for comparative study. The experimental results show that the deep learning risk prediction model has significant superiority in prediction accuracy and stability. The proposed model can help enterprises organize their limited resources, realize the scientific allocation of enterprise resources, and create more benefits for enterprises.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "deep learning",
    "cache_key": "2fa0a310c11b1512565927f13eb961cc",
    "relevant_keywords": [
      "deep learning",
      "neural network",
      "long short-term memory",
      "LSTM"
    ],
    "stage1_timestamp": "2025-05-15T01:34:25.378251"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是设计了一个基于深度学习的财务风险预测模型，旨在帮助企业实时收集和分析财务信息，以优化资源配置并创造更多效益。这直接关联到金融风险管理领域，特别是企业财务风险的预测和管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是设计了一个基于深度学习的财务风险预测模型，旨在帮助企业实时收集和分析财务信息，以优化资源配置并创造更多效益。这直接关联到金融风险管理领域，特别是企业财务风险的预测和管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:04:08.265350"
}