{
  "paper": {
    "id": 1350,
    "title": "Regulatory technology (Reg-Tech) in financial stability supervision: Taxonomy, key methods, applications and future directions",
    "abstract": "Financial regulation is the basic requirement for financial stability. Recently, regulatory technology (Reg-Tech) has become one of the main research topics in financial stability regulation. Reg-Tech aims to use artificial intelligence technologies to realize intelligent identification and early risk warning. It is a powerful tool for assisting financial regulation informatization and high efficiency. This study aims to comprehensively review the application of smart technology in financial stability regulation, and analyze the objects and results of the technology's applications. We build a framework for the application of complex networks, knowledge graphs, machine learning, and dynamic systems in Reg-Tech. The aim is to form a clear context for its development, and serve as the support and development foundation for financial stability research. Finally, we summarize the limitations and shortcomings of current Reg-Tech developments, and discuss future research and development directions.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "612a1a78fd5d80e5b064e866e719d8a6",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "neural network",
      "representation learning",
      "knowledge graphs",
      "dynamic systems"
    ],
    "stage1_timestamp": "2025-05-15T02:01:44.851548"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要讨论监管科技（Reg-Tech）在金融稳定监管中的应用，特别是利用人工智能技术进行智能识别和早期风险预警，这属于金融风险管理的范畴。论文中提到的技术如复杂网络、知识图谱、机器学习和动态系统都是为了辅助金融监管信息化和提高效率，与金融风险管理直接相关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文主要讨论监管科技（Reg-Tech）在金融稳定监管中的应用，特别是利用人工智能技术进行智能识别和早期风险预警，这属于金融风险管理的范畴。论文中提到的技术如复杂网络、知识图谱、机器学习和动态系统都是为了辅助金融监管信息化和提高效率，与金融风险管理直接相关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:49:28.521335"
}