{
  "paper": {
    "id": 318,
    "title": "Intelligent Asset Allocation Portfolio Division and Recommendation: Based on Deep Learning and Knowledge Graphs",
    "abstract": "With the continuous development of financial markets, intelligent asset allocation has become a topic of great concern in the investment field. However, traditional asset allocation methods often face difficulties in grasping the relationship between diversity, risk and return, which limits its application in complex market environments. To solve this problem, this study introduces deep learning and knowledge graphs and proposes an intelligent asset allocation model. Our model makes full use of the advantages of the Knowledge Graph Embedding Model (KGE), LSTM, and Genetic Algorithm (GA) to build a multi-level and multi-dimensional asset allocation model. KGE helps capture the complex relationships between different assets, LSTM is used to learn key patterns of historical portfolio performance, and GA finds the optimal asset allocation combination by simulating natural selection and genetic mechanisms. Experimental findings indicate that our model has demonstrated substantial improvements across various performance metrics and outperforms conventional approaches.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "deep learning",
    "cache_key": "ef1b4a834b38b4f043cc95d1a93696fe",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "neural network",
      "long short-term memory",
      "LSTM",
      "representation learning"
    ],
    "stage1_timestamp": "2025-05-15T01:36:59.728772"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是使用深度学习和知识图谱构建智能资产配置模型，旨在优化资产组合的多样性和风险回报关系，这直接属于投资组合管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是使用深度学习和知识图谱构建智能资产配置模型，旨在优化资产组合的多样性和风险回报关系，这直接属于投资组合管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T14:24:01.669658"
}