{
  "paper": {
    "id": 8232,
    "title": "Estimating concrete chloride diffusion using an enhanced arithmetic optimization-based fuzzy system",
    "abstract": "The corrosion of steel reinforcement in concrete structures due to chloride exposure poses significant financial and environmental risks. An accurate assessment of chloride diffusion is essential for predicting the service life of steel-reinforced concrete. This article develops six models for estimating the chloride diffusion coefficient (CDC) in concrete, considering various exposure conditions like tidal, splash, atmospheric, and submerged environments. The models utilize a hybrid approach combining the adaptive neuro-fuzzy inference system (ANFIS) and least square support vector regression (LSSVR), enhanced by an improved arithmetic optimization algorithm (IAA). The IAA merges the arithmetic optimization algorithm (AOA) with the Aquila optimizer (AO) to address AOA's limitations. The models undergo sensitivity analysis using the Fourier Amplitude Sensitivity Test (FAST), revealing that the curing mechanism (CM) is the most influential factor, with a sensitivity value of 0.993. The study demonstrates that LSSVR and ANFIS-based methods are highly effective in predicting CDC. Among them, the ANFIS combined with IAA outperforms others regarding reliability and accuracy, making it a superior choice for CDC estimation. This robust model could lead to better management and longevity of concrete structures exposed to chloride, mitigating potential risks. The main application of this research is to enhance the durability management and service life prediction of steel-reinforced concrete structures exposed to chloride-laden environments. Engineers and infrastructure managers can better assess the risk and timing of corrosion onset by accurately estimating the CDC, which is crucial for preventive maintenance and cost-effective design.",
    "year": 2025,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "43166d5dbebbc824a37da7434c75ab59",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "regression",
      "support vector machine",
      "SVM",
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T03:16:48.939134"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究混凝土中氯离子扩散系数的预测模型，以提高混凝土结构的耐久性和使用寿命管理。虽然涉及风险评估，但其应用领域属于土木工程和材料科学，而非金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究混凝土中氯离子扩散系数的预测模型，以提高混凝土结构的耐久性和使用寿命管理。虽然涉及风险评估，但其应用领域属于土木工程和材料科学，而非金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:25:37.716029"
}