{
  "paper": {
    "id": 3802,
    "title": "Bayesian component selection in multi-response hierarchical structured additive models with an application to clinical workload prediction in patient-centered medical homes",
    "abstract": "Motivated by a large health care data obtained from the U.S. Veterans Health Administration (VHA), we develop a multivariate version of hierarchical structured additive regression (STAR) models that involves a set of health care responses defined at the lowest level of the hierarchy, a set of patient factors to account for individual heterogeneity, and a set of higher level effects to capture dependence between patients within the same medical home team and facility. We show how a special class of such models can equivalently be represented and estimated in structural equation modeling framework. We then propose a Bayesian component selection with a spike and slab prior structure that allows inclusion or exclusion single effects as well as grouped coefficients representing particular model terms. A simple parameter expansion is used to improve mixing and convergence properties of Markov chain Monte Carlo simulation. The proposed methods are applied to a real-world application of the VHA patient centered medical home (PCMH) data and help to provide a good prediction of clinical workload portfolio for a certain mix of health care professionals based on patient key demographic, diagnostic, and medical attributes.",
    "year": 2015,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "bc7deab50750a4aca3cddba09a7cbc79",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:21:08.197255"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是医疗保健领域中的临床工作量预测，使用了贝叶斯组件选择和结构化加性回归模型，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是医疗保健领域中的临床工作量预测，使用了贝叶斯组件选择和结构化加性回归模型，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:08:48.764021"
}