{
  "paper": {
    "id": 7983,
    "title": "Construction and validation of a nomogram prediction model for the catheter-related thrombosis risk of central venous access devices in patients with cancer: a prospective machine learning study",
    "abstract": "Central venous access devices (CVADs) are integral to cancer treatment. However, catheter-related thrombosis (CRT) poses a considerable risk to patient safety. It interrupts treatment; delays therapy; prolongs hospitalisation; and increases the physical, psychological and financial burden of patients. Our study aims to construct and validate a predictive model for CRT risk in patients with cancer. It offers the possibility to identify independent risk factors for CRT and prevent CRT in patients with cancer. We prospectively followed patients with cancer and CVAD at Xiangya Hospital of Central South University from January 2021 to December 2022 until catheter removal. Patients with CRT who met the criteria were taken as the case group. Two patients with cancer but without CRT diagnosed in the same month that a patient with cancer and CRT was diagnosed were selected by using a random number table to form a control group. Data from patients with CVAD placement in Qinghai University Affiliated Hospital and Hainan Provincial People's Hospital (January 2023 to June 2023) were used for the external validation of the optimal model. The incidence rate of CRT in patients with cancer was 5.02% (539/10 736). Amongst different malignant tumour types, head and neck (9.66%), haematological (6.97%) and respiratory (6.58%) tumours had the highest risks. Amongst catheter types, haemodialysis (13.91%), central venous (8.39%) and peripherally inserted central (4.68%) catheters were associated with the highest risks. A total of 500 patients with CRT and 1000 without CRT participated in model construction and were randomly assigned to the training (n = 1050) or testing (n = 450) groups. We identified 11 independent risk factors, including age, catheterisation method, catheter valve, catheter material, infection, insertion history, D-dimer concentration, operation history, anaemia, diabetes and targeted drugs. The logistic regression model had the best discriminative ability amongst the three models. It had an area under the curve (AUC) of 0.868 (0.846-0.890) for the training group. The external validation AUC was 0.708 (0.618-0.797). The calibration curve of the nomogram model was consistent with the ideal curve. Moreover, the Hosmer-Lemeshow test showed a good fit (P > 0.05) and high net benefit value for the clinical decision curve. The nomogram model constructed in this study can predict the risk of CRT in patients with cancer. It can help in the early identification and screening of patients at high risk of cancer CRT.",
    "year": 2025,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "b3600bfe7a06e74f222fa6f4cd2d4265",
    "relevant_keywords": [
      "machine learning",
      "classification",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T03:14:07.206430"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是医疗领域中癌症患者导管相关血栓形成的风险预测模型，使用了机器学习技术进行分类和回归分析。虽然涉及风险预测，但其应用场景是医疗健康领域，而非金融领域中的衍生品定价、金融风险管理或投资组合管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是医疗领域中癌症患者导管相关血栓形成的风险预测模型，使用了机器学习技术进行分类和回归分析。虽然涉及风险预测，但其应用场景是医疗健康领域，而非金融领域中的衍生品定价、金融风险管理或投资组合管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:25:54.690088"
}