{
  "paper": {
    "id": 1049,
    "title": "Gamification of Project Business Studies",
    "abstract": "During recent years, gamification of education has received increased attention and interest. Although critics argue that gamification derails the focus of learning and increases stress and competition, most scholars see that benefits outweigh the risks. They believe that gamification increases student engagement and reinforces their problem-solving skills, collaboration, and communication. In this paper, gamification is applied to skills required in the management of the company's project business. In project business, the focus is not on individual projects, but on the organization's project portfolio. The project portfolio refers to the company's simultaneous projects and project opportunities that have common strategic goals and that are competing for the same resources. In the empirical part of the study, post-graduate students' feedback on the project portfolio management (PPM) exercise was investigated using both manual and machine learning-based content and sentiment analysis. The results of the experiment indicate that student sentiment toward the PPM workshop was positive and that gamification seems to be a good method of learning project business skills, especially in the creation of the management and decision-making system and in managing a diverse project portfolio.",
    "year": 2022,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "4d7294bb469c46e776ca9ca26163130f",
    "relevant_keywords": [
      "machine learning"
    ],
    "stage1_timestamp": "2025-05-15T00:51:25.841758"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是通过游戏化方法教授项目管理技能，特别是项目组合管理（PPM），这与金融领域的投资组合管理（Portfolio Management）虽然名称相似，但应用场景和目的完全不同。论文的核心技术是游戏化教育和机器学习的情感分析，并未涉及金融领域的任何具体应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是通过游戏化方法教授项目管理技能，特别是项目组合管理（PPM），这与金融领域的投资组合管理（Portfolio Management）虽然名称相似，但应用场景和目的完全不同。论文的核心技术是游戏化教育和机器学习的情感分析，并未涉及金融领域的任何具体应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:25:13.119265"
}