{
  "paper": {
    "id": 3861,
    "title": "Genetic Algorithm-based Feature Selectionmethod for Credit Risk Analysis",
    "abstract": "Credit risk assessment of financial intermediaries is an important problem in finance. The key is to find accurate predictors of individual risk in the credit portfolios of institutions. However, accessing credit risk is very challenging as many factors may contribute to the risk and their relationship is complicated to capture. Recentyears have witnessed a growing trend in applying statistical and machinelearning modeling methods such as SVMclassifier, for credit risk analysis, which is effective in capturing nonlinear relationshipin the data. However, high dimensional training data not only results in time-consuming computation but also affects the performance of the classifier. In this paper, wepropose a wrapper feature selection method based on genetic algorithm to select a subset of essential featuresthat will contribute to good performance in the credit risk classification. We test ourmethod in a real-world credit risk predictiontask, and our empirical results demonstrate the advantage ofour method over other competing ones.",
    "year": 2012,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "554c50fd26ad105905ff1384d4f06d39",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM",
      "feature learning"
    ],
    "stage1_timestamp": "2025-05-15T02:30:28.822517"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on credit risk assessment, which is a key aspect of financial risk management. The proposed genetic algorithm-based feature selection method is specifically designed to improve the accuracy of credit risk classification, directly addressing challenges in risk evaluation for financial intermediaries.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on credit risk assessment, which is a key aspect of financial risk management. The proposed genetic algorithm-based feature selection method is specifically designed to improve the accuracy of credit risk classification, directly addressing challenges in risk evaluation for financial intermediaries.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:35:06.712018"
}