{
  "paper": {
    "id": 7,
    "title": "Construction of Cross-Border e-Commerce Financial Risk Analysis System Based on Support Vector Machine",
    "abstract": "The rapid changes in the economic situation and the complex market environment make the cross-border e-commerce industry, as an important part of the market economy, face many challenges and risks in the development process. The particularity of its transaction and the imperfect tax mechanism have virtually increased the financial management risk. The research constructs the financial risk analysis model with the help of the support vector machine (SVM) and fuzzy theory. Through algorithm test and empirical research, it is found that the average accuracy of the optimized SVM on the selected data set is more than 90%, and after parameter optimization, the change of model fitness tends to be stable with the increase of iteration times, which greatly improves the search ability of sample data, and the accuracy of financial data classification with high risk is 46.8%. In the empirical research, the model established by fuzzy SVM can effectively eliminate the irrelevant index data, and the prediction accuracy of investment risk and operation risk has reached 80% or more. In the prediction of financing risk and tax risk, its accuracy has been improved by 12.4% compared to that before use.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "f9eda35d54f831372d44cc19113668fc",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM"
    ],
    "stage1_timestamp": "2025-05-15T01:45:16.453457"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要研究基于支持向量机（SVM）和模糊理论的金融风险分析模型，用于预测和管理跨境电子商务中的投资风险、运营风险、融资风险和税务风险，这明显属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文主要研究基于支持向量机（SVM）和模糊理论的金融风险分析模型，用于预测和管理跨境电子商务中的投资风险、运营风险、融资风险和税务风险，这明显属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:01:36.242480"
}