{
  "paper": {
    "id": 3372,
    "title": "Consumer Choice Prediction: Artificial Neural Networks versus Logistic Model",
    "abstract": "Quantitative analysis for forecasting in business and marketing, especially in consumer behaviour and consumer decision-making process (consumer choice modelling), has become more poplar in business practices. The ability to understand and to accurately predict the consumer decision can lead to more effectively target the products (and/or services), cost effectiveness in marketing strategies, increasing in sale and result in substantial improvement in the overall profitability of the firm. Conventional econometric models, such as discriminant analysis and logistic regression have been used to predict consumer choices. However, in recent years, there has been a growing interest in applying artificial neural networks (ANN) to analyse consumer behaviour and to model the consumer decision-making process. Neural networks are considered as a field of artificial intelligence. The development of the models was inspired by the neural architecture of human brain. Neural networks have been generally applied to two different categories of problems recognition problems and generalisation problems. Recognition problems include visual applications such as learning to recognize particular words and speak them. Generalization problems include classification and prediction problems. ANN have been applied in many disciplines, including biology, psychology, statistics, mathematics, medical science, and computer science. Recently ANNs have been applied to a variety of business areas such as accounting, finance, management and decision making, marketing, and production. However, the technique has been sparsely used in modelling consumer choices. For example, Dasgupta et al. (1994) compared the performance of discriminant analysis and logistic regression models against an ANN model with respect to their ability to identify consumer segment based upon their willingness to take financial risks and to purchase a non-traditional investment product. The purpose of this paper is to empirically compare the predictive power of the probability neural network (PNN), a special class of neural networks, and the MLFN with the logistic model on consumers' banking choices between electronic banking and non-electronic banking. Data for this analysis was obtained through a mail survey sent to 1,960 household in New Zealand. The questionnaire gathered information on consumers' decision to use electronic banking versus non-electronic banking. The factors include service quality dimensions, perceived risk factors, user input factors, price factors, service product characteristics, and individual factors. In addition, demographic variables including age, gender, marital status, ethnic background, educational qualification, employment, income, and area of residence are considered. Empirical results showed that both ANN models (MLFN and PNN) exhibit a higher overall percentage correct on consumer choice predictions than the logistic model. Furthermore, the PNN demonstrates to be the best predictive model since it has the highest overall percentage correct and a very low percentage error on both Type I and Type II errors.",
    "year": 2005,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "c20ad3480f60fc67c9d49f4ab24d87f5",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "neural network",
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T02:25:40.093001"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究消费者选择预测，特别是电子银行与非电子银行之间的选择，虽然涉及金融产品，但其核心技术（人工神经网络和逻辑模型）主要用于市场营销和消费者行为分析，而非衍生品定价、金融风险管理或投资组合管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究消费者选择预测，特别是电子银行与非电子银行之间的选择，虽然涉及金融产品，但其核心技术（人工神经网络和逻辑模型）主要用于市场营销和消费者行为分析，而非衍生品定价、金融风险管理或投资组合管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:36:50.824620"
}