{
  "paper": {
    "id": 928,
    "title": "Deep learning application detecting SARS-CoV-2 key enzymes inhibitors",
    "abstract": "The fast spread of the COVID-19 over the world pressured scientists to find its cures. Especially, with the disastrous results, it engendered from human life losses to long-term impacts on infected people's health and the huge financial losses. In addition to the massive efforts made by researchers and medicals on finding safe, smart, fast, and efficient methods to accurately make an early diagnosis of the COVID-19. Some researchers focused on finding drugs to treat the disease and its symptoms, others worked on creating effective vaccines, while several concentrated on finding inhibitors for the key enzymes of the virus, to reduce its spreading and reproduction inside the human body. These enzymes' inhibitors are usually found in aliments, plants, fungi, or even in some drugs. Since these inhibitors slow and halt the replication of the virus in the human body, they can help fight it at an early stage saving the patient from death risk. Moreover, if the human body's immune system gets rid of the virus at the early stage it can be spared from the disastrous sequels it may leave inside the patient's body. Our research aims to find aliments and plants that are rich in these inhibitors. In this paper, we developed a deep learning application that is trained with various aliments, plants, and drugs to detect if a component contains SARS-CoV-2 key inhibitor(s) intending to help them find more sources containing these inhibitors. The application is trained to identify various sources rich in thirteen coronavirus-2 key inhibitors. The sources are currently just aliments, plants, and seeds and the identification is done by their names.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "deep learning",
    "cache_key": "6b5ad38e6bbef05b4d585c3714e080cf",
    "relevant_keywords": [
      "deep learning",
      "neural network",
      "classification"
    ],
    "stage1_timestamp": "2025-05-15T01:44:35.384720"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究使用深度学习技术检测SARS-CoV-2关键酶抑制剂，其应用领域为医学和生物信息学，与金融研究领域无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究使用深度学习技术检测SARS-CoV-2关键酶抑制剂，其应用领域为医学和生物信息学，与金融研究领域无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:01:59.782842"
}