{
  "paper": {
    "id": 294,
    "title": "Dynamic financial distress prediction with concept drift based on time weighting combined with Adaboost support vector machine ensemble",
    "abstract": "Dynamic financial distress prediction (DFDP) is important for improving corporate financial risk management. However, earlier studies ignore the time weight of samples when constructing ensemble FDP models. This study ptoposes two new DFDP approaches based on time weighting and Adaboost support vector machine (SVM) ensemble. One is the double expert voting ensemble based on Adaboost-SVM and Timeboost-SVM (DEVE-AT), which externally combines the outputs of an error-based decision expert and a time-based decision expert. The other is Adaboost SVM internally integrated with time weighting (ADASVM-TW), which uses a novel error-time-based sample weight updating function in the Adaboost iteration. These two approaches consider time weighting of samples in constructing Adaboost-based SVM ensemble, and they are more suitable for DFDP in case of financial distress concept drift. Empirical experiment is carried out with sample data of 932 Chinese listed companies' 7 financial ratios, and time moving process is simulated by dividing the sample data into 13 batches with one year as time step. Experimental results show that both DEVE-AT and ADASVM-TW have significantly better DFDP performance than single SVM, batch-based ensemble with local weighted scheme, Adaboost-SVM and Timeboost-SVM, and they are more suitable for disposing concept drift of financial distress. (C) 2016 Elsevier B.V. All rights reserved.",
    "year": 2017,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "dbfcd65dcfdb9355378c81e8a68c22d6",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM"
    ],
    "stage1_timestamp": "2025-05-15T01:49:04.644619"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on dynamic financial distress prediction (DFDP) for corporate financial risk management, which is a key aspect of financial risk management. The proposed methods aim to improve the prediction of financial distress, a critical component in assessing and managing financial risks for companies.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on dynamic financial distress prediction (DFDP) for corporate financial risk management, which is a key aspect of financial risk management. The proposed methods aim to improve the prediction of financial distress, a critical component in assessing and managing financial risks for companies.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:59:27.664587"
}