{
  "paper": {
    "id": 1771,
    "title": "How Green Credit Policy Affects Commercial Banks' Credit Risk? Evidence and Federated Learning-Based Modeling From 26 Listed Commercial Banks in China",
    "abstract": "The green credit policy has significantly influenced the growth of green industries in China. This study evaluates its impact on reducing bank credit risk using data from 26 Chinese banks from 2015 to 2021. The authors discovered that the policy's primary effect is linked to banks' financial leverage. Notably, green credit's influence on insolvency risk is most evident in leverage risk. However, despite governmental support for green credit collaboration, prevalent information gaps between banks and green enterprises lead to misjudgments and subsequent credit losses. To address the balance between credit risk mitigation and privacy, the authors investigated vertical joint learning for a precise risk control model grounded in commercial banks' practices. Experiments revealed that this joint model outperforms the sole bank internal model in presenting green credit data, underscoring the potential of machine learning to refine green credit systems and bolster banks' credit risk management.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "8bbf92ed482800bed92dfb0eb7e19eff",
    "relevant_keywords": [
      "machine learning",
      "neural network",
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T02:07:25.672317"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心研究内容是评估绿色信贷政策对商业银行信用风险的影响，并利用联合学习技术构建风险控制模型，这直接涉及信用风险管理的领域。论文的主要目标是优化银行的信用风险管理，而非衍生品定价或投资组合管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"该论文的核心研究内容是评估绿色信贷政策对商业银行信用风险的影响，并利用联合学习技术构建风险控制模型，这直接涉及信用风险管理的领域。论文的主要目标是优化银行的信用风险管理，而非衍生品定价或投资组合管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:46:35.406054"
}