{
  "paper": {
    "id": 1616,
    "title": "Expert system design for credit risk evaluation using neuro-fuzzy logic",
    "abstract": "Over the past few years, the credit risk evaluation of micro-, small- and medium-scale enterprises by banks and financial institutions has been an active area of research under the joint pressure of regulators and shareholders. The credit rating assessment forms an important part of credit risk assessment, involving risk parameters such as financial, business, industry and management areas. The mathematical models of evaluation are at the core of modern credit risk management systems. This paper focuses on the use of fuzzy logic and neural network techniques to design a methodology for evaluating the credit worthiness of the entrepreneur. The neuro-fuzzy logic approach takes into account the minute details of credit rating expert's thought process to arrive at the final decision. A flexible credit rating framework (CRF) has been designed to organize all the facts of the client in a hierarchical fashion. The neural networks provide self-learning capability to the CRF. The CRF can be customized to suit different business and industrial interests.",
    "year": 2012,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "6b0b84ce6319defc5e2fc494a04c8d53",
    "relevant_keywords": [
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T02:05:42.473195"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on designing an expert system for credit risk evaluation using neuro-fuzzy logic, which is a core aspect of financial risk management, specifically in assessing and managing credit risk for enterprises.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on designing an expert system for credit risk evaluation using neuro-fuzzy logic, which is a core aspect of financial risk management, specifically in assessing and managing credit risk for enterprises.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:47:54.318627"
}