{
  "paper": {
    "id": 992,
    "title": "Can board diversity predict the risk of financial distress?",
    "abstract": "Purpose The purpose of this study is to explore whether different board diversity attributes (corporate governance aspect) can be used to predict financial distress. This study also aims to identify what type of prediction models are more applicable to capture board diversity along with conventional predictors. Design/methodology/approach This study used Chinese A-listed companies during 2007-2016. Board diversity dimensions of gender, age, education, expertise and independence are categorized into three broad categories; relation-oriented diversity (age and gender), task-oriented diversity (expertise and education) and structural diversity (independence). The data is divided into test and validation sets. Six statistical and machine learning models that included logistic regression, dynamic hazard, K-nearest neighbor, random forest (RF), bagging and boosting were compared on Type I errors, Type II errors, accuracy and area under the curve. Findings The results indicate that board diversity attributes can significantly predict the financial distress of firms. Overall, the machine learning models perform better and the best model in terms of Type I error and accuracy is RF. Practical implications This study not only highlights symptoms but also causes of financial distress, which are deeply rooted in weak corporate governance. The result of the study can be used in future credit risk assessment by incorporating board diversity attributes. The study has implications for academicians, practitioners and nomination committees. Originality/value To the best of the authors' knowledge, this study is the first to comprehensively investigate how different attributes of diversity can predict financial distress in Chinese firms. Further, this study also explores, which financial distress prediction models can show better predictive power.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "23c538c715346b6c74c50c3483af06b2",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T01:57:29.912470"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心研究内容是使用机器学习模型预测企业的财务困境，这直接关联到信用风险评估，属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心研究内容是使用机器学习模型预测企业的财务困境，这直接关联到信用风险评估，属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T14:23:36.436655"
}