{
  "paper": {
    "id": 1322,
    "title": "An Algorithm for Supporting Decision Making in Stock Investment through Opinion Mining and Machine Learning",
    "abstract": "This paper suggests an algorithm for supporting decision making in stock investment through opinion mining and machine learning. Within the framework of supporting decision making, this research deals with (1) fake information filtering to accurate foresight, (2) credit risk assessment, and (3) prediction based on critical signal detection. At first, financial data including news, SNS, the financial statements is collected and then, among them, fake information such as rumors and fake news is refined by author analysis and the rule-based approach. Second, the credit risk is assessed by opinion mining and sentiment analysis for both social data and news in the form of sentimental score and trend of documents for each stock. Third, a risk signal in stock investment is detected in accordance with the credit risk derived from opinion mining and financial risk identified by the financial database. Consequently, the possibility of credit events such as delisting and bankruptcy will be forecast in the near future based on the risk signal. The proposed algorithm helps investors to monitor relevant information objectively through fake information filtering as well as to make correct judgments in stock investment.",
    "year": 2018,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "a3586c0ae00a4ca999f66647930af9ab",
    "relevant_keywords": [
      "machine learning",
      "classification",
      "sentiment analysis"
    ],
    "stage1_timestamp": "2025-05-15T02:01:44.700799"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是通过意见挖掘和机器学习来支持股票投资决策，特别是通过情感分析和信用风险评估来预测信用事件（如退市和破产），这属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是通过意见挖掘和机器学习来支持股票投资决策，特别是通过情感分析和信用风险评估来预测信用事件（如退市和破产），这属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:49:49.330632"
}