{
  "paper": {
    "id": 5214,
    "title": "Credit Fraud Detection Based on Hybrid Credit Scoring Model",
    "abstract": "Credit risk rating can be described by several economic activity indicators. Utilizing these financial movement markers to build a tenable credit scoring model will enormously improve the precision of the model. This method can be used in a series of credit evaluations and specific economic conditions. A reasonable scenario in which the uncertainty is consistent. In this paper, the logistic regression algorithm is joined with weighted evidence to fabricate another credit score model. Through the relationship existing in economic activities, the connection of each economic movement is additionally dissected by utilizing the correlation orthogonal transformation in the weight of proof to improve the exactness of the model. In practice, due to numerous weaknesses in the records, there is significant error in the logistic regression. Hence, building of hybrid scoring model can increase the accurateness of credit score. Thus improved the prediction rate of user credit scores and reducing the occurrence of credit fraud. (C) 2020 The Authors. Published by Elsevier B.V.",
    "year": 2020,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "9082fed3247585d3be7b3bacdf8b86b7",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "regression",
      "logistic regression"
    ],
    "stage1_timestamp": "2025-05-15T02:45:47.311724"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是构建混合信用评分模型以提高信用评分的准确性，并减少信用欺诈的发生。这直接涉及信用风险的评估和管理，属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是构建混合信用评分模型以提高信用评分的准确性，并减少信用欺诈的发生。这直接涉及信用风险的评估和管理，属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:31:06.955774"
}