{
  "paper": {
    "id": 1038,
    "title": "Credit Risk Evaluation Based on Data Mining and Integrated Feature Selection",
    "abstract": "Credit risk assessment is an important process for every financial institution. Most current studies in this area focus on the development of the classifiers. However, besides the classifiers, data analysis and mining also play an important role in improving the accuracy. In this paper, an integrated feature selection method is proposed combing the analysis of the data in one feature but belongs to different labels and the analysis of the relationship between a single feature and labels. Back propagation neural network is used as the classification model. Experiments are done on Australian credit approval dataset. The results show that the proposed integrated feature selection can improve the accuracy of assessment compared with other previous work.",
    "year": 2020,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "61e5f9d18d7e9f1e67505ae749cccb03",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "neural network",
      "backpropagation",
      "BP"
    ],
    "stage1_timestamp": "2025-05-15T01:58:08.517898"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on credit risk assessment using data mining and feature selection techniques, which is a key aspect of financial risk management, specifically in evaluating the likelihood of default by borrowers.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on credit risk assessment using data mining and feature selection techniques, which is a key aspect of financial risk management, specifically in evaluating the likelihood of default by borrowers.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:52:22.381389"
}