{
  "paper": {
    "id": 6324,
    "title": "The Use of Multilayer Perceptron Artificial Neural Networks to Detect Dairy Cows at Risk of Ketosis",
    "abstract": "Simple Summary Ketosis is a serious metabolic disease in high-yield dairy cows, that affects productive herds throughout the world. Subclinical ketosis is one of the most dominant metabolic disorders in dairy herds during early lactation, so early detection and prevention are important for both economic and animal welfare reasons. Neural networks, which offer a high degree of accuracy in predicting various phenomena and processes where there is no clear causal correlation or there are no rules that allow the establishment of a logical cause-and-effect relationship, can be used to address problems related to prediction, classification, or control. A Multi-Layer perceptron (MLP) is a feedforward artificial neural network model that takes input data for a set of proper output. This study investigated the performance of four algorithms used to train MLP networks. The experimental results demonstrate that the MLP network model improved the accuracy of process recognition of subclinical ketosis in dairy cows. The received artificial model's results were saved in the predictive model markup language (PMML) and can be used to describe the learning set, the algorithm used in the data mining application and related information. Subclinical ketosis is one of the most dominant metabolic disorders in dairy herds during lactation. Cows suffering from ketosis experience elevated ketone body levels in blood and milk, including beta-hydroxybutyric acid (BHB), acetone (ACE) and acetoacetic acid. Ketosis causes serious financial losses to dairy cattle breeders and milk producers due to the costs of diagnosis and management as well as animal welfare reasons. Recent years have seen a growing interest in the use of artificial neural networks (ANNs) in various fields of science. ANNs offer a modeling method that enables the mapping of highly complex functional relationships. The purpose of this study was to determine the relationship between milk composition and blood BHB levels associated with subclinical ketosis in dairy cows, using feedforward multilayer perceptron (MLP) artificial neural networks. The results were verified based on the estimated sensitivity and specificity of selected network models, an optimum cut-off point was identified for the receiver operating characteristic (ROC) curve and the area under the ROC curve (AUC). The study demonstrated that BHB, ACE and lactose (LAC) levels, as well as the fat-to-protein ratio in milk, were important input variables in the network training process. For the identification of cows at risk of subclinical ketosis, variables such as BHB and ACE levels in milk were of particular relevance, with a sensitivity and specificity of 0.84 and 0.61, respectively. It was found that the back propagation algorithm offers opportunities to integrate artificial intelligence and dairy cattle welfare within a computerized decision support tool.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "c36b064277e521ca18ef709fd8b31988",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "neural network",
      "deep learning",
      "backpropagation",
      "BP",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T02:57:07.673737"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究使用多层感知器人工神经网络检测奶牛酮症风险，其应用领域为农业和动物健康管理，与金融领域无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究使用多层感知器人工神经网络检测奶牛酮症风险，其应用领域为农业和动物健康管理，与金融领域无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:27:54.999903"
}