{
  "paper": {
    "id": 2089,
    "title": "A statistical Time-Of-Use tariff based wind resource clustering approach using Self-Organizing Maps",
    "abstract": "The optimized siting of grid-scale renewable generation is a viable technique to minimize the variable component of the electricity generation portfolio. This process, however, requires simulated meteorological datasets, and consequently, significant computational power to perform detailed studies. This is particularly true for countries with large geographic areas. Clustering is a viable data reduction technique that can be utilized to reduce the computational burden. This work proposes the use of Self-Organizing Maps to partition high-dimensional wind speed data using statistical features derived from Time-Of-Use tariff periods. This approach is undertaken with the view towards the optimization of wind farm siting for grid-support objectives where tariff incentivization is the main driver. The proposed approach is compared with clusters derived using Self-Organizing Maps with the temporal wind speed data for the input feature set. The results show increased cluster granularity, superior validation results and decreased execution time when compared with the temporal clustering approach.",
    "year": 2021,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "090350af19b8e3f8e9fc859ed1bbc1f7",
    "relevant_keywords": [
      "unsupervised learning",
      "clustering",
      "neural network",
      "Self-Organizing Maps"
    ],
    "stage1_timestamp": "2025-05-15T01:02:32.977725"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究使用自组织映射（Self-Organizing Maps）对风速数据进行聚类，以优化风力发电场的选址，其核心应用领域是可再生能源和电网支持，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究使用自组织映射（Self-Organizing Maps）对风速数据进行聚类，以优化风力发电场的选址，其核心应用领域是可再生能源和电网支持，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:17:20.150222"
}