{
  "paper": {
    "id": 5549,
    "title": "Can pecuniary and environmental incentives via SMS messaging make households adjust their electricity demand to a fluctuating production?",
    "abstract": "The increasing deployment of renewables introduces substantial variability into the production of electricity, requiring demand to be more movable across time. We analyze data from a large Danish field experiment (2015-2016) to investigate whether households can be prompted, via SMS messages, to move electricity consumption, and if so, whether these are motivated by pecuniary or environmental motives. The analysis has two steps: As a novel approach, we first use automatic model selection, which allows a different time series regression for each of the 1488 households studied. From this, we obtain a cross-section of estimated SMS effects, which we then regress on the motive type. Since households can opt out there is a risk of self-selection. We therefore control for the size, income and average consumption of the household, and the age, educational- and labor market status of the SMS recipient. The results suggest that SMS messages can to some extent motivate households to move consumption. Although a stronger financial motive seems more effective, mixing financial and environmental motives seems the most effective. Finally, women and elderly people are more inclined to move consumption. (C) 2019 Elsevier B.V. All rights reserved.",
    "year": 2019,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "04eeb03a683ffab62bec2310d55d4abf",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:48:51.363844"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究通过短信激励家庭调整电力消费行为，涉及的是能源经济学和行为经济学领域，并未提及或应用于衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究通过短信激励家庭调整电力消费行为，涉及的是能源经济学和行为经济学领域，并未提及或应用于衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:30:03.077707"
}