{
  "paper": {
    "id": 2981,
    "title": "A novel hybrid simplified group BWM and multi-criteria sorting approach for stock portfolio selection",
    "abstract": "Many real-life issues can be modeled as multi-criteria sorting problems. In this type of problem, a set of options are assigned to predefined classes. This research aims to propose a new hybrid approach including simplified group best-worst and multi-criteria sorting methods to classify options considering decision-maker constraints. It is crucial to consider such constraints, and ignoring them can make the results ineffective for the decision-maker. The method developed in this study for weighting the criteria can be considered the most unmixed group best-worst method ever proposed, as no optimization model and specialized software are needed to solve it. In this research, a multi-criteria sorting method is also suggested. The developed method compares alternatives with limiting profiles and then classifies alternatives based on their distance from the limiting profiles. This method can consider investor preferences, such as the number of alternatives in categories or the maximum number of stocks allowed from each industry in the stock portfolio. The proposed approach is used in a real case study of stock portfolio selection in the Tehran Stock Exchange. The results of the methods proposed in this study were compared with the results of the previous methods using numerical examples and a real case study. The results show that the developed methods are valid and accurate. The suggested approach helps managers to include their constraints in the decision-making process and can be applied to real-world problems with a classification nature.",
    "year": 2023,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "a83fae3635b20384d282432ed74260b7",
    "relevant_keywords": [
      "classification"
    ],
    "stage1_timestamp": "2025-05-15T01:12:09.240460"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文提出了一种新的混合方法，用于股票投资组合的选择，并应用于德黑兰证券交易所的实际案例中。这直接涉及投资组合管理的核心问题，即如何选择和分类股票以构建投资组合。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文提出了一种新的混合方法，用于股票投资组合的选择，并应用于德黑兰证券交易所的实际案例中。这直接涉及投资组合管理的核心问题，即如何选择和分类股票以构建投资组合。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:11:58.013228"
}