{
  "paper": {
    "id": 784,
    "title": "Research on Comparison of Credit Risk Evaluation Models Based on SOM and LVQ Neural Network",
    "abstract": "In this paper, we have established and compared two credit risk evaluation models based on Self-Organizing Feature Map neural network and Learning Vector Quantization respectively. The models are used to identify two patterns samples of Chinese listed companies, including training samples of 285 listed companies (59 companies with special treatment and 226 normal companies) and test samples of 117 listed companies(29 companies with special treatment and 88 normal companies). The two patterns indicate that the listed companies are divided into two groups in terms of their business conditions: credit default group (ST and *ST listed companies) and credit non-default group (normal listed companies). 4 main financial indexes are considered: earning per share, net asset per share, return on equity, cash flow per share. The simulating results showed that, after 20 training steps, SOM neural network enters into a steady state and the overall discriminant accuracy rate is 99.75%. The LVQ neural network, but nevertheless, becomes steady after 300 training epochs and the overall discriminant accuracy rate is 92.79%. Therefore this indicates that the credit risk evaluation model based on self-Organizing Feature Map neural network we established is better than the one based on Learning Vector Quantization neural network. The SOM neural network model is able to result in good classification and has research value to the reality.",
    "year": 2008,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "5d1e016189325a08e2b7e37243679eec",
    "relevant_keywords": [
      "machine learning",
      "unsupervised learning",
      "classification",
      "neural network",
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T01:55:08.014325"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是建立和比较两种基于神经网络的信用风险评估模型，用于识别中国上市公司的信用违约风险。这直接涉及金融风险管理中的信用风险分析，旨在通过机器学习方法提高信用风险分类的准确性。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"该论文的核心技术是建立和比较两种基于神经网络的信用风险评估模型，用于识别中国上市公司的信用违约风险。这直接涉及金融风险管理中的信用风险分析，旨在通过机器学习方法提高信用风险分类的准确性。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:54:40.696391"
}