{
  "paper": {
    "id": 3038,
    "title": "Effectiveness of a Negotiation Simulation Game in IB Learning",
    "abstract": "This study describes a foreign investment negotiation simulation game and evaluates its effectiveness on the teaching and learning of international business. The game involves the application of the major topics of an introductory international business course to a setting that is dose to the real world, thus allows students to explore the association between theory and practice. By quantitative and qualitative analysis on the primary data collected from both face-to-face and online classes at the same time, the study finds strong evidence that the negotiation simulation game significantly improves students learning in both class settings, and the poor performers benefit the most from the simulation game. Evidence also shows that the simulation game is more effective in enhancing students learning in the traditional face-to-face class than the online class, indicating class settings matter. The findings suggest higher-level learning requires deep engagement of students, and student-centered active teaming strategies like the negotiation simulation game can effectively engage all students, including those who are difficult to engage with other traditional pedagogical methods. Therefore, the simulation game can be an important addition to the teaching portfolio to accommodate students with different learning styles. Moreover, the game offers an experiential learning opportunity that improves both the cognitive and affective experiences of students learning, and provides hands-on experience of business negotiations. Professors, especially those who are searching for an active learning tool for teaching international business online could benefit from this study.",
    "year": 2020,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "722a32a1fffa38a14179b8d6d3c84362",
    "relevant_keywords": [
      "active learning"
    ],
    "stage1_timestamp": "2025-05-15T01:12:43.150561"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是国际商务教学中的谈判模拟游戏的有效性，属于教育技术领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是国际商务教学中的谈判模拟游戏的有效性，属于教育技术领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:11:33.218383"
}