{
  "paper": {
    "id": 2145,
    "title": "A Distributed Algorithm for the Cooperative Prediction of Power Production in PV Plants",
    "abstract": "Forecasting the energy production of photovoltaic plants is today an essential tool for asset owners because it has direct economic implications on the net operating income of the plants whose generated energy is sold in competitive electricity markets. In this paper, we propose an innovative distributed decentralized prediction technique for the forecasting of power generated by several PV plants. The prediction technique is based on the Echo State Networks, which are recurrent neural network models very promising in terms of prediction performance and model accuracy. They will be used in conjunction with a distributed learning algorithm and a distributed consensus protocol that makes unnecessary any central coordinator. The technique has been properly conceived for asset owners that hold a wide portfolio of PV systems that are geographically spread out over large areas. The algorithm reveals very efficient, accurate, and scalable performance to any number of plants and it requires only a simple reliable communication channel. Through a real-world example we assess the applicability of such methodology and show its strength.",
    "year": 2019,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "494894da246f5233bb7cc32ab066bc41",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "neural network",
      "recurrent neural network",
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T01:03:36.613547"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究分布式算法用于光伏电站的能源生产预测，虽然涉及资产所有者，但其核心技术应用于能源市场预测而非特定的金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究分布式算法用于光伏电站的能源生产预测，虽然涉及资产所有者，但其核心技术应用于能源市场预测而非特定的金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:17:15.572689"
}