{
  "paper": {
    "id": 5044,
    "title": "Testing the relation between beta and returns in the Athens stock exchange",
    "abstract": "Purpose - The purpose of this paper is to examine the relationship between beta and returns in the Athens stock exchange (ASE), taking into account the difference between positive and negative market excess returns' yields. Design/methodology/approach - The data were taken from DataStream database and the sample period consists of 12 years divided into four six-year periods such that the test periods do not overlap. Regression analysis is applied, using both the traditional (unconditional) test procedure and the conditional approach. Findings - The estimation of return and beta without differentiating positive and negative market excess returns produces a flat unconditional relationship between return and beta. However, when using the conditional capital asset pricing model (CAPM) and cross-sectional regression analysis, the evidence tends to support the significant positive relationship in up market and a significant negative relationship in down market. Research limitations/implications - The small number of listed companies in the ASE led to the inclusion of the financial and insurance companies in the sample, and to the formation of a small number of portfolios. The same research methodology could be applied to individual stocks of the ASE and with the exclusion of all financial companies. Originality/value - The results tend to support the existence of a conditional CAPM relation between risk and realized return trade-off.",
    "year": 2010,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "3301ea6f5c2430891586f58efb2b2bb7",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:43:40.221063"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文研究了beta与回报之间的关系，并应用了条件资本资产定价模型（CAPM）和横截面回归分析，这些技术主要用于投资组合管理中的风险与回报权衡分析。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文研究了beta与回报之间的关系，并应用了条件资本资产定价模型（CAPM）和横截面回归分析，这些技术主要用于投资组合管理中的风险与回报权衡分析。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:31:30.285930"
}