{
  "paper": {
    "id": 1133,
    "title": "Machine Learning in Financial Crisis Prediction: A Survey",
    "abstract": "For financial institutions, the ability to predict or forecast business failures is crucial, as incorrect decisions can have direct financial consequences. Bankruptcy prediction and credit scoring are the two major research problems in the accounting and finance domain. In the literature, a number of models have been developed to predict whether borrowers are in danger of bankruptcy and whether they should be considered a good or bad credit risk. Since the 1990s, machine-learning techniques, such as neural networks and decision trees, have been studied extensively as tools for bankruptcy prediction and credit score modeling. This paper reviews 130 related journal papers from the period between 1995 and 2010, focusing on the development of state-of-the-art machine-learning techniques, including hybrid and ensemble classifiers. Related studies are compared in terms of classifier design, datasets, baselines, and other experimental factors. This paper presents the current achievements and limitations associated with the development of bankruptcy-prediction and credit-scoring models employing machine learning. We also provide suggestions for future research.",
    "year": 2012,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "0d5a7c6288f6036d16ce3ddba72f014c",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM",
      "decision tree",
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T01:59:21.615362"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要讨论了使用机器学习技术进行破产预测和信用评分，这些应用直接关联到金融机构的风险评估和管理，属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"该论文主要讨论了使用机器学习技术进行破产预测和信用评分，这些应用直接关联到金融机构的风险评估和管理，属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:51:57.985503"
}