{
  "paper": {
    "id": 4672,
    "title": "Investors' attention and overpricing of IPO: an empirical study on China's growth enterprise market",
    "abstract": "In China, the Growth Enterprise Market (GEM) is a brand new market that provides an additional way of financing for firms with good growth potential. Whereas there has been a massive amount of stocks breaking on the first trading day since 2010, the risk of IPO's overpricing in China's GEM has drawn more and more attention in recent years. Based on the theory of behavioral finance and limited attention, investors' attention may be a quite indicative determinant to the IPO overpricing. Accordingly, we collected data from Internet including online stock forums and search engines, then built multiple investors' attention metrics that were distinct to the traditional metrics from the offline stock market. In the empirical study, we built regression models to dig out the determinants of IPO's overpricing and found that the hybrid model containing both online metrics and financial metrics outperformed the others considerably. The adjusted R-square of the hybrid model containing both online metrics and financial metrics is as high as 82.8%, in contrast to 18.2% for the model containing only the financial metrics and 59.3% for that containing only investors' attention.",
    "year": 2018,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "7e4a797c79cbb3ff8a82648643ecc417",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:39:57.423607"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究投资者注意力对IPO定价过高的影响，属于行为金融学的范畴，并未直接涉及衍生品定价、金融风险管理或投资组合管理等特定金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究投资者注意力对IPO定价过高的影响，属于行为金融学的范畴，并未直接涉及衍生品定价、金融风险管理或投资组合管理等特定金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:32:20.687091"
}