{
  "paper": {
    "id": 1517,
    "title": "Fourteen-Year Outcome of Angle-Closure Prevention with Laser Iridotomy in the Zhongshan Angle-Closure Prevention Study Extended Follow-up of a Randomized Controlled Trial",
    "abstract": "Purpose: This study aimed to evaluate the efficacy of laser peripheral iridotomy (LPI) prophylaxis for patients with primary angle-closure suspect (PACS) after 14 years and to identify risk factors for the conversion from PACS to primary angle closure (PCA). Participants: Eight hundred eighty-nine Chinese patients 50 to 70 years of age with bilateral PACS. Methods: Each patient received LPI in 1 randomly selected eye, with the fellow untreated eye serving as a control. Because the risk of glaucoma was low and acute angle closure (AAC) occurred only rarely, the follow-up was extended to 14 years despite substantial benefits of LPI reported after the 6-year visit. Main Outcome Measures: Incidence of PCA, a composite end point including peripheral anterior synechiae, intraocular pressure (IOP) of > 24 mmHg, or AAC. Results: During the 14 years, 390 LPI-treated eyes and 388 control eyes were lost to follow-up. A total of 33 LPI-treated eyes and 105 control eyes reached primary end points (P < 0.01). Within them, 1 LPI-treated eye and 5 control eyes progressed to AAC. Primary angle-closure glaucoma was found in 2 LPI-treated eyes and 4 control eyes. The hazard ratio for progression to PCA was 0.31 (95% confidence interval, 0.21e0.46) in LPI-treated eyes compared with control eyes. At the 14-year visit, LPI-treated eyes showed more severe nuclear cataract, higher IOP, and larger angle width and limbal anterior chamber depth (LACD) than control eyes. Higher IOP, shallower LACD, and greater central anterior chamber depth (CACD) were associated with an increased risk of end points developing in control eyes. In the treated group, eyes with higher IOP, shallower LACD, or less IOP elevation after the darkroom prone provocative test (DRPPT) were more likely to demonstrate PCA after LPI. Concluions: Despite a two-third decrease in PCA occurrence after LPI, the cumulative risk of progression was relatively low in the community-based PACS population over 14 years. Apart from IOP, IOP elevation after DRPPT, CACD, and LACD, more risk factors are needed to achieve precise prediction of PCA occurrence and to guide clinical practice. Financial Disclosure(s): The author(s) have no proprietary or commercial interest in any materials discussed in this article. Ophthalmology 2023;130:786-794 & COPY; 2023 by the American Academy of Ophthalmology. This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/).",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "21abadcdb8145a1f07a8a0af8ca2e16e",
    "relevant_keywords": [
      "PCA"
    ],
    "stage1_timestamp": "2025-05-15T02:04:19.999818"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究激光周边虹膜切开术（LPI）在预防原发性房角关闭（PCA）中的长期效果，属于医学领域，特别是眼科研究，与金融领域无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究激光周边虹膜切开术（LPI）在预防原发性房角关闭（PCA）中的长期效果，属于医学领域，特别是眼科研究，与金融领域无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:48:23.457180"
}