{
  "paper": {
    "id": 1908,
    "title": "Unveiling the drivers behind carbon emissions disclosure: an ESG perspective",
    "abstract": "PurposeThis study aims to explore the key drivers of voluntary carbon disclosures among French firms, highlighting environmental, social and governance (ESG) components and sustainable investments as crucial factors.Design/methodology/approachThis study uses H2O AutoML, an advanced machine-learning framework, to examine CO2 emissions disclosure among 77 French non-financial companies listed on the SBF 120 index from 2017-2021. The research rigorously assesses CO2 disclosures using the Carbon Disclosure Project Index criteria, enhancing the precision of the findings. This approach paves the way for innovative advancements in ESG research by integrating cutting-edge computational tools with conventional environmental reporting metrics.FindingsSocial performance and sustainable investments are the most significant predictors of CO2 disclosure, outweighing traditional financial metrics such as the Book-to-Market ratio and direct environmental factors. Variable importance analysis and heatmaps underscore the critical role of social factors in shaping corporate transparency regarding carbon emissions.Practical implicationsThis research offers valuable insights for companies and policymakers aiming to enhance environmental transparency and reporting, underscoring the significance of integrating ESG factors. Carbon emissions disclosure plays a critical role in promoting sustainability, ensuring regulatory compliance, attracting investors and strengthening risk management practices.Originality/valueThis research presents an innovative methodology for analyzing CO2 emissions disclosure using advanced machine learning within the H2O AutoML framework. It emphasizes the importance of model diversity and variable consideration to comprehensively understand environmental disclosure, potentially guiding policymakers and businesses in improving transparency and sustainability practices.",
    "year": 2025,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "e01a3ead7a8b4102d5286be7e4176fec",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:08:39.101315"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究企业碳披露的驱动因素，使用机器学习方法分析ESG因素对碳披露的影响，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究企业碳披露的驱动因素，使用机器学习方法分析ESG因素对碳披露的影响，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:45:28.652144"
}