{
  "paper": {
    "id": 2291,
    "title": "Financialized Classification Systems and Public Policy: An Interdisciplinary Approach to Crisis Response",
    "abstract": "We utilize classification systems research to examine the disproportionate impact of COVID-19 on marginalized communities and the failures of policy makers to adequately respond to those most in need. Classification situations are individual positions within the market, generated via the mass collection and aggregation of individual financial and behavioral data, that are used to categorize people into price-differentiated opportunities. In a financialized economy, where profits are increasingly accumulated through financial channels, thereby entrenching the role of financial institutions and motives at the center of economic activity, one's classification situation operates to maximize value for shareholders. Importantly, in a neoliberal economy, where the logic of the market is used to guide social and political policy more broadly, classification situations are the mechanism by which individuals are allocated resources, opportunities, hardships, and other socio-political economic outcomes. In this paper we argue that the fiscal and monetary responses to COVID-19 were designed to support financialized interests and, as a consequence, the resources and protections of the state were allocated not to those most at risk but, rather, to those whose classification situation promised a stronger return on investment.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "d1048b6ee492be1f67b3c682980b8d26",
    "relevant_keywords": [
      "classification"
    ],
    "stage1_timestamp": "2025-05-15T02:13:31.849654"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要探讨了金融化分类系统在公共政策和社会经济分配中的应用，特别是COVID-19疫情期间资源分配的问题。虽然涉及金融化的概念，但并未具体应用于衍生品定价、金融风险管理或投资组合管理等金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要探讨了金融化分类系统在公共政策和社会经济分配中的应用，特别是COVID-19疫情期间资源分配的问题。虽然涉及金融化的概念，但并未具体应用于衍生品定价、金融风险管理或投资组合管理等金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:43:20.123868"
}