{
  "paper": {
    "id": 2044,
    "title": "ANALYSIS OF RISK VARIABLES IN ONLINE BANKING",
    "abstract": "The complexity and diversity of banking risks has been on the rise in recent years due to increased competition between banks and the increasing number of financial products and services. Innovative banking financial services aimed at serving the population of the digitalized environment have caused major changes in online banking risks. The complex changes and regulations, as well as the increase in the volume of digital data, represent only a few of the factors that determine the change. As a result the associated risks are numerous. Bank risks in the digital environment are generated by fraudulent actions made on data, failures of the online banking system, cybercrime, cyber-terrorism, cyber-activism etc. These cyber threats lead to a variety of risks affecting the online banking system, such as: financial risks (R11 - R13); operational risks (R14); security risks (R15); fraud risks (R16); money-laundering risks (R17); reputational risks (R18); technological risks (R19). All these risk categories will be the subject of this paper. The code (R11-R21) will be used for easier identification during the paper. In this context, the purpose of this paper is to identify bank risks from another perspective for establishing a framework of risk variables for the machine-learning model that will be developed in future research. In this paper, the literature review was the central source to confirm our results.",
    "year": 2019,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "b1504e7932bc8ffc32658d630caf94ab",
    "relevant_keywords": [
      "machine learning"
    ],
    "stage1_timestamp": "2025-05-15T02:10:25.806463"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要研究在线银行环境中的多种风险类别，包括金融风险、操作风险、安全风险等，并旨在建立一个风险变量的框架用于未来的机器学习模型开发。这直接涉及金融风险管理的领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文主要研究在线银行环境中的多种风险类别，包括金融风险、操作风险、安全风险等，并旨在建立一个风险变量的框架用于未来的机器学习模型开发。这直接涉及金融风险管理的领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:44:28.489550"
}