{
  "paper": {
    "id": 53,
    "title": "Forecasting Detrended Volatility Risk and Financial Price Series Using LSTM Neural Networks and XGBoost Regressor",
    "abstract": "It is common practice to employ returns, price differences or log returns for financial risk estimation and time series forecasting. In De Prado's 2018 book, it was argued that by using returns we lose memory of time series. In order to verify this statement, we examined the differences between fractional differencing and logarithmic transformations and their impact on data memory. We employed LSTM (long short-term memory) recurrent neural networks and an XGBoost regressor on the data using those transformations. We forecasted risk (volatility) and price value and compared the results of all models using original, unmodified prices. From the results, models showed that, on average, a logarithmic transformation achieved better volatility predictions in terms of mean squared error and accuracy. Logarithmic transformation was the most promising transformation in terms of profitability. Our results were controversial to Marco Lopez de Prado's suggestion, as we managed to achieve the most accurate volatility predictions in terms of mean squared error and accuracy using logarithmic transformation instead of fractional differencing. This transformation was also most promising in terms of profitability.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "deep learning",
    "cache_key": "389303f2c07dc8edc8f61699738776cf",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "regression",
      "neural network",
      "deep learning",
      "long short-term memory",
      "LSTM"
    ],
    "stage1_timestamp": "2025-05-15T01:33:11.365997"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用LSTM神经网络和XGBoost回归器来预测波动性风险（volatility risk）和金融价格序列，这直接涉及金融风险管理中的风险预测和评估。论文的主要研究目标是提高波动性预测的准确性，这是金融风险管理的关键组成部分。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是使用LSTM神经网络和XGBoost回归器来预测波动性风险（volatility risk）和金融价格序列，这直接涉及金融风险管理中的风险预测和评估。论文的主要研究目标是提高波动性预测的准确性，这是金融风险管理的关键组成部分。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:04:46.992507"
}