{
  "paper": {
    "id": 216,
    "title": "Financial distress prediction using the hybrid associative memory with translation",
    "abstract": "This paper presents an alternative technique for financial distress prediction systems. The method is based on a type of neural network, which is called hybrid associative memory with translation. While many different neural network architectures have successfully been used to predict credit risk and corporate failure, the power of associative memories for financial decision-making has not been explored in any depth as yet. The performance of the hybrid associative memory with translation is compared to four traditional neural networks, a support vector machine and a logistic regression model in terms of their prediction capabilities. The experimental results over nine real-life data sets show that the associative memory here proposed constitutes an appropriate solution for bankruptcy and credit risk prediction, performing significantly better than the rest of models under class imbalance and data overlapping conditions in terms of the true positive rate and the geometric mean of true positive and true negative rates. (C) 2016 Elsevier B.V. All rights reserved.",
    "year": 2016,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "4f3e11e98f4204e7bb16182c8153798c",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM",
      "neural network",
      "memory network"
    ],
    "stage1_timestamp": "2025-05-15T01:48:30.635648"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on predicting financial distress, bankruptcy, and credit risk using a hybrid associative memory neural network. These are key aspects of financial risk management, as they involve assessing and mitigating potential financial losses.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on predicting financial distress, bankruptcy, and credit risk using a hybrid associative memory neural network. These are key aspects of financial risk management, as they involve assessing and mitigating potential financial losses.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:59:56.171278"
}