{
  "paper": {
    "id": 922,
    "title": "A novel fuzzy inference system for predicting roof fall rate in underground coal mines",
    "abstract": "Roof fall is one of the most important hazards connected with underground coal mines, because significantly affects financial and human losses. On the other hand, according to different parameters make a significant impact on roof fall and these factors are ill-defined or even immeasurable, this problem is an uncertain and complex issue. Fuzzy logic is a useful tool to handle the existing uncertainty to be more adapted to the real world problems. In this paper, fuzzy inference system (FIS) is applied to predict roof fall rate more accurate, precise, and sure for controlling, mitigating, and/or even eliminating the risk of roof fall. The model utilizes subtractive clustering method to generate fuzzy rules based on 109 data of roof performance from US coal mines. The established model is evaluated by testing dataset based on three indices, including coefficient of determination (R-2), mean absolute error (MAE), and root mean square error (RMSE). The results derived from the FIS model in comparison with artificial neural network (ANN) and multivariate regression (MVR) model demonstrate that prediction of roof fall rate by the FIS model is more accurate and satisfied. (C) 2012 Elsevier Ltd. All rights reserved.",
    "year": 2013,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "ef057b761c45ddb71ab8ad2d76427f6b",
    "relevant_keywords": [
      "clustering",
      "neural network",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:56:49.549605"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究模糊推理系统在预测地下煤矿顶板塌落率中的应用，属于矿业工程和安全领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究模糊推理系统在预测地下煤矿顶板塌落率中的应用，属于矿业工程和安全领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:53:51.739297"
}