{
  "paper": {
    "id": 2811,
    "title": "Supporting a complex audit judgment task: An expert network approach",
    "abstract": "An auditor considers a tremendous amount of data when assessing the risk that the internal control (IC) structure of an entity will fail to prevent or detect significant misstatements in financial statements. The myriad of relationships between IC variables that must be identified, selected, and analyzed often makes assessing control risk a difficult task, While some general procedures and guidelines are provided, audit standards dictate no specifically set procedures and rules for making a preliminary control risk assessment (CRA). Rather, the procedures and rules are left mostly to auditor judgment. This paper considers the appropriateness of applying artificial intelligence (AI) techniques to support this audit judgment task. It details the construction of a prototype expert network; an integration of an expert system (ES) and a neural network (NN). The rules contained in the ES model basic CRA heuristics, thus allowing for efficient use of well-known control variable relationships. The NN provides a way to recognize patterns in the large number of control variable inter-relationships that even experienced auditors cannot express as a logical set of specific rules. The NN was trained using actual case decisions of practicing auditors. (C) 1997 Elsevier Science B.V.",
    "year": 1997,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "a68888447739c48fb7951db9759ce78a",
    "relevant_keywords": [
      "neural network",
      "deep learning",
      "representation learning",
      "backpropagation",
      "BP",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T02:19:08.521301"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要探讨了人工智能技术在审计判断任务中的应用，特别是通过专家系统和神经网络来评估内部控制风险。虽然涉及风险评估，但其核心应用场景是审计而非金融领域的衍生品定价、金融风险管理或投资组合管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要探讨了人工智能技术在审计判断任务中的应用，特别是通过专家系统和神经网络来评估内部控制风险。虽然涉及风险评估，但其核心应用场景是审计而非金融领域的衍生品定价、金融风险管理或投资组合管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:39:47.207329"
}