{
  "paper": {
    "id": 3834,
    "title": "Applying deep learning method in TVP-VAR model under systematic financial risk monitoring and early warning",
    "abstract": "In order to improve the effectiveness and accuracy of financial status indicators to measure the degree of fiscal tightening, financial market situation and systemic financial risk, the logistic regression method is used to screen the target variables of the indicators. The model improves the objectivity of the selection of target variables. The model chooses 18 alternative indicators such as three-month weighted average interest rate, national real estate prosperity index, money supply M2, declared effective exchange rate and Shenzhen Component Index, and establishes the financial status index. This model validates China' s financial situation from 2013 to 2017. The results indicate that the dynamic weighted financial condition index based on time-varying parameter vector autoregressive model includes five variables: interest rate, real estate price, money supply, exchange rate and stock price, which effectively reflect the actual financial situation of China. It also proves that the degree of fiscal tightening and financial market conditions can be measured and warned in advance by changes in financial indicators. To sum up, it can be concluded that it is necessary to pay attention to the changes of interest rates, real estate prices and stock prices when monitoring the systemic financial risks in China. In order to promote early warning and effectively control financial risks, China should establish an information system and a flexible macro-prudential supervision system. This study is of great significance to the prediction and supervision of systemic financial risks in China. (C) 2020 Elsevier B.V. All rights reserved.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "578f519009d13fb429c9db21a465f831",
    "relevant_keywords": [
      "deep learning",
      "neural network",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:30:28.711225"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要研究如何通过深度学习方法和TVP-VAR模型来监测和预警系统性金融风险，包括衡量财政紧缩程度、金融市场状况和系统性金融风险，这属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文主要研究如何通过深度学习方法和TVP-VAR模型来监测和预警系统性金融风险，包括衡量财政紧缩程度、金融市场状况和系统性金融风险，这属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:35:07.505282"
}