{
  "paper": {
    "id": 4243,
    "title": "Does deforestation increase malaria prevalence? Evidence from satellite data and health surveys",
    "abstract": "Deforestation can increase malaria risk factors such as mosquito growth rates and biting rates in some settings. But deforestation affects more than mosquitoes-it is associated with socio-economic changes that affect malaria rates in humans. Most previous studies have found that deforestation is associated with increased malaria prevalence, suggesting that in some cases forest conservation might belong in a portfolio of anti-malarial interventions. However, previous peer-reviewed studies of deforestation and malaria were based on a small number of geographically aggregated observations, mostly from the Brazilian Amazon. Here we combine 14 years of high-resolution satellite data on forest loss with individual-level and nationally representative malaria tests for more than 60,000 rural children in 17 countries in Sub-Saharan Africa, where 88% of malaria cases occur. Adhering to methods that we prespecified in a pre-analysis plan, we used multiple regression analysis to test ex-ante hypotheses derived from previous literature. Aggregated across countries, we did not find either deforestation or intermediate levels of forest cover to be associated with higher malaria prevalence. In nearly all (n = 78/84) country-year-specific regressions, we also did not find deforestation or intermediate levels of forest cover to be associated with higher malaria prevalence. However, we can not rule out associations at the local scale or beyond the geographic scope of our study region. We speculate that our findings may differ from those of previous studies because deforestation in Sub-Saharan Africa is largely driven by the steady expansion of smallholder agriculture for domestic use by long-time residents in stable socio-economic settings where malaria is already endemic and previous exposure is high, while in much of Latin America and Asia deforestation is driven by rapid clearing for market-driven agricultural exports by new frontier migrants without previous exposure. These differences across regions suggest useful hypotheses to test in future research. (C) 2019 The Author(s). Published by Elsevier Ltd.",
    "year": 2020,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "6b95a7b46f53b30b543b8f8b040576c2",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:25:23.218370"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究森林砍伐与疟疾流行率之间的关系，使用了卫星数据和健康调查数据进行分析，并未涉及任何金融领域的研究或应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究森林砍伐与疟疾流行率之间的关系，使用了卫星数据和健康调查数据进行分析，并未涉及任何金融领域的研究或应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:07:57.935511"
}