{
  "paper": {
    "id": 3971,
    "title": "A process model to develop an internal rating system: Sovereign credit ratings",
    "abstract": "The Basel II capital accord encourages financial institutions to develop rating systems for assessing the risk of default of their credit portfolios in order to better calculate the minimum regulatory capital needed to cover unexpected losses. In the internal ratings based approach, financial institutions are allowed to build their own models based on collected data. In this paper, a generic process model to develop an advanced internal rating system is presented in the context of country risk analysis of developed and developing countries. In the modelling step, a new, gradual approach is suggested to augment the well-known ordinal logistic regression model with a kernel based learning capability, hereby yielding models which are at the same time both accurate and readable. The estimated models are extensively evaluated and validated taking into account several criteria. Furthermore, it is shown how these models can be transformed into user-friendly and easy to understand scorecards. (c) 2005 Elsevier B.V. All rights reserved.",
    "year": 2006,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "00abf7fd1382e789380e579fa8e02cb1",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "regression",
      "support vector machine",
      "SVM"
    ],
    "stage1_timestamp": "2025-05-15T02:31:58.599279"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是开发一个内部评级系统，用于评估信用组合的违约风险，这直接关联到金融机构的风险管理需求，特别是信用风险管理。论文中提到的Basel II资本协议和内部评级基础方法进一步证实了其在金融风险管理领域的应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"该论文的核心技术是开发一个内部评级系统，用于评估信用组合的违约风险，这直接关联到金融机构的风险管理需求，特别是信用风险管理。论文中提到的Basel II资本协议和内部评级基础方法进一步证实了其在金融风险管理领域的应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:34:43.329687"
}