{
  "paper": {
    "id": 1424,
    "title": "Research on the Construction of Financial Supervision Information System Based on Machine Learning",
    "abstract": "In order to fully implement systematic, continuous and effective supervision of financial institutions and promote the safe, steady, and efficient operation of China's financial system, this research needs to develop a fully intelligent financial supervision information system, so as to take measures to effectively prevent and resolve financial risks. In this paper, based on ML (machine learning), an LSTM (long short-term memory) model with good comprehensive performance is built. This model is different from the existing scorecard model which relies on statistical learning. It not only further reduces the dependence on financial experts, but also has the ability of rapid iteration. The post-loan risk early warning model based on RF (random forest) algorithm is designed. The model parameters are optimized, which makes the risk early warning model have higher accuracy. The results show that when the data amount is 10,000 to 50,000, the accuracy of the model is relatively high when it is input into the model. When the amount of data is low, the overall throughput of the model is still very high. It shows that the pre-warning model of post-lending risk constructed in this paper has a strong risk prediction ability.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "5f455d5ee78b5d232184150a9a0ddf30",
    "relevant_keywords": [
      "machine learning",
      "long short-term memory",
      "LSTM",
      "deep learning",
      "neural network",
      "random forest",
      "decision tree",
      "classification"
    ],
    "stage1_timestamp": "2025-05-15T02:03:00.625102"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是构建基于机器学习的金融监管信息系统，特别是用于后贷款风险预警，这直接关联到金融风险管理领域。论文明确提到预防和解决金融风险的目标，并设计了风险预警模型以提高准确性。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是构建基于机器学习的金融监管信息系统，特别是用于后贷款风险预警，这直接关联到金融风险管理领域。论文明确提到预防和解决金融风险的目标，并设计了风险预警模型以提高准确性。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:49:04.041446"
}