{
  "paper": {
    "id": 4070,
    "title": "A new financial stress index model based on support vector regression and control chart",
    "abstract": "Financial stress index (FSI) is considered to be an important risk management tool to quantify financial vulnerabilities. This paper proposes a new framework based on a hybrid classifier model that integrates rough set theory (RST), FSI, support vector regression (SVR) and a control chart to identify stressed periods. First, the RST method is applied to select variables. The outputs are used as input data for FSI-SVR computation. Empirical analysis is conducted based on monthly FSI of the Federal Reserve Bank of Saint Louis from January 1992 to June 2011. A comparison study is performed between FSI based on the principal component analysis and FSI-SVR. A control chart based on FSI-SVR and extreme value theory is proposed to identify the extremely stressed periods. Our approach identified different stressed periods including internet bubble, subprime crisis and actual financial stress episodes, along with the calmest periods, agreeing with those given by Federal Reserve System reports.",
    "year": 2015,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "509e24cba855c92d7287e90eacc5d969",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "regression",
      "support vector machine",
      "SVM",
      "principal components analysis"
    ],
    "stage1_timestamp": "2025-05-15T02:33:03.366462"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on developing a financial stress index (FSI) to identify stressed periods in financial markets, which is a tool for monitoring and managing financial risks. The proposed model integrates machine learning techniques to improve the accuracy of FSI, directly addressing financial risk management challenges.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on developing a financial stress index (FSI) to identify stressed periods in financial markets, which is a tool for monitoring and managing financial risks. The proposed model integrates machine learning techniques to improve the accuracy of FSI, directly addressing financial risk management challenges.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:34:18.558353"
}