{
  "paper": {
    "id": 211,
    "title": "Investment Biases in Reinforcement Learning-based Financial Portfolio Management",
    "abstract": "As one of the most applicable problems in reinforcement learning (RL), a number of RL-based system designs for financial portfolio management (PM) have been proposed by researchers, which are proven to achieve outstanding performance in terms of capital returns. However, these systems' degrees of bias proxies in investment are often ignored and rarely inspected in the existing research. A high-yield RL-based system does not sufficiently indicate it is unbiased. The system might as well display the biases which humans may have during financial trading owing to the resemblant decision-making and rewarding mechanism between human investors and RL agents. In this study, we investigate the proxies of two biases in financial investment, disposition effect (DE) and narrow framing (NF), in a cutting-edge RL-based system for PM: MSPM. The experimental results on 135 different portfolios during the year 2021 indicate that MSPM has significantly lower degrees of DE (-0.1477) and NF (0.0904) compared to human investors. We confirm the RL-based system's capacity to overcome the biases which human investors often have in financial investment.",
    "year": 2022,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "57ccd7c06c7f0c26af5cf023c49c2af1",
    "relevant_keywords": [
      "reinforcement learning",
      "deep learning",
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T00:40:34.147278"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心研究内容是使用强化学习（RL）技术来优化金融投资组合管理（PM），并探讨了RL系统在投资中的偏差问题。论文明确提到了金融投资组合管理（PM）作为RL的应用场景，并进行了相关实验验证。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心研究内容是使用强化学习（RL）技术来优化金融投资组合管理（PM），并探讨了RL系统在投资中的偏差问题。论文明确提到了金融投资组合管理（PM）作为RL的应用场景，并进行了相关实验验证。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:32:47.873385"
}