{
  "paper": {
    "id": 1438,
    "title": "Methodology and Models for Individuals' Creditworthiness Management Using Digital Footprint Data and Machine Learning Methods",
    "abstract": "This research deals with the challenge of reducing banks' credit risks associated with the insolvency of borrowing individuals. To solve this challenge, we propose a new approach, methodology and models for assessing individual creditworthiness, with additional data about borrowers' digital footprints to implement comprehensive analysis and prediction of a borrower's credit profile. We suggest a model for borrowers' clustering based on the method of hierarchical clustering and the k-means method, which groups actual borrowers having similar creditworthiness and similar credit risks into homogeneous clusters. We also design the model for borrowers' classification based on the stochastic gradient boosting (SGB) method, which reliably determines the cluster number and therefore the risk level for a new borrower. The developed models are the basis for decision making regarding the decision about lending value, interest rates and lending terms for each risk-homogeneous borrower's group. The modified version of the methodology for assessing individual creditworthiness is presented, which is to reduce the credit risks and to increase the stability and profitability of financial organizations.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "d6233f2c1b566ed3ada63f4fa948918c",
    "relevant_keywords": [
      "machine learning",
      "unsupervised learning",
      "classification",
      "clustering",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T02:03:00.691111"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on assessing individual creditworthiness and reducing credit risks for banks, which is a core aspect of financial risk management. The proposed models and methodology aim to improve decision-making regarding lending values, interest rates, and terms, directly addressing credit risk mitigation.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on assessing individual creditworthiness and reducing credit risks for banks, which is a core aspect of financial risk management. The proposed models and methodology aim to improve decision-making regarding lending values, interest rates, and terms, directly addressing credit risk mitigation.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:49:02.863914"
}