{
  "paper": {
    "id": 1314,
    "title": "The consistency and asymptotic normality of the kernel type expectile regression estimator for functional data",
    "abstract": "The aim of this paper is to nonparametrically estimate the expectile regression in the case of a functional predictor and a scalar response. More precisely, we construct a kernel-type estimator of the expectile regression function. The main contribution of this study is the establishment of the asymptotic properties of the expectile regression estimator. Precisely, we establish the almost complete convergence with rate. Furthermore, we obtain the asymptotic normality of the proposed estimator under some mild conditions. We provide how to apply our results to construct the confidence intervals. The case of functional predictor is of particular interest and challenge, both from theoretical as well as practical point of view. We discuss the potential impacts of functional expectile regression in NFDA with a particular focus on the supervised classification, prediction and financial risk analysis problems. Finally, the finite-sample performances of the model and the estimation method are illustrated using the analysis of simulated data and real data coming from the financial risk analysis. (C) 2020 Elsevier Inc. All rights reserved.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "20dedfdd92635ce1496c3215f97a99bb",
    "relevant_keywords": [
      "supervised learning",
      "classification",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:01:44.653585"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文讨论了函数型期望回归在金融风险分析中的应用，并特别提到了其在金融风险分析中的实际数据应用，这明确指向了金融风险管理领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文讨论了函数型期望回归在金融风险分析中的应用，并特别提到了其在金融风险分析中的实际数据应用，这明确指向了金融风险管理领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:49:50.076850"
}