{
  "paper": {
    "id": 3570,
    "title": "COVID-19 pandemic risk and probability of loan default: evidence from marketplace lending market",
    "abstract": "As the COVID-19 pandemic adversely affects the financial markets, a better understanding of the lending dynamics of a successful marketplace is necessary under the conditions of financial distress. Using the loan book database of Mintos (Latvia) and employing logit regression method, we provide evidence of the pandemic-induced exposure to default risk in the marketplace lending market. Our analysis indicates that the probability of default increases from 0.056 in the pre-pandemic period to 0.079 in the post-pandemic period. COVID-19 pandemic has a significant impact on default risk during May and June of 2020. We also find that the magnitude of the impact of COVID-19 risk is higher for borrowers with lower credit ratings and in countries with low levels of FinTech adoption. Our main findings are robust to sample selection bias allowing for a better understanding of and quantifying risks related to FinTech loans during the pandemic and periods of overall economic distress.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "7d8096d164bf60f8a365dbae43be6d6a",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:27:53.946468"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on analyzing the impact of the COVID-19 pandemic on loan default risk in the marketplace lending market, which is a key aspect of financial risk management. The study employs logit regression to quantify the increase in default probability and identifies factors that exacerbate this risk, such as lower credit ratings and low FinTech adoption levels. These findings are directly relevant to managing and understanding financial risks, particularly in the context of economic distress.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on analyzing the impact of the COVID-19 pandemic on loan default risk in the marketplace lending market, which is a key aspect of financial risk management. The study employs logit regression to quantify the increase in default probability and identifies factors that exacerbate this risk, such as lower credit ratings and low FinTech adoption levels. These findings are directly relevant to managing and understanding financial risks, particularly in the context of economic distress.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:35:59.919383"
}