{
  "paper": {
    "id": 3871,
    "title": "Analysis of EEMD-based quantile-in-quantile approach on spot- futures prices of energy and precious metals in India",
    "abstract": "By using the daily data for spot and future prices for India, we examine the frequency-dependent asymmetric relationship between futures and spot markets of crude oil, gold, and natural gas (GON). We use the novel asymmetric, noise-reducing frequency-domain EEMD-based quantile-on-quantile regression (QQR) technique. We contribute to the literature on the Indian commodity market by performing the analysis in a noise-free frequency-varying asymmetric framework where dynamic hedging and portfolio diversification is possible. The study appeals to the nature of market dynamics as well as to different investor risk and reward preferences. The empirical results show that both QR and QQR are able to adequately capture the asymmetric link between GON spot and futures prices across the short-, medium-, and long-terms. It also allows ranging from weak to very strong dependencies albeit both negative and positive across different quantiles. Specifically, we find that hedging strategies are feasible in the medium-terms and long-terms of crude oil returns at all quantiles above 0.05. Moreover, our results also show that natural gas and gold futures can only be a weak hedge for a spot in the short-term, but not in the medium-terms and long-terms. The policy implications are also discussed from the findings.",
    "year": 2020,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "752a39d13fe92626d53b3fa42917bb49",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:21:41.379859"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk",
      "Portfolio Management"
    ],
    "justification": "该论文研究了现货与期货价格之间的不对称关系，并探讨了动态对冲和投资组合多样化的可能性。这些内容直接涉及金融风险管理和投资组合管理领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\", \"投资组合管理\"],\n  \"justification\": \"该论文研究了现货与期货价格之间的不对称关系，并探讨了动态对冲和投资组合多样化的可能性。这些内容直接涉及金融风险管理和投资组合管理领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:08:45.556034"
}