{
  "paper": {
    "id": 4700,
    "title": "Regression Models for Project Expenditures",
    "abstract": "This report discusses regression models to analyse planned and actual expenditure data from projects in an Australian Defence capital investment program. Variations in expenditure from that planned have the potential to create cash flow problems in Defence. Therefore, an understanding of the relationship between planned and actual expenditure will improve project planning and portfolio financial management. It is also useful to understand if families of projects behave differently to each other because differences may indicate varying management practices across project domains or differences in the nature of project families. The regression model accommodates project time and military domain effects, heteroscedasticity, repeated measures and nonlinear relations between planned and actual annual project expenditure. The nonlinear model is linearized into an additive lognormal model and fitted via a linear mixed models methodology that facilitates modelling the within project covariance structure. Generally, projects underspend against the plan early in their life and overspend in later years. For each year, there are significant differences in expenditure rates between domains, but the expenditure rate does not depend on planned expenditure. The model may be used by project and portfolio planners to test likely spending variations from plan and to then adjust expenditure plans accordingly; it, therefore, provides a tool to measure project and financial risk.",
    "year": 2018,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "75be1e4400d7a38ffff8dfc543fd2995",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:39:57.605309"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要讨论回归模型在分析项目支出数据中的应用，目的是改进项目规划和财务风险管理，但并未明确指出其应用于衍生品定价、金融风险管理或投资组合管理等特定金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要讨论回归模型在分析项目支出数据中的应用，目的是改进项目规划和财务风险管理，但并未明确指出其应用于衍生品定价、金融风险管理或投资组合管理等特定金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:32:19.826707"
}