{
  "paper": {
    "id": 5533,
    "title": "Multi-hazard spatial modeling via ensembles of machine learning and meta-heuristic techniques",
    "abstract": "Considering the large number of natural disasters on the planet, many areas in the world are at risk of these hazards; therefore, providing an integrated map as a guide map for multiple natural hazards can be applied to save human lives and reduce financial losses. This study designed a multi-hazard map for three important hazards (earthquakes, floods, and landslides) to identify endangered areas in Kermanshah province located in western Iran using ensemble SWARA-ANFIS-PSO and SWARA-ANFIS-GWO models. In the first step, flood and landslide inventory maps were generated to identify at-risk areas. Then, the occurrence places for each hazard were divided into two groups for training susceptibility models (70%) and testing the models applied (30%). Factors affecting these hazards, including altitude, slope aspect, slope degree, plan curvature, distance to rivers, distance to roads, distance to the faults, rainfall, lithology, and land use, were used to generate susceptibility maps. The SWARA method was used to weigh the subclasses of the influencing factors in floods and landslides. In addition, a peak ground acceleration (PGA) map was generated to investigate earthquakes in the study area. In the next step, the ANFIS machine learning algorithm was used in combination with PSO and GWO meta-heuristic algorithms to train the data, and SWARA-ANFIS-PSO and SWARA-ANFIS-GWO susceptibility maps were separately generated for flood and landslide hazards. The predictive ability of the implemented models was validated using the receiver operating characteristics (ROC), root mean square error (RMSE), and mean square error (MSE) methods. The results showed that the SWARA-ANFIS-PSO ensemble model had the best performance in generating flood susceptibility maps with ROC = 0.936, RMS = 0.346, and MSE = 0.120. Furthermore, this model showed excellent results (ROC = 0.894, RMS = 0.410, and MSE = 0.168) for generating a landslide map. Finally, the best maps and PGA map were combined, and a multi-hazard map (MHM) was obtained for Kermanshah Province. This map can be used by managers and planners as a practical guide for sustainable development.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "1cb611610807b7273270b2eacffdda3f",
    "relevant_keywords": [
      "machine learning",
      "neural network",
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T02:48:51.318999"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究自然灾害的多灾害空间建模，使用机器学习与元启发式技术生成多灾害地图，目的是为了减少自然灾害对人类生命和财产的损失。虽然提到了减少财务损失，但并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域的具体应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究自然灾害的多灾害空间建模，使用机器学习与元启发式技术生成多灾害地图，目的是为了减少自然灾害对人类生命和财产的损失。虽然提到了减少财务损失，但并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域的具体应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:30:03.311186"
}