{
  "paper": {
    "id": 852,
    "title": "Research on credit risk of listed companies: a hybrid model based on TCN and DilateFormer",
    "abstract": "The ability to assess and manage corporate credit risk enables financial institutions and investors to mitigate risk, enhance the precision of their decision-making, and adapt their strategies in a prompt and effective manner. The growing quantity of data and the increasing complexity of indicators have rendered traditional machine learning methods ineffective in enhancing the accuracy of credit risk assessment. Consequently, academics have begun to explore the potential of models based on deep learning. In this paper, we apply the concept of combining Transformer and CNN to the financial field, building on the traditional CNN-Transformer model's capacity to effectively process local features, perform parallel processing, and handle long-distance dependencies. To enhance the model's ability to capture financial data over extended periods and address the challenge of high-dimensional financial data, we propose a novel hybrid model, TCN-DilateFormer. This integration improves the accuracy of corporate credit risk assessment. The empirical study demonstrates that the model exhibits superior prediction accuracy compared to traditional machine learning assessment models, thereby offering a novel and efficacious tool for corporate credit risk assessment.",
    "year": 2025,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "2036514eeab58b408d92cea8f41b67eb",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "neural network",
      "convolutional neural network",
      "CNN",
      "attention mechanism"
    ],
    "stage1_timestamp": "2025-05-15T01:55:41.680325"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文提出了一种新的混合模型TCN-DilateFormer，用于提高公司信用风险评估的准确性。信用风险评估是金融风险管理的重要组成部分，因此该论文的核心技术主要应用于金融风险管理领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文提出了一种新的混合模型TCN-DilateFormer，用于提高公司信用风险评估的准确性。信用风险评估是金融风险管理的重要组成部分，因此该论文的核心技术主要应用于金融风险管理领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:54:15.772902"
}