{
  "paper": {
    "id": 465,
    "title": "PORTFOLIO SELECTION WITH SUPPORT VECTOR MACHINES IN LOW ECONOMIC PERSPECTIVES IN EMERGING MARKETS",
    "abstract": "Some of the innovations are presented here are the use of the ranking probability for classification of assets and the balance of the cost by the type of forecast error. The study was conducted on two different samples. The first sample consists on assets that are part of the Ibovespa, considering the portfolio valid from January to April 2015 and this sample was compared to the portfolio generated by SVM and the BOVA11 index fund. The second sample consists of the assets comprising the IBrX-100 index, the portfolio valid from January to April 2015 which similarly was compared with the portfolio generated by SVM and the BRAX11 index fund. In order to evaluate the proposed strategy results were also compared to the free return indicator CDI risk. The portfolio cumulative return of the sample selected by SVM was 94.15%, compared to -14.42% of BOVA11 that replicates the Ibovespa. While the portfolio selected on the portfolio of IBrX100 was 38.25% against 13.86% of BRAX11 index fund. For the period rated the CDI presented a return of 53.75%. The average cumulative return of assets in the study period was in the case of portfolio of the Ibovespa 57.1% and 34.4% for IBrX100 portfolio.",
    "year": 2015,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "73e006024df83cf969d73b84779bae00",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM"
    ],
    "stage1_timestamp": "2025-05-15T00:43:47.355759"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是使用支持向量机（SVM）进行资产分类和投资组合选择，并在新兴市场中进行了实证研究。论文明确比较了由SVM生成的投资组合与市场指数的表现，这直接属于投资组合管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Portfolio Management\"],\n  \"justification\": \"该论文的核心技术是使用支持向量机（SVM）进行资产分类和投资组合选择，并在新兴市场中进行了实证研究。论文明确比较了由SVM生成的投资组合与市场指数的表现，这直接属于投资组合管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:30:36.701103"
}