{
  "paper": {
    "id": 1218,
    "title": "Using machine learning for detecting liquidity risk in banks",
    "abstract": "The accurate classification of banks' Liquidity Risk (LR) for regulatory supervision is hindered by limitations in the measures, such as Minimum Liquid Assets (MLA), Net-Stable Funding Ratio (NSFR), and Liquidity Coverage Ratio (LCR). This study addressed two limitations on data integrity vulnerabilities and the narrow composition of LR factors excluding practical LR determinants such as credit portfolio quality, market conditions, strategies of assets and funding. Theoretical gaps included the eight new LR factors in this study, benchmarking study results with measures to interpret the studies' contributions and the selection of suitable prediction methods for non-linear, imbalanced, scaling, and near real-time data. We used data from 38 Tanzanian banks (20102021) from the Bank of Tanzania (BOT). Extensive factors experimentation using Random Forest (RF) and Multi-Layer Perceptron (MLP) models identified ten features for Machine Learning (ML) analysis and LR rating as output. A hybrid RF-MLP model with a 199-tree RF and 10-512-250-120-80-60-6 MLP was developed. It increased LR sensitivity and reduced RF and MLP model limitations through generalisation, and demonstrated statistical and practical performance. It minimised classification errors with Type I and II errors, and Negative Likelihood of 0.8%, 9.1%, and 1%; Discriminant Power of 2.61; and 90% to 96% Accuracy, Balanced Accuracy, Precision, Recall, F1 Score, G-mean, Cohen's Kappa, Youden Index, and Area Under the Curve. Past LR scenarios confirmed RF-MLP performance improvement over MLA. The unavailability of LCR and NSFR data hindered a comprehensive evaluation. This study extended LR factors and proposed a model to complement LR classification.",
    "year": 2024,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "95f7f1a0fa747e4deb490da8e55feb95",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "neural network",
      "deep learning",
      "hidden layer",
      "backpropagation",
      "BP",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T00:53:09.939670"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on using machine learning to detect and classify liquidity risk in banks, which is a critical aspect of financial risk management. The study addresses limitations in existing liquidity risk measures and proposes a hybrid model to improve classification accuracy, directly contributing to the field of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on using machine learning to detect and classify liquidity risk in banks, which is a critical aspect of financial risk management. The study addresses limitations in existing liquidity risk measures and proposes a hybrid model to improve classification accuracy, directly contributing to the field of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:23:20.546917"
}