{
  "paper": {
    "id": 393,
    "title": "An Efficient Botnet Detection Methodology using Hyper-parameter Optimization Trough Grid-Search Techniques",
    "abstract": "In recent years botnets have become serious threats for Internet-based services and infrastructures. Prompt detection can mitigate the impact of several attacks including Denial-of-service (DDoS), spam, phishing, identity theft, and information leaking. Actually, physical and logical appliances over networks are addressing botnet discovery. However, signature-based solutions require constant updates from repositories, which is a concerning setback given the rapid development of new threats. An alternative solution to overcome such limitations is to train Machine Learning (ML) algorithms to accurately identify malicious network flows. Although the state-of-the-art provide significant advances in botnet classification using machine and statistical learning, the algorithm selection procedure is not properly defined nor explained. In this work an algorithm portfolio is built to test performance between several supervised learning algorithms using a hyper-parameter optimization technique known as Grid Search. Experimental results prove that by tuning algorithms trained models can outperform detection accuracy in an efficient manner.",
    "year": 2019,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "5e74a1239b429d72a1942b77855f8059",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T00:43:10.466336"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究使用机器学习和超参数优化技术进行僵尸网络检测，其应用场景是网络安全而非金融领域。论文中未提及任何与衍生品定价、金融风险管理或投资组合管理相关的内容或应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究使用机器学习和超参数优化技术进行僵尸网络检测，其应用场景是网络安全而非金融领域。论文中未提及任何与衍生品定价、金融风险管理或投资组合管理相关的内容或应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T14:24:43.997254"
}