{
  "paper": {
    "id": 1054,
    "title": "A walk in the patients' shoes: A step toward competency development in systems-based practice",
    "abstract": "Objectives.-To implement and evaluate the effectiveness of scenario-based learning as a method for teaching systems-based practice to pediatric residents. Methods.-Twelve pediatric residents at the University of Florida/Jacksonville participated in an active learning scenario experience during their 1-month community pediatrics block rotation from January 2003 to April 2004. A scenario, developed in partnership with community-based organizations, required the residents to assume the role of a parent faced with multiproblem life situations requiring skills in prioritizing problems and identifying and accessing community resources to address them. Residents documented their assessment of the experience as they went through it by making entries into a learning portfolio and at the end of the experience through written evaluations and exit interviews. A case study design was used to assess resident-perceived impact of this experience. Qualitative methods were used to analyze data from resident portfolio entries, resident written evaluation surveys, and resident exit interviews. Results.-Five themes, some of which reflect competencies in systems-based practice, emerged from the data: development of empathy and compassion, increased understanding of the barriers facing patients and families, increased appreciation of social determinants of health, self-perceived increased ability to serve patients, and advantages of active learning. Conclusions.-Active learning experiences that simulate patient situations can be incorporated into community pediatrics training for residents, increasing perceived competence in systems-based practice.",
    "year": 2006,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "db10dc5770804cb46d0923d27c39dcd9",
    "relevant_keywords": [
      "active learning"
    ],
    "stage1_timestamp": "2025-05-15T00:51:25.870978"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是医学教育中的情景式学习方法，用于提高儿科住院医师的系统实践能力，与金融领域的衍生品定价、金融风险管理和投资组合管理无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是医学教育中的情景式学习方法，用于提高儿科住院医师的系统实践能力，与金融领域的衍生品定价、金融风险管理和投资组合管理无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:24:50.613514"
}