{
  "paper": {
    "id": 362,
    "title": "Valuing portfolios of interdependent real options using influence diagrams and simulation-and-regression: A multi-stage stochastic integer programming approach",
    "abstract": "Although real options generally occur within portfolios, most valuation approaches based on either option pricing or decision analysis alone focus on single well-defined options. In this paper we present a new approach for modelling and approximating the value of portfolios of interdependent real options using both influence diagrams and simulation-and-regression. The key feature of this approach is that it translates the interdependencies between real options into a set of constraints and then directly models the dynamics of all underlying uncertainties using (Markovian) stochastic processes. These are then integrated in a portfolio optimisation problem which is formulated as a multi-stage stochastic integer program. Applying a simulation and parametric regression approach to approximate the value of this optimisation problem, we present a transparent valuation algorithm that explicitly takes into account vector-valued exercise decisions and the state variable's multidimensional resource component. The approach is therefore applicable to a wide range of complex investment projects with both inherent interdependent flexibilities and many underlying uncertainties. The approach is illustrated by evaluating a complex natural resource investment that features both a large portfolio of interdependent real options and four stochastic factors. We analyse the way in which the approximated value of the portfolio and its individual options are affected by the initial copper price as well as by the degrees of production cost and copper price uncertainty. (C) 2018 Elsevier Ltd. All rights reserved.",
    "year": 2020,
    "source": "WOS",
    "area": "derivatives_pricing",
    "method": "machine learning",
    "cache_key": "443185dacc6ff6fb1e35ea62e576991a",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:31:13.166359"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Derivatives Pricing",
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是使用影响图和模拟-回归方法来评估相互依赖的实物期权组合的价值，这直接涉及衍生品定价领域。同时，论文将问题建模为一个多阶段随机整数规划的投资组合优化问题，因此也属于投资组合管理领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"衍生品定价\", \"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是使用影响图和模拟-回归方法来评估相互依赖的实物期权组合的价值，这直接涉及衍生品定价领域。同时，论文将问题建模为一个多阶段随机整数规划的投资组合优化问题，因此也属于投资组合管理领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:05:13.405926"
}