{
  "paper": {
    "id": 497,
    "title": "Short-Term Stock Price Prediction by Supervised Learning of Rapid Volume Decrease Patterns",
    "abstract": "Recently several researchers have proposed various methods to build intelligent stock trading and portfolio management systems using rapid advancements in artificial intelligence including machine learning techniques. However, existing technical analysis-based stock price prediction studies primarily depend on price change or price-related moving average patterns, and information related to trading volume is only used as an auxiliary indicator. This study focuses on the effect of changes in trading volume on stock prices and proposes a novel method for short-term stock price predictions based on trading volume patterns. Two rapid volume decrease patterns are defined based on the combinations of multiple volume moving averages. The dataset filtered using these patterns is learned through the supervised learning of neural networks. Experimental results based on the data from Korea Composite Stock Price Index and Korean Securities Dealers Automated Quotation, show that the proposed prediction system can achieve a trading performance that significantly exceeds the market average.",
    "year": 2022,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "0f63b0ab33b8feb506ac907d1e3987cb",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T00:44:20.924191"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是使用监督学习和神经网络来预测短期股票价格，目的是构建智能股票交易和投资组合管理系统。虽然论文没有直接提到投资组合管理的具体策略，但其研究目标和技术应用与投资组合管理密切相关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是使用监督学习和神经网络来预测短期股票价格，目的是构建智能股票交易和投资组合管理系统。虽然论文没有直接提到投资组合管理的具体策略，但其研究目标和技术应用与投资组合管理密切相关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:30:09.398275"
}