{
  "paper": {
    "id": 1913,
    "title": "Relative informative power and stock return predictability: a new perspective from Egypt",
    "abstract": "PurposeThis paper aims to introduce a new perspective on long-term stock return predictability by focusing on the relative (individual and hybrid) informative power of a wide range of accounting (firm-related), technical and macroeconomic factors while considering the past performance of the stocks using machine learning algorithms. Design/methodology/approachThe sample includes a panel data set of 94 non-financial firms listed in Egyptian Exchange 100 index from 2014: Q1 to 2019: Q4. Relativity has been investigated by comparing relevant factors' individual and combined informative power and differentiating between losers and winners based on historical stock returns. To predict the quarterly stock returns, Gaussian process regression (GPR) has been used. The robustness of the results is examined through the out-of-sample test. This study also uses linear regression (LR) as a benchmark model. FindingsThe past performance and the presence of other predictors influence the informative power of relevant factors and hence their predictive ability. The out-of-sample results show a trade-off between GPR and LR with proven superiority to GPR in limited experiments. The individual informative power outperforms the hybrid power, in which macroeconomic indicators outperform the remaining sets of indicators for losers, while winners show mixed results in terms of various performance evaluation metrics. Prediction accuracy is generally higher for losers than for winners. Practical implicationsThis study provides interesting insight into the dynamic nature of the predictor variables in terms of stock return predictability. Hence, this study also deepens the understanding of asset pricing in a way that directly contributes to practitioners' portfolio diversification strategies. Originality/valueIn concern of the chaos of factors in the literature and its accompanying misleading conclusions, this study takes another look at the approach that studies stock return predictability. To the best of the authors' knowledge, this is the first study in the Egyptian context that re-examines the predictive power of the previously discovered factors from a different perspective that highlights their relative nature.",
    "year": 2023,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "c2d5ccda170fa5350e6d2ea72c5c4476",
    "relevant_keywords": [
      "machine learning",
      "regression",
      "Gaussian process regression",
      "linear regression"
    ],
    "stage1_timestamp": "2025-05-15T01:01:06.118987"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心研究内容是使用机器学习算法（如高斯过程回归和线性回归）预测股票回报，并探讨了不同因素对预测能力的影响。这些研究直接有助于投资者优化其投资组合策略，因此主要应用于投资组合管理领域。论文摘要中明确提到研究结果对实践者的投资组合多样化策略有直接贡献。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心研究内容是使用机器学习算法（如高斯过程回归和线性回归）预测股票回报，并探讨了不同因素对预测能力的影响。这些研究直接有助于投资者优化其投资组合策略，因此主要应用于投资组合管理领域。论文摘要中明确提到研究结果对实践者的投资组合多样化策略有直接贡献。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:18:14.982039"
}