{
  "paper": {
    "id": 9436,
    "title": "The effect of dietary diversity on anemia levels among children 6-23 months in sub-Saharan Africa: A multilevel ordinal logistic regression model",
    "abstract": "Background Anemia is the most common hematologic disorder of children worldwide. Since dietary diversity is a main requirement of children is to get all the essential nutrients, it can thus use as one of the basic indicator when assessing the child's anemia. Although dietary diversity plays a major role in anemia among children in sub-Saharan Africa, there is little evidence of an association between the dietary diversity and anemia level to identified potential strategies for prevention of anemia level in sub-Saharan Africa.Objective To examine the association between dietary diversity and anemia levels among children aged 6-23 months in sub-Saharan Africa.Methods The most recent Demographic and Health Surveys from 32 countries in SSA were considered for this study, which used pooled data from those surveys. In this study, a total weighted sample of 52,180 children aged 6-23 months was included. The diversity of the diet given to children was assessed using the minimum dietary diversity (MDD), which considers only four of the seven food groups. A multilevel ordinal logistic regression model was applied due to the DHS data's hierarchical structure and the ordinal nature of anemia. With a p-value of 0.08, the Brant test found that the proportional odds assumption was satisfied. In addition, model comparisons were done using deviance. In the bi-variable analysis, variables having a p-value <= 0.2 were taken into account for multivariable analysis. The Adjusted Odds Ratio (AOR) with 95% Confidence Interval (CI) was presented for potential determinants of levels of anemia in the multivariable multilevel proportional odds model.Results The overall prevalence of minimum dietary diversity and anemia among children aged 6-23 months were 43% [95% CI: 42.6%, 43.4%] and 72.0% [95% CI: 70.9%, 72.9%] respectively. Of which, 26.2% had mild anemia, 43.4% had moderate anemia, and 2.4% had severe anemia. MDD, being female child, being 18-23 months age, born from mothers aged >= 25, taking drugs for the intestinal parasite, higher level of maternal education, number of ANC visits, middle and richer household wealth status, distance of health facility and being born in Central and Southern Africa were significantly associated with the lower odds of levels of anemia. Contrarily, being 9-11- and 12-17-months age, size of child, having fever and diarrhea in the last two weeks, higher birth order, stunting, wasting, and underweight and being in West Africa were significantly associated with higher odds of levels of anemia.Conclusion Anemia was a significant public health issue among children aged 6-23 months in sub-Saharan Africa. Minimum dietary diversity intake is associated with reduced anemia in children aged 6 to 23 months in sub-Saharan Africa. Children should be fed a variety of foods to improve their anemia status. Reducing anemia in children aged 6-23 months can be achieved by raising mother education levels, treating febrile illnesses, and improve the family's financial situation. Finally, iron fortification or vitamin supplementation could help to better reduce the risk of anemia and raise children's hemoglobin levels in order to treat anemia.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "ed0ec74723940cf70441712ea6797789",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T03:28:46.307184"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究饮食多样性与儿童贫血水平之间的关系，属于公共卫生领域，与衍生品定价、金融风险管理或投资组合管理无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究饮食多样性与儿童贫血水平之间的关系，属于公共卫生领域，与衍生品定价、金融风险管理或投资组合管理无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:25:11.751206"
}