{
  "paper": {
    "id": 4676,
    "title": "Research on the Relationship between Ex-financial Performance and IPO Under-pricing in China GEM",
    "abstract": "IPO (Initial Public Offering), IPO Underpricing, refers to the initial public offering of stock issue price is lower than the company's closing price listed on the first day of the phenomenon. In China's capital market, after ten years of development, now the related laws and regulations are also being gradually perfected and improved. This paper selects 355 companies in China's gem since 2009 October until 2012 October opened listing data, will in the main influence factors of IPO underpricing board decision: first, P / E ratio, starting on the scale of fund-raising, the first day of the first day of the success rate and the size of the company to do the analysis the first regression, and draw the conclusion, then these four variables model as control variables and the ex-financial performance of the listing corporation is listed before the introduction of the model, model two, respectively introduces the four main indexes from the enterprise profitability, asset quality, debt risk and business growth of the four dimensions, respectively. As the rate of return on net assets, total assets turnover ratio, asset-liability ratio, operating profit growth rate, regression analysis and concluded, ex-financial performance of listing corporation on IPO underpricing has certain influence.",
    "year": 2015,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "0b5f1783680a7df7b2a96cfd94f5f754",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:39:57.434795"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究IPO定价偏低现象及其影响因素，虽然涉及金融市场，但并未直接应用于衍生品定价、金融风险管理或投资组合管理等特定领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究IPO定价偏低现象及其影响因素，虽然涉及金融市场，但并未直接应用于衍生品定价、金融风险管理或投资组合管理等特定领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:32:20.556876"
}