{
  "paper": {
    "id": 5672,
    "title": "Mathematical Modeling and Nonlinear Optimization in Determining the Minimum Risk of Legalization of Income from Criminal Activities in the Context of EU Member Countries",
    "abstract": "Legalization of the proceeds of crime represents a worldwide problem with serious economic and social consequences. Information technologies in conjunction with advanced computer techniques are important tools in the fight against money laundering (ML), financial crime (FC) and terrorism financing (TF). Nowadays, the applied literature on ML/FC/TF uses much more mathematical modelling as a solving strategy to estimate illicit money flows. However, we perceive that there is preference of linear models of economical dependences and sometimes lack of acceptance of nonlinearity of such investigated economic systems. To characterize the risk of legalization of crime proceeds in a certain country, the scientific researchers use the Basel anti-money laundering (AML) index. To better understand how the global indicators (WCI, CPI, EFI, GII, SEDA, DBI, GSCI, HDI, VAT(GAP), GDP per capita) affect the level of risk of ML/TF in the countries of EU, the authors use a unique data set of 24 destination countries of EU over the period 2012-2019. The article deals with two main research goals: to develop a nonlinear model and optimize the ML/TF risk by implementation of nonlinear optimization methods. The authors contribute: (i) providing the cross-country statistical analysis; (ii) creating the new nonlinear mathematical-statistical computational model (MSCM); and (iii) describing the observed dependent variable (Basel AML index). This study deepens previous knowledge in this research field and, in addition to the panel regression analysis, also applies nonlinear regression analysis to model the behavior of the investigated system (with nonlinearity). Our results point out the differences between the estimates of the investigated system behavior when using panel and nonlinear regression analysis. Based on the developed MSC model, the optimization procedure is conducted by applying an interior point method and MATLAB toolboxes and the second goal is achieved: the statement that such values of input variables at which the risk of legalization of income from criminal activity will be minimal.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "c37a7c014c737b12118187f36fa66d3b",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:50:21.179275"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是通过非线性模型和优化方法来评估和最小化犯罪收入合法化的风险，虽然涉及金融犯罪（如洗钱和恐怖主义融资），但其核心技术和应用并不直接属于衍生品定价、金融风险管理或投资组合管理这些特定的金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是通过非线性模型和优化方法来评估和最小化犯罪收入合法化的风险，虽然涉及金融犯罪（如洗钱和恐怖主义融资），但其核心技术和应用并不直接属于衍生品定价、金融风险管理或投资组合管理这些特定的金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:30:01.381250"
}