{
  "paper": {
    "id": 265,
    "title": "GA-BP neural network modeling for project portfolio risk prediction",
    "abstract": "PurposeProject portfolio risk (PPR) management plays an important role in promoting the smooth implementation of a project portfolio (PP). Accurate PPR prediction helps managers cope with risks timely in complicated PP environments. However, studies on accurate PPR impact degree prediction, which consists of both risk occurrence probabilities and risk impact consequences considering project interactions, are limited. This study aims to model PPR prediction and expand PPR prediction tools.Design/methodology/approachIn this study, the authors build a PPR prediction model based on a genetic algorithm and back-propagation neural network (GA-BPNN) integrated with entropy-trapezoidal fuzzy numbers. Then, the authors verify the proposed model with real data and obtain PPR impact degrees.FindingsThe test results indicate that the proposed method achieves an average absolute error of 0.002 and an average prediction accuracy rate of 97.8%. The former is reduced by 0.038, while the latter is improved by 32.1% when compared with the results of the original BPNN model. Finally, the authors conduct an index sensitivity analysis for identifying critical risks to effectively control them.Originality/valueThis study develops a hybrid PPR prediction model that integrates a GA-BPNN with entropy-trapezoidal fuzzy numbers. The authors use this model to predict PPR impact degrees, which consist of both risk occurrence probabilities and risk impact consequences considering project interactions. The results provide insights into PPR management.",
    "year": 2024,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "020a3ac7ef932aa7e8e08a6799ab4eef",
    "relevant_keywords": [
      "machine learning",
      "neural network",
      "deep learning",
      "backpropagation",
      "BP",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T00:41:04.775101"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究项目组合风险（PPR）预测，虽然涉及风险管理和组合管理，但其应用场景是项目管理而非金融领域。论文未提及任何金融产品或市场，因此不属于上述金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究项目组合风险（PPR）预测，虽然涉及风险管理和组合管理，但其应用场景是项目管理而非金融领域。论文未提及任何金融产品或市场，因此不属于上述金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:32:16.082186"
}