{
  "paper": {
    "id": 5112,
    "title": "Measuring CoVaR: An Empirical Comparison",
    "abstract": "Recent literature has proposed a market-based measure to assess the contribution of a single bank to the systemic risk, i.e. the delta conditional value-at-risk (Delta CoVaR). This measure could be useful to control the dynamics of systemic risk as perceived by the market. We estimate the Delta CoVaR of Italian and main European banks over the time span from January 2007 to December 2018 by considering three possible methodologies: (1) the quantile regression; (2) a closed form formula; (3) a non-parametric method. The estimates based on closed form formula do not differ substantially from those of the other two methodologies, moreover they provide more robust results. Furthermore, we compare the ranking derived by the Delta CoVaR with the global systemically important banks (GSIBs) buckets determining additional loss absorbency requirements. We show that there are differences in the ranking defined by the Delta CoVaR and the GSIBs bucket allocation provided by the Financial Stability Board even if the Delta CoVaR seems to be able to divide the good from the bad, from a systemic risk perspective.",
    "year": 2020,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "493a3589e7c3cb43fb3bbfbe2196a170",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:44:11.129404"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on measuring the Delta CoVaR to assess the contribution of banks to systemic risk, which is a key aspect of financial risk management. The methodologies discussed (quantile regression, closed form formula, non-parametric method) are applied to evaluate and manage systemic risk, aligning with the objectives of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on measuring the Delta CoVaR to assess the contribution of banks to systemic risk, which is a key aspect of financial risk management. The methodologies discussed (quantile regression, closed form formula, non-parametric method) are applied to evaluate and manage systemic risk, aligning with the objectives of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:31:09.133856"
}