{
  "paper": {
    "id": 3790,
    "title": "AN EMPIRICAL ASSESSMENT OF THE DETERMINANTS OF BANK PROFITABILITY IN ROMANIA",
    "abstract": "The eurozone crisis represented one of the most important factors influencing the global economic evolution, affecting the comercial exchange dynamics, the financial markets risk perception and the thrust of the economic operators. Due to the unpredictable external environment conditions, the commercial banks operating in Romania were forced to cope with the impairment of the economic potential and the unfavourable evolution of the currency market (altering the real lending demand), the increase of the credit risk ratio and of the bad debts (influencing the financial results) and also the gradual implementation of the Basel III requirements. The foreign financial market determined changes in the feaures of the romanian bank activities, the crucial issue remaining the preservation of the performance level. The literature provides a broad base of studies of this theme on banking sectors in different countries. Regardless of the banking system studied, the research involves assessing the interaction between the economic environment, internal and external operations of the banking sector. Generally, at banking performance evaluation is used a variety of financial indicators, that may prediction profitability and efficiency of banking institutions. In terms of methodology, most used technique to optimize the data is regression analysis. This article aims to identify the Influence of bank specific and macroeconomic factors on profitability of large commercial banks in Romania over the period of 2007 to 2012,profoundly affected by the effects of the global financial crisis. A standard regression model is used to identify bank characteristic and macroeconomics determinants that significantly contribute to profitability, expressed through return on assets and return on equity, of large commercial banks in Romania. The main reason being that a lot of these factors keep on changing and such frequent changes could affect banks' overall profitability which, in turn, could give an impact to the general economy of a country. The study is taking into consideration the first five banks, namely, BCR, BRD, BT, Raiffeisen, Unicredit.",
    "year": 2014,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "eef96208863c57edb4d01e4d6c5d38f0",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:29:59.188027"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究银行盈利能力的影响因素，使用回归分析来评估银行特定和宏观经济因素对盈利能力的影响。虽然涉及金融领域，但并未直接涉及衍生品定价、金融风险管理或投资组合管理等特定领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究银行盈利能力的影响因素，使用回归分析来评估银行特定和宏观经济因素对盈利能力的影响。虽然涉及金融领域，但并未直接涉及衍生品定价、金融风险管理或投资组合管理等特定领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:35:09.012464"
}