{
  "paper": {
    "id": 314,
    "title": "Credit risk prediction with corruption perception index: machine learning approaches",
    "abstract": "This study examines the impact of corruption on credit risk in Southeast Asian commercial banks by using machine learning models to predict non-performing loans (NPLs) based on the Corruption Perception Index (CPI). Analyzing data from 70 banks over a decade, it employs Decision Tree, Random Forest, Gradient Boosted Trees, and XGBoost models, evaluated using R-2, RMSE, and MAE. Findings indicate that ensemble methods, particularly XGBoost, outperform simpler models in predicting NPLs influenced by corruption. Results confirm that corruption significantly increases NPLs, weakening banks' lending capacity and financial stability. By addressing limitations of traditional risk assessment methods, this study highlights machine learning's effectiveness in integrating corruption indices for better credit risk management. The insights benefit investors, bank managers, and policymakers, emphasizing the need for anti-corruption measures and advanced predictive models to mitigate financial risks in the region.",
    "year": 2025,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "e5719374a67e202852047cba823dc1bc",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "decision tree",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:49:40.946982"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on predicting non-performing loans (NPLs) using machine learning models to assess credit risk influenced by corruption, which is a key aspect of financial risk management. The study aims to improve credit risk assessment and financial stability, directly aligning with the goals of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on predicting non-performing loans (NPLs) using machine learning models to assess credit risk influenced by corruption, which is a key aspect of financial risk management. The study aims to improve credit risk assessment and financial stability, directly aligning with the goals of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:59:05.835331"
}