{
  "paper": {
    "id": 1480,
    "title": "A bat optimized neural network and wavelet transform approach for short-term price forecasting",
    "abstract": "In the competitive power industry environment, electricity price forecasting is a fundamental task when market participants decide upon bidding strategies. This has led researchers in the last years to intensely search for accurate forecasting methods, contributing to better risk assessment, with significant financial repercussions. This paper presents a hybrid method that combines similar and recent day-based selection, correlation and wavelet analysis in a pre-processing stage. Afterwards a feedforward neural network is used alongside Bat and Scaled Conjugate Gradient Algorithms to improve the traditional neural network learning capability. Another feature is the method's capacity to fine-tune neural network architecture and wavelet decomposition, for which there is no optimal paradigm. Numerical testing was applied in a day-ahead framework to historical data pertaining to Spanish and Pennsylvania-New Jersey-Maryland (PJM) electricity markets, revealing positive forecasting results in comparison with other state-of-the-art methods.",
    "year": 2018,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "585b46ae118058bf5e0bfd2a3cd7d946",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "neural network",
      "backpropagation",
      "BP",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T02:03:39.762390"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究电力市场的短期价格预测，虽然涉及风险管理和财务影响，但其核心技术并未明确应用于衍生品定价、金融风险管理或投资组合管理等特定金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究电力市场的短期价格预测，虽然涉及风险管理和财务影响，但其核心技术并未明确应用于衍生品定价、金融风险管理或投资组合管理等特定金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:48:43.613168"
}