{
  "paper": {
    "id": 906,
    "title": "Machine Learning Analysis of Mortgage Credit Risk",
    "abstract": "In 2008, the US experienced the worst financial crisis since the Great Depression of the 1930s. The 2008 recession was fueled by poorly underwritten mortgages in which a high percentage of less-credit-worthy borrowers defaulted on their mortgage payments. Although the market has recovered from that collapse, we must avoid the pitfalls of another market meltdown. Greed and overzealous assumptions fueled that crisis and it is imperative that bank underwriters properly assess risks with the assistance of the latest technologies. In this paper, machine learning techniques are utilized to predict the approval or denial of mortgage applicants using predicted risks due to external factors. The mortgage decision is determined by a two-tier machine learning model that examines micro and macro risk exposures. In addition a comparative analysis on approved and declined credit decisions was performed using logistic regression, random forest, adaboost, and deep learning. Throughout this paper multiple models are tested with different machine learning algorithms, but time is the key driver for the final candidate model decision. The results of this study are fascinating and we believe that this technology will offer a unique perspective and add value to banking risk models to reduce mortgage default percentages.",
    "year": 2020,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "0f7c304bb9c6a0cbc68e08ce8ba9a51b",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "regression",
      "deep learning",
      "neural network",
      "random forest",
      "logistic regression",
      "Adaboost"
    ],
    "stage1_timestamp": "2025-05-15T01:56:17.608132"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on using machine learning techniques to predict mortgage credit risk and assess the approval or denial of mortgage applicants, which is directly related to managing financial risks in banking and lending. This falls under the domain of Financial Risk Management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on using machine learning techniques to predict mortgage credit risk and assess the approval or denial of mortgage applicants, which is directly related to managing financial risks in banking and lending. This falls under the domain of Financial Risk Management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:53:53.536911"
}