{
  "paper": {
    "id": 620,
    "title": "Estimating the Value-at-Risk by Temporal VAE",
    "abstract": "Estimation of the value-at-risk (VaR) of a large portfolio of assets is an important task for financial institutions. As the joint log-returns of asset prices can often be projected to a latent space of a much smaller dimension, the use of a variational autoencoder (VAE) for estimating the VaR is a natural suggestion. To ensure the bottleneck structure of autoencoders when learning sequential data, we use a temporal VAE (TempVAE) that avoids the use of an autoregressive structure for the observation variables. However, the low signal-to-noise ratio of financial data in combination with the auto-pruning property of a VAE typically makes use of a VAE prone to posterior collapse. Therefore, we use annealing of the regularization to mitigate this effect. As a result, the auto-pruning of the TempVAE works properly, which also leads to excellent estimation results for the VaR that beat classical GARCH-type, multivariate versions of GARCH and historical simulation approaches when applied to real data.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "deep learning",
    "cache_key": "ce7f36ca35cc37528ab1c18f798fa6ee",
    "relevant_keywords": [
      "machine learning",
      "unsupervised learning",
      "neural network",
      "deep learning",
      "representation learning",
      "autoencoder",
      "variational autoencoder",
      "VAE",
      "temporal VAE",
      "TempVAE"
    ],
    "stage1_timestamp": "2025-05-15T01:40:51.077080"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on estimating the value-at-risk (VaR) of a large portfolio of assets, which is a key task in financial risk management. The use of a temporal VAE (TempVAE) is specifically aimed at improving VaR estimation, a core component of risk assessment and management in financial institutions.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on estimating the value-at-risk (VaR) of a large portfolio of assets, which is a key task in financial risk management. The use of a temporal VAE (TempVAE) is specifically aimed at improving VaR estimation, a core component of risk assessment and management in financial institutions.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:02:47.136715"
}