{
  "paper": {
    "id": 1938,
    "title": "Honey Bees Mating Optimization algorithm for financial classification problems",
    "abstract": "Nature inspired methods are approaches that are used in various fields and for the solution for a number of problems. This study uses a nature inspired method, namely Honey Bees Mating Optimization, that is based on the mating behaviour of honey bees for a financial classification problem. Financial decisions are often based on classification models which are used to assign a set of observations into predefined groups. One important step towards the development of accurate financial classification models involves the selection of the appropriate independent variables ( features) which are relevant for the problem at hand. The proposed method uses for the feature selection step, the Honey Bees Mating Optimization algorithm while for the classification step, Nearest Neighbor based classifiers are used. The performance of the method is tested in a financial classification task involving credit risk assessment. The results of the proposed method are compared with the results of a particle swarm optimization algorithm, an ant colony optimization, a genetic algorithm and a tabu search algorithm. (C) 2009 Elsevier B. V. All rights reserved.",
    "year": 2010,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "0fa8b6cf1913950c5d426a5385711362",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "feature learning"
    ],
    "stage1_timestamp": "2025-05-15T02:09:14.394649"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on using the Honey Bees Mating Optimization algorithm for a financial classification task involving credit risk assessment, which is a key aspect of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on using the Honey Bees Mating Optimization algorithm for a financial classification task involving credit risk assessment, which is a key aspect of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:45:11.369749"
}