{
  "paper": {
    "id": 1190,
    "title": "Financial risk management on a neutral atom quantum processor",
    "abstract": "Machine learning models capable of handling the large data sets collected in the financial world can often become black boxes expensive to run. The quantum computing paradigm suggests new optimization techniques that, combined with classical algorithms, may deliver competitive, faster, and more interpretable models. In this paper we propose a quantum-enhanced machine learning solution for the prediction of credit rating downgrades, also known as fallen-angels forecasting in the financial risk management field. We implement this solution on a neutral atom quantum processing unit with up to 60 qubits on a real-life data set. We report performance that is competitive with the state-of-the-art random forest benchmark, whereas our model achieves better interpretability and comparable training times. We examine how to improve performance in the near term, validating our ideas with tensor-networks-based numerical simulations.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "844672833007e61bc5f215291ec77b20",
    "relevant_keywords": [
      "machine learning",
      "classification"
    ],
    "stage1_timestamp": "2025-05-15T01:59:56.321602"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on predicting credit rating downgrades (fallen-angels forecasting), which is a specific application within financial risk management. The use of quantum-enhanced machine learning for this purpose directly addresses risk assessment and mitigation in financial contexts.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on predicting credit rating downgrades (fallen-angels forecasting), which is a specific application within financial risk management. The use of quantum-enhanced machine learning for this purpose directly addresses risk assessment and mitigation in financial contexts.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:51:36.668992"
}