{
  "paper": {
    "id": 109,
    "title": "Deep Reinforcement Learning Task for Portfolio Construction",
    "abstract": "This paper covers the analysis of contemporary portfolio management techniques, as well as the development of a backtesting trading environment and an autonomous trading agent based on state-of-the-art Reinforcement Learning algorithms with different reward functions. The scientific novelty of this study relies on the development of a scalable automated trading agent that makes periodic investment decisions autonomously. Baseline strategies include UCPR (weekly rebalancing) and UBAH (buy and hold strategy) for SPDR SP 500 ETF Trust (NYSE: SPY). Backtesting Period covers the range 2017-0101-2020-03-30, characterized by the sustained growth of the US stock market in 2017.",
    "year": 2021,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "3f48ccfee673b2d8046d705e2c22168d",
    "relevant_keywords": [
      "machine learning",
      "reinforcement learning",
      "deep learning",
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T00:39:32.557112"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "The paper focuses on the development of an autonomous trading agent for portfolio construction using reinforcement learning, which is a core aspect of portfolio management. The study involves backtesting trading strategies and making periodic investment decisions, directly aligning with the objectives of portfolio management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Portfolio Management\"],\n  \"justification\": \"The paper focuses on the development of an autonomous trading agent for portfolio construction using reinforcement learning, which is a core aspect of portfolio management. The study involves backtesting trading strategies and making periodic investment decisions, directly aligning with the objectives of portfolio management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:33:28.117828"
}