{
  "paper": {
    "id": 2067,
    "title": "Efficient Mixture Design Fitting Quadratic Surface with Quantile Responses Using First-degree Polynomial",
    "abstract": "This study considers efficient mixture designs for the approximation of the response surface of a quantile regression model, which is a second degree polynomial, by a first degree polynomial in the proportions of q components. Instead of least squares estimation in the traditional regression analysis, the objective function in quantile regression models is a weighted sum of absolute deviations and the least absolute deviations (LAD) estimation technique should be used (Bassett and Koenker, 1982; Koenker and Bassett, 1978). Therefore, the standard optimal mixture designs like the D-optimal or A-optimal mixture designs for the least squared estimation are not appropriate. This study explores mixture designs that minimize the bias between the approximated 1st-degree polynomial and a 2nd-degree polynomial response surfaces by the LAD estimation. In contrast to the standard optimal mixture designs for the least squared estimation, the efficient designs might contain elementary centroid design points of degrees higher than two. An example of a portfolio with five assets is given to illustrate the proposed efficient mixture designs in determining the marginal contribution of risks by individual assets in the portfolio.",
    "year": 2016,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "30289353323385aa0271b6d6c5ada70e",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:02:32.879896"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是高效混合设计用于分位数回归模型，其应用示例涉及五资产组合的风险边际贡献分析，这直接关联到投资组合管理领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是高效混合设计用于分位数回归模型，其应用示例涉及五资产组合的风险边际贡献分析，这直接关联到投资组合管理领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:17:22.261279"
}