{
  "paper": {
    "id": 4127,
    "title": "Quantile cointegrating regression",
    "abstract": "Quantile regression has important applications in risk management, portfolio optimization, and asset pricing. The current paper studies estimation, inference and financial applications of quantile regression with cointegrated time series. In addition, a new cointegration model with quantile-varying coefficients is proposed. In the proposed model, the value of cointegrating coefficients may be affected by the shocks and thus may vary over the innovation quantile. The proposed model may be viewed as a stochastic cointegration model which includes the conventional cointegration model as a special case. It also provides a useful complement to cointegration models with (G)ARCH effects. Asymptotic properties of the proposed model and limiting distribution of the cointegrating regression quantiles are derived. In the presence of endogenous regressors, fully-modified quantile regression estimators and augmented quantile cointegrating regression are proposed to remove the second order bias and nuisance parameters. Regression Wald tests are constructed based on the fully modified quantile regression estimators. An empirical application to stock index data highlights the potential of the proposed method. (c) 2008 Elsevier B.V. All rights reserved.",
    "year": 2009,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "6feb3e011d7379db4836757fdefc5a2f",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:33:42.026555"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk",
      "Portfolio Management"
    ],
    "justification": "论文摘要明确提到分位数回归在风险管理和投资组合优化中有重要应用，并且论文研究了分位数回归在协整时间序列中的估计、推断和金融应用。此外，论文还提出了一个新的具有分位数变化系数的协整模型，这些内容直接关联到金融风险管理和投资组合管理领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\", \"投资组合管理\"],\n  \"justification\": \"论文摘要明确提到分位数回归在风险管理和投资组合优化中有重要应用，并且论文研究了分位数回归在协整时间序列中的估计、推断和金融应用。此外，论文还提出了一个新的具有分位数变化系数的协整模型，这些内容直接关联到金融风险管理和投资组合管理领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:34:17.049496"
}