{
  "paper": {
    "id": 802,
    "title": "Deep learning for modeling the collection rate for third-party buyers",
    "abstract": "This study evaluates a wide range of machine learning techniques such as deep learning, boosting, and support vector regression to predict the collection rate of more than 65,000 defaulted consumer credits from the telecommunications sector that were bought by a German third-party company. Weighted performance measures were defined based on the value of exposure at default for comparing collection rate models. The approach proposed in this paper is useful for a third-party company in managing the risk of a portfolio of defaulted credit that it purchases. The main finding is that one of the machine learning models we investigate, the deep learning model, performs significantly better out-of-sample than all other methods that can be used by an acquirer of defaulted credits based on weighted-performance measures. By using unweighted performance measures, deep learning and boosting perform similarly. Moreover, we find that using a training set with a larger proportion of the dataset does not improve prediction accuracy significantly when deep learning is used. The general conclusion is that deep learning is a potentially performance-enhancing tool for credit risk management. (c) 2021 International Institute of Forecasters. Published by Elsevier B.V. All rights reserved.",
    "year": 2022,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "831f3cc86ed456ffa8ce7b932c45f652",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "regression",
      "support vector machine",
      "SVM",
      "deep learning",
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T00:48:22.320733"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文研究了使用深度学习等机器学习技术预测违约信贷的回收率，并明确指出其方法有助于第三方公司管理所购买的违约信贷组合的风险。这直接涉及信用风险管理，属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"该论文研究了使用深度学习等机器学习技术预测违约信贷的回收率，并明确指出其方法有助于第三方公司管理所购买的违约信贷组合的风险。这直接涉及信用风险管理，属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:27:29.317943"
}