{
  "paper": {
    "id": 6564,
    "title": "Longitudinal Impact of Life Events on Adolescent Binge Drinking in the National Consortium on Alcohol and Neurodevelopment in Adolescence (NCANDA)",
    "abstract": "Background:Life events experienced during adolescence are associated with risk and resilience to heavy episodic drinking (HED; i.e. binge drinking). The current study builds on prior research using latent class analysis (LCA) to examine heterogeneity in patterns of adolescent life events at baseline to HED over the course of three years (4 timepoints) as part of the National Consortium on Alcohol and Neurodevelopment in Adolescence (NCANDA).Methods:Life event classes were modeled using LCA that characterized NCANDA participants based upon their responses to the Life Events Questionnaire (N = 467, age:M = 14.98,SD = 1.69, 49.7% female). These baseline latent life event classes were then compared to HED at baseline and years 1, 2 and 3 using multinomial logistic regression.Results:At baseline, the LCA characterized four classes of adolescents based on endorsement of life events: negative-relational conflict (n = 65, 13.9%), negative-financial problems (n = 49, 10.5%), low life events (n = 130, 27.8%), and positive life events (n = 223, 47.8%). Life event trajectories differed for the negative life event classes compared to the other two classes, with greater odds of HED in the negative-financial problems class at year 1.Conclusion:The four latent classes derived from the life events of NCANDA youth yielded a characterization of adolescents that could aid in understanding HED over the subsequent three years, suggesting that everyday life events may inform adolescent binge drinking.",
    "year": 2020,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "486d7ae4d6e5717ead1bcbc139408168",
    "relevant_keywords": [
      "unsupervised learning",
      "classification",
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T02:59:36.859943"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究青少年生活事件对暴饮暴食行为的影响，使用了潜在类别分析和多项逻辑回归方法，但其研究领域属于心理学和公共卫生，与金融领域无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究青少年生活事件对暴饮暴食行为的影响，使用了潜在类别分析和多项逻辑回归方法，但其研究领域属于心理学和公共卫生，与金融领域无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:27:32.748635"
}