{
  "paper": {
    "id": 1321,
    "title": "Modelling Systemic Risk in Morocco's Banking System",
    "abstract": "The Moroccan banking system suffered a significant impact due to the extreme market conditions caused by the COVID-19 outbreak, which led to an increase in non-performance loans. This, in turn, reduced the value of banks' assets and their ability to meet their obligations, implicitly raising systemic risk. In such circumstances, the collapse of one financial institution could cause a series of bankruptcies and endanger the overall state of the economy. Given the limited attention devoted to the analysis of systemic risk in the Moroccan banking system, this paper aimed to fill this gap by analyzing the Moroccan banks' systemic risk exposure and assessing their stability during the COVID-19 crisis, using Quantile Regression Neural Network (QRNN) optimized by Adam algorithm to calibrate the Conditional Value at Risk (CoVaR). This study revealed a significant increase in systemic risk during the pandemic crisis and highlights the suitability of more complex QRNN in assessing systemic risk. The findings emphasize the need for regulators to pay close attention to banks' risk exposures when implementing measures to mitigate systemic risk, such as increasing banks' capital requirements or increasing the amount of high-quality liquid assets.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "5cce7def2ede585560529eb0c5398e9c",
    "relevant_keywords": [
      "neural network",
      "deep learning",
      "representation learning",
      "backpropagation",
      "BP",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T02:01:44.692266"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on analyzing systemic risk in the Moroccan banking system using Quantile Regression Neural Network (QRNN) to calibrate Conditional Value at Risk (CoVaR), which is a key technique in financial risk management for assessing and mitigating systemic risk.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on analyzing systemic risk in the Moroccan banking system using Quantile Regression Neural Network (QRNN) to calibrate Conditional Value at Risk (CoVaR), which is a key technique in financial risk management for assessing and mitigating systemic risk.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:49:49.406436"
}