{
  "paper": {
    "id": 4659,
    "title": "A semi-deterministic ensemble strategy for imbalanced datasets (SDEID) applied to bankruptcy prediction",
    "abstract": "In the last decade, there was a rapid growth in the availability and use of credit for Brazilian companies. Until recently, the decision to grant credit was based on human trial to evaluate the risk of insolvency. Increased demand from companies for credit has led to the use of more accurate models for bankruptcy prediction. In recent years much progress has occurred in the process of drawing up a model fostered by increased competition among financial institutions, changes in the economic environment for businesses and advances in computational techniques. This article discusses and presents alternatives for some of the main problems in the preparation of models for bankruptcy prediction with the application of data mining techniques. The first problem approached is the class imbalance that may cause a poor classification performance and it is treated jointly with an ensemble strategy. The other one rely on the selection of the most significant combination of attributes, the financial variables, which have been widely studied in insolvency prediction. Finally, it is presented a case study in a real world data base of Brazilian companies.",
    "year": 2008,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "85a0fbab1674f771d34d9ab72ca5b9f0",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "ensemble strategy"
    ],
    "stage1_timestamp": "2025-05-15T02:39:27.060039"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要研究破产预测模型，通过数据挖掘技术处理类别不平衡和特征选择问题，这直接应用于信用风险评估，属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文主要研究破产预测模型，通过数据挖掘技术处理类别不平衡和特征选择问题，这直接应用于信用风险评估，属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:32:21.069582"
}