{
  "paper": {
    "id": 5944,
    "title": "Changes of individual perception in psychosocial stressors related to German reunification in 1989/1990 and cardiovascular risk factors and cardiovascular diseases in a population-based study in East Germany",
    "abstract": "Objectives: Aim was to examine the relationship between individually perceived changes in psychosocial stressors associated with German reunification and cardiovascular effects. We hypothesised that higher levels of psychosocial stress related to German reunification were associated with an increase in cardiovascular risk factors and cardiovascular diseases (CVDs). Design: Cross-sectional data from 2 cohort studies in East Germany were used: Cardiovascular Disease, Living and Ageing in Halle Study (CARLA), and Study of Health in Pomerania (SHIP). Setting: 2 populations in East Germany. Participants: CARLA study: 1779 participants, aged 45-83 years at baseline (812 women), SHIP study: 4308 participants, aged 20-79 years at baseline (2193 women). Primary and secondary outcome measures: Psychosocial stressors related to reunification were operationalised by the Reunification Stress Index (RSI; scale from 0 to 10). This index was composed of questions that were related to individually perceived changes in psychosocial stressors (occupational, financial and personal) after reunification. To examine the associations between the RSI and each stressor separately with cardiovascular risk factors and CVD, regression models were used. Results: RSI was associated with CVD in women (RR=1.15, 95% CI 1.00 to 1.33). Cardiovascular risk factors were associated with RSI for both men and women, with strongest associations between RSI and diabetes in women (RR=1.10, 95% CI 1.01 to 1.20) and depressive disorders in men (RR=1.15, 95% CI 1.07 to 2.77). The change in occupational situation related to reunification was the major contributing psychosocial stressor. We observed a strong association with CVD in women who experienced occupational deterioration after reunification (RR=4.04, 95% CI 1.21 to 13.43). Conclusions: Individually perceived deterioration of psychosocial stressors (occupational, financial and personal) related to German reunification was associated with cardiovascular risk factors and CVD. The associations were stronger for women than for men. An explanation for these findings could be that women were more often affected by unemployment after reunification. Morbidity and mortality follow-up of both cohorts could enhance the results.",
    "year": 2016,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "55c6faacb356ffe3bf1060a16d910234",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:53:03.114360"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究德国统一后个体感知的心理社会压力变化与心血管风险因素及疾病之间的关系，属于公共卫生和流行病学领域，与金融研究领域无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究德国统一后个体感知的心理社会压力变化与心血管风险因素及疾病之间的关系，属于公共卫生和流行病学领域，与金融研究领域无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:28:56.779206"
}