{
  "paper": {
    "id": 413,
    "title": "Portfolio creation using artificial neural networks and classification probabilities: a Canadian study",
    "abstract": "This study aims to verify whether using artificial neural networks (ANNs) to establish classification probabilities generates portfolios with higher excess returns than using ANNs in their traditional role of predicting portfolio returns. Our sample includes all companies listed on the Toronto Stock Exchange from 1994 to 2014 with a monthly average of 16,324 company-month observations. Results indicate that portfolios based on the classification probabilities yield mean returns ranging from 7.81 to 14.40% annually over a 16-year period and that portfolios based on both predicted returns and classification probabilities generate returns that are superior to the market index. In addition, there is evidence that ranking securities based on their probability of beating the market has some benefit.",
    "year": 2020,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "560b71ba562e2fe18b79f0fd5e9164d7",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "neural network",
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T00:43:10.525990"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "The paper focuses on using artificial neural networks to create and evaluate investment portfolios, specifically comparing different approaches to generate higher returns. This directly aligns with the field of Portfolio Management, as it involves the selection and management of investment portfolios to achieve specific financial objectives.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Portfolio Management\"],\n  \"justification\": \"The paper focuses on using artificial neural networks to create and evaluate investment portfolios, specifically comparing different approaches to generate higher returns. This directly aligns with the field of Portfolio Management, as it involves the selection and management of investment portfolios to achieve specific financial objectives.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:31:08.928717"
}