{
  "paper": {
    "id": 1155,
    "title": "Critical Firms Prediction for Stemming Contagion Risk in Networked-Loans through Graph-Based Deep Reinforcement Learning",
    "abstract": "The networked-loan is major financing support for Micro, Small and Medium-sized Enterprises (MSMEs) in some developing countries. But external shocks may weaken the financial networks' robustness; an accidental default may spread across the network and collapse the whole network. Thus, predicting the critical firms in networked-loans to stem contagion risk and prevent potential systemic financial crises is of crucial significance to the long-term health of inclusive finance and sustainable economic development. Existing approaches in the banking industry dismiss the contagion risk across loan networks and need extensive knowledge with sophisticated financial expertise. Regarding the issues, we propose a novel approach to predict critical firms for stemming contagion risk in the bank industry with deep reinforcement learning integrated with high-order graph message-passing networks. We demonstrate that our approach outperforms the state-of-the-art baselines significantly on the dataset from a large commercial bank. Moreover, we also conducted empirical studies on the real-world loan dataset for risk mitigation. The proposed approach enables financial regulators and risk managers to better track and understands contagion and systemic risk in networked-loans. The superior performance also represents a paradigm shift in addressing the modern challenges in financing support of MSMEs and sustainable economic development.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "e8b4c5519913d8661386389799968cbe",
    "relevant_keywords": [
      "machine learning",
      "reinforcement learning",
      "deep learning",
      "neural network",
      "representation learning"
    ],
    "stage1_timestamp": "2025-05-15T01:59:21.734466"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on predicting critical firms in networked-loans to stem contagion risk and prevent systemic financial crises, which is a core aspect of financial risk management. The use of deep reinforcement learning and graph-based methods is specifically aimed at mitigating contagion risk in loan networks, a key concern in risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on predicting critical firms in networked-loans to stem contagion risk and prevent systemic financial crises, which is a core aspect of financial risk management. The use of deep reinforcement learning and graph-based methods is specifically aimed at mitigating contagion risk in loan networks, a key concern in risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:51:39.961694"
}