{
  "paper": {
    "id": 2809,
    "title": "On the predictive ability of narrative disclosures in annual reports",
    "abstract": "We investigate whether narrative disclosures in 10-K and 10K-405 filings contain value-relevant information for predicting market performance. We apply text classification techniques from computer science to machine code text disclosures in a sample of 4280 filings by 1236 firms over five years. Our methodology develops a model using documents and actual performance for a training sample. This model, when applied to documents from a test set, leads to performance prediction. We find that a portfolio based on model predictions earns significantly positive size-adjusted returns, indicating that narrative disclosures contain value-relevant information. Supplementary analyses show that the text classification model captures information not contained in document-level features of clarity, tone and risk sentiment considered in prior research. However, we find that the narrative score is not providing information incremental to traditional predictors such as size, market-to-book and momentum. but rather affects investors' use of price momentum as a factor that predicts excess returns. (C) 2009 Elsevier B.V. All rights reserved.",
    "year": 2010,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "94bbaa87b9d8f731eae6cab3264cb478",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "feature representation"
    ],
    "stage1_timestamp": "2025-05-15T01:10:49.492468"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文研究了如何利用年报中的叙述性披露信息预测市场表现，并基于模型预测构建投资组合，这直接涉及投资组合管理的领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文研究了如何利用年报中的叙述性披露信息预测市场表现，并基于模型预测构建投资组合，这直接涉及投资组合管理的领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:12:27.476820"
}