{
  "paper": {
    "id": 3835,
    "title": "Planning-Phase Estimation of Construction Time for a Large Portfolio of Highway Projects",
    "abstract": "Estimation of highway project construction time prior to design development has received comparatively little focus from researchers. State transportation agencies (STAs) and their management teams need a method or tool to estimate construction time during the project planning and development phases, where STAs typically manage hundreds of projects at the program level. These programs of projects are updated periodically, which requires an estimation methodology that is efficient, less time consuming, and reliable during the phases where limited project information is available. This paper presents an approach to developing a planning-phase construction time estimation model using linear regression modeling on actual construction time and cost data from 623 highway projects completed by the Dallas District Office, Texas Department of Transportation (TxDOT). The study developed a multiple linear regression model with three project parameters that were identified as key predictors to construction time. The accuracy and reliability of the developed model were higher than those of the well-known Bromilow's time-cost (BTC) model. The model was also validated by the Mann-Whitney test of its applicability to a large group of projects. The proposed model requires less effort to develop, update, and revise with new data, which allows STAs to conduct planning-phase estimation of the construction time of a large portfolio of diverse projects effectively and efficiently. STAs would benefit from using this model in various project planning areas such as financial planning, staff planning, transportation impact mitigation, budget allocation, and project prioritization. This study also contributes to the body of knowledge with the proposed construction time estimation methodology during the planning and development phase that has been less focused. (C) 2019 American Society of Civil Engineers.",
    "year": 2019,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "9386300f98c85c6ac01ed04f870aceb4",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:21:08.328697"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是高速公路项目施工时间的估计模型，属于工程管理和规划领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是高速公路项目施工时间的估计模型，属于工程管理和规划领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:08:46.565036"
}