{
  "paper": {
    "id": 32,
    "title": "Using AI to assess corporate climate transition disclosures",
    "abstract": "Company transition plans toward a low-carbon economy are key for effective capital allocation and risk management. This paper proposes a set of 64 indicators to comprehensively assess transition plans and develops a Large Language Model-based tool to automate the assessment of company disclosures. We evaluate our tool with experts from 26 institutions, including financial regulators, investors, and non-governmental organizations. We apply the tool to the sustainability reports from carbon-intensive Climate Action 100+ companies. Our results show that companies tend to disclose more information related to target setting (talk), but less information related to the concrete implementation of strategies (walk). In addition, companies that disclose more information tend to have lower emissions. Our results highlight the need for increased scrutiny of companies' efforts and potential greenwashing risks. The complexity of transition activities presents a major challenge for comprehensive large-scale assessments. As shown in this paper, novel and flexible approaches using Large Language Models can serve as a remedy.",
    "year": 2025,
    "source": "WOS",
    "area": "financial_risk",
    "method": "LLMs",
    "cache_key": "034925fb9a5f23be83ed3cf6780ef27d",
    "relevant_keywords": [
      "Large Language Model",
      "LLM"
    ],
    "stage1_timestamp": "2025-05-15T01:45:16.408596"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用大型语言模型（LLM）评估公司向低碳经济过渡的披露信息，这直接关系到金融风险管理中的气候相关风险和潜在绿色洗牌风险。论文的研究目标和应用场景明确指向了风险管理的领域，特别是环境和社会治理（ESG）风险。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是使用大型语言模型（LLM）评估公司向低碳经济过渡的披露信息，这直接关系到金融风险管理中的气候相关风险和潜在绿色洗牌风险。论文的研究目标和应用场景明确指向了风险管理的领域，特别是环境和社会治理（ESG）风险。\"\n}\n```"
  },
  "timestamp": "2025-05-20T14:23:00.379301"
}