{
  "paper": {
    "id": 7223,
    "title": "Optimizing denominator data estimation through a multimodel approach",
    "abstract": "To assess the risk of (zoonotic) disease transmission in developing countries, decision makers generally rely on distribution estimates of animals from survey records or projections of historical enumeration results. Given the high cost of large-scale surveys, the sample size is often restricted and the accuracy of estimates is therefore low, especially when spatial high-resolution is applied. This study explores possibilities of improving the accuracy of livestock distribution maps without additional samples using spatial modelling based on regression tree forest models, developed using subsets of the Uganda 2008 Livestock Census data, and several covariates. The accuracy of these spatial models as well as the accuracy of an ensemble of a spatial model and direct estimate was compared to direct estimates and  true livestock figures based on the entire dataset. The new approach is shown to effectively increase the livestock estimate accuracy (median relative error decrease of 0.166-0.037 for total sample sizes of 80-1,600 animals, respectively). This outcome suggests that the accuracy levels obtained with direct estimates can indeed be achieved with lower sample sizes and the multimodel approach presented here, indicating a more efficient use of financial resources.",
    "year": 2014,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "3d62dc0ff032b2de58c92f3e259ef5b6",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "regression",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T03:06:35.304404"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是通过多模型方法优化发展中国家牲畜分布数据的估计，以提高疾病传播风险评估的准确性。虽然使用了机器学习技术，但其应用领域是公共卫生和农业统计，而非金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是通过多模型方法优化发展中国家牲畜分布数据的估计，以提高疾病传播风险评估的准确性。虽然使用了机器学习技术，但其应用领域是公共卫生和农业统计，而非金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:26:39.528795"
}