{
  "paper": {
    "id": 1303,
    "title": "Bitcoin Price Forecasting: An Integrated Approach Using Hybrid LSTM-ELM Models",
    "abstract": "In recent years, digital currencies have flourished on a considerable scale, and the markets of digital currencies have generated a nonnegligible impact on the whole financial system. Under this background, the accurate prediction of cryptocurrency prices could be a prerequisite for managing the risk of both cryptocurrency markets and financial systems. Considering the multiscale attributes of cryptocurrency price, we match the different machine learning algorithms to corresponding multiscale components and construct the ensemble prediction models based on machine learning and multiscale analysis. The Bitcoin price series, respectively, from 2017/11/24 to 2020/4/21 and 2020/4/22 to 2020/11/27, is selected as the training and prediction datasets. The empirical results show that the ensemble models can achieve a prediction accuracy of 95.12%, with better performance than the benchmark models, and the proposed models are robust in upward and downward market conditions. Meanwhile, the different algorithms are applicable for components with varying time scales.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "f66a366a8f1fa26ef231b981e5fdf656",
    "relevant_keywords": [
      "machine learning",
      "regression",
      "neural network",
      "deep learning",
      "long short-term memory",
      "LSTM"
    ],
    "stage1_timestamp": "2025-05-15T02:01:11.898893"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用混合LSTM-ELM模型预测比特币价格，其研究目标是准确预测加密货币价格以管理加密货币市场和金融系统的风险，这属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是使用混合LSTM-ELM模型预测比特币价格，其研究目标是准确预测加密货币价格以管理加密货币市场和金融系统的风险，这属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:49:50.882696"
}