{
  "paper": {
    "id": 688,
    "title": "Image Processing Based Implied Volatility Surface Analysis for Asset movement Forecasting",
    "abstract": "Nowadays, people are showing growing attention to the market movements. With more demand for market sentiment analysis and risk management, advanced investment tools are needed to assist the high frequency trading activities. Machine learning as a fast-growing tool provides people a new perspective to handle complex problems. Although financial data contains various information and is usually regarded as hard to concentrate into one unified dimension, our research aims to fuse the image processing method with the high frequency implied-volatility-based market sentiment analysis. In this way, our research implemented the real-time processing of the market data and proposes an innovative idea, applying the machine learning method to regress the market price using the two-dimensional discrete financial data, which is traditionally viewed as images. The proposed method shows satisfying performance in testing with tick-level S&P500 option dataset containing around 1.5 million trading record. To go further with the improvement of the economic image classification and represent the momentum factors of the implied volatility surface images, we also introduce the speed and acceleration of sequence images. Overall, we have reached 61.23% accuracy for implied volatility image classification, and 63.22% & 65.52% accuracy for financial image considering velocity and acceleration.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "6cf6e4bd1b88464ce63dea1c474da5c5",
    "relevant_keywords": [
      "machine learning",
      "classification",
      "regression",
      "neural network",
      "deep learning",
      "representation learning",
      "convolutional neural network",
      "CNN"
    ],
    "stage1_timestamp": "2025-05-15T01:53:59.362824"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Derivatives Pricing"
    ],
    "justification": "该论文的核心技术是将图像处理方法应用于高频隐含波动率市场情绪分析，并利用机器学习方法对市场价格进行回归。隐含波动率是衍生品定价中的关键因素，因此该研究主要应用于衍生品定价领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"衍生品定价\"],\n  \"justification\": \"该论文的核心技术是将图像处理方法应用于高频隐含波动率市场情绪分析，并利用机器学习方法对市场价格进行回归。隐含波动率是衍生品定价中的关键因素，因此该研究主要应用于衍生品定价领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:55:50.558992"
}