{
  "paper": {
    "id": 1498,
    "title": "Risk attitudes, risky sexual behaviours and willingness to test negative for syphilis using lottery-based financial incentives among Chinese men who have sex with men",
    "abstract": "Background Individuals with risk-loving attitudes may be more likely to participate in high-risk sex and gambling. We investigated whether a lottery-based financial incentive to have a negative syphilis test may attract Chinese men who have sex with men (MSM) who practised risky sexual behaviours. Methods In July 2018, a national online cross-sectional survey was conducted in China. We collected information on willingness to participate in a lottery-based financial incentive where men were eligible if they tested negative for syphilis, and the minimum prize that would attract them to participate. We used a validated risk attitude scale which asked about the willingness to take risks in six domains, ranging from 0 (avoids taking risk) to 10 (fully prepared to take risks). To avoid multicollinearity, we used principal components analysis to create a 'risk attitude index'. Bivariable and multivariable logistic regression explored factors associated with willingness to test negative for syphilis. Results 699 MSM enrolled with a median age of 26 years (IQR: 23-30). 70% self-identified as gay and 52% reported ever testing for syphilis. 64% stated they were likely or very likely to test for syphilis linked with a lottery-based incentive. The median desired amount for the lottery had an expected value of yen 10 (US$1.50, IQR: yen 5- yen 30). Men who had greater odds of willingness to participate in the lottery-based incentive were those scoring highest on the risk attitude index (adjusted OR (AOR) 2.6, 95% CI 1.5 to 4.3), those reporting more than one sexual partner in the last 3 months (AOR 1.7, 95% CI 1.2 to 2.4), those who had not used condoms during their last sex (AOR 1.5, 95% CI 1.0 to 2.2) and those who ever had group sex (AOR 1.5, 95% CI 1.0 to 2.2). Conclusion Chinese MSM with higher risk attitudes and who reported riskier sexual behaviours indicated greater interest in the concept of a lottery-based incentive for syphilis testing. A lottery-based incentive may be a promising strategy for promoting condom use among risk-loving men.",
    "year": 2020,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "635408de8a74d613591def8367d5ebb0",
    "relevant_keywords": [
      "principal components analysis"
    ],
    "stage1_timestamp": "2025-05-15T02:03:39.817167"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是通过彩票式财务激励来促进高风险性行为人群进行梅毒检测，虽然涉及风险态度和财务激励，但其核心应用领域是公共卫生而非金融研究。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是通过彩票式财务激励来促进高风险性行为人群进行梅毒检测，虽然涉及风险态度和财务激励，但其核心应用领域是公共卫生而非金融研究。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:48:41.989489"
}