{
  "paper": {
    "id": 1388,
    "title": "Identifying Customer-oriented Key Aspects of Perception with Focus on Longitudinal Vehicle Dynamics",
    "abstract": "Performance of the vehicle's longitudinal dynamics essentially determines the character and the perception of a vehicle by the customer. To place a vehicle at a specific niche in the market or the product portfolio, it is necessary to know the relations between the variable parameters of the power train and their perception by the user. Therefore, as a necessary basis, this study deals with the identification of customer-oriented key aspects of perception with focus on longitudinal vehicle dynamics. For this purpose, a group of subjects took part in a study, where they drove selected cars implementing a variety of different vehicle concepts. Being interviewed using a repertory grid technique, subjects were assisted in structuring and verbalizing their subjective perception. Subjective data for different aspects of the vehicle's longitudinal dynamics were collected by standardized questionnaires. With the help of recorded driving dynamics data different driver types were identified. The influence of driver type on subjective perception was investigated. These aspects of perception could be described using a two dimensional structure identified by principal components analysis.",
    "year": 2013,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "6f178c0a123a8d3d22f6e596ea20e551",
    "relevant_keywords": [
      "principal components analysis"
    ],
    "stage1_timestamp": "2025-05-15T00:54:56.558632"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究车辆纵向动力学的客户感知关键因素，涉及驾驶体验和用户感知分析，与金融领域的衍生品定价、金融风险管理或投资组合管理无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究车辆纵向动力学的客户感知关键因素，涉及驾驶体验和用户感知分析，与金融领域的衍生品定价、金融风险管理或投资组合管理无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:21:13.670534"
}