{
  "paper": {
    "id": 841,
    "title": "QUANTITATIVE INVESTMENT DECISIONS BASED ON MACHINE LEARNING AND INVESTOR ATTENTION ANALYSIS",
    "abstract": "According to the trading rules and financial data structure of the stock index futures market, and considering the impact of major emergencies, we intend to build a quantitative investment decision-making model based on machine learning. We first adopt the Complete Ensemble Empirical Mode Decomposition with Adaptive Noise (CEEMDAN) signal decomposition technology to separate the short-term noise, cycle transformation and long-term trend from the original series, and use the CSI 500 Baidu index series to reflect the investors' attention, which provides data support for establishing a more effective forecasting model. Then, the CEEMDANBP neural network model is designed based on the obtained effective information of low -frequency trend series, investor attention index and CSI 500 stock index futures market transaction data. Finally, an Attention-based Dual Thrust quantitative trading strategy is proposed and optimized. The optimized Attention-based Dual Thrust strategy solves the core problem of breakout interval determination, effectively avoids the risk of subjective selection, and can meet investors' different risk preferences. The quantitative investment decision-making model based on CEEMDAN-BP neural network utilizes the advantages of different algorithms, avoids some defects of a single algorithm, and can make corresponding adjustments according to changes in investors' attention and the occurrence of emergencies. The results show that considering investor attention can not only improve the predictive ability of the model, but also reduce the cognitive bias of the market, effectively control risks and obtain higher returns.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "9dfbc0594340ea2f17d99f404eff2d2d",
    "relevant_keywords": [
      "machine learning",
      "neural network",
      "backpropagation",
      "BP",
      "attention mechanism"
    ],
    "stage1_timestamp": "2025-05-15T01:55:41.606645"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是构建一个基于机器学习的定量投资决策模型，用于优化交易策略并提高投资回报，这直接属于投资组合管理的范畴。论文中提到的交易策略优化、风险控制和收益提升都是投资组合管理的关键方面。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是构建一个基于机器学习的定量投资决策模型，用于优化交易策略并提高投资回报，这直接属于投资组合管理的范畴。论文中提到的交易策略优化、风险控制和收益提升都是投资组合管理的关键方面。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:54:16.819672"
}