{
  "paper": {
    "id": 321,
    "title": "Developing an SVM based risk hedging prediction model for construction material suppliers",
    "abstract": "Construction material suppliers are usually exposed to financial risks as a consequence of a high debt capital structure and the nature of the material import business. There is demand for a tool that is able to predict whether such a material supplier, based on its financial status, should use derivatives to hedge financial risks. The research objective is to develop a prediction model using the Support Vector Machine (SVM) to determine whether employing risk hedging based on derivatives usage would be beneficial. The scope of this research limits the database to 640 financial statements published over the last 5 years from 32 listed construction material suppliers. A total of 10 input determinants were identified and verified from the literature review, t-test results, and collinearity diagnosis. Using data trimming and normalization, these 640 sets were downsized to 520 sets which contained 248 effective and 272 ineffective risk-hedging sets. The SVM prediction model, based on the kernel radial basis function and normalized data, yields a prediction accuracy rate of 80.65%. The evaluation, using logistics and small sets of data, shows the validation and practicality of this model. This research concludes that 10 financial determinates are proven candidates for financial risk hedging. From the viewpoint of derivatives usage and the proposed SVM prediction model it appears feasible for construction material suppliers to apply this model. (C) 2010 Elsevier B.V. All rights reserved.",
    "year": 2010,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "da59829f58fe3ae71a3ed95bf9021a07",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM"
    ],
    "stage1_timestamp": "2025-05-15T01:49:40.967339"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用支持向量机（SVM）开发一个预测模型，以帮助建筑材料供应商决定是否使用衍生品进行金融风险对冲。这直接涉及金融风险管理领域，特别是关于风险对冲策略的决策支持。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是使用支持向量机（SVM）开发一个预测模型，以帮助建筑材料供应商决定是否使用衍生品进行金融风险对冲。这直接涉及金融风险管理领域，特别是关于风险对冲策略的决策支持。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:59:04.797684"
}