{
  "paper": {
    "id": 603,
    "title": "A hybrid approach for portfolio selection with higher-order moments: Empirical evidence from Shanghai Stock Exchange",
    "abstract": "Skewness and kurtosis, the third and fourth order moments, are statistics to summarize the shape of a distribution function. Recent studies show that investors would take these higher-order moments into consideration to make a profitable investment decision. Unfortunately, due to the difficulties in solving the multi-objective problem with higher-order moments, the literature on portfolio selection problem with higher-order moments is few. This paper proposes a new hybrid approach to solve the portfolio selection problem with skewness and kurtosis, which includes not only the multi-objective optimization but also the data-driven asset selection and return prediction, where the techniques of two-stage clustering, radial basis function neural network and genetic algorithm are employed. With the historical data from Shanghai stock exchange, we find that the out-of-sample performance of our model with higher-order moments is significantly better than that of traditional mean-variance model and verify the robustness of our hybrid algorithm. (C) 2019 Elsevier Ltd. All rights reserved.",
    "year": 2020,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "59dcd9ae7b2d307b18085ecefd8e4f69",
    "relevant_keywords": [
      "clustering",
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T00:45:39.098094"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是提出一种新的混合方法来处理投资组合选择问题，考虑了高阶矩（偏度和峰度），并通过实证数据验证了其优于传统的均值-方差模型。这明确属于投资组合管理领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是提出一种新的混合方法来处理投资组合选择问题，考虑了高阶矩（偏度和峰度），并通过实证数据验证了其优于传统的均值-方差模型。这明确属于投资组合管理领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:29:27.376858"
}