{
  "paper": {
    "id": 1,
    "title": "Prediction based mean-value-at-risk portfolio optimization using machine learning regression algorithms for multi-national stock markets",
    "abstract": "The future performance of stock markets is the most crucial factor in portfolio creation. As machine learning technique is advancing, new possibilities have opened up for incorporating prediction concepts into portfolio selection. A hybrid approach that constitutes machine learning algorithms for stock return prediction and a mean-VaR (value-at-risk) model for portfolio selection is illustrated in this paper as a unique portfolio construction technique. Machine learning regression models such as Random Forest, Extreme Gradient Boosting (XGBoost), Adaptive Boosting (AdaBoost), Support Vector Machine Regression (SVR), k-Nearest Neighbors (KNN), and Artificial Neural Network (ANN) are adopted to forecast stock values for the next period. The stocks with greater prospective returns are chosen in the first stage of this affection. Further, the mean-VaR portfolio optimization model is employed for portfolio selection in the second stage. The monthly datasets of the Bombay Stock Exchange (BSE), India, Tokyo Stock Exchange, Japan, and Shanghai Stock Exchange, China, are used as the research sample, and the findings show that the mean-VaR model with AdaBoost prediction outperforms other models.",
    "year": 2023,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "6abc178c9124539db614f1cae9972e35",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "regression",
      "support vector machine",
      "SVM",
      "decision tree",
      "neural network",
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T00:38:16.191875"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management",
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是结合机器学习回归算法和均值-VaR模型进行投资组合优化，这直接涉及投资组合管理领域。同时，VaR（Value-at-Risk）是金融风险管理中常用的风险度量工具，因此也属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\", \"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是结合机器学习回归算法和均值-VaR模型进行投资组合优化，这直接涉及投资组合管理领域。同时，VaR（Value-at-Risk）是金融风险管理中常用的风险度量工具，因此也属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:34:29.719111"
}