{
  "paper": {
    "id": 7743,
    "title": "Investigating Causes of Disputes Resulting in Litigation in Airport Development Projects in the United States Using Graph-Based Techniques",
    "abstract": "Airports represent a crucial a sector of the US infrastructure, but they were documented to have scored a D+. To mitigate this, governmental authorities have issued initiatives to update the airport infrastructure. With an expected critical junction for a major transformation in the airport sector, it is anticipated that airport projects will increase. This shall result in an escalation in the number of disputes. Previous research analyzed dispute concerns within the construction sector, but none tackled the perspective of airport projects. Accordingly, the goal of this study is to investigate the leading causes of disputes in litigation within US airport projects through data-driven techniques. To achieve this goal, a three-step methodology is adopted, including (1) collecting a comprehensive list of federal and state litigation cases to map the data and identify the causes of disputes; (2) clustering and visualizing the data using k-means and network analysis (NA), respectively; and (3) determining the key associations emanating from the dispute clusters through association rule analysis (ARA). The outcomes of this research revealed a total of 23 dispute causes clustered across four groups. Results of the NA indicated that the most common dispute causes are those involved with ambiguity in contractual interpretation, incurred damages, safety issues, and negligence or lack to duty of care. ARA identified several key associations and risk themes related to (1) financial assurance and operational performance: (2) contractual compliance and execution; (3) business affiliation, methods, and inclusion; (4) integrity and misconduct; (5) regulatory hurdles and area effects; and (6) collaboration and teamwork challenges. By identifying these associations and causes of disputes, airport stakeholders can implement early proactive measures that aim to mitigate dispute risks experienced. Ultimately, this study is of value to stakeholders concerned with the overall support and success of dispute management procedures in US airport projects.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "a7fb29e54a79e91d17fb7fe66b0a3b2b",
    "relevant_keywords": [
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T03:11:38.551596"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究机场建设项目中的争议原因，并采用数据驱动技术（如k-means聚类、网络分析和关联规则分析）来分析争议原因。虽然提到了金融保证和操作性能等与金融相关的术语，但论文的核心技术并未应用于衍生品定价、金融风险管理或投资组合管理等金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究机场建设项目中的争议原因，并采用数据驱动技术（如k-means聚类、网络分析和关联规则分析）来分析争议原因。虽然提到了金融保证和操作性能等与金融相关的术语，但论文的核心技术并未应用于衍生品定价、金融风险管理或投资组合管理等金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:26:13.294581"
}