{
  "paper": {
    "id": 724,
    "title": "Risk Measurement of the Financial Credit Industry Driven by Data: Based on DAE-LSTM Deep Learning Algorithm",
    "abstract": "The risk measurement of the financial credit industry is an important research issue in the field of financial risk assessment. The design of a financial credit risk measurement algorithm can help investors avoid greater risks and obtain higher returns, so as to promote the benign development of financial credit industry. Based on the combined deep learning algorithm, this paper studies the risk measurement of financial and credit industry and proposes a fusion algorithm of deep auto-encoder (DAE) and long short-term memory (LSTM) network. The algorithm recombines the value of fixed features by using the unsupervised mechanism of DAE and extracts non-fixed features for measurement combined with the memory characteristics of LSTM network. The experimental results show that, compared with single generalized regression neural network and LSTM network, the average accuracy of DAE-LSTM algorithm is improved by about 6.49% and 3.25%, respectively, which has a better application effect in credit risk measurement.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "6cadbc3df8c86a34f058e571613cc7a3",
    "relevant_keywords": [
      "machine learning",
      "unsupervised learning",
      "deep learning",
      "neural network",
      "long short-term memory",
      "LSTM",
      "autoencoder",
      "denoising autoencoder",
      "feature learning",
      "feature representation",
      "representation learning"
    ],
    "stage1_timestamp": "2025-05-15T01:54:34.000805"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心研究内容是使用DAE-LSTM深度学习算法进行金融信用行业的风险测量，这直接属于金融风险管理的范畴。论文明确提到该算法用于信用风险测量，帮助投资者规避风险，促进金融信用行业的良性发展。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心研究内容是使用DAE-LSTM深度学习算法进行金融信用行业的风险测量，这直接属于金融风险管理的范畴。论文明确提到该算法用于信用风险测量，帮助投资者规避风险，促进金融信用行业的良性发展。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:55:27.306957"
}