{
  "paper": {
    "id": 2294,
    "title": "A Hybrid Forecasting Model for Nonstationary and Nonlinear Time Series in the Stochastic Process of CO2 Emission Trading Price Fluctuation",
    "abstract": "Predicting CO(2)emission prices is an important and challenging task for policy makers and market participants, as carbon prices follow a stochastic process of complex time series with nonstationary and nonlinear characteristics. Existing literature has focused on highly precise point forecasting, but it cannot correctly solve the uncertainties related to carbon price datasets in most cases. This study aims to develop a hybrid forecasting model to estimate in advance the maximum or minimum loss in the stochastic process of CO(2)emission trading price fluctuation. This model can granulate raw data into fuzzy-information granular components with minimum (Low), average (R), and maximum (Up) values as changing space-description parameters. Furthermore, it can forecast carbon prices' changing space with Low,R, and Up as inputs to support a vector regression. This method's feasibility and effectiveness is examined using empirical experiments on European Union allowances' spot and futures prices under the European Union's Emissions Trading Scheme. The proposed FIG-SVM model exhibits fewer errors and superior performance than ARIMA, ARFIMA, and Markov-switching methods. This study provides several important implications for investors and risk managers involved in trading carbon financial products.",
    "year": 2020,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "d8edfb0a521990ecb9b63242d1cf7b84",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "regression",
      "support vector machine",
      "SVM"
    ],
    "stage1_timestamp": "2025-05-15T02:13:31.862272"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是开发一个混合预测模型，用于估计CO2排放交易价格波动的随机过程中的最大或最小损失，这直接关联到金融风险管理中的风险预测和评估。论文还提到该方法对投资者和风险管理者在交易碳金融产品时具有重要启示，进一步确认了其在金融风险管理领域的应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是开发一个混合预测模型，用于估计CO2排放交易价格波动的随机过程中的最大或最小损失，这直接关联到金融风险管理中的风险预测和评估。论文还提到该方法对投资者和风险管理者在交易碳金融产品时具有重要启示，进一步确认了其在金融风险管理领域的应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:43:19.954330"
}