{
  "paper": {
    "id": 1261,
    "title": "Applying machine learning methods to psychosocial screening data to improve identification of prenatal depression: Implications for clinical practice and research",
    "abstract": "We utilized machine learning (ML) methods on data from the PROMOTE, a novel psychosocial screening tool, to quantify risk for prenatal depression for individual patients and identify contributing factors that impart greater risk for depression. Random forest algorithms were used to predict likelihood for being at high risk for prenatal depression (Edinburgh Postnatal Depression Scale; EPDS >= 13 and/or positive self-injury item) using data from 1715 patients who completed the PROMOTE. Performance matrices were calculated to assess the ability of the PROMOTE to accurately classify patients. Probability for depression was calculated for individual patients. Finally, recursive feature elimination was used to evaluate the importance of each PROMOTE item in the classification of depression risk. PROMOTE data were successfully used to predict depression with acceptable performance matrices (accuracy = 0.80; sensitivity = 0.75; specificity = 0.81; positive predictive value = 0.79; negative predictive value = 0.97). Perceived stress, emotional problems, family support, age, major life events, partner support, unplanned pregnancy, current employment, lifetime abuse, and financial state were the most important PROMOTE items in the classification of depression risk. Results affirm the value of the PROMOTE as a psychosocial screening tool for prenatal depression and the benefit of using it in conjunction with ML methods. Using such methods can help detect underreported outcomes and identify what in patients' lives makes them more vulnerable, thus paving the way for effective individually tailored precision medicine.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "6de5e8abd41ea2127a02b718e2e2044e",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "decision tree",
      "feature learning"
    ],
    "stage1_timestamp": "2025-05-15T02:00:30.686166"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究应用机器学习方法预测产前抑郁症风险，属于医疗健康领域，与金融研究领域无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究应用机器学习方法预测产前抑郁症风险，属于医疗健康领域，与金融研究领域无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:50:33.369581"
}