{
  "paper": {
    "id": 4611,
    "title": "Estimation of Expected Shortfall Using Quantile Regression: A Comparison Study",
    "abstract": "Expected Shortfall (ES) is one of the most heavily used measures of financial risk. It is defined as a scaled integral of the quantile of the profit-and-loss distribution up to a certainly confidence level. As such, quantile regression (QR) and the closely related expectile regression (ER) methods are natural techniques for estimating ES. In this paper, we survey QR and ER based estimators of ES and introduce several novel variants. We compare the performance of these methods through simulation and through a data analysis based on four major US market indices: the S&P 500 Index, the Russell 2000 Index, the Dow Jones Industrial Average, and the NASDAQ Composite Index. Our results suggest that QR and ER methods often work better than other, more standard, approaches.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "7af2aafe6c3ab114cf7959e657ff2459",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:38:56.459933"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on estimating Expected Shortfall (ES), a key measure in financial risk management, using quantile regression methods. The study compares these methods through simulations and data analysis of major US market indices, which is directly related to assessing and managing financial risk.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on estimating Expected Shortfall (ES), a key measure in financial risk management, using quantile regression methods. The study compares these methods through simulations and data analysis of major US market indices, which is directly related to assessing and managing financial risk.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:32:21.931886"
}