{
  "paper": {
    "id": 810,
    "title": "Soft computing based imputation and hybrid data and text mining: The case of predicting the severity of phishing alerts",
    "abstract": "In this paper, we employ a novel two-stage soft computing approach for data imputation to assess the severity of phishing attacks. The imputation method involves K-means algorithm and multilayer perceptron (MLP) working in tandem. The hybrid is applied to replace the missing values of financial data which is used for predicting the severity of phishing attacks in financial firms. After imputing the missing values, we mine the financial data related to the firms along with the structured form of the textual data using multilayer perceptron (MLP), probabilistic neural network (PNN) and decision trees (DT) separately. Of particular significance is the overall classification accuracy of 81.80%, 82.58%, and 82.19% obtained using MLP, PNN, and DT respectively. It is observed that the present results outperform those of prior research. The overall classification accuracies for the three risk levels of phishing attacks using the classifiers MLP, PNN. and DT are also superior. (C) 2012 Elsevier Ltd. All rights reserved.",
    "year": 2012,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "4d7c7b82b5afc06940b06bc9f00c9492",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "decision tree",
      "clustering",
      "neural network",
      "deep learning",
      "backpropagation",
      "BP",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T01:55:08.122856"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用软计算和混合数据挖掘方法来预测金融公司中钓鱼攻击的严重程度，这直接关系到金融风险管理中的操作风险识别和评估。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是使用软计算和混合数据挖掘方法来预测金融公司中钓鱼攻击的严重程度，这直接关系到金融风险管理中的操作风险识别和评估。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:54:37.646416"
}