{
  "paper": {
    "id": 36,
    "title": "Decision-making for financial trading: A fusion approach of machine learning and portfolio selection",
    "abstract": "Forecasting stock returns is an exacting prospect in the context of financial time series. This study proposes a unique decision-making model for day trading investments on the stock market. In this regard, the model was developed using a fusion approach of a classifier based on machine learning, with the support vector machine (SVM) method, and the mean-variance (MV) method for portfolio selection. The model's experimental evaluation was based on assets from the Sao Paulo Stock Exchange Index (Ibovespa). Monthly rolling windows were used to choose the best-performing parameter sets (the in sample phase) and testing (the out-of-sample phase). The monthly windows were composed of daily rolling windows, with new training of the classifying algorithm and portfolio optimization. A total of 81 parameter arrangements were formulated. To compare the proposed model's performance, two other models were suggested: (i) SVM +1/N, which maintained the process of classifying the trends of the assets that reached a certain target of gain and which invested equally in all assets that had positive signals in their classifications, and (ii) Random +MV, which also maintained the selection of those assets with a tendency to reach a certain target of gain, but where the selection was randomly defined. Then, the portfolio's composition was determined using the MV method. Together, the alternative models registered 36 parameter variations. In addition to these two models, the results were also compared with the lbovespa's performance. The experiments were formulated using historical data for 3716 trading days for the out-of-sample analysis. Simulations were conducted without including transaction costs and also with the inclusion of a proportion of such costs. We specifically analyzed the effect of brokerage costs on buying and selling stocks on the Brazilian market. This study also evaluated the classifier's performance, portfolios' cardinality, and models' returns and risks. The proposed main model showed significant results, although demand for trading value can be a limiting factor for its implementation. Nonetheless, this study extends the theoretical application of machine learning and offers a potentially practical approach to anticipating stock prices. (C) 2018 Elsevier Ltd. All rights reserved.",
    "year": 2019,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "8906d459eeb4b06551e4f39e5d066d68",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM"
    ],
    "stage1_timestamp": "2025-05-15T00:38:16.314821"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是结合机器学习分类器（SVM）和均值-方差方法（MV）进行投资组合选择和股票交易决策，主要应用于投资组合管理领域。论文详细描述了如何优化投资组合的构成，并比较了不同模型在风险和回报方面的表现，这些都是投资组合管理的典型研究内容。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是结合机器学习分类器（SVM）和均值-方差方法（MV）进行投资组合选择和股票交易决策，主要应用于投资组合管理领域。论文详细描述了如何优化投资组合的构成，并比较了不同模型在风险和回报方面的表现，这些都是投资组合管理的典型研究内容。\"\n}\n```"
  },
  "timestamp": "2025-05-20T14:23:36.319710"
}