{
  "paper": {
    "id": 3964,
    "title": "Estimation of value-at-risk by Lp quantile regression",
    "abstract": "Exploring more accurate estimates of financial value at risk (VaR) has always been an important issue in applied statistics. To this end either quantile or expectile regression methods are widely employed at present, but an accumulating body of research indicates that L-p quantile regression outweighs both quantile and expectile regression in many aspects. In view of this, the paper extends L-p quantile regression to a general classical nonlinear conditional autoregressive model and proposes a new model called the conditional L-p quantile nonlinear autoregressive regression model (CAR-L-p-quantile model for short). Limit theorems for regression estimators are proved in mild conditions, and algorithms are provided for obtaining parameter estimates and the optimal value of p. Simulation study of estimation's quality is given. Then, a CLVaR method calculating VaR based on the CAR-L-p-quantile model is elaborated. Finally, a real data analysis is conducted to illustrate virtues of our proposed methods.",
    "year": 2025,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "f0afb61e78b19b154934fcce66cf7b44",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:31:58.576571"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on improving the estimation of Value at Risk (VaR), which is a key metric in financial risk management. The proposed CAR-L-p-quantile model and CLVaR method are specifically designed for more accurate VaR calculations, directly addressing financial risk assessment needs.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on improving the estimation of Value at Risk (VaR), which is a key metric in financial risk management. The proposed CAR-L-p-quantile model and CLVaR method are specifically designed for more accurate VaR calculations, directly addressing financial risk assessment needs.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:34:43.648544"
}