{
  "paper": {
    "id": 921,
    "title": "First-Gen Lens: Assessing Mental Health of First-Generation Students across Their First Year at College Using Mobile Sensing",
    "abstract": "The transition from high school to college is a taxing time for young adults. New students arriving on campus navigate a myriad of challenges centered around adapting to new living situations, financial needs, academic pressures and social demands. First-year students need to gain new skills and strategies to cope with these new demands in order to make good decisions, ease their transition to independent living and ultimately succeed. In general, first-generation students are less prepared when they enter college in comparison to non-first-generation students. This presents additional challenges for first-generation students to overcome and be successful during their college years. We study first-year students through the lens of mobile phone sensing across their first year at college, including all academic terms and breaks. We collect longitudinal mobile sensing data for N=180 first-year college students, where 27 of the students are first-generation, representing 15% of the study cohort and representative of the number of first-generation students admitted each year at the study institution, Dartmouth College. We discuss risk factors, behavioral patterns and mental health of first-generation and non-first-generation students. We propose a deep learning model that accurately predicts the mental health of first-generation students by taking into account important distinguishing behavioral factors of first-generation students. Our study, which uses the StudentLife app, offers data-informed insights that could be used to identify struggling students and provide new forms of phone-based interventions with the goal of keeping students on track.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "deep learning",
    "cache_key": "1d590719af2ad979d0a232dab00f26d7",
    "relevant_keywords": [
      "deep learning",
      "neural network",
      "classification"
    ],
    "stage1_timestamp": "2025-05-15T01:44:35.367624"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究使用移动感知和深度学习模型来评估大学生的心理健康状况，特别是第一代大学生的心理健康。虽然涉及数据分析和预测模型，但其应用领域是心理健康和教育支持，与金融研究领域无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究使用移动感知和深度学习模型来评估大学生的心理健康状况，特别是第一代大学生的心理健康。虽然涉及数据分析和预测模型，但其应用领域是心理健康和教育支持，与金融研究领域无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:02:00.085737"
}