{
  "paper": {
    "id": 3274,
    "title": "Do crude oil futures still fuel portfolio performance?",
    "abstract": "Motivated by significant changes in the dynamics of crude oil markets, we revisit the question of whether crude oil futures are a valuable addition to typical stock and bond portfolios. To answer this question, we use a mean-variance framework with established heuristic and classic weighting schemes and, in addition, derive optimal asset weights based on forward-looking estimates of expected returns (via univariate forecast combinations and multivariate LASSO regressions) and covariances (via DCC-GARCH and GO-GARCH models). We find that crude oil futures tend to be of limited benefit for investors. In recent data, their optimal weights are very low and they typically do not enhance out-of-sample portfolio performance. These findings hold in a variety of robustness checks with respect to different datasets, estimation windows, regression specifications, GARCH models, and transaction costs.",
    "year": 2021,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "4ee969e78497526691817e07bc0ef462",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:15:26.157478"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "The paper focuses on evaluating the performance of crude oil futures in stock and bond portfolios using mean-variance framework and various weighting schemes, which is a core topic in portfolio management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Portfolio Management\"],\n  \"justification\": \"The paper focuses on evaluating the performance of crude oil futures in stock and bond portfolios using mean-variance framework and various weighting schemes, which is a core topic in portfolio management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:10:14.982270"
}