{
  "paper": {
    "id": 150,
    "title": "Machine Learning and Portfolio Optimization",
    "abstract": "The portfolio optimization model has limited impact in practice because of estimation issues when applied to real data. To address this, we adapt two machine learning methods, regularization and cross-validation, for portfolio optimization. First, we introduce performance-based regularization (PBR), where the idea is to constrain the sample variances of the estimated portfolio risk and return, which steers the solution toward one associated with less estimation error in the performance. We consider PBR for both mean-variance and mean-conditional value-at-risk (CVaR) problems. For the mean-variance problem, PBR introduces a quartic polynomial constraint, for which we make two convex approximations: one based on rank-1 approximation and another based on a convex quadratic approximation. The rank-1 approximation PBR adds a bias to the optimal allocation, and the convex quadratic approximation PBR shrinks the sample covariance matrix. For the mean-CVaR problem, the PBR model is a combinatorial optimization problem, but we prove its convex relaxation, a quadratically constrained quadratic program, is essentially tight. We show that the PBR models can be cast as robust optimization problems with novel uncertainty sets and establish asymptotic optimality of both sample average approximation (SAA) and PBR solutions and the corresponding efficient frontiers. To calibrate the right-hand sides of the PBR constraints, we develop new, performance-based k-fold cross-validation algorithms. Using these algorithms, we carry out an extensive empirical investigation of PBR against SAA, as well as L1 and L2 regularizations and the equally weighted portfolio. We find that PBR dominates all other benchmarks for two out of three Fama-French data sets.",
    "year": 2018,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "653412c0b0f04e5971b7d63ac2f53328",
    "relevant_keywords": [
      "machine learning",
      "regularization"
    ],
    "stage1_timestamp": "2025-05-15T00:40:02.070500"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是使用机器学习的正则化和交叉验证方法来优化投资组合，特别是针对均值-方差和均值-CVaR问题。这些内容直接关联到投资组合管理的实践和研究。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是使用机器学习的正则化和交叉验证方法来优化投资组合，特别是针对均值-方差和均值-CVaR问题。这些内容直接关联到投资组合管理的实践和研究。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:33:19.766547"
}