{
  "paper": {
    "id": 634,
    "title": "A Novel Risk Control Method for Commercial Bank",
    "abstract": "On the basis of depth study of commercial bank credit risk control model literature, this paper introduced the concepts of credit risk and credit risk control. We research the main influencing factors of commercial bank credit risk control scientifically by artificial neural network theory, and then set a commercial bank credit risk control index system which contains 3 levels of 27 indexes. Improved BP Neural Networks is selected as the commercial bank credit risk control model on the basis of comparison among representative models. Finally, MATLAB software is used for empirical analysis with 144 companies' financial data. The results show that the discriminate accuracy rate of this model is higher than the standard BP neural network and Logistic regression model, which proves that this model could effectively control the credit risk of commercial banks corporate customers. The results of this research provides a useful method for the commercial bank credit risk control and has a certain reference.",
    "year": 2016,
    "source": "WOS",
    "area": "financial_risk",
    "method": "deep learning",
    "cache_key": "1e65daf3c6e300d3e434de1a911aaa43",
    "relevant_keywords": [
      "neural network",
      "backpropagation",
      "BP"
    ],
    "stage1_timestamp": "2025-05-15T01:40:51.105590"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on developing a credit risk control model for commercial banks using neural networks, which is a direct application in the field of financial risk management, specifically addressing credit risk.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on developing a credit risk control model for commercial banks using neural networks, which is a direct application in the field of financial risk management, specifically addressing credit risk.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:02:29.709702"
}