{
  "paper": {
    "id": 193,
    "title": "Application of Data Mining Combined with Fuzzy Multicriteria Decision-Making in Credit Risk Assessment from Legal Service Companies",
    "abstract": "The purpose is to avert the systematic financial risks from the Internet financial bubble and improve the efficiency of legal service companies' credit risk assessment ability. Firstly, this study analyzes the commonly used classification model, Support Vector Machine (SVM), and linear regression model, Logistic model, and then puts forward the integrated SVM-Logistic + Fuzzy Multicriteria Decision-Making (FMCDM) to evaluate and analyze the credit risk level of listed companies. In the proposed integrated model, the SVM model classifies the data sample from listed companies, and the Logistic model is used for regression analysis on the credit risk assessment. Based on the credit risk indexes and weight uncertain factors of sample companies, FMCDM based on fuzzy set is applied to obtain the evaluation indexes. Then, the Analytic Hierarchy Process (AHP) is used to obtain the weight of key indexes. Finally, the fit analysis is carried out according to the existing risk status of the sample company and the risk status results of the proposed integrated model. The results show that the integrated SVM-Logistic model is complementary and has high intensive evaluation. According to the fitness value obtained by FMCDM, the company's credit risk status can be accurately evaluated, and the intermediate threshold of corporate credit default risk measurement is 0.56152; if Fit is lower than the threshold, the company's credit is low, and if Fit is higher than the threshold, the company's credit is high. Therefore, the data mining technology based on integrated SVM-Logistic model + FMCDM has high precision and feasible application in the credit risk assessment from legal service companies. This study creates a new method model for legal service companies in the field of corporate credit risk assessment and can provide references and ideas for corporate credit risk assessment.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "fcde1c742ace64d8ddf88ca519849ca6",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "regression",
      "support vector machine",
      "SVM"
    ],
    "stage1_timestamp": "2025-05-15T01:47:53.027331"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on developing an integrated model (SVM-Logistic + FMCDM) for credit risk assessment in legal service companies, which is a specific application within the domain of financial risk management, particularly in assessing and mitigating credit risk.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on developing an integrated model (SVM-Logistic + FMCDM) for credit risk assessment in legal service companies, which is a specific application within the domain of financial risk management, particularly in assessing and mitigating credit risk.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:00:20.358160"
}