{
  "paper": {
    "id": 258,
    "title": "Ownership of Cash Value Life Insurance among Rural Households: Utilization of Machine Learning Algorithms to Find Predictors",
    "abstract": "This study examines the determinants of life insurance ownership with a focus on rural areas and farming households in the United States. Utilizing data from online surveys conducted in 2019 and 2021, this paper explores how psychological factors, financial knowledge, and household characteristics influence life insurance ownership. Traditional indicators like wealth, income, and age were evaluated alongside less frequently discussed variables such as farm loans and rural residency. Machine learning techniques, including neural networks, Support Vector Machine modeling, Gradient Boosting, and logistic regression, were employed to identify the most robust predictors of life insurance demand. The findings reveal that farming-associated factors, particularly holding a farm loan and living in a farming household, significantly predict life insurance ownership. The study also highlights the complexity of life insurance demand, showing that financial education and management practices are critical determinants. This research underscores the need for tailored financial risk management strategies for rural and farming households and contributes to a nuanced understanding of life insurance demand in varying contexts.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "9b8edf6a2fba2b09b5a86348bdb0b900",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "regression",
      "support vector machine",
      "SVM",
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T01:48:30.821916"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究农村家庭人寿保险所有权的预测因素，虽然涉及金融知识和管理实践，但其核心应用是保险需求预测，而非衍生品定价、金融风险管理或投资组合管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究农村家庭人寿保险所有权的预测因素，虽然涉及金融知识和管理实践，但其核心应用是保险需求预测，而非衍生品定价、金融风险管理或投资组合管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:59:32.414923"
}