{
  "paper": {
    "id": 1134,
    "title": "Machine learning in finance: A topic modeling approach",
    "abstract": "We identify the core topics of research applying machine learning to finance. We use a probabilistic topic modeling approach to make sense of this diverse body of research spanning across multiple disciplines. Through a latent Dirichlet allocation topic modeling technique, we extract 15 coherent research topics that are the focus of 5942 academic studies from 1990 to 2020. We find that these topics can be grouped into four categories: Price-forecasting techniques, financial markets analysis, risk forecasting and financial perspectives. We first describe and structure these topics and then further show how the topic focus has evolved over the last three decades. A notable trend we find is the emergence of text-based machine learning, for example, for sentiment analysis, in recent years. Our study thus provides a structured topography for finance researchers seeking to integrate machine learning research approaches in their exploration of finance phenomena. We also showcase the benefits to finance researchers of the method of probabilistic modeling of topics for deep comprehension of a body of literature.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "96ca8cc8fb2923e0b974e704eaf8fcd4",
    "relevant_keywords": [
      "machine learning",
      "unsupervised learning",
      "clustering",
      "deep learning",
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T01:59:21.618341"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是使用主题建模技术对金融领域的机器学习研究进行分类和趋势分析，并未具体涉及衍生品定价、金融风险管理或投资组合管理等特定金融领域的应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是使用主题建模技术对金融领域的机器学习研究进行分类和趋势分析，并未具体涉及衍生品定价、金融风险管理或投资组合管理等特定金融领域的应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:51:57.884503"
}