{
  "paper": {
    "id": 1610,
    "title": "A novel financial performance metric to minimize misclassification costs in model selection",
    "abstract": "A novel financial performance metric (FPM) is introduced seeking to minimise the misclassification cost arising from false positives and false negatives in credit risk assessment. Using the German Credit Dataset (GCD), important financial variables are simulated according to four different asset classes to enable a more accurate and reliable, multidimensional model selection. The misclassification cost arising from FPM is compared with commonly used statistical metrics and the credit scoring example dependent cost matrix (CSEDCM) metric. The results show that CSEDCM underestimates false prediction costs by as much as 99% compared to the FPM. A range of high- performance machine learning methods was compared using FPM and statistical metrics. The Multi-Layer Perceptron outperformed other methods on statistical metrics and overall on financial costs, while a mix of algorithms worked best on either side of the decision threshold. The results confirmed that the proposed FPM would provide a significant financial benefit to organisations.",
    "year": 2025,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "c6f15e4d6466971149e6e4e5797e96db",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "neural network",
      "Multi-Layer Perceptron"
    ],
    "stage1_timestamp": "2025-05-15T02:05:08.293268"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是开发一种新的金融绩效指标（FPM），旨在最小化信用风险评估中的误分类成本。这直接涉及信用风险的管理，属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是开发一种新的金融绩效指标（FPM），旨在最小化信用风险评估中的误分类成本。这直接涉及信用风险的管理，属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:47:54.823844"
}