{
  "paper": {
    "id": 3878,
    "title": "Do global financial distress and uncertainties impact GCC and global sukuk return dynamics?",
    "abstract": "We investigate the dynamics of the co-movement and causal relationship of the GCC sukuk (Islamic bond) returns with global financial distress and various uncertainty factors (including nancial and commodity market and economic policy uncertainty indices), using the quantile regression analysis. The empirical results demonstrate that these global financial, economic policy and oil uncertainties have negative impacts and causality effects on the GCC sukuk returns, which is limited to the lower quantiles (bearish GCC markets). The global financial distress has a negative impact and a causality effect on GCC sukuk but only for the upper quantiles (when the sukuk returns are high). Interestingly, the GCC sukuk returns are not affected by the conventional bond market and gold market uncertainties. For comparison purpose, we examine the impacts of global financial distress and uncertainty factors on the global sukuk index, which is much wider than the GCC index, and find that this index is mainly affected by the global conventional bond market uncertainty. The results show also that the GCC sukuk are more sensitive to the global uncertainty factor, mainly in the tail distributions, than the global sulcuk, offering investors different investment alternatives and portfolio diversification opportunities. (C) 2016 Elsevier B.V. All rights reserved.",
    "year": 2016,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "cdc484ee2353b0afc59d916f4c006330",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:21:41.408403"
  },
  "domain_result": {
    "success": false,
    "error": "Client error '429 Too Many Requests' for url 'https://api.deepseek.com/v1/chat/completions'\nFor more information check: https://developer.mozilla.org/en-US/docs/Web/HTTP/Status/429",
    "application_domains": [
      "None"
    ],
    "justification": "API调用失败: Client error '429 Too Many Requests' for url 'https://api.deepseek.com/v1/chat/completions'\nFor more information check: https://developer.mozilla.org/en-US/docs/Web/HTTP/Status/429",
    "raw_response": null
  },
  "timestamp": "2025-05-20T16:08:45.205077"
}