{
  "paper": {
    "id": 6799,
    "title": "Mobile technology acceptance model: An investigation using mobile users to explore smartphone credit card",
    "abstract": "Smartphone credit card (SCC) is an emerging payment method using NFC-enabled smartphones. The proximity payment allows consumers to pay their products and services by waving their smartphones with a NFC reader. While there are advantageous adopting SCC, the adoption rate has not been encouraging. Interestingly, existing research work on past information technology and system models have so far focused primarily on organizational context and adopted specifically for work. Furthermore, past antecedents were mainly constructed using electronic commerce literatures which do not reflect the actual mobile environment. In contrast SCC is mainly adopted voluntarily by mobile users and for personal purposes. Thus this leads to the difficulty in drawing meaningful conclusion. The study addresses these limitations by proposing a new mobile technology acceptance model (MTAM) which consists of mobile usefulness (MU) and mobile ease of use (MEU) to determine SCC adoption. In anticipating on the complexity which exists in the mobile environment, additional mobile constructs namely mobile perceived security risk (MPSR), mobile perceived trust (MPT), mobile perceived compatibility (MPC) and mobile perceived financial resources (MPFR) were incorporated into the parsimonious MTAM. The integrated model was applied to 459 mobile users through a questionnaire approach and tested using partial least square structural equation modelling-artificial neural network (PLS-SEM-ANN) has provided a new impact and a possible new research methodology paradigm as it is able to capture both linear and non-linear relationships. While the model confirms the role of MU in MTAM, MEU needs for more attention in practice. The results from the extended model showed that only three of the proposed hypotheses were nonsignificant in this study and thus warrant further investigation. The study contributes to academia by proposing new mobile constructs that brings together MTAM to assess the likelihood of mobile users to adopt SCC. The study also offers several important managerial implications which can be generalized to the mobile studies of other transportation, hotel, banking, and tourism industries. (C) 2016 Elsevier Ltd. All rights reserved.",
    "year": 2016,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "1d0bf3041fb9f40da473c5086e517804",
    "relevant_keywords": [
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T03:01:31.470225"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究智能手机信用卡（SCC）的接受模型，涉及移动支付技术的用户接受度，并未涉及衍生品定价、金融风险管理或投资组合管理等金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究智能手机信用卡（SCC）的接受模型，涉及移动支付技术的用户接受度，并未涉及衍生品定价、金融风险管理或投资组合管理等金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:27:30.238682"
}