{
  "paper": {
    "id": 4003,
    "title": "On Some Models for Value-At-Risk",
    "abstract": "The idea of statistical learning can be applied in financial risk management. In recent years, value-at-risk (VaR) has become the standard tool for market risk measurement and management. For better VaR estimation, Engle and Manganelli (2004) introduced the conditional autoregressive value-at-risk (CAViaR) model to estimate the VaR directly by quantile regression. To entertain the nonlinearity and structural change in the VaR, we extend the CAViaR idea using two approaches: the threshold GARCH (TGARCH) and the mixture-GARCH models. The estimation method of these models are proposed. Our models should possess all the advantages of the CAViaR model and enhance the nonlinear structure. The methods are applied to the SP500, Hang Seng, Nikkei and Nasdaq indices to illustrate our models.",
    "year": 2010,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "c1dc5f485f7f1382d017920e54341bee",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:31:58.710201"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on improving Value-at-Risk (VaR) estimation, which is a standard tool for market risk measurement and management. The proposed models (TGARCH and mixture-GARCH) are specifically designed to enhance VaR estimation, directly addressing financial risk management challenges.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on improving Value-at-Risk (VaR) estimation, which is a standard tool for market risk measurement and management. The proposed models (TGARCH and mixture-GARCH) are specifically designed to enhance VaR estimation, directly addressing financial risk management challenges.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:34:42.341639"
}