{
  "paper": {
    "id": 2047,
    "title": "Built-in challenges within the supervisory architecture of the Eurozone",
    "abstract": "We analyse a sample of significant European financial intermediaries that fall under the Single Supervisory Mechanism, which is part of the existing institutional supervisory architecture of the Eurozone. Theory suggests that herding among financial intermediaries raises cross-sectional correlations and has negative implications for systemic risk. Empirically, herding behaviours are associated with clusters identifying commonalities in asset allocations and risk strategies. By adopting a novel clustering approach, we analyse whether some pre-determined classifications and criteria associated with the current supervisory framework can capture financial intermediaries' herding behaviour. We find that simple classifications and criteria, which are less likely to be policy-biased, can be more efficient than complex ones when it comes to identifying commonalities posing the highest threats to systemic risk. The findings confirm the need for a macro-rather than micro-prudential approach to financial supervision by highlighting the importance of using a supervisory toolkit that includes indicators with a stronger cross-sectional and network dimension. Our methodology can serve as a final consistency check for quantitative-based classifications and criteria employed by supervisory authorities.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "9f05b93c13538924378e9da90541e3f3",
    "relevant_keywords": [
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T02:10:25.816075"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要研究金融中介机构的羊群行为及其对系统性风险的影响，并提出了一种新的聚类方法来识别这些行为。这直接关联到金融风险管理中的系统性风险监控和管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文主要研究金融中介机构的羊群行为及其对系统性风险的影响，并提出了一种新的聚类方法来识别这些行为。这直接关联到金融风险管理中的系统性风险监控和管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:44:28.207271"
}