{
  "paper": {
    "id": 2956,
    "title": "Systemic risk and spatiotemporal dynamics of the US housing market",
    "abstract": "Housing markets play a crucial role in economies and the collapse of a real- estate bubble usually destabilizes the financial system and causes economic recessions. We investigate the systemic risk and spatiotemporal dynamics of the US housing market (1975-2011) at the state level based on the Random Matrix Theory (RMT). We identify richer economic information in the largest eigenvalues deviating from RMT predictions for the housing market than for stock markets and find that the component signs of the eigenvectors contain either geographical information or the extent of differences in house price growth rates or both. By looking at the evolution of different quantities such as eigenvalues and eigenvectors, we find that the US housing market experienced six different regimes, which is consistent with the evolution of state clusters identified by the box clustering algorithm and the consensus clustering algorithm on the partial correlation matrices. We find that dramatic increases in the systemic risk are usually accompanied by regime shifts, which provide a means of early detection of housing bubbles.",
    "year": 2014,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "1c9cf89014fbc1ef1f9c7733bf8832e9",
    "relevant_keywords": [
      "clustering",
      "principal components analysis"
    ],
    "stage1_timestamp": "2025-05-15T02:20:48.282062"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要研究美国住房市场的系统性风险和时空动态，通过随机矩阵理论和聚类算法识别市场状态转变和系统性风险的增加，这属于金融风险管理的范畴。论文未涉及衍生品定价或投资组合管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文主要研究美国住房市场的系统性风险和时空动态，通过随机矩阵理论和聚类算法识别市场状态转变和系统性风险的增加，这属于金融风险管理的范畴。论文未涉及衍生品定价或投资组合管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:39:18.605680"
}