{
  "paper": {
    "id": 619,
    "title": "Climate change and US Corporate bond market activity: A machine learning approach",
    "abstract": "We investigate the predictive relationship between climate change indexes and international corporate debt market volumes, focusing on forecasting domestic and foreign net purchases of U. S. corporate bonds, using thirty machine learning models across different families of algorithms. Among these, Gaussian Process Regression models demonstrated superior accuracy in capturing complex patterns, highlighting the significance of climate change indexes as predictors of corporate bond market behaviors. NARX models and decision trees also performed well. However, machine learning predictive accuracy broadly outperforms traditional estimation methods, but varies across different regional markets and investor types. The findings underscore the need for integrating climate risk into financial analysis, advocating for sophisticated predictive models to better manage climate-related financial risks. These insights have significant implications for asset managers, issuers, and regulators, promoting a more holistic approach to managing these risk.",
    "year": 2025,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "a3982cd286f390c18799d2f86f3d6467",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "regression",
      "decision tree",
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T01:53:24.747978"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on using machine learning models to predict corporate bond market behaviors based on climate change indexes, which is directly related to assessing and managing climate-related financial risks. This falls under the domain of Financial Risk Management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on using machine learning models to predict corporate bond market behaviors based on climate change indexes, which is directly related to assessing and managing climate-related financial risks. This falls under the domain of Financial Risk Management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:56:18.388676"
}