{
  "paper": {
    "id": 1343,
    "title": "Dependence structure of the commodity and stock markets, and relevant multi-spread strategy",
    "abstract": "Understanding the dependence structure between the commodity and stock markets is a crucial issue in constructing a portfolio. It can also help us to discover new opportunities to implement spread trading using multiple assets classified in the two different markets. This study analyzed the dependence structure of the commodity and stock markets using the random matrix theory technique and network analysis. Our results show that the stock and commodity markets must be handled as completely separated asset classes except for the oil and gold markets, so the performance enhancement of the mean-variance portfolio is significant as expected. In light of the fact that WTI 1 month futures and four oil-related stocks are strongly correlated, they were selected as basic ingredients to complement the multi-spread convergence trading strategy using a machine learning technique called the AdaBoost algorithm. The performance of this strategy for non-myopic investors, who can endure short-term loss, can be enhanced significantly on a risk measurement basis. Crown Copyright (C) 2011 Published by Elsevier B.V. All rights reserved.",
    "year": 2011,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "dc2de91d31862775df4da88901983015",
    "relevant_keywords": [
      "machine learning",
      "classification",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T00:54:56.341756"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文主要研究了商品市场和股票市场的依赖结构，并基于此构建了多资产价差交易策略，以提高均值-方差投资组合的表现。这些内容直接涉及投资组合的构建和优化，属于投资组合管理领域。虽然论文提到了衍生品（WTI 1个月期货），但其核心研究并非衍生品定价，也未直接涉及金融风险管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文主要研究了商品市场和股票市场的依赖结构，并基于此构建了多资产价差交易策略，以提高均值-方差投资组合的表现。这些内容直接涉及投资组合的构建和优化，属于投资组合管理领域。虽然论文提到了衍生品（WTI 1个月期货），但其核心研究并非衍生品定价，也未直接涉及金融风险管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:21:40.061975"
}