{
  "paper": {
    "id": 571,
    "title": "STAGE framework: A stock dynamic anomaly detection and trend prediction model based on graph attention network and sparse spatiotemporal convolutional network",
    "abstract": "As the financial market becomes increasingly complex, stock prediction and anomaly data detection have emerged as crucial tasks in financial risk management. However, existing methods exhibit significant limitations in handling the intricate relationships between stocks and addressing anomalous data. This paper proposes the STAGE framework, which integrates the Graph Attention Network (GAT), Variational Autoencoder (VAE), and Sparse Spatiotemporal Convolutional Network (STCN), to enhance the accuracy of stock prediction and the robustness of anomaly data detection. Experimental results show that the complete STAGE framework achieved an accuracy of 85% after 20 training epochs, which is 10% to 20% higher than models with key algorithms removed. In the anomaly detection task, the STAGE framework further improved the accuracy to 95%, demonstrating fast convergence and stability. This framework offers an innovative solution for stock prediction, adapting to the complex dynamics of real-world markets.",
    "year": 2025,
    "source": "WOS",
    "area": "financial_risk",
    "method": "deep learning",
    "cache_key": "89ec77e935d8078e5f09254ade07b4f8",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "neural network",
      "representation learning",
      "autoencoder",
      "attention mechanism"
    ],
    "stage1_timestamp": "2025-05-15T01:40:14.167398"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on stock prediction and anomaly data detection, which are crucial tasks in financial risk management. The proposed STAGE framework aims to enhance the accuracy of stock prediction and the robustness of anomaly data detection, directly addressing risks associated with stock market dynamics.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on stock prediction and anomaly data detection, which are crucial tasks in financial risk management. The proposed STAGE framework aims to enhance the accuracy of stock prediction and the robustness of anomaly data detection, directly addressing risks associated with stock market dynamics.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:02:48.640456"
}