{
  "paper": {
    "id": 4761,
    "title": "Transmission mechanisms of the effects of geopolitical risk on energy returns and volatility",
    "abstract": "In this paper, we investigate the transmission mechanisms of the impacts of geopolitical risk on energy (crude oil, natural gas, heating oil) returns and volatility from June 28, 1990, to January 6, 2020, by using a quantile regression model. The results show that under the supply and demand channel, geopolitical risk increases energy returns and decreases energy volatility in different market conditions. Under the uncertainty channel, geopolitical risk increases or decreases energy returns in various market conditions through economic policy uncertainty and market uncertainty and reduces energy volatility. Under the financial market channel, geopolitical risk reduces natural gas returns through the interest rate, decreases energy returns through the exchange rate and raises energy returns through gold in different market conditions. For energy volatility, geopolitical risk increases natural gas volatility through the interest rate and reduces energy volatility through the exchange rate across market conditions, while gold has little transmission effect. Our findings can help policymakers formulate corresponding policies to hedge against the adverse effects of geopolitical risk and maintain the stability of the energy market.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "0288fa5845fd0fed5821802166886560",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:40:28.009720"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究地缘政治风险对能源回报和波动性的传导机制，虽然涉及金融市场的波动性，但其核心研究并不直接涉及衍生品定价、金融风险管理或投资组合管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究地缘政治风险对能源回报和波动性的传导机制，虽然涉及金融市场的波动性，但其核心研究并不直接涉及衍生品定价、金融风险管理或投资组合管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:31:57.564956"
}