{
  "paper": {
    "id": 1502,
    "title": "Measuring systemic and systematic risk in the financial markets using artificial intelligence",
    "abstract": "Financial markets are exposed to sharp price volatility, and defaults and errors, which results in high risks for relevant stakeholders. In such markets, success depends upon the quality and quantity of information available to assist the decision-making. Artificial intelligence (AI), in this regard, can measure or predict systemic and systematic risk in the financial markets. This research study aims to highlight how the risks can be measured and controlled with the support and integration of modern AI and machine learning mechanisms. By performing a review-based methodology, the study first presents an explanation of the models, which is followed by proposing a new AI-based model. The model relies on several financial system's inputs, which include portfolio data, trade data, market data, financial reports, market condition, and sector-wise data. The systemic and systematic risk is then assessed through a number of outputs that the AI algorithm will process, in the form of an interactive dashboard. The article further tests that model and presents benefits and implications.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "7f722981d1fe3d01522fba912a59e3bb",
    "relevant_keywords": [
      "machine learning",
      "neural network",
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T02:03:39.837718"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用人工智能和机器学习来测量和预测金融市场的系统性和系统性风险，这直接属于金融风险管理的范畴。论文中提到的模型输入和输出都集中在风险评估和控制上，而不是衍生品定价或投资组合管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是使用人工智能和机器学习来测量和预测金融市场的系统性和系统性风险，这直接属于金融风险管理的范畴。论文中提到的模型输入和输出都集中在风险评估和控制上，而不是衍生品定价或投资组合管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:48:41.577722"
}