{
  "paper": {
    "id": 729,
    "title": "Credit risk analysis using a reliability-based neural network ensemble model",
    "abstract": "Credit risk analysis is an important topic in the financial risk management. Due to recent financial crises and regulatory concern of Basel II, credit risk analysis has been the major focus of financial and banking industry. An accurate estimation of credit risk could be transformed into a more efficient use of economic capital. In this study, we try to use a triple-phase neural network ensemble technique to design a credit risk evaluation system to discriminate good creditors from bad ones. In this model, many diverse neural network models are first created. Then an uncorrelation maximization algorithm is used to select the appropriate ensemble members. Finally, a reliability-based method is used for neural network ensemble. For further illustration, a publicly credit dataset is used to test the effectiveness of the proposed neural ensemble model.",
    "year": 2006,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "c5b5063648d49269479a8c6d1907f216",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "neural network",
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T01:54:34.017171"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on credit risk analysis, which is a key aspect of financial risk management. It specifically aims to discriminate between good and bad creditors using a neural network ensemble model, directly addressing risk assessment in financial contexts.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on credit risk analysis, which is a key aspect of financial risk management. It specifically aims to discriminate between good and bad creditors using a neural network ensemble model, directly addressing risk assessment in financial contexts.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:55:26.610108"
}