{
  "paper": {
    "id": 1152,
    "title": "A Default Prediction Method using XGBoost and LightGBM",
    "abstract": "With the rapid development of the global economy, loans have been used to promote consumption, promote currency circulation, and help individuals deal with economic problems. However, the formation of people's concept of ahead of time consumption and the high-yield business of commercial banks are accompanied by an increase in the number of financial risk events. The personal credit risk prediction problem can be regarded as a binary classification problem, and it is a common method to solve the problem by using machine learning algorithms to build a credit evaluation model. This paper uses the match data published by American Express in Kaggle to conduct a study of default prediction. To evaluate our experiment's performance, we do comparative competitions. We define the new experimental metrics. The result shows our hybrid model owns the highest metric 0.800 among these models, which is 0.002, 0.01, 0.013 higher than XGBoost, LightgGBM, DNN respectively.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "493914602d2e40c65db4092aed833e3e",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "deep learning",
      "neural network",
      "DNN"
    ],
    "stage1_timestamp": "2025-05-15T01:59:21.720833"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on predicting personal credit defaults using machine learning models, which is a key aspect of financial risk management, specifically in assessing and mitigating credit risk.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on predicting personal credit defaults using machine learning models, which is a key aspect of financial risk management, specifically in assessing and mitigating credit risk.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:51:40.279494"
}