{
  "paper": {
    "id": 3022,
    "title": "Video games for assessing computational thinking: a systematic literature review",
    "abstract": "Computational thinking (CT) is a widely researched domain. Many researchers around the world have conducted studies to define CT, to develop CT in students, and to assess CT using various tools and paradigms. Our review focuses on the assessment aspect of CT using digital games. Typically, the assessment in CT is done using Multiple Choice Questions, Portfolio analysis, pen-and-paper methods, and games. The use of video games to assess CT skills was one of the least explored areas. To further explore this area, we did a systematic literature review on the use of video games to assess CT. The findings of our review are as follows: (1) CT skills such as abstraction, algorithmic thinking, data representation, debugging, decomposition, pattern recognition, recursive thinking, simulation, socialization, heuristic, iteration, and problem-solving were primarily assessed using digital games. (2) The reviewed articles used samples ranging from 18 to 3355 participants. (3) The sample includes elementary, middle-, and high-school and graduate students. (4) In the reviewed articles, it is observed that the time for treatment varied from a few hours to the entire school year. (5) A mixed-mode study using quantitative and qualitative methods was preferred by researchers to explore the CT aspects such as CT concepts, practices, and perspectives. (6) The use of video games, stealth assessment, educational data mining and machine learning for assessing CT skills is in a dormant state. (7) There is a lack of empirical evidence to prove that video games are effective to assess CT skills. This review paper will be helpful for researchers working on the assessment of CT skills using digital games.",
    "year": 2024,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "026be6e06779dbae56d7d3ecf129e320",
    "relevant_keywords": [
      "machine learning"
    ],
    "stage1_timestamp": "2025-05-15T01:12:43.077663"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究使用视频游戏评估计算思维（Computational Thinking），并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。虽然提到了机器学习，但其应用场景是教育数据挖掘和计算思维评估，而非金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究使用视频游戏评估计算思维（Computational Thinking），并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。虽然提到了机器学习，但其应用场景是教育数据挖掘和计算思维评估，而非金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T14:23:36.682326"
}