{
  "paper": {
    "id": 2824,
    "title": "Predicting the Bitcoin's price using AI",
    "abstract": "This study investigates the application of Artificial Intelligence (AI) and Machine Learning (ML) in predicting Bitcoin price movements and developing adaptive investment strategies. An analysis of Bitcoin performance from January 2018 to January 2024 revealed that the AI-driven strategy, leveraging an ensemble of neural networks, achieved a total return of 1640.32%, significantly surpassing the ML-based approach with a return of 304.77% and the traditional B&H strategy at 223.40%. By incorporating predictive analytics and technical indicators, the AI strategy dynamically adjusted its market exposure, enabling it to mitigate losses during downturns and maximize gains during favorable market conditions. These findings underscore the transformative potential of AI in financial markets, particularly in emerging asset classes like cryptocurrencies. Using a broader spectrum of data and employing advanced analytical techniques, AI can provide a more nuanced understanding of market dynamics and investor behavior providing significant implications for portfolio management, risk assessment, and trading system design.",
    "year": 2025,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "18f28cfcfba33ada305513d69159e57f",
    "relevant_keywords": [
      "machine learning",
      "neural network",
      "deep learning",
      "representation learning",
      "backpropagation",
      "BP",
      "hidden layer",
      "recurrent neural network",
      "long short-term memory",
      "LSTM"
    ],
    "stage1_timestamp": "2025-05-15T02:19:46.615348"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文主要研究利用AI和ML预测比特币价格并开发自适应投资策略，其核心应用在于动态调整市场暴露以优化投资组合表现，这直接关联到投资组合管理领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文主要研究利用AI和ML预测比特币价格并开发自适应投资策略，其核心应用在于动态调整市场暴露以优化投资组合表现，这直接关联到投资组合管理领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:39:46.223003"
}