{
  "paper": {
    "id": 3005,
    "title": "Can sentiment analysis help mimic decision-making process of loan granting? A novel credit risk evaluation approach using GMKL model",
    "abstract": "Credit risk assessment is a crucial process for financial institutions when granting commercial loans. However, the manual analysis of the overall condition of firms through customer due diligence reports is costly for both time and labor. This paper proposes a novel credit risk evaluation approach using GMKL model to automate the decision-making process. Sentiment indexes are generated by mining the opinions of the text content in customer due diligence reports and further used as input for model construction. The method distinguishes itself by innovatively employing sentiment analysis in credit risk assessment. A real-life loans granting dataset is utilized for verifying the performance of the method. The experiment results show that, when combining the traditional financial indicators along with the sentiment indexes, the classifiers trained by GMKL model can outperform several baseline models, successfully improving the accuracy of classification and also detecting the default loans.",
    "year": 2015,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "b848c7debcd711215bd1eb8590bf1f2f",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM",
      "decision tree",
      "feature representation",
      "neural network",
      "deep learning",
      "representation learning"
    ],
    "stage1_timestamp": "2025-05-15T02:21:19.301822"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on credit risk assessment using sentiment analysis and machine learning, which is a key aspect of financial risk management, specifically in evaluating the risk of loan defaults.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on credit risk assessment using sentiment analysis and machine learning, which is a key aspect of financial risk management, specifically in evaluating the risk of loan defaults.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:38:33.200619"
}