{
  "paper": {
    "id": 2866,
    "title": "CORPORATE BANKRUPTCY AND INSOLVENCY PREDICTION MODEL",
    "abstract": "In any competitive economy, the risk of bankruptcy is pervasive. The research aims to contribute in improving the predictive power of bankruptcy and insolvency risk among companies by introducing new methods of processing and validation. This paper investigates the extensive application of the Z score model for predicting the economic-financial stability of Romanian companies in the manufacturing and extractive industries. A list of 37 financial indicators determined on the basis of the balance sheet data of 80 companies for the period 2015-2018 was used. Stepwise Least Squares Estimation through the Forward method allowed the identification of the most relevant ones. Canonical discriminant analysis and sensitivity analyzes were introduced to test the predictive power of the model. The new model identified allows both the prediction of bankruptcy and insolvency risk. This study contributes to the literature by testing variables in relation to financial difficulties and by including other classification information. The robustness of the determined canonical discriminant function was verified by testing the model on two other samples.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "38adb1b3ba453476d61bb93115f38354",
    "relevant_keywords": [
      "classification"
    ],
    "stage1_timestamp": "2025-05-15T02:20:16.798645"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on developing a predictive model for corporate bankruptcy and insolvency risk, which is a key aspect of financial risk management, particularly in credit risk assessment.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on developing a predictive model for corporate bankruptcy and insolvency risk, which is a key aspect of financial risk management, particularly in credit risk assessment.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:39:44.090164"
}