{
  "paper": {
    "id": 396,
    "title": "The Non-Linear Regression Model to Estimate the Part of NPLS in the Whole Loan Portfolio of Ukrainian Banks",
    "abstract": "The non-linear regression model for estimating the part of non-performing loans (NPLs) in the whole loan portfolio of Ukrainian banks is constructed on the basis of the Johnson normalizing transformation for the four-dimensional non-Gaussian data: the part of NPLs in the whole loan portfolio of Ukrainian banks, the official exchange rate of the US dollar to the national currency UAH, the part of foreign currency loans and the part of loans for legal entities in the loan portfolio. The equation, confidence and prediction intervals of non-linear regression on the basis of normalizing transformations for the non-Gaussian data are also built. Comparison of the constructed model with the linear regression model and a nonlinear regression model based on the decimal logarithm is performed.",
    "year": 2018,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "a55d93ebd96cc23bc88d0b547be51704",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T00:43:10.476764"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on estimating the part of non-performing loans (NPLs) in the loan portfolio of Ukrainian banks, which is a key aspect of credit risk management, a subfield of financial risk management. The use of non-linear regression models to predict NPLs directly addresses risk assessment and mitigation in banking.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on estimating the part of non-performing loans (NPLs) in the loan portfolio of Ukrainian banks, which is a key aspect of credit risk management, a subfield of financial risk management. The use of non-linear regression models to predict NPLs directly addresses risk assessment and mitigation in banking.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:31:12.648842"
}