{
  "paper": {
    "id": 3658,
    "title": "RPS: Portfolio asset selection using graph based representation learning",
    "abstract": "Portfolio optimization is one of the essential fields of focus in finance. There has been an increasing demand for novel computational methods in this area to compute portfolios with better returns and lower risks in recent years. We present a novel computational method called Representation Portfolio Selection by redefining the distance matrix of financial assets using Representation Learning and Clustering algorithms for portfolio selection to increase diversification. RPS proposes a heuristic for getting closer to the optimal subset of assets. Using empirical results in this paper, we demonstrate that widely used portfolio optimization algorithms, such as Mean-Variance Optimization, Critical Line Algorithm, and Hierarchical Risk Parity can benefit from our asset subset selection.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "8b7442a26fe847a120370895c4463f60",
    "relevant_keywords": [
      "unsupervised learning",
      "clustering",
      "representation learning",
      "feature representation"
    ],
    "stage1_timestamp": "2025-05-15T02:28:29.437370"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "The paper focuses on portfolio optimization and asset selection using representation learning and clustering algorithms, which are core techniques in the field of portfolio management. The goal is to improve diversification and optimize returns and risks, directly aligning with the objectives of portfolio management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Portfolio Management\"],\n  \"justification\": \"The paper focuses on portfolio optimization and asset selection using representation learning and clustering algorithms, which are core techniques in the field of portfolio management. The goal is to improve diversification and optimize returns and risks, directly aligning with the objectives of portfolio management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:35:33.961382"
}