{
  "paper": {
    "id": 1605,
    "title": "Trends in the thematic landscape of HR analytics research: a structural topic modeling approach",
    "abstract": "Purpose - The growth of the global labor force and business analytics has significantly impacted human resource management (HRM). Human resource (HR) analytics is an emerging field that creates value for employees and organizations. By examining the existing studies on HR analytics, the paper systematically reviews the literature to identify active research areas and establish a roadmap for future studies in HR analytics. Design/methodology/approach - A portfolio of 503 articles collected from the Scopus database was reviewed. The study has adopted a Latent Dirichlet allocation (LDA) topic modeling approach to identify significant themes in the literature.Findings - The HR analytics research domain is classified into four categories: HR functions, statistical techniques, organizational outcomes and employee characteristics. The study has also developed a framework for organizations adopting HR analytics. Linking HR with blockchain technology, explainable artificial intelligence and Metaverse are the areas identified for future researchers.Practical implications - The framework will assist practitioners in identifying statistical techniques for optimizing various HR functions. The paper discovers that by implementing HR analytics, HR managers and business partners can run reports, make dashboards and visualizations and make evidence-based decision making.Originality/value - The previous studies have not applied any machine learning techniques to identify the topics in the extant literature. The paper has applied machine learning tools, making the review more robust and providing an exhaustive understanding of the domain.",
    "year": 2023,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "b31abbc2b113100f177a78047b828aab",
    "relevant_keywords": [
      "machine learning",
      "unsupervised learning",
      "clustering",
      "deep learning",
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T00:57:46.799561"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究人力资源分析（HR analytics）领域，使用机器学习技术（如LDA主题建模）来识别文献中的主题，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究人力资源分析（HR analytics）领域，使用机器学习技术（如LDA主题建模）来识别文献中的主题，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:20:03.951468"
}