{
  "paper": {
    "id": 1416,
    "title": "Financial Risk Control Model Based on Deep Neural Networks",
    "abstract": "Under the background of global economic integration, commercial banks are facing more and more complex business environment. As one of the major financial risks faced by commercial banks, liquidity risk determines and reflects the safety and profitability of bank operation. Based on joint-stock commercial banks as the research object, this paper, respectively, from the angle of the static and dynamic measurements and projections for liquidity risk and based on the current situation of four joint-stock commercial banks liquidity level study, tries to explore the change law of commercial banks liquidity risk and financial risk control of commercial bank and puts forward reasonable suggestions. In this paper, an AHP neural network model combining subjective and objective methods is proposed. This method can not only overcome the defects of the single evaluation method but also improve the data accessibility by using the qualitative data and quantitative data of AHP. In the aspect of financial risk control system, this paper tries to establish a more comprehensive and practical financial risk control model by combining the previous research of scholars, the business model process, and the experience of practical workers.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "1d424286e13cee06721880ab7beefc13",
    "relevant_keywords": [
      "neural network",
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T02:03:00.602599"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心研究内容是商业银行的流动性风险控制，提出了基于AHP神经网络的风险控制模型，旨在改善商业银行的金融风险管理。论文明确提到金融风险控制模型和流动性风险测量，这直接属于金融风险管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心研究内容是商业银行的流动性风险控制，提出了基于AHP神经网络的风险控制模型，旨在改善商业银行的金融风险管理。论文明确提到金融风险控制模型和流动性风险测量，这直接属于金融风险管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:49:04.678039"
}