{
  "paper": {
    "id": 4172,
    "title": "Take it to the limit: Innovative CVaR applications to extreme credit risk measurement",
    "abstract": "The Global Financial Crisis (GFC) demonstrated the devastating impact of extreme credit risk on global economic stability. We develop four credit models to better measure credit risk in extreme economic circumstances, by applying innovative Conditional Value at Risk (CVaR) techniques to structural models (called Xtreme-S), transition models (Xtreme-T), quantile regression models (Xtreme-Q), and the author's unique iTransition model (Xtreme-i) which incorporates industry factors into transition matrices. We find the Xtreme-S and Xtreme-Q models to be the most responsive to changing market conditions. The paper also demonstrates how the models can be used to determine capital buffers required to deal with extreme credit risk. (C) 2014 Elsevier B.V. and Association of European Operational Research Societies (EURO) within the International Federation of Operational Research Societies (IFORS). All rights reserved.",
    "year": 2016,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "dea999a9e4d7c0d32251fa61f712198c",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:34:13.342231"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on developing credit models to measure extreme credit risk using Conditional Value at Risk (CVaR) techniques, which is a core aspect of financial risk management. The study aims to determine capital buffers for extreme credit risk, further emphasizing its application in risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on developing credit models to measure extreme credit risk using Conditional Value at Risk (CVaR) techniques, which is a core aspect of financial risk management. The study aims to determine capital buffers for extreme credit risk, further emphasizing its application in risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:33:53.182908"
}