{
  "paper": {
    "id": 316,
    "title": "PATTERNS OF 50 ETF OPTIONS IMPLIED VOLATILITY IN CHINA: ON IMPLIED VOLATILITY FUNCTIONS",
    "abstract": "The aim of this study is to examine the volatility smile based on the European options on Shanghai stock exchange 50 ETF. The data gives evidence of the existence of a well-known U-shaped implied volatility smile for the SSE 50 ETF options market in China. For those near-month options, the implied volatility smirk is also observed. And the implied volatility remains high for the short maturity and decreases as the maturity increases. The patterns of the implied volatility of SSE 50 ETF options indicate that in-the-money options and out-of-the-money options are more expensive relative to at-the-money options. This makes the use of at-the-money implied volatility for pricing out-of- or in-the-money options questionable. In order to investigate the implied volatility, the regression-based implied volatility functions model is considered employed to study the implied volatility in this study as this method is simple and easy to apply in practice. Several classical implied volatility functions are investigated in this paper to find whether some kind of implied volatility functions could lead to more accurate options pricing values. The potential determinants of implied volatility are the degree of moneyness and days left to expiration. The empirical work has been expressed by means of simple ordinary least squares framework. As the study shows, when valuing options, the results of using volatility functions are mixed. For far-month options, using atthe-money implied volatility performs better than other volatility functions in option valuation. For near-month options, the use of volatility functions can improve the valuation accuracy for deep in-the-money options or deep out-of-the-money options. However, no particular implied volatility function performs very well for options of all moneyness level and time to maturity.",
    "year": 2021,
    "source": "WOS",
    "area": "derivatives_pricing",
    "method": "machine learning",
    "cache_key": "0f442dc78c763cd299bba5d1252c5063",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:30:46.328694"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Derivatives Pricing"
    ],
    "justification": "该论文主要研究上证50ETF期权的隐含波动率模式，并探讨了不同隐含波动率函数对期权定价准确性的影响。这直接涉及期权定价问题，属于衍生品定价领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"衍生品定价\"],\n  \"justification\": \"该论文主要研究上证50ETF期权的隐含波动率模式，并探讨了不同隐含波动率函数对期权定价准确性的影响。这直接涉及期权定价问题，属于衍生品定价领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:05:36.589055"
}