{
  "paper": {
    "id": 8656,
    "title": "Psychosocial markers of age at onset in bipolar disorder: a machine learning approach",
    "abstract": "Background Bipolar disorder is a chronic and severe mental health disorder. Early stratification of individuals into subgroups based on age at onset (AAO) has the potential to inform diagnosis and early intervention. Yet, the psychosocial predictors associated with AAO are unknown. Aims We aim to identify psychosocial factors associated with bipolar disorder AAO. Method Using data from the Bipolar Disorder Research Network UK, we employed least absolute shrinkage and selection operator regression to identify psychosocial factors associated with bipolar disorder AAO. Twenty-eight factors were entered into our model, with AAO as our outcome measure. Results We included 1022 participants with bipolar disorder (mu = 23.0, s.d. +/- 9.86) in our model. Six variables predicted an earlier AAO: childhood abuse (beta = -0.2855), regular cannabis use in the year before onset (beta = -0.2765), death of a close family friend or relative in the 6 months before onset (beta = -0.2435), family history of suicide (beta = -0.1385), schizotypal personality traits (beta = -0.1055) and irritable temperament (beta = -0.0685). Five predicted a later AAO: the average number of alcohol units consumed per week in the year before onset (beta = 0.1385); birth of a child in the 6 months before onset (beta = 0.2755); death of parent, partner, child or sibling in the 6 months before onset (beta = 0.3125); seeking work without success for 1 month or more in the 6 months before onset (beta = 0.3505) and a major financial crisis in the 6 months before onset (beta = 0.4575). Conclusions The identified predictor variables have the potential to help stratify high-risk individuals into likely AAO groups, to inform treatment provision and early intervention.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "289cb44b6b73b8198c13a133279ff83d",
    "relevant_keywords": [
      "machine learning",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T03:20:55.994015"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究双相情感障碍的发病年龄预测，使用了机器学习方法分析心理社会因素，并未涉及任何金融领域的研究或应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究双相情感障碍的发病年龄预测，使用了机器学习方法分析心理社会因素，并未涉及任何金融领域的研究或应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:25:35.854153"
}