{
  "paper": {
    "id": 3466,
    "title": "Poset ontologies and concept lattices as semantic hierarchies",
    "abstract": "We describe some aspects of our research in relational knowledge discovery and combinatorial scientific computing [11], with special emphasis on the relation to the research portfolio of the conceptual structures community. We have recently been developing [10,12] a combinatorial approach to the management and analysis of large ontologies such as the Gene Ontology (GO) [6]. Our approach depends on casting the GO as a labeled partially ordered set (poset) [16], and then using scores based on pseudo-distance measures which we have developed to categorize lists of labels (in the case of the GO, genes and gene products) concerning their clustering and depth within the GO. We hold that such taxonomic semantic hierarchies serve as the core conceptual structures underlying all ontological databases, and through this work we have developed a number of what we believe to be both fundamental and novel ideas about treating such large posets as data objects, in particular the nature of distance in such structures, and the nature of level as an interval-valued property. After laying out this basic framework, we can then bring these ideas to a particular kind of poset, namely the concept lattice [5]. Considering a concept lattice as a poset, we are then prepared to develop techniques for anomaly detection in relational data by measuring the relative level of concepts vs. their cardinalities.",
    "year": 2004,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "63eb92fab924f539fbdebb39dd875385",
    "relevant_keywords": [
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T01:17:25.496934"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是关系知识发现和组合科学计算，特别是关于部分有序集（poset）和概念格的应用，用于语义层次结构和异常检测。虽然提到了聚类和距离测量，但这些技术并未明确应用于衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是关系知识发现和组合科学计算，特别是关于部分有序集（poset）和概念格的应用，用于语义层次结构和异常检测。虽然提到了聚类和距离测量，但这些技术并未明确应用于衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:09:42.193937"
}