{
  "paper": {
    "id": 1969,
    "title": "Patent co-citation analysis of Eli!Lilly & Co. patents",
    "abstract": "This is the third in a series of articles that applies patent citation analysis to pharmaceutical patents. The authors use co-citation clustering to identify the major technology fronts that Eli Lilly & Co. is pursuing. The analysis covers all US patents assigned to Lilly and issued from 1975 through to 1998. Lilly's patents fall into 132 Clusters, which in turn form 13 Groups. Statistics of self-citations to the Clusters identify technology fronts of key importance to Lilly. The authors examine the patents in one of these areas, pertaining to raloxifene and related compounds, in more detail. The article shows how the technique can take a large number of patents, almost 3,000 in this case, and organise them into Groups without the need for an expert to read and classify each. The technique quickly organises the patents in a portfolio and gives a starting paint that can help experts focus on areas of major importance or interest. A company can apply this technique to identify core areas of its patent portfolio, areas where it might face stiff competition, areas where others have found value within its patent portfolio, and areas where licensing opportunities may exist. Competitors applying this technique can see areas of a rival's strength and areas the rival has abandoned or is not following up on.",
    "year": 1999,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "9aa898db13d21fdfdc4b6d20eb660a22",
    "relevant_keywords": [
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T01:01:41.621075"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究专利共引分析技术，应用于制药行业的专利分类和管理，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究专利共引分析技术，应用于制药行业的专利分类和管理，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:17:50.756783"
}