{
  "paper": {
    "id": 3231,
    "title": "WISE 2014 Challenge: Multi-label Classification of Print Media Articles to Topics",
    "abstract": "The WISE 2014 challenge was concerned with the task of multi-label classification of articles coming from Greek print media. Raw data comes from the scanning of print media, article segmentation, and optical character segmentation, and therefore is quite noisy. Each article is examined by a human annotator and categorized to one or more of the topics being monitored. Topics range from specific persons, products, and companies that can be easily categorized based on keywords, to more general semantic concepts, such as environment or economy. Building multi-label classifiers for the automated annotation of articles into topics can support the work of human annotators by suggesting a list of all topics by order of relevance, or even automate the annotation process for media and/or categories that are easier to predict. This saves valuable time and allows a media monitoring company to expand the portfolio of media being monitored. This paper summarizes the approaches of the top 4 among the 121 teams that participated in the competition.",
    "year": 2014,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "52aaf098186e6f2526712dc1319901df",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM",
      "decision tree",
      "neural network",
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T01:14:55.040424"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要关注多标签分类技术在希腊印刷媒体文章分类中的应用，旨在自动化文章标注过程以提高效率。虽然提到了经济和公司等主题，但并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域的核心技术或应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要关注多标签分类技术在希腊印刷媒体文章分类中的应用，旨在自动化文章标注过程以提高效率。虽然提到了经济和公司等主题，但并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域的核心技术或应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:10:32.333792"
}