{
  "paper": {
    "id": 2649,
    "title": "SEEKING THE INVESTMENT PORTFOLIO EFFICIENCY APPLYING THE ARTIFICIAL INTELLIGENCE",
    "abstract": "Research background: Stochastic information in finance and economics results from various unexpected and uncertain processes and fluctuations of financial and economic activity. It is necessary to make investment decisions in capital and exchange markets adequately. Thus stochastic models in investment are widely used. Investment decision-making problems are successfully being solved by applying artificial intelligence or similar methods. However, artificial intelligence can solve significantly broader groups of problems and tasks. To solve such kinds of problems, the focusing of artificial neurons into the effectively functioning stochastic pseudo-neural network is oriented in the proposed research. Purpose of the article: The research objective is to form an efficient investment portfolio using the historical data of financial markets and assess its results. Methods: To reach the aim of the research, the stochastic investment system based on artificial intelligence and methodology of stochastic expertise is developed. It is capable of solving the investment problems in financial markets. The system is backed up by the authors' previously developed adequate portfolio model, which solves investment problems concerning the stochastic nature of investment return and analyses three investment parameters: return, reliability, and risk. Findings & value added: The paper presents investment results in the USA stock market during the 2019-2020 time period. Based on the historical data, the investment portfolio is proposed, highlighting its generated return and reliability. The possibilities to invest in portfolios with different risk levels are disclosed, attention to the investor's risk resistance level is paid. Also, an experiment in the exchange market has been conducted. After performing experiments in capital and exchange markets, the traditional technique of investment portfolio optimal solution search has been diversified and broadened. The results of the research are useful for researchers in the field of investment, as well as for individual and institutional investors.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "6384f80991c0d317e2a04135ee9ecae8",
    "relevant_keywords": [
      "neural network",
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T02:17:32.267525"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心目标是利用人工智能和随机模型构建高效的投资组合，并评估其回报、可靠性和风险。研究重点在于投资决策和组合优化，这直接属于投资组合管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心目标是利用人工智能和随机模型构建高效的投资组合，并评估其回报、可靠性和风险。研究重点在于投资决策和组合优化，这直接属于投资组合管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:40:41.023318"
}