{
  "paper": {
    "id": 1279,
    "title": "Sparse and Stable Portfolio Selection With Parameter Uncertainty",
    "abstract": "A number of alternative mean-variance portfolio strategies have been recently proposed to improve the empirical performance of the classic Markowitz mean-variance framework. Designed as remedies for parameter uncertainty and estimation errors in portfolio selection problems, these alternative portfolio strategies deliver substantially better out-of-sample performance. In this article, we first show how to solve a general portfolio selection problem in a linear regression framework. Then we propose to reduce the estimation risk of expected returns and the variance-covariance matrix of asset returns by imposing additional constraints on the portfolio weights. With results from linear regression models, we show that portfolio weights derived from new approaches enjoy two favorable properties: sparsity and stability. Moreover, we present insights into these new approaches as well as their connections to alternative strategies in literature. Four empirical studies show that the proposed strategies have better out-of-sample performance and lower turnover than many other strategies, especially when the estimation risk is large.",
    "year": 2015,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "c420511fb81a7cf2e70efe792512d127",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T00:53:42.192325"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "The paper focuses on improving the mean-variance portfolio selection framework by addressing parameter uncertainty and estimation errors, which are central concerns in portfolio management. The proposed strategies aim to enhance out-of-sample performance and reduce turnover, directly aligning with the goals of portfolio management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Portfolio Management\"],\n  \"justification\": \"The paper focuses on improving the mean-variance portfolio selection framework by addressing parameter uncertainty and estimation errors, which are central concerns in portfolio management. The proposed strategies aim to enhance out-of-sample performance and reduce turnover, directly aligning with the goals of portfolio management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:22:09.277406"
}