{
  "paper": {
    "id": 710,
    "title": "Listed Company Financial Risk Prediction Based on BP Neural Work",
    "abstract": "This paper discusses correlative relation between company's financial risk and data mining and studies currently financial crisis warning optimization method of listed company. It analyzes and demonstrates neural network input dimension optimization of rough intension simplification, network weights, and threshold value of genetic algorithm optimization. In addition, it empirically analyzes the optimized model and traditional BP neural network model. Then, the genetic algorithm is used as preset device of neural network model which optimizes the initial value and threshold value at input terminal, to shorten the training time and to improve network predictive efficiency. Empirical research shows that financial risk predictive accuracy of optimized model is higher than traditional predictive accuracy and efficiency of BP neural network model.",
    "year": 2015,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "dce7f6e3dc99912c20b04ce04c06b05a",
    "relevant_keywords": [
      "machine learning",
      "neural network",
      "backpropagation",
      "BP",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T01:53:59.512166"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on predicting financial risks of listed companies using optimized BP neural networks and genetic algorithms, which is a direct application in the field of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on predicting financial risks of listed companies using optimized BP neural networks and genetic algorithms, which is a direct application in the field of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:55:47.829636"
}