{
  "paper": {
    "id": 6670,
    "title": "An asymmetric PROMETHEE II for cryptocurrency portfolio allocation based on return prediction",
    "abstract": "Portfolio allocation, portfolio selection, and portfolio optimization are recognized as three crucial problems in the financial field. Using different criteria in addition to return and risk in the portfolio allocation problem based on the multi-criteria decision-making (MCDM) methods makes it more practical in the real world. The emergence of new and volatile assets such as cryptocurrencies has recently increased the need to use portfolio allocation models. In order to reduce inequalities and alleviate poverty as one of the sustainable development goals, cryptocurrency portfolio construction leads to sustainable income and wealth. This paper proposes a cryptocurrency portfolio allocation model based on the asymmetric Preference Ranking Organization Method for Enrichment Evaluation (PROMETHEE II) method using eight criteria and nine cryptocurrencies. To reduce the uncertainty of the problem, the return prediction obtained from the Auto-Regressive Integrated Moving Average (ARIMA), the Long Short-Term Memory (LSTM), and the Random Forest Regression (RFR) models as return-related criteria and has been used from the SlideVaR, along with the Value at Risk (VaR) and the Conditional Value at Risk (C-VaR) as risk-related criteria to consider investor insight from the market situation. It is also proposed that an asymmetric preference function be proposed to consider gain and loss asymmetry as a behavioral phenomenon in the model. The out-of-sample performance of the proposed model in the last three months of 2021 confirms the superiority of the proposed model in terms of average return (= 0.017) and standard deviation (= 0.036) among other proposed models.(c) 2022 Elsevier B.V. All rights reserved.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "515c997672c6a8f7efa477063e678f05",
    "relevant_keywords": [
      "long short-term memory",
      "LSTM",
      "regression",
      "neural network",
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T03:00:35.326459"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心内容是提出一种基于多准则决策方法（MCDM）的加密货币投资组合分配模型，并使用了多种预测模型和风险度量方法（如SlideVaR、VaR和C-VaR）来优化投资组合。这明确属于投资组合管理领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心内容是提出一种基于多准则决策方法（MCDM）的加密货币投资组合分配模型，并使用了多种预测模型和风险度量方法（如SlideVaR、VaR和C-VaR）来优化投资组合。这明确属于投资组合管理领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:27:31.806327"
}