{
  "paper": {
    "id": 2784,
    "title": "INNOVATIONS AND TOURISM REGIONS: ARE INNOVATIONS PERCEIVED AS A PROBLEM IN REGIONAL DEVELOPMENT IN EUROPEAN TOURISM?",
    "abstract": "This article examines innovative aspects of the development of tourism regions in Europe. The article aims to determine the intensity of the perception of innovation in the tourism region as a problem in its development. The ambition of the article is to assess the problems in the development of tourism regions in Europe in the field of innovation as a possible starting point for optimizing changes in local and regional tourism policy. The research analyses the positions of 95 regional tourism experts from 17 European countries. The database was based on a databank of 150 representatives of academia and 275 representatives of regional tourism organizations. To analyse the properties of categorical data and the relationships between them, we used Gamma, Kendall's Tau-b, Somers' D C vertical bar R, Spearman correlation coefficient, Phi Coefficient, Contingency Coefficient, Cramer's V and the decision tree algorithm. The maturity of the innovation environment of tourism regions and their level of development influence the perception of innovations as a problem in their development. Southern European tourism regions perceive innovation as a problem in their development most intensively. Tourism regions with stronger innovation activity have a well-established quality management system and a comprehensive and systematically addressed supply of seasonal and off-season products. Tourism regions ranked in the emerging innovator group perceive the specified problems in the implementation of innovations more intensively. This reflects the lack of coordination of the product portfolio, both in terms of range and quality, in countries where the innovation environment is poorly developed. A key recommendation to mitigate the perception of innovations as a problem in the development of Europe's tourism regions is to focus attention on the implementation of regional policy instruments that stimulate the participation of tourism in the synergy effects of the existing innovation environment of the economy.",
    "year": 2023,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "6b00f3f78e0ab2b3a62a2e9ed1b52c30",
    "relevant_keywords": [
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T01:10:16.576250"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究欧洲旅游区域的创新发展问题，使用了决策树等统计方法分析数据，但其核心内容与衍生品定价、金融风险管理或投资组合管理无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究欧洲旅游区域的创新发展问题，使用了决策树等统计方法分析数据，但其核心内容与衍生品定价、金融风险管理或投资组合管理无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:13:10.461244"
}