{
  "paper": {
    "id": 1844,
    "title": "Recommendation of investment portfolio for peer-to-peer lending with additional consideration of bidding period",
    "abstract": "Peer-to-peer (P2P) lending has emerged as an alternative method of financing. Keeping pace with this development, many P2P lending studies have provided approaches to select investment portfolios for individual lenders. However, none of these approaches consider how long it takes for an individual loan to be fully funded so as to reduce the opportunity cost incurred due to delayed investment. In this paper, we propose a goal programming framework to develop an optimal P2P lending portfolio that considers not only the expected returns but also this opportunity cost for individual investors. First, for each loan proposal, a logistic regression model is used to predict the loan default probability while a Weibull regression is used to determine the opportunity cost incurred due to the time taken to obtain the loan. Next, goal programming is applied to construct a portfolio that minimizes the slack from the desired return on investment as well as the surplus from the preset opportunity cost due to a prolonged bidding period. The proposed approach is then applied to Prosper platform data and is expected to help investors' portfolio decisions in the P2P lending market.",
    "year": 2022,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "32badf5a83539b845c73a429424cac82",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:00:27.277288"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文提出了一种目标规划框架，用于开发考虑预期回报和机会成本的P2P借贷最优投资组合，这直接涉及投资组合管理的核心问题。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文提出了一种目标规划框架，用于开发考虑预期回报和机会成本的P2P借贷最优投资组合，这直接涉及投资组合管理的核心问题。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:18:42.137677"
}