{
  "paper": {
    "id": 952,
    "title": "Entrepreneurial Finance: Emerging Approaches Using Machine Learning and Big Data",
    "abstract": "For equity investors the identification of ventures that most likely will achieve the expected return on investment is an extremely complex task. To select early-stage companies, venture capitalists and business angels traditionally rely on a mix of assessment criteria and their own experience. However, given the high level of risk with new, innovative companies, the number of financially successful startups within an investment portfolio is generally very low. In this context of uncertainty, a data-driven approach to investment decision-making can provide more effective results. Specifically, the application of machine learning techniques can provide equity investors and scholars in entrepreneurial finance with new insights on patterns common to successful startups. This study presents a comprehensive overview of the applications of machine learning algorithms to the Crunchbase database. We highlight the main research goals that can be addressed and then we review all the variables and algorithms used for each goal. For each machine learning algorithm, we analyze the respective performance metrics to identify a baseline model. This study aims to be a reference for researchers and practitioners on the use of machine learning as an effective tool to support decision-making processes in equity investments.",
    "year": 2021,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "067d9df91c72e0655267a3e0db40f3c7",
    "relevant_keywords": [
      "machine learning",
      "classification",
      "regression",
      "decision tree",
      "clustering",
      "feature learning",
      "feature representation",
      "neural network",
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T00:50:08.695422"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文主要探讨了使用机器学习技术来支持股权投资决策，特别是通过分析初创企业的数据来预测其成功概率，这属于投资组合管理的范畴，因为它涉及选择和优化投资组合中的资产。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文主要探讨了使用机器学习技术来支持股权投资决策，特别是通过分析初创企业的数据来预测其成功概率，这属于投资组合管理的范畴，因为它涉及选择和优化投资组合中的资产。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:25:52.371853"
}