{
  "paper": {
    "id": 238,
    "title": "Dynamic interrelationships among crude oil, green bond, and carbon markets: Evidence from fuzzy logic autoencoders",
    "abstract": "This paper investigates the dynamic interrelationships among various markets covering crude oil, green bonds, and carbon emissions from January 2014 to October 2022, using a Fuzzy Logistic Autoencoder (FLAE) model, which elevates methodological sophistication and helps capturing intricate and complex relationships across the three markets. Different features of FLAE, such as identifying crossed lags and introducing a novel sigmoid-type activation function, enhance structural stability and establish the model as a reference for studying crosstemporal effects across markets. The key findings indicate that green bond returns negatively impact the returns of carbon emission allowances and Brent oil in the short and medium term. The impact of carbon emission allowance returns and oil returns on the forecast of green bond returns is comparatively trivial. Forecasting green bond returns is primarily driven by its short-term lags. These findings should be useful for portfolio managers in energy markets, environmentally conscious investors, and policy-makers concerned with financial sustainability amid the energy transition.",
    "year": 2025,
    "source": "WOS",
    "area": "portfolio",
    "method": "deep learning",
    "cache_key": "3b9778208e4d93a6ec5dc1d44d2dc07f",
    "relevant_keywords": [
      "autoencoder",
      "deep learning",
      "neural network",
      "sigmoid",
      "feature learning",
      "representation learning"
    ],
    "stage1_timestamp": "2025-05-15T00:33:39.517799"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文研究了原油、绿色债券和碳市场之间的动态相互关系，并指出这些发现对能源市场的投资组合经理、环保投资者和政策制定者有用，这直接关联到投资组合管理的领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文研究了原油、绿色债券和碳市场之间的动态相互关系，并指出这些发现对能源市场的投资组合经理、环保投资者和政策制定者有用，这直接关联到投资组合管理的领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:35:28.872286"
}