{
  "paper": {
    "id": 2885,
    "title": "Clustering of extreme values: estimation and application",
    "abstract": "The extreme value theory (EVT) encompasses a set of methods that allow inferring about the risk inherent to various phenomena in the scope of economic, financial, actuarial, environmental, hydrological, climatic sciences, as well as various areas of engineering. In many situations the clustering effect of high values may have an impact on the risk of occurrence of extreme phenomena. For example, extreme temperatures that last over time and result in drought situations, the permanence of intense rains leading to floods, stock markets in successive falls and consequent catastrophic losses. The extremal index is a measure of EVT associated with the degree of clustering of extreme values. In many situations, and under certain conditions, it corresponds to the arithmetic inverse of the average size of high-value clusters. The estimation of the extremal index generally entails two sources of uncertainty: the level at which high observations are considered and the identification of clusters. There are several contributions in the literature on the estimation of the extremal index, including methodologies to overcome the aforementioned sources of uncertainty. In this work we will revisit several existing estimators, apply automatic choice methods, both for the threshold and for the clustering parameter, and compare the performance of the methods. We will end with an application to meteorological data.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "786fad41e32b3e2c60a0d851dc5e81df",
    "relevant_keywords": [
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T02:20:16.894615"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要讨论了极端值理论（EVT）及其在气象数据中的应用，虽然提到了股票市场的连续下跌和灾难性损失，但并未明确指出其在衍生品定价、金融风险管理或投资组合管理等金融领域的核心应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要讨论了极端值理论（EVT）及其在气象数据中的应用，虽然提到了股票市场的连续下跌和灾难性损失，但并未明确指出其在衍生品定价、金融风险管理或投资组合管理等金融领域的核心应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:39:21.430192"
}