{
  "paper": {
    "id": 1077,
    "title": "Management and monitoring of the displaced commercial risk: a prescriptive approach",
    "abstract": "Purpose The displaced commercial risk is one of the specific risks in the Islamic finance that creates a serious debate among practitioners and researchers about its management. The purpose of this paper is to assess a new approach to manage this risk using machine learning algorithms. Design/methodology/approach To attempt this purpose, the authors use several machine learning algorithms applied to a set of financial data related to banks from different regions and consider the deposit variation intensity as an indicator. Findings Results show acceptable prediction accuracy. The model could be used to optimize the prudential reserves for banks and the incomes distributed to depositors. Originality/value Previous studies have analyzed the origin and impact of DCR. To the best of authors' knowledge, none of them has provided an ex ante management tool for this risk. Furthermore, the authors suggest the use of a new approach based on machine learning algorithms.",
    "year": 2024,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "e3a6f4ef1c9f5b90ecb909280e94cdaf",
    "relevant_keywords": [
      "machine learning"
    ],
    "stage1_timestamp": "2025-05-15T01:58:43.360925"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on managing the displaced commercial risk (DCR) in Islamic finance using machine learning algorithms, which is a specific type of financial risk. The study aims to optimize prudential reserves and income distribution to depositors, indicating a clear application in financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on managing the displaced commercial risk (DCR) in Islamic finance using machine learning algorithms, which is a specific type of financial risk. The study aims to optimize prudential reserves and income distribution to depositors, indicating a clear application in financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:52:19.060557"
}