{
  "paper": {
    "id": 1165,
    "title": "Customer Churn Prediction in the Iranian Banking Sector",
    "abstract": "in the financial system such as the banking sector, customers are valuable, and losing them is very expensive as customer churn is a major challenge facing banks. In this paper, we present a time series Deep Neural Networks (DNNs)-based approach for customer retention, in which a dataset has been collected from retail banking customers in the Republic Islamic of Iran. The dataset consists of real daily transactional data of about 50,000 customers in Pasargad bank in the months of November and December 2021. The goal of this study is to perform a highly churned customer predictor, attempting to observe the customer information in 30 days and predict the customer behavior in the next 30 days. Also, unlike other research in this field where the labels of customers are already determined, we present a new definition of the churned banking customer to label the data. Then, the data is cleaned, preprocessed, and prepared to import to a BiLSTM neural network. The proposed model has shown a significant superiority over Traditional Machine Learning Techniques. This paper can guide researchers in the field of banking and artificial intelligence, providing business knowledge to managers in the banking sector to reduce the risk of losing their customers.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "9410f95bc0c864f71e699c3110faae1b",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "neural network",
      "deep learning",
      "long short-term memory",
      "LSTM"
    ],
    "stage1_timestamp": "2025-05-15T01:59:56.246991"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究客户流失预测在银行业的应用，虽然涉及金融领域，但其核心技术（时间序列深度神经网络）主要用于客户行为预测和客户保留，并不直接涉及衍生品定价、金融风险管理或投资组合管理等特定金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究客户流失预测在银行业的应用，虽然涉及金融领域，但其核心技术（时间序列深度神经网络）主要用于客户行为预测和客户保留，并不直接涉及衍生品定价、金融风险管理或投资组合管理等特定金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:51:39.114241"
}