{
  "paper": {
    "id": 880,
    "title": "Volatility forecasting for interbank offered rate using grey extreme learning machine: The case of China",
    "abstract": "Interbank Offered rate is the only direct market rate in China's currency market. Volatility forecasting of China Interbank Offered Rate (IBOR) has a very important theoretical and practical significance for financial asset pricing and financial risk measure or management. However, IBOR is a dynamics and non-steady time series whose developmental changes have stronger random fluctuation, so it is difficult to forecast the volatility of IBOR. This paper offers a hybrid algorithm using grey model and extreme learning machine (ELM) to forecast volatility of IBOR. The proposed algorithm is composed of three phases. In the first, grey model is used to deal with the original IBOR time series by accumulated generating operation (AGO) and weaken the stochastic volatility in original series. And then, a forecasting model is founded by using ELM to analyze the new IBOR series. Lastly, the predictive value of the original IBOR series can be obtained by inverse accumulated generating operation (IAGO). The new model is applied to forecasting Interbank Offered Rate of China. Compared with the forecasting results of BP and classical ELM, the new model is more efficient to forecasting short- and middle-term volatility of IBOR. (C) 2015 Elsevier Ltd. All rights reserved.",
    "year": 2016,
    "source": "WOS",
    "area": "financial_risk",
    "method": "deep learning",
    "cache_key": "516dd19da7cc89c1fec79c0c9c7f6394",
    "relevant_keywords": [
      "machine learning",
      "neural network",
      "backpropagation",
      "BP"
    ],
    "stage1_timestamp": "2025-05-15T01:43:54.562904"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用灰色极端学习机（Grey Extreme Learning Machine）来预测中国银行间同业拆借利率（IBOR）的波动性。论文明确指出这种波动性预测对于金融资产定价和金融风险度量或管理具有重要的理论和实践意义。因此，该研究主要应用于金融风险管理领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是使用灰色极端学习机（Grey Extreme Learning Machine）来预测中国银行间同业拆借利率（IBOR）的波动性。论文明确指出这种波动性预测对于金融资产定价和金融风险度量或管理具有重要的理论和实践意义。因此，该研究主要应用于金融风险管理领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:02:00.849593"
}