{
  "paper": {
    "id": 4074,
    "title": "Development of an empirical formula for machine classification: Prioritization of maintenance tasks",
    "abstract": "Continuous type production and discrete type manufacturing systems face challenges in optimizing the maintenance related costs. The risk based maintenance approach has been carried out within the continuous type production systems to classify equipment in production and process facilities based on the risk of failure that can cause financial, societal and environmental challenges to the asset owner. At the same time the term 'machine classification' (MC) has been used within the discrete type manufacturing systems to classify machines based on the influence on; production process to continue, delay in deliveries, product quality as well as personnel, process, societal and environmental safety. Initially, this paper discusses the role of the MC in mitigating health, safety and environmental challenges. Then, it derives an empirical formula performing classification of machines. The derivation has been performed by carrying out a case study in three manufacturing companies and utilizing the three different MC models employed by them. Finally, the manuscript verifies the empirical formula with an arbitrarily selected manufacturing organization. (C) 2013 Elsevier Ltd. All rights reserved.",
    "year": 2014,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "5a16f4c23c8038dc78a86c6df71d85ca",
    "relevant_keywords": [
      "classification"
    ],
    "stage1_timestamp": "2025-05-15T02:33:03.371064"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要讨论了在生产和制造系统中优化维护任务的分类方法，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要讨论了在生产和制造系统中优化维护任务的分类方法，并未涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:34:18.427000"
}