{
  "paper": {
    "id": 6900,
    "title": "Machine learning for screening and predicting the risk of anti-MDA5 antibody in juvenile dermatomyositis children",
    "abstract": "ObjectiveThe anti-MDA5 (anti-melanoma differentiation associated gene 5) antibody is often associated with a poor prognosis in juvenile dermatomyositis (JDM) patients. In many developing countries, there is limited ability to access myositis- specific antibodies due to financial and technological issues, especially in remote regions. This study was performed to develop a prediction model for screening anti-MDA5 antibodies in JDM patients with commonly available clinical findings. MethodsA cross-sectional study was undertaken with 152 patients enrolled from the inpatient wards of Beijing Children's Hospital between June 2018 and September 2021. Stepwise logistic regression, least absolute shrinkage and selection operator (LASSO) regression, and the random forest (RF) method were used to fit the model. Model discrimination, calibration, and decision curve analysis were performed for validation. ResultsThe final prediction model included eight clinical variables (gender, fever, alopecia, periungual telangiectasia, digital ulcer, interstitial lung disease, arthritis/arthralgia, and Gottron sign) and four auxiliary results (WBC, CK, CKMB, and ALB). An anti-MDA5 antibody risk probability-predictive nomogram was established with an AUC of 0.975 predicted by the random forest algorithm. The model was internally validated by Harrell's concordance index (0.904), the Brier score (0.052), and a 500 bootstrapped satisfactory calibration curve. According to the net benefit and predicted probability thresholds of decision curve analysis, the established model showed a significantly higher net benefit than the traditional logistic regression model. ConclusionWe developed a prediction model using routine clinical assessments to screen for JDM patients likely to be anti-MDA5 positive. This new tool may effectively predict the detection of anti-MDA5 in these patients using a non-invasive and efficient way.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "29add29edba3aa88eeb23346bda10c3f",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "regression",
      "decision tree",
      "random forest"
    ],
    "stage1_timestamp": "2025-05-15T03:02:41.318200"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究使用机器学习模型预测抗MDA5抗体在儿童皮肌炎中的风险，属于医学领域，与金融研究领域无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究使用机器学习模型预测抗MDA5抗体在儿童皮肌炎中的风险，属于医学领域，与金融研究领域无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:27:07.000537"
}