{
  "paper": {
    "id": 4500,
    "title": "Variations of Particle Swarm Optimization for Obtaining Classification Rules Applied to Credit Risk in Financial Institutions of Ecuador",
    "abstract": "Knowledge generated using data mining techniques is of great interest for organizations, as it facilitates tactical and strategic decision making, generating a competitive advantage. In the special case of credit granting organizations, it is important to clearly define rejection/approval criteria. In this direction, classification rules are an appropriate tool, provided that the rule set has low cardinality and that the antecedent of the rules has few conditions. This paper analyzes different solutions based on Particle Swarm Optimization (PSO) techniques, which are able to construct a set of classification rules with the aforementioned characteristics using information from the borrower and the macroeconomic environment at the time of granting the loan. In addition, to facilitate the understanding of the model, fuzzy logic is incorporated into the construction of the antecedent. To reduce the search time, the particle swarm is initialized by a competitive neural network. Different variants of PSO are applied to three databases of financial institutions in Ecuador. The first institution specializes in massive credit placement. The second institution specializes in consumer credit and business credit lines. Finally, the third institution is a savings and credit cooperative. According to our results, the incorporation of fuzzy logic generates rule sets with greater precision.",
    "year": 2020,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "9295cd3377a8de6e787b861c8759183c",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T02:37:47.568759"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用粒子群优化（PSO）和模糊逻辑来生成分类规则，用于信用风险评估。信用风险评估是金融风险管理的一个重要组成部分，特别是在贷款审批过程中。论文明确提到应用场景是金融机构的信用风险分析，因此属于金融风险管理领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是使用粒子群优化（PSO）和模糊逻辑来生成分类规则，用于信用风险评估。信用风险评估是金融风险管理的一个重要组成部分，特别是在贷款审批过程中。论文明确提到应用场景是金融机构的信用风险分析，因此属于金融风险管理领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:32:55.171791"
}