{
  "paper": {
    "id": 484,
    "title": "A Comparative Study of Financial Big Data Standard System Based on Deep Learning Algorithms",
    "abstract": "The standard system of financial big data involves a wide range of contents and diversification. Financial institutions in the process of operation and social sectors constitute a huge interweaving network, precipitating a large number of data. In this context, data security is particularly important. Therefore, based on the deep learning algorithm, the author compares and studies the financial big data standard system. The in-depth learning model is introduced into the financial market and combined with the traditional statistical model to forecast the volatility of the financial market and calculate its risk value. Through the research and comparative analysis of the domestic and international financial big data standard norm system, it is found that part of the domestic financial big data standard specification is revised by reference, while the other part has the characteristics of Chinese financial market. However, there is still room for further development in terms of financial big data regulation, information security, financial enterprise big data platform construction and analytical capabilities.",
    "year": 2019,
    "source": "WOS",
    "area": "financial_risk",
    "method": "deep learning",
    "cache_key": "6f9dfd2d6f19e015c7a2a1248c889d93",
    "relevant_keywords": [
      "deep learning",
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T01:38:59.241288"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是基于深度学习算法预测金融市场的波动性并计算其风险值，这直接关联到金融风险管理领域。虽然论文也涉及金融大数据标准体系的研究，但其主要应用场景和研究成果集中在风险预测和管理上。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是基于深度学习算法预测金融市场的波动性并计算其风险值，这直接关联到金融风险管理领域。虽然论文也涉及金融大数据标准体系的研究，但其主要应用场景和研究成果集中在风险预测和管理上。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:02:52.635226"
}