{
  "paper": {
    "id": 1307,
    "title": "Group Recommendation Based on Financial Social Network for Robo-Advisor",
    "abstract": "Robo-advisor is a financial advisor that can get help from machine-learning algorithms to automatically analyze financial product risk levels and provide portfolio recommendations. In the previous work, robo-advisor mainly focused on the basic information and investment preferences of individual users and often ignored the relationship between groups and the individual's risk preference. In the actual environment, the individual investment behavior and the group's social relations are inseparable. In order to solve this challenge, this paper proposes a group recommendation model based on financial social networks and collaborative filtering algorithms. Compared with the latest personalized recommendation system, it not only considers the asset status and risk level of individual investors but also considers social relationships and risk levels among groups. With experiments on benchmark and real-world datasets, we demonstrate that the proposed algorithm achieves the superior performance on both the tasks compared to the state-of-the-art methods.",
    "year": 2018,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "850175c9a65059f777d924b64e9b37fc",
    "relevant_keywords": [
      "machine learning",
      "clustering",
      "neural network",
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T02:01:11.921885"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是基于金融社交网络和协同过滤算法的群体推荐模型，旨在为机器人顾问提供投资组合推荐。论文明确提到分析金融产品风险水平并提供投资组合推荐，这直接属于投资组合管理的范畴。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是基于金融社交网络和协同过滤算法的群体推荐模型，旨在为机器人顾问提供投资组合推荐。论文明确提到分析金融产品风险水平并提供投资组合推荐，这直接属于投资组合管理的范畴。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:49:50.725164"
}