{
  "paper": {
    "id": 1946,
    "title": "A Model-Adaptive Clustering-Based Time Aggregation Method for Low-Carbon Energy System Optimization",
    "abstract": "Intermittent renewable energy resources like wind and solar introduce uncertainty across multiple time scales, from minutes to years, on the design and operation of power systems. Energy system optimization models have been developed to find the least-cost solution that manages the multi-timescale variability using an optimal portfolio of flexible resources. However, input data that capture such multi-timescale uncertainty are characterized with a long time horizon and high resolution, which brings great difficulty to solving the optimization model. Here we propose a model-adaptive time aggregation method based on clustering to alleviate the computational complexity, in which the energy system is solved over selected representative time periods instead of the full time horizon. The proposed clustering method is adaptive to various energy system optimization models or settings, because it extracts features from the optimization models to inform the clustering process. Results show that the proposed adaptive method can significantly lower the error in approximating the solution of the optimization model with the full time horizon, compared to traditional time aggregation methods.",
    "year": 2023,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "d39354af5152f2abd6b9bc02a113cfb3",
    "relevant_keywords": [
      "clustering"
    ],
    "stage1_timestamp": "2025-05-15T01:01:41.576812"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究一种基于聚类的模型自适应时间聚合方法，用于低碳能源系统优化，其核心技术和应用场景集中在能源系统领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究一种基于聚类的模型自适应时间聚合方法，用于低碳能源系统优化，其核心技术和应用场景集中在能源系统领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:18:10.796813"
}