{
  "paper": {
    "id": 568,
    "title": "DEEP NEURAL NETWORKS METHODS FOR ESTIMATING MARKET MICROSTRUCTURE AND SPECULATIVE ATTACKS MODELS: THE CASE OF GOVERNMENT BOND MARKET",
    "abstract": "A sovereign bond market offers a wide range of opportunities for public and private sector financing and has drawn the interest of both scholars and professionals as they are the main instrument of most fixed-income asset markets. Numerous works have studied the behavior of sovereign bonds at the microeconomic level, given that a domestic securities market can enhance overall financial stability and improve financial market intermediation. Nevertheless, they do not deepen methods that identify liquidity risks in bond markets. This study introduces a new model for predicting unexpected situations of speculative attacks in the government bond market, applying methods of deep learning neural networks, which proactively identify and quantify financial market risks. Our approach has a strong impact in anticipating possible speculative actions against the sovereign bond market and liquidity risks, so the aspect of the potential effect on the systemic risk is of high importance.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "deep learning",
    "cache_key": "05c9f542fab3625f6701adc16195e5f0",
    "relevant_keywords": [
      "machine learning",
      "neural network",
      "deep learning",
      "representation learning",
      "backpropagation",
      "BP",
      "hidden layer"
    ],
    "stage1_timestamp": "2025-05-15T01:40:14.162902"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是应用深度神经网络方法来预测政府债券市场中的投机攻击和流动性风险，这直接涉及金融风险管理领域。论文明确提到其目标是识别和量化金融市场风险，特别是系统性风险的影响，因此其主要应用领域是金融风险管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心技术是应用深度神经网络方法来预测政府债券市场中的投机攻击和流动性风险，这直接涉及金融风险管理领域。论文明确提到其目标是识别和量化金融市场风险，特别是系统性风险的影响，因此其主要应用领域是金融风险管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:02:48.779287"
}