{
  "paper": {
    "id": 6876,
    "title": "Simplified Evolving Rule-Based Fuzzy Modeling of Realized Volatility Forecasting with Jumps",
    "abstract": "Financial asset volatility modeling and forecasting play a central role in risk management, portfolio selection, and derivative pricing. The increasing availability of market data at intraday frequencies has led to the development of improved volatility measurements such as realized volatility. The literature has shown that simple realized volatility models outperform the popular GARCH and related stochastic volatility models in out-of-sample forecasting. Moreover, gains in performance are achieved by separately considering volatility jump components. This paper suggests a nonlinear approach for realized volatility forecasting with jumps using a simplified evolving fuzzy system based on the concept of data clouds. Such an approach offers an alternative nonparametric form of fuzzy rule antecedents that reflects the real data distribution without requiring any explicit aggregation operations or membership functions, thus providing a more autonomous and efficient algorithm. Empirical results based on the Brazilian stock market index Ibovespa reveal the high potential of the evolving cloud-based fuzzy approach in modeling time-varying realized volatility with jump components, outperforming a traditional benchmark based on a linear regression, as well as alternative evolving fuzzy systems.",
    "year": 2013,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "7644e9df480b6a404a99480ad9959728",
    "relevant_keywords": [
      "machine learning",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T03:02:41.194886"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk",
      "Portfolio Management",
      "Derivatives Pricing"
    ],
    "justification": "The paper explicitly mentions that financial asset volatility modeling and forecasting play a central role in risk management, portfolio selection, and derivative pricing. The study focuses on forecasting realized volatility with jumps, which is directly applicable to these three financial domains.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\", \"Portfolio Management\", \"Derivatives Pricing\"],\n  \"justification\": \"The paper explicitly mentions that financial asset volatility modeling and forecasting play a central role in risk management, portfolio selection, and derivative pricing. The study focuses on forecasting realized volatility with jumps, which is directly applicable to these three financial domains.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:27:07.518191"
}