{
  "paper": {
    "id": 2120,
    "title": "Clustering and visualization of bankruptcy trajectory using self-organizing map",
    "abstract": "Bankruptcy trajectory reflects the dynamic changes of financial situation of companies, and hence make possible to keep track of the evolution of companies and recognize the important trajectory patterns. This study aims at a compact visualization of the complex temporal behaviors in financial statements. We use self-organizing map (SUM) to analyze and visualize the financial situation of companies over several years through a two-step clustering process. Initially, the bankruptcy risk is characterized by a feature self-organizing map (FSOM), and therefore the temporal sequence is converted to the trajectory vector projected on the map. Afterwards, the trajectory self-organizing map (TSOM) clusters the trajectory vectors to a number of trajectory patterns. The proposed approach is applied to a large database of French companies spanning over four years. The experimental results demonstrate the promising functionality of SUM for bankruptcy trajectory clustering and visualization. From the viewpoint of decision support, the method might give experts insight into the patterns of bankrupt and healthy company development. (c) 2012 Elsevier Ltd. All rights reserved.",
    "year": 2013,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "27d57c71f228a2d6c24c585a36b10c7e",
    "relevant_keywords": [
      "machine learning",
      "unsupervised learning",
      "clustering",
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T02:11:40.509142"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文主要研究使用自组织映射（SOM）对破产轨迹进行聚类和可视化，旨在帮助专家识别破产和健康公司的发展模式。这属于金融风险管理中信用风险管理的范畴，因为破产预测和监控是风险管理的重要组成部分。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文主要研究使用自组织映射（SOM）对破产轨迹进行聚类和可视化，旨在帮助专家识别破产和健康公司的发展模式。这属于金融风险管理中信用风险管理的范畴，因为破产预测和监控是风险管理的重要组成部分。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:44:05.938789"
}