{
  "paper": {
    "id": 1258,
    "title": "Research on Influencing Factors and Early Warning of University Finance Based on Decision Tree Model",
    "abstract": "The level and quality of financial management work are directly related to the progress of the work of the university in all aspects, and it is related to the normal operation of the overall mechanism of the university. With the fast development of Chinese universities, the Chinese government has increasingly relaxed its laws, allowing universities to exercise greater autonomy. However, there are many issues in financial management. Therefore, it is critical to solve the problems in the financial management of universities. In this study, the financial survey data of 56 colleges and universities are collected and, based on the detailed analysis of the development and financial situation of these colleges and universities, we summarize and analyze the financial situation of these colleges and universities. Moreover, a decision tree-based early warning system is constructed for early prediction of financial risk of colleges and universities. Finally, in light of the highlighted elements affecting college and university financial management, appropriate countermeasures and solutions are offered from both an external and internal perspective.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "f510e45a03fbcc851f4971ccb46f1ad7",
    "relevant_keywords": [
      "decision tree",
      "classification"
    ],
    "stage1_timestamp": "2025-05-15T02:00:30.670616"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究的是高校财务管理中的风险预警系统，虽然涉及财务风险，但其应用场景是高校财务管理而非金融市场中的金融风险管理、衍生品定价或投资组合管理。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究的是高校财务管理中的风险预警系统，虽然涉及财务风险，但其应用场景是高校财务管理而非金融市场中的金融风险管理、衍生品定价或投资组合管理。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:50:33.616046"
}