{
  "paper": {
    "id": 3458,
    "title": "A novel deep learning approach to enhance creditworthiness evaluation and ethical lending practices in the economy",
    "abstract": "Evaluating a borrower's creditworthiness and enabling ethical lending practices are two of the most essential functions of credit scoring, making it an integral part of the economy. Credit risk management is an essential aspect of the financial industry, with the primary goal of minimising potential losses caused by customers failing to meet their credit responsibilities, such as fails to pay and bankruptcies. This risk is inherent in lending activities, where lenders extend credit to individuals or businesses. The traditional credit scoring approaches, which rely on statistical and machine learning techniques to analyse complex data and non-linear correlations in credit data has to be improved. Because the current financial sector lacks credit scoring, a deep learning network-based credit ranking model is presented in this research. This paper applies the complicated field of deep learning known as the stacked unidirectional and bidirectional long short-term memory model in the network to resolve credit scoring issues. Since scoring is not a time sequence issue, the suggested model uses the three-layer stacked LSTM and bidirectional LSTM architecture by modelling public datasets in a new way. Our suggested models beat state-of-the-art, considerably more difficult deep learning methods, proving that we could keep complexity to a minimum. The research findings indicate that the model demonstrates high levels of accuracy across various datasets. The model obtains an accuracy of 99.5% on the Australian dataset, 99.4% on the German dataset (categorical), 99.7% on the German dataset (numerical), 99.2% on the Japanese dataset, and 99.8% on the Taiwanese dataset. These results highlight the robustness and effectiveness of the model in accurately predicting outcomes for different geographical regions.",
    "year": 2025,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "f9e8b4ad83e318ed1f14d01fd5ed6c3c",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "neural network",
      "long short-term memory",
      "LSTM"
    ],
    "stage1_timestamp": "2025-05-15T02:26:09.251572"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on developing a deep learning model for credit scoring to evaluate borrowers' creditworthiness and minimize potential losses in lending activities, which is a core aspect of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on developing a deep learning model for credit scoring to evaluate borrowers' creditworthiness and minimize potential losses in lending activities, which is a core aspect of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:36:26.092144"
}