{
  "paper": {
    "id": 3115,
    "title": "IDENTIFYING MOTIVATION OF THE LOCAL GOVERNMENTS TO IMPROVE THE SUSTAINABILITY TRANSPARENCY",
    "abstract": "This paper examines the sustainability transparency of governments, i.e., the disclosure of information on the sustainability of their actions. To do so, we identify contributory factors to the online disclosure of environmental, social, economic and general information by local governments in Nordic countries. Linear regression analysis was used to identify factors influencing the online dissemination of government information on sustainability; a factor analysis, as a precursor to linear regression, led us to reduce 14 explanatory variables to four factors: financial risk, demography, professional qualifications and local government resources. The results obtained show that local financial priorities have a greater impact on the sustainability-related content of governmental websites than does concern for the needs of the population. Furthermore, an organization's disclosure of its financial risks, together with greater awareness of stakeholders' demands, could promote transparency in the field of environmental, social and economic sustainability, while local demographic characteristics could foster the publication of information on environmental sustainability.",
    "year": 2015,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "3f5182a18f5cf5cfaff0eb17eb716add",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:22:56.639672"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究地方政府在可持续性透明度方面的信息披露，虽然提到了金融风险作为一个影响因素，但其核心研究并不涉及衍生品定价、金融风险管理或投资组合管理等金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究地方政府在可持续性透明度方面的信息披露，虽然提到了金融风险作为一个影响因素，但其核心研究并不涉及衍生品定价、金融风险管理或投资组合管理等金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:38:29.858142"
}