{
  "paper": {
    "id": 3825,
    "title": "Asymmetry of return distribution, abnormality of intradaily risk based on quantile regression model with high-frequency data from Shanghai stock market",
    "abstract": "In finance and econometrics, study on high-frequency time series data has attracted plenty of attentions in recent years. The high-frequency time series data do help to investigate the microstructure theory of financial market more closely, and the need of modeling high-frequency data for risk management has already risen greatly in practice. In the paper, the quantile regression model with ARCH effect, as an ideal semi-parametric approach to estimate the quantile of return distribution directly that differs from the conventional mean-variance framework in risk management and econometrics, is applied to analyze the 5-minitue high-frequency intradaily return and trading volume time series of Shanghai Composite Index in Shanghai stock market of China. We find that the significant asymmetry of return distribution and negative relationship between price change and first-order lagged trading volume, and that value at risk analysis and back testing also indicate quantile regression model is a competitive method to risk management in high-frequency data conditions. Finally the abnormality of intradaily risk pattern near opening and closing is also discovered.",
    "year": 2007,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "7ebcb66da844290e199aee40cb32d855",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:30:28.635388"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on applying a quantile regression model to analyze high-frequency intraday return data for risk management purposes, specifically mentioning value at risk analysis and back testing, which are key components of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on applying a quantile regression model to analyze high-frequency intraday return data for risk management purposes, specifically mentioning value at risk analysis and back testing, which are key components of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:35:07.773766"
}