{
  "paper": {
    "id": 3078,
    "title": "A New Extended Geometric Distribution: Properties, Regression Model, and Actuarial Applications",
    "abstract": "In this paper, a new modified version of geometric distribution is proposed. The newly introduced model is called transmuted record type geometric (TRTG) distribution. TRTG distribution is a good alternative to the negative binomial, Poisson and geometric distributions in modeling real data encountered in several applied fields. The main statistical properties of the new distribution were obtained. We determined the measures of value at risk and tail value at risk for the TRTG distribution. These measures are important quantities in actuarial sciences for portfolio optimization under uncertainty. The TRTG parameters were estimated via maximum likelihood, moments, proportions, and Bayesian estimation methods, and the simulation results were determined to explore their performance. Furthermore, a new count regression model based on the TRTG distribution was proposed. Four real data applications were adopted to illustrate the applicability of the TRTG distribution and its count regression model. These applications showed empirically that the TRTG distribution outperforms some important discrete models such as the negative binomial, transmuted geometric, discrete Burr, discrete Chen, geometric, and Poisson distributions.",
    "year": 2021,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "e2227c5de2fb177e3937c9be5b67e814",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T01:13:09.904890"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文提出了一个新的几何分布模型（TRTG分布），并讨论了其在风险价值（Value at Risk）和尾部风险价值（Tail Value at Risk）测量中的应用，这些是金融风险管理中的关键概念。此外，论文还提到了在不确定性下的投资组合优化，这也是金融风险管理的一部分。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文提出了一个新的几何分布模型（TRTG分布），并讨论了其在风险价值（Value at Risk）和尾部风险价值（Tail Value at Risk）测量中的应用，这些是金融风险管理中的关键概念。此外，论文还提到了在不确定性下的投资组合优化，这也是金融风险管理的一部分。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:11:30.900311"
}