{
  "paper": {
    "id": 2040,
    "title": "The Effect of Corporate Governance Structure on Financial Risk-Empirical Evidence Based on Agricultural Listed Companies",
    "abstract": "Taking agricultural listed companies from 2011 to 2015 in A shares as the research samples, considering the characters of the agricultural listed companies, this paper utilizes the Efficacy Coefficient Score to differentiate the enterprise financial risk and make the empirical research between the financial risk and the governance structure through the Binary Logistic Regression. This paper discovers that in the agricultural listed companies, the ownership concentration, the state-owned holding company and the one person holding two positions can restrain financial risk. The equity restriction ratio, the board size, the ratio of independent directors and the board of supervisors will enlarge the financial risk. The frequency of board meeting and board of supervisors meeting, the senior executive's shareholding and executive compensation have no significantly effects on financial risk.",
    "year": 2017,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "662541c6f9c4f725b372415b3d6512f7",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:10:25.782279"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on analyzing the relationship between corporate governance structure and financial risk in agricultural listed companies, using empirical methods to assess financial risk. This directly pertains to the field of financial risk management, as it involves identifying and mitigating financial risks within corporate structures.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on analyzing the relationship between corporate governance structure and financial risk in agricultural listed companies, using empirical methods to assess financial risk. This directly pertains to the field of financial risk management, as it involves identifying and mitigating financial risks within corporate structures.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:44:46.748740"
}