{
  "paper": {
    "id": 577,
    "title": "Measuring retail company performance using credit scoring techniques",
    "abstract": "This paper discusses models for evaluating credit risk in relation to the retailing industry. Hunt's [Hunt, S.D., 2000. A General Theory of Competition. Sage Publications Inc., California] Resource-Advantage Theory of Competition is used as a basis for variable selection, given the theory's relevancy to retail competition. The study focuses on the US retail market. Four standard credit scoring methodologies: Naive Bayes, Logistic Regression, Recursive Partitioning and Artificial Neural Network, are compared with Sequential Minimal Optimization (SMO), using a sample of 195 healthy companies and 51 distressed firms over five time periods from 1994 to 2002. The five methodologies performed well in predicting default particularly one year before financial distress. Prediction remained sound even five years before distress with accuracy rates above 78% and AUROC values above 0.79. No single methodology, however, had the best classification ability across different time scales and variable sets. External environmental influences exist, but these influences are weak. In terms of similarity with Moody's ranking, both SMO and logistic regression models are better than the neural network model, with SMO being slightly better than logistic regression. (c) 2006 Elsevier B.V. All rights reserved.",
    "year": 2007,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "d4d40b0845c6300f047ed9c158679ddd",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "regression",
      "support vector machine",
      "SVM",
      "decision tree",
      "neural network"
    ],
    "stage1_timestamp": "2025-05-15T01:52:49.412738"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心技术是使用多种信用评分方法来评估零售行业的信用风险，并预测公司违约情况。这直接涉及金融风险管理中的信用风险管理领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"该论文的核心技术是使用多种信用评分方法来评估零售行业的信用风险，并预测公司违约情况。这直接涉及金融风险管理中的信用风险管理领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:56:41.531685"
}