{
  "paper": {
    "id": 6,
    "title": "Determination of Individual Investors' Financial Risk Tolerance by Machine Learning Methods",
    "abstract": "Financial risk tolerance refers to the amount of risk that an investor is willing to take in order to obtain returns. In this study, it was aimed to heuristically determine the individual investor financial risk tolerance by using demographic and socioeconomic variables. For this purpose, a questionnaire consisting of two parts was applied to blond University Computer Engineering Department students and administrative and academic staff. In the first part of the questionnaire, demographic and socioeconomic information of the participants were taken, and in the second part, 13 questions aiming to measure the financial risk tolerance were asked. The participants were labeled as risk-averse, risk-neutral and risk-loving according to their answers. The obtained data were classified by decision tree, k-nearest neighbor and support vector machine methods. 10-fold cross-validation method was used to determine model performances. According to the results of the experiment, the best classification performance was obtained with a overall accuracy value of 66.67% using the decision tree classifier.",
    "year": 2020,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "84bb606570ccfe8f189445e39395aed8",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T01:45:16.452981"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "该论文的核心研究是通过机器学习方法确定个体投资者的金融风险容忍度，这直接关联到金融风险管理中的投资者风险偏好评估，有助于金融机构更好地管理客户风险。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\"],\n  \"justification\": \"该论文的核心研究是通过机器学习方法确定个体投资者的金融风险容忍度，这直接关联到金融风险管理中的投资者风险偏好评估，有助于金融机构更好地管理客户风险。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:01:36.421520"
}