{
  "paper": {
    "id": 298,
    "title": "A Synthetic Regression Model for Large Portfolio Allocation",
    "abstract": "Portfolio allocation is an important topic in financial data analysis. In this article, based on the mean-variance optimization principle, we propose a synthetic regression model for construction of portfolio allocation, and an easy to implement approach to generate the synthetic sample for the model. Compared with the regression approach in existing literature for portfolio allocation, the proposed method of generating the synthetic sample provides more accurate approximation for the synthetic response variable when the number of assets under consideration is large. Due to the embedded leave-one-out idea, the synthetic sample generated by the proposed method has weaker within sample correlation, which makes the resulting portfolio allocation more close to the optimal one. This intuitive conclusion is theoretically confirmed to be true by the asymptotic properties established in this article. We have also conducted intensive simulation studies in this article to compare the proposed method with the existing ones, and found the proposed method works better. Finally, we apply the proposed method to real datasets. The yielded returns look very encouraging.",
    "year": 2022,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "e43e1047caf6dd7c2e06b9cb5cf5b43d",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T00:42:00.398938"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "The paper focuses on proposing a synthetic regression model for portfolio allocation based on the mean-variance optimization principle, which is a core technique in portfolio management. The study aims to improve the accuracy of portfolio allocation, especially for large numbers of assets, and demonstrates its application through simulation studies and real datasets.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Portfolio Management\"],\n  \"justification\": \"The paper focuses on proposing a synthetic regression model for portfolio allocation based on the mean-variance optimization principle, which is a core technique in portfolio management. The study aims to improve the accuracy of portfolio allocation, especially for large numbers of assets, and demonstrates its application through simulation studies and real datasets.\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:32:08.376057"
}