{
  "paper": {
    "id": 380,
    "title": "The use of genetic programming for the construction of a financial management model in an enterprise",
    "abstract": "The fast development in China's economy has caused the rapid expansion of the domestic market. Since many economists do not have optimistic views regarding the bubble economy of China, it is necessary for Taiwanese businessmen to understand in-depth the business operational performance and financial situation of enterprises in China, so as to reduce the risk of a potential investment. In this article, data from the China Economic Research Database (CCER), the financial database of financial corporations are collected for analysis to investigate the business operation and management performance and financial characteristic of enterprises in China. In this article, grey relational analysis is applied first in order to investigate the business operational performance of 600 enterprises in China. Afterwards, a more recent clustering technique is used to divide, based on financial characteristic, enterprises in China into two groups. Finally, three models, namely genetic programming, Back-Propagation Neural Network and Logistic Regression are adopted to construct an Enterprise Operational Performance model and an Enterprise Finance Characteristic model, respectively. Based on the results found, it can be concluded that genetic programming yielded the best classification and forecast performance, compared to the other three techniques.",
    "year": 2012,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "71de5fd3e14cc2e4ec57f0acd2406996",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "regression",
      "clustering",
      "neural network",
      "backpropagation",
      "BP"
    ],
    "stage1_timestamp": "2025-05-15T01:50:14.041986"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究企业运营绩效和财务特征的建模与分类，虽然涉及金融数据分析，但并未明确指出其应用于衍生品定价、金融风险管理或投资组合管理等特定金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究企业运营绩效和财务特征的建模与分类，虽然涉及金融数据分析，但并未明确指出其应用于衍生品定价、金融风险管理或投资组合管理等特定金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:58:28.678131"
}