{
  "paper": {
    "id": 2326,
    "title": "LEArning portfolio for accessing engineering information for engineers",
    "abstract": "This article describes design considerations of two interrelated programs that together make Learning Portfolio (LEAP) prototype system far accessing engineering information for engineers. The two programs are: Engineering Information Sources and Access (EISA), implemented as a Web-based self-learning prototype system; and Information Sources that Every Engineer should Know; ISEEK adds embedded instructional layer, representative queries, and constitutes the core layer of engineering sources for a beginner engineering student. Of analytical significance, the project has (1) defined indicators of information literacy (IL) for engineering students; (2) developed IL questionnaire to test engineering students' IL skills; (3) developed information literacy profile of engineering students under study; (4) assessed existing information resources, tools and search techniques. Of practical significance, we have: (5) applied students' responses in the design of EISA; (6) implemented the EISA information literacy program for engineers; (7) developed a series of hypertext-based tutorials each dealing with a specific IL issue; and (8) proposed set of the four design principles (i.e., understanding the user; active learning; conceptual model of teaching; and modularity). Finally, the article identifies and discusses future work.",
    "year": 1999,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "d316e915d795ade3c2c4af1685f54a93",
    "relevant_keywords": [
      "active learning"
    ],
    "stage1_timestamp": "2025-05-15T01:05:39.672794"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要讨论的是为工程师设计的学习组合系统，涉及信息素养和工程信息的获取，与衍生品定价、金融风险管理或投资组合管理等金融领域无关。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要讨论的是为工程师设计的学习组合系统，涉及信息素养和工程信息的获取，与衍生品定价、金融风险管理或投资组合管理等金融领域无关。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:15:34.268163"
}