{
  "paper": {
    "id": 465,
    "title": "Identifying crowdfunding storytellers who deliver successful projects: a machine learning approach",
    "abstract": "Crowdfunding plays a key role in financial technology to provide individuals and enterprises with funding opportunities to establish start-ups and/or new business ventures. It is mainly used to link projects' creators and backers, collect money and plan fundraising projects via social networks. This paper proposes a machine learning-enabled approach to analyse Kickstarter numerical and textual data and predict the successful funding and delivery of crowdfunding projects. It offers crowdfunding stakeholders benefits including creator credibility assessment, project risk reduction, and backer confidence enhancement. This research proposes a data preprocessing approach to prepare the dataset and extract the relevant features for the predictions. Besides, it trains and compares five numerical machine learning classification models and three text-mining methods to find the best-fitted numerical and textual analysis approaches. According to the results, the proposed SVM model outperforms the numerical benchmarks in terms of Accuracy, Precision, Recall, F1 score, and model Training latency. Moreover, BERT gives the best results if the dataset is complex, while Word2vec works better with simple features in textual analysis.",
    "year": 2025,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "e4e4e9cd8df4db06c03e845d853cace0",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "support vector machine",
      "SVM",
      "feature learning",
      "feature representation",
      "deep learning",
      "representation learning"
    ],
    "stage1_timestamp": "2025-05-15T01:51:31.184430"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究利用机器学习方法预测众筹项目的成功与否，虽然涉及金融科技领域，但其核心技术并未直接应用于衍生品定价、金融风险管理或投资组合管理等特定金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究利用机器学习方法预测众筹项目的成功与否，虽然涉及金融科技领域，但其核心技术并未直接应用于衍生品定价、金融风险管理或投资组合管理等特定金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:57:40.585048"
}