{
  "paper": {
    "id": 7720,
    "title": "Willingness to enroll and pay for community-based health insurance, decision motives, and associated factors among rural households in Enugu State, Southeast Nigeria",
    "abstract": "Background: Over 70% of Nigeria's population is poor and rural, and most lack financial risk protection against ill health. Community-based health insurance (CBHI) may be an essential intervention strategy for ensuring that quality healthcare reaches the informal and rural populations. Aim: This article explores the willingness to enroll (WTE) and willingness to pay (WTP) for CBHI by community members, their decision considerations, and associated factors in Enugu State, Nigeria. Materials and Methods: We adopted a cross-sectional survey design with a multi-stage sampling approach. A validated and pre-tested questionnaire was used to elicit information from the respondents. WTE and WTP for CBHI was determined using the bid contingent valuation method. A test of correlation/association (Chi-square and ordinary least square regression) was conducted to ascertain the relationship between WTP for CBHI and other variables at a 95% confidence interval. The socioeconomic status index was generated using principal component analysis. A test of association was conducted between the demographic characteristics and WTE and WTP variables. Key Findings: A total of 501 household heads or their representatives were included in the study which yielded a return rate of 98.2%. The finding showed that most (92.4%) of the respondents indicated a WTE in CBHI. 86.6% indicated a willingness to pay cash for CBHI, while 84.4% indicated a willingness to pay other household members for CBHI. There was a significant association between gender, marital status, education, location, and willingness to pay. The study shows that 81.6% of the respondent stated that qualified staff availability motivates their WTE/WTP for CBHI, while 78.1% would be willing to enroll and pay for CBHI if services were provided free, and 324 (74.6%) stated that proximity to a health facility would encourage them to enroll and pay for the CBHI. Conclusion: This community demand analysis shows that rural and peri-urban community members are open to using a contributory mechanism for their health care, raising the prospect of establishing CBHI. To achieve universal health coverage, policy measures need to be taken to promote participation, provide financial and non-financial incentives and ensure that the service delivery mechanism is affordable and accessible. Further studies are needed to explore ways to encourage participation and enrollment in CBHI and other contributory schemes among under-served populations and improve access to and utilization of healthcare services.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "6a17095aa5fb7d338012fc73a84c8c71",
    "relevant_keywords": [
      "principal components analysis"
    ],
    "stage1_timestamp": "2025-05-15T03:11:38.434843"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究社区健康保险的意愿支付和参与动机，属于健康经济学和公共卫生领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究社区健康保险的意愿支付和参与动机，属于健康经济学和公共卫生领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:26:13.582791"
}