{
  "paper": {
    "id": 1711,
    "title": "Implementation of an Innovative Learning Resource with Project to Facilitate Active Learning to Improve Students' Performance on Chemistry",
    "abstract": "Background: The provision of suitable and comprehensive learning resources concedes to be an effective strategy to create a serviceable learning process to achieve the competencies needed by students. Objectives: This research aims to provide an innovative learning resource with projects to facilitate active learning to improve student performance in chemistry. Methods: This research conducted by developing of chemistry learning package through the integration of projects, media and multimedia into learning materials, followed by standardization and implementation for chemistry teaching. Results: A section of an innovative learning resource with projects on the topic of Alkanes Compounds has been successfully developed. It also has been validated and standardized by experts and is considered appropriate for the teaching needs of undergraduate Chemistry and Pharmacy students. The implementation of a learning resource has proven to be beneficial in helping students to learn organic chemistry. The research findings authenticated that the developed learning resource effectively facilitates active learning in improving student performance on chemistry. The facilities available in the learning resources are sufficient to guide the students to carry out project assignments. The students are very enthusiastic about learning chemistry and their learning styles have changed to become independent learners. The developed learning resource discovered to be effective in building the skills and knowledge in chemistry. Students' performance is classified as very good, where the average score successively obtained for skills is 89.18 +/- 2.86, the project report portfolio is 87.76 +/- 3.48 and the formative exam is 85.84 +/- 4.46. Conclusion: An innovative learning resource has succeeded in facilitating students' active learning, making learning more enjoyable and ultimately increasing their knowledge and skills to meet the competencies needed in the field of chemistry. Recommendation: The learning resource model developed in this study could be adopted in other subjects to facilitate active learning and to achieve the competencies needed by scientists and pharmacists.",
    "year": 2020,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "c8b43ba4a6a43429bf49bb3c56545b7d",
    "relevant_keywords": [
      "active learning"
    ],
    "stage1_timestamp": "2025-05-15T00:58:50.637326"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究化学教育中的创新学习资源开发，旨在提高学生在化学学科中的表现，并未涉及任何金融领域的研究或应用。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究化学教育中的创新学习资源开发，旨在提高学生在化学学科中的表现，并未涉及任何金融领域的研究或应用。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:19:14.373022"
}