{
  "paper": {
    "id": 2978,
    "title": "Computation and application of Copula-based weighted average quantile regression",
    "abstract": "Copula theories have obtained rapid development with respect to the dependent analysis of financial markets. The widely adopted technique for estimating Copula is maximum likelihood. In distinction, this paper proposes weighted average quantile regression to estimate Copula, which shares robustness from quantile regression and achieves nearly the same efficiency as the maximum likelihood. Consistency and asymptotic normality of the suggested estimators are established under regularity conditions. Through solving a quadratic programming, we obtain the expression of optimal weights. Monte Carlo simulations are conducted to compare the performance of different estimators. The proposed approach is used to investigate the dependent structure and risk measurement of Chinese financial markets. (C) 2014 Elsevier B.V. All rights reserved.",
    "year": 2015,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "b8abb76a23949db650b38ca8680d93aa",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:21:19.225052"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper proposes a method for estimating Copula using weighted average quantile regression, which is applied to investigate the dependent structure and risk measurement of financial markets. This directly relates to financial risk management, as it involves analyzing dependencies and measuring risks in financial markets.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper proposes a method for estimating Copula using weighted average quantile regression, which is applied to investigate the dependent structure and risk measurement of financial markets. This directly relates to financial risk management, as it involves analyzing dependencies and measuring risks in financial markets.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:39:17.781342"
}