{
  "paper": {
    "id": 2169,
    "title": "FINANCIAL TIME SERIES PREDICTION MODEL BASED RECURRENT NEURAL NETWORK",
    "abstract": "Financial time series prediction is usually considered as one of the most difficult challenges because of huge external factors, which are usually stochastic and sensitive so that we can hardly recognize the patterns from historical information. Besides, traditional time series prediction models cannot adapt to the changes in financial circumstances. To overcome these problems, we design a prediction model based on recurrent neural network with gating units, which can learn historical information and adapt the market changes through a specific inner structure. Experiments carried on the Shanghai Securities Composite Index show that the prediction results of our model have more competitive performance compared to those of other traditional models. Our model has good interpretability, and the effects of model hyperparameters on prediction accuracy are also analyzed. On the basis, we proceed with the long-term trend analysis and estimate precisely the tipping points of the stock market. These results give application prospects in risk assessment and portfolio management for the finance industry.",
    "year": 2020,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "7403dd8a0a6729651a0d223fc6fb3de9",
    "relevant_keywords": [
      "machine learning",
      "neural network",
      "deep learning",
      "recurrent neural network",
      "long short-term memory",
      "LSTM"
    ],
    "stage1_timestamp": "2025-05-15T02:12:17.349984"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk",
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是基于循环神经网络的金融时间序列预测模型，主要用于预测股票市场的长期趋势和转折点。论文明确提到这些结果在风险评估（金融风险管理）和投资组合管理中有应用前景。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\", \"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是基于循环神经网络的金融时间序列预测模型，主要用于预测股票市场的长期趋势和转折点。论文明确提到这些结果在风险评估（金融风险管理）和投资组合管理中有应用前景。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:44:03.886879"
}