{
  "paper": {
    "id": 500,
    "title": "Predicting macro-financial instability-How relevant is sentiment? Evidence from long short-term memory networks",
    "abstract": "This paper examines the relevance of sentiment in predicting overall financial system instability using long-run short-term memory networks. Weekly data on the US financial system, consumer sentiment, producer sentiment, and investor sentiment is collected from 21 January 1994 to 27 December 2019, and different models are developed to predict the one-week-ahead levels of financial stress in the US financial system. We find that models using sentiment indices outper-form those relying solely on historical financial stress and risk data. This result is robust to comparisons with an alternative deep learning method and out-of-sample predictions. It consti-tutes an argument in favor of behavioral finance and Minsky's (Knell, 2015) financial instability hypothesis against the Efficient Market Hypothesis. As it concretely identifies the main indicators for predicting US financial stress one week in advance, the study provides relevant recommen-dations for policymakers and investors in terms of macroprudential policies and portfolio management.",
    "year": 2023,
    "source": "WOS",
    "area": "financial_risk",
    "method": "deep learning",
    "cache_key": "4dfc23ae04fcc9843593f4c71ff6e1ac",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "neural network",
      "long short-term memory",
      "LSTM"
    ],
    "stage1_timestamp": "2025-05-15T01:38:59.292258"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk",
      "Portfolio Management"
    ],
    "justification": "该论文的核心技术是使用长短期记忆网络（LSTM）预测金融系统的不稳定性，这直接关联到金融风险管理。此外，论文提到为投资者提供关于投资组合管理的建议，表明其研究也涉及投资组合管理领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"金融风险管理\", \"投资组合管理\"],\n  \"justification\": \"该论文的核心技术是使用长短期记忆网络（LSTM）预测金融系统的不稳定性，这直接关联到金融风险管理。此外，论文提到为投资者提供关于投资组合管理的建议，表明其研究也涉及投资组合管理领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:02:51.645808"
}