{
  "paper": {
    "id": 949,
    "title": "Research on Financial Risk Control Algorithm Based on Machine Learning",
    "abstract": "Internet technology is currently used in various industries. The use of the Internet for financial management has become a new field of financial technology. However, there are also considerable risks associated with Internet finance. Therefore, the security of online credit funds is one of the important research contents of Internet finance. In this paper, the GBDT algorithm is firstly analysed, and the variable selection and parameter optimisation methods of the GBDT algorithm are studied. Based on the current research, a credit prevention and control method that integrates GBDT with logistic regression is designed. Experiments show that the algorithm enables the model to show better application effects.",
    "year": 2021,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "33564d7c7433ad2d914e39bbfb1185ac",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "regression",
      "decision tree"
    ],
    "stage1_timestamp": "2025-05-15T01:56:49.718238"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on designing a credit prevention and control method using machine learning algorithms (GBDT and logistic regression) to address risks in Internet finance, which is a clear application in the field of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on designing a credit prevention and control method using machine learning algorithms (GBDT and logistic regression) to address risks in Internet finance, which is a clear application in the field of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:53:07.917127"
}