{
  "paper": {
    "id": 1491,
    "title": "Vulnerability of Sustainable Islamic Stock Returns to Implied Market Volatilities: An Asymmetric Approach",
    "abstract": "There has been increasing interests in the sustainable way of investing as enjoined by several sustainability initiatives. However, investors require effective portfolio diversification at various market conditions (stress, benign, and boom) and would consider sustainable equities to the extent that they aid in the minimisation of portfolio risks. As a result, a better way investors can mitigate portfolio risk is by forming portfolios with relevant volatility indices as enshrined in extant literature. It becomes necessary to investigate the susceptibility of Islamic stocks in a sustainable way to shocks from volatility indices to enhance effective portfolio decisions. In this regard, we investigate the asymmetric effect of implied volatility indices on sustainable Islamic stocks across different market conditions. Hence, the quantile regression and quantile-on-quantile regression techniques are employed. The study discovered an asymmetric influence of volatility on sustainable Islamic stock returns at various quantiles. Furthermore, most volatilities' asymmetric effects were generally inversely associated to sustainable Islamic stock returns, implying diversification benefits across market outcomes. Also, with the exception of the extreme quantiles, there is a causal effect of volatilities on Islamic stock returns for most quantiles. It seems to reason that ordinary market outcomes, rather than market stress or boom, have a greater impact on causal estimates for our quantile regression model.",
    "year": 2022,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "54e88f70b3abdf2ae5f1202afc4626ec",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T00:56:38.912516"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文研究了可持续伊斯兰股票收益对隐含波动率指数的非对称影响，旨在通过分析不同市场条件下的波动性影响来优化投资组合决策，这直接关联到投资组合管理领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文研究了可持续伊斯兰股票收益对隐含波动率指数的非对称影响，旨在通过分析不同市场条件下的波动性影响来优化投资组合决策，这直接关联到投资组合管理领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:20:40.405121"
}