{
  "paper": {
    "id": 3638,
    "title": "Loss Assessment for Sustainable Industrial Infrastructure: Focusing on Bridge Construction and Financial Losses",
    "abstract": "Bridges are important infrastructures for urban growth and the economic development of a country, because bridges allow a large volume of logistics and transportation by connecting rivers, canyons, islands and lands. As such, massive resources including financial, material and human resources are invested for bridge construction and management. However, although the latest bridge construction is undergoing rapid development of new technologies and designs, the management and prevention of risks still tend to rely on qualitative practices, which, as a result, calls for more quantified and systematic measurement and, thus, more sustainable management of potential risks. As part of efforts in managing risks to achieve quantitative risk management, this study aimed to predict losses of financial resources by identifying statistically significant risk factors based on the past record of insurance claim payouts (compensation for a loss that occurred as a result of a material damage in bridge construction projects) from a major insurance company in Korea, and conducted a multiple regression analysis to identify the loss indicators and to develop a loss estimation model. The statistical analysis confirmed that superstructure types, superstructure construction methods, and construction duration are the three significant risk factors that affects financial losses of bridge construction projects among the seven variables adopted as independent variables, which included the superstructure type, maximum span length, superstructure construction method, foundation type, floods, typhoons, and construction duration. Such findings, and the consequentially developed risk prediction model of this study, will contribute to sustainable construction management through cost reduction by predicting and preventing the future financial loss factors of bridge construction.",
    "year": 2020,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "a6e278a0a06627609cd885e3dc9779f3",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T02:28:29.344494"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究桥梁建设项目中的财务损失预测模型，虽然涉及风险因素分析，但其核心应用领域是建筑和工程管理，而非金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究桥梁建设项目中的财务损失预测模型，虽然涉及风险因素分析，但其核心应用领域是建筑和工程管理，而非金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:35:57.664812"
}