{
  "paper": {
    "id": 3848,
    "title": "Identifying Corporate Credit Risk Sentiments from Financial News",
    "abstract": "Credit risk management is one central practice for financial institutions, and such practice helps them measure and understand the inherent risk within their portfolios. Historically, firms relied on the assessment of default probabilities and used the press as one tool to gather insights on the latest credit event developments of an entity. However, due to the deluge of the current news coverage for companies, analyzing news manually by financial experts is considered a highly laborious task. To this end, we propose a novel deep learningpowered approach to automate news analysis and credit adverse events detection to score the credit sentiment associated with a company. This paper showcases a complete system that leverages news extraction and data enrichment with targeted sentiment entity recognition to detect companies and text classification to identify credit events. We developed a custom scoring mechanism to provide the company's credit sentiment score (CSSTM) based on these detected events. Additionally, using case studies, we illustrate how this score helps understand the company's credit profile and discriminates between defaulters and non-defaulters.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "7a78d19dad4c1b588e3e9555f89dddb1",
    "relevant_keywords": [
      "machine learning",
      "deep learning",
      "classification",
      "neural network",
      "representation learning"
    ],
    "stage1_timestamp": "2025-05-15T02:30:28.767431"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on automating news analysis and credit adverse events detection to score the credit sentiment associated with a company, which is directly related to credit risk management—a key aspect of financial risk management.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on automating news analysis and credit adverse events detection to score the credit sentiment associated with a company, which is directly related to credit risk management—a key aspect of financial risk management.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:35:07.216185"
}