{
  "paper": {
    "id": 951,
    "title": "ML-Based Interconnected Affecting Factors with Supporting Matrices for Assessment of Risk in Stock Market",
    "abstract": "In today's world, people study and evaluate trading stocks to make informed decisions, based on available financial data and market information. Previous researchers relied on trend identification before making any decision to buy or sell stocks but fail to make accurate decisions due to complex systems. Some studies showed analysis to apply to stop loss on every stock transaction that got wrong levels due to limited features scaling that relied on single indicators without checking the performance metrics such as mean, standard deviation, and value at risk. Some existing models are based on theoretical implementation and they possess inaccurate success in real-time stock market transactions. Earlier risk management techniques were based on fundamental statistics of the company performance based on specific quarters that propose the future expects in the positive direction that is not every true which results in huge financial loss. Previous researchers failed to consider dynamic risk management parameters to ensure minimum loss for decision-making in fast-moving stock variations. Machine learning simply refers to learning about computers and making predictions from data. Identifying and analyzing the risk factors in the stock market are the major and crucial stage for predicting the company stock values at the national and international levels. In existing research, all risk management-related factors are analyzed based on fundamental statistics of the company performance which are measured as quarterly results, which will not give long-term true predictions and will not provide positive directions to invest in further stocks. This research majorly focused on risk management for national stock companies using the machine learning methodology and algorithms. The objective is to determine if stock market indicators are suitable decision-aid tools within the context of intraday risk management. The review of the literature revealed that while there are many studies looking to foresee changes in the stock market, there are few studies looking to improve stock market risk management methods using machine learning algorithms. The goal of this study was to fill this gap by utilizing the body of existing research on stock index forecasting combined with machine learning techniques for both short- and long-term risk managements. It has described the association between machine learning models and implicated the data with respect to discrete models based on supportive, dependable, nondependable parameters along with the name and type of the stock. This research has integrated a few crucial dependable parameters such as oil prices, on-hand projects, and future projects. It has integrated with the simple, multiple linear regression models to generate a signal for SPY growth. The proposed ML-based model has been evaluated by comparing two states of training and testing and achieved 96.3% of accuracy. The parameters used for evaluation are closing price, price differences, and daily return. The performance range of the proposed multiple regression model lies along the maximum drawn down which is 0.04411 for test cases and 1.2533 for training cases. Compare the performance of the proposed approach with that existing models with respect to the number of keys and methods associated with training and testing the data.",
    "year": 2022,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "437afd9965b86560fecfd39bc49e1c19",
    "relevant_keywords": [
      "machine learning",
      "regression",
      "neural network",
      "deep learning"
    ],
    "stage1_timestamp": "2025-05-15T01:56:49.736860"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper primarily focuses on using machine learning methodologies and algorithms for risk management in stock markets, specifically addressing intraday risk management and dynamic risk management parameters to minimize losses in fast-moving stock variations. The study aims to improve stock market risk management methods, which clearly falls under the Financial Risk Management domain.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper primarily focuses on using machine learning methodologies and algorithms for risk management in stock markets, specifically addressing intraday risk management and dynamic risk management parameters to minimize losses in fast-moving stock variations. The study aims to improve stock market risk management methods, which clearly falls under the Financial Risk Management domain.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:53:07.643600"
}