{
  "paper": {
    "id": 7566,
    "title": "Hospital-skilled nursing facility referral linkage reduces readmission rates among Medicare patients receiving major surgery",
    "abstract": "Background. In the health reform era, rehospitalization after discharge may result in financial penalties to hospitals. The effect of increased hospital skilled nursing facility (SNF) linkage on readmission reduction after surgery has not been explored. Methods. To determine whether enhanced hospital SNF linkage, as measured by the proportion of surgical patients referred from a hospital to a particular SNF, would result in reduced 30-day readmission rates for surgical patients, we used national Medicare data (2011-2012) and evaluated patients who underwent 1 of 5 operative procedures (coronary artery bypass grafting [CABG], hip fracture repair, total hip arthroplasty, colectomy, or lumbar spine surgery). Initial evaluation was performed using regression modeling. Patient choice in SNF referral was adjusted for using instrumental variable (IV) analysis with distance between an individuals' home and the SNF as the IV. Results. A strong negative correlation (P < .001) was observed between the proportion of selected surgical discharges received by a SNF and the rate of hospital readmission. Increasing the proportion of surgical discharges decreased the likelihood of rehospitalization (regression coefficient, -0.04; 95 % CI, -0.07 to -0.02). These findings were preserved in IV analysis. Increasing hospital SNF linkage was found to reduce significantly the likelihood of readmission for patients receiving lumbar spine surgery, CABG, and hip fracture repair. Conclusion. The benefits of increased hospital SNF linkage seem to include meaningful reductions in hospital readmission after surgery. Overall, a 10% increase in the proportion of surgical referrals to a particular SNF is estimated to decrease readmissions by 4 %. This may impact hospital SNF networks participating in risk-based reimbursement models.",
    "year": 2016,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "7258c5a9153535e59057a86f49e05675",
    "relevant_keywords": [
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T03:10:05.513958"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "None"
    ],
    "justification": "该论文主要研究医院与专业护理机构之间的转诊联系对减少再入院率的影响，属于医疗健康管理领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融研究领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"None\"],\n  \"justification\": \"该论文主要研究医院与专业护理机构之间的转诊联系对减少再入院率的影响，属于医疗健康管理领域，并未涉及衍生品定价、金融风险管理或投资组合管理等金融研究领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:26:15.627474"
}