{
  "paper": {
    "id": 1170,
    "title": "What are tenants demanding the most? A machine learning approach for the prediction of time on market",
    "abstract": "PurposeThis is the first article to apply a machine learning approach to the analysis of time on market on real estate markets.Design/methodology/approachThe random survival forest approach is introduced to the real estate market. The most important predictors of time on market are revealed and it is analyzed how the survival probability of residential rental apartments responds to these major characteristics.FindingsResults show that price, living area, construction year, year of listing and the distances to the next hairdresser, bakery and city center have the greatest impact on the marketing time of residential apartments. The time on market for an apartment in Munich is lowest at a price of 750 euro per month, an area of 60 m2, built in 1985 and is in a range of 200-400 meters from the important amenities.Practical implicationsThe findings might be interesting for private and institutional investors to derive real estate investment decisions and implications for portfolio management strategies and ultimately to minimize cash-flow failure.Originality/valueAlthough machine learning algorithms have been applied frequently on the real estate market for the analysis of prices, its application for examining time on market is completely novel. This is the first paper to apply a machine learning approach to survival analysis on the real estate market.",
    "year": 2024,
    "source": "WOS",
    "area": "portfolio",
    "method": "machine learning",
    "cache_key": "f5210f4dc92cf31d15fd74d271e304d8",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "decision tree",
      "regression"
    ],
    "stage1_timestamp": "2025-05-15T00:52:33.867685"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Portfolio Management"
    ],
    "justification": "该论文应用机器学习方法分析房地产市场的营销时间，其研究结果被指出可用于房地产投资决策和投资组合管理策略，以最小化现金流失败的风险。虽然论文主要关注房地产市场的特定问题，但其应用场景明确指向了投资组合管理的金融领域。",
    "raw_response": "```json\n{\n  \"application_domains\": [\"投资组合管理\"],\n  \"justification\": \"该论文应用机器学习方法分析房地产市场的营销时间，其研究结果被指出可用于房地产投资决策和投资组合管理策略，以最小化现金流失败的风险。虽然论文主要关注房地产市场的特定问题，但其应用场景明确指向了投资组合管理的金融领域。\"\n}\n```"
  },
  "timestamp": "2025-05-20T16:23:52.079709"
}