{
  "paper": {
    "id": 6498,
    "title": "Sparse Logistic Regression with Supervised Selectivity for Predictors Selection in Credit Scoring",
    "abstract": "Credit scoring is a fundamental and one of the most complex tasks that financial institutions have to deal with. Commonly this problem is considered as default probability prediction for the lenders counterparts. Knowing predictors that significantly contribute to default prediction has recently emerged as a crucial issue of credit risk analysis. Default prediction and default predictor selection are two related issues, but many existing approaches address them separately. In this paper a unified procedure is proposed that is based on the regularization approach with logistic regression as an underlying model, which simultaneously selects the default predictors and optimizes all the parameters within the model. We give the strong probabilistic statement of shrinkage criterion for features selection. The proposed regularization do not corrupt the relevant predictors, can select correlated predictors into model, gives stable subset of relevant features. Experimental results show that the proposed framework is competitive on both artificial data and publicly available data sets.",
    "year": 2016,
    "source": "WOS",
    "area": "financial_risk",
    "method": "machine learning",
    "cache_key": "712be770238527f2242ab6ad48f3c999",
    "relevant_keywords": [
      "machine learning",
      "supervised learning",
      "classification",
      "regression",
      "feature learning"
    ],
    "stage1_timestamp": "2025-05-15T02:58:34.248318"
  },
  "domain_result": {
    "success": true,
    "application_domains": [
      "Financial Risk"
    ],
    "justification": "The paper focuses on credit scoring and default probability prediction, which are key components of credit risk analysis in financial risk management. The proposed method aims to select default predictors and optimize model parameters, directly addressing risk assessment in lending.",
    "raw_response": "```json\n{\n  \"application_domains\": [\"Financial Risk Management\"],\n  \"justification\": \"The paper focuses on credit scoring and default probability prediction, which are key components of credit risk analysis in financial risk management. The proposed method aims to select default predictors and optimize model parameters, directly addressing risk assessment in lending.\"\n}\n```"
  },
  "timestamp": "2025-05-20T15:27:53.036444"
}